[
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 14:38:52 UTC",
    "id": "1j804a5",
    "link_flair_text": null,
    "media": null,
    "num_comments": 12,
    "score": 0,
    "secure_media": null,
    "selftext": "I got one fairly recently and i am unsure if women generally like or dislike the look I know everybody is different but i would like your personal opinion",
    "subreddit": "AskUK",
    "title": "Do women like men with buzzcuts?",
    "upvote_ratio": 0.25,
    "url": "https://www.reddit.com/r/AskUK/comments/1j804a5/do_women_like_men_with_buzzcuts/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 14:32:11 UTC",
    "id": "1j7zz63",
    "link_flair_text": null,
    "media": null,
    "num_comments": 21,
    "score": 0,
    "secure_media": null,
    "selftext": "I see this in many jobs, especially those in shops or sales assistants where they require employees to wear black shoes. When living outside the UK an international school nearby got a British headmaster whom also brought the black shoe policy. I’ve also seen this in some movies where British schools ask pupils to wear black shoes. \n\nWhy? Why do they care in the first place about the color of your footwear?",
    "subreddit": "AskUK",
    "title": "Why is there a requirement for black shoes in most jobs?",
    "upvote_ratio": 0.38,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7zz63/why_is_there_a_requirement_for_black_shoes_in/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 14:31:09 UTC",
    "id": "1j7zybo",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 0,
    "secure_media": null,
    "selftext": "At my company, every time we do updates or presentations, someone always adds up everyone’s experience and says something like:\n\n*\"We have over 300 years of experience!\",*   \n*\"We've been doing this for 78 years!\"*\n\nI get why this could be impressive for clients, but what makes me laugh is that they do this in internal meetings too.\n\nAnyway, my question is, is this just a thing in my company, or is this a common thing UK?",
    "subreddit": "AskUK",
    "title": "Is it common in the UK for companies to add up employees’ years of experience?",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7zybo/is_it_common_in_the_uk_for_companies_to_add_up/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 14:27:13 UTC",
    "id": "1j7zv4w",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 1,
    "secure_media": null,
    "selftext": "I interviewed with 2 companies 8 months ago, the company which was my preference decided they were going to promote internally as opposed to an external appointment, I took the job with the other company. A few weeks ago I had contact with the company i preferred and they had asked me if I’d be willing to join them now as the internal promotion didn’t have the desired affect and the person they promoted returned to their previous role. \n\nThey have offered me a lot more in terms of remuneration and it’s a better package but before I make any decisions is it bad for me to accept and leave the company I joined?",
    "subreddit": "AskUK",
    "title": "Is it a bad look for me to leave my job for a different company having only been here 8 months?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7zv4w/is_it_a_bad_look_for_me_to_leave_my_job_for_a/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 14:14:51 UTC",
    "id": "1j7zl7z",
    "link_flair_text": null,
    "media": null,
    "num_comments": 10,
    "score": 0,
    "secure_media": null,
    "selftext": "I am going to the uk in April to visit my girlfriend, I'll be staying with her (her perents) for around 4 months. I have gotten a ETA but I am wondering on what type of documents I need to get through border control smoothly.",
    "subreddit": "AskUK",
    "title": "Traveling to the uk at 17, what documents do I need?",
    "upvote_ratio": 0.25,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7zl7z/traveling_to_the_uk_at_17_what_documents_do_i_need/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 14:12:35 UTC",
    "id": "1j7zjga",
    "link_flair_text": null,
    "media": null,
    "num_comments": 13,
    "score": 0,
    "secure_media": null,
    "selftext": "I've never shopped on Temu. It's mostly because my perception (from ads) was that they sell cheap junk or I couldn't trust it. I don't know if I am right or wrong, but I never bothered to figure it out (until now, I guess).\n\nSo, do you routinely shop on Temu? What's your experience like (quality, price, delivery, customer service, etc)?",
    "subreddit": "AskUK",
    "title": "Do you shop on Temu?",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7zjga/do_you_shop_on_temu/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 13:58:17 UTC",
    "id": "1j7z7z1",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 1,
    "secure_media": null,
    "selftext": "Looks pretty cool, but I don't know why they swim like that",
    "subreddit": "AskUK",
    "title": "Why do swans swim like this?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/gallery/1j7z7z1",
    "url_overridden_by_dest": "https://www.reddit.com/gallery/1j7z7z1"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 13:58:40 UTC",
    "id": "1j7z89k",
    "link_flair_text": null,
    "media": null,
    "num_comments": 27,
    "score": 1,
    "secure_media": null,
    "selftext": "Shout out to : [Fine-Huckleberry4165](https://www.reddit.com/user/Fine-Huckleberry4165/) who figured it out. \n\n\n\nI am trying to call a UK non-profit (Guide Dogs UK)  from a U.S phone and keep receiving the message \" call can not be completed as dialed\"\n\nThe number I am trying to call is : 0800 953 0113 . I've tried 011+44 800 953 0113 , 011 44 800 953 0113, and just +44 800.... But I am getting nowhere.\n\nEDIT: This is the number on the website but this also isn't working for me! : 0345 143 0200 \n\nSome help would be greatly appreciated!",
    "subreddit": "AskUK",
    "title": "How do I dial a UK phone number?",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7z89k/how_do_i_dial_a_uk_phone_number/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 13:24:10 UTC",
    "id": "1j7yieh",
    "link_flair_text": null,
    "media": null,
    "num_comments": 20,
    "score": 0,
    "secure_media": null,
    "selftext": "Hey, so me and my friends and I (all from the states of course) are nearing the end of our tour of the UK. We've traveled up and down the continent, but we've only been in a few major cities (London, Manchester, Glasgow) but even the smaller cities are pretty built up and we've visited about a dozen so far. In all this time I've seen probably less than 10 homeless people. And most of them were in London or Manchester. \n\nIn America, (at least in most states, where homeless isn't on the verge of being a death sentence. *Cough* Texas *cough*) you'll find homeless everywhere. \n\nIn the cities it's the worst obviously, with someone panhandling all the busy intersections, but even in small towns now it's completely normal to see homeless on various corners or homeless camps along the street/hwy etc. \n\nI'm just curious what your thoughts are as to why this is? Better social protections? Do we just have more homeless than you per capita, or are they more visible in the US? \n\nThanks guys\n-A stupid yankee",
    "subreddit": "AskUK",
    "title": "Why are there so few homeless in the UK?",
    "upvote_ratio": 0.38,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7yieh/why_are_there_so_few_homeless_in_the_uk/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 13:52:10 UTC",
    "id": "1j7z38v",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 0,
    "secure_media": null,
    "selftext": "If you have been stopped from taking items from a supermarket without paying and given a permanent ban, are they likely to take the time to go back over old cctv to see if there are any more instances of shoplifting?",
    "subreddit": "AskUK",
    "title": "Banned from supermarket - will they check previous cctv?",
    "upvote_ratio": 0.2,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7z38v/banned_from_supermarket_will_they_check_previous/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 13:53:02 UTC",
    "id": "1j7z3vg",
    "link_flair_text": null,
    "media": null,
    "num_comments": 154,
    "score": 23,
    "secure_media": null,
    "selftext": "I'm sure there's been loads of: Fluffy's, Buster and Marmalade's. But what's the insane ones?\nThe ones that make you think 'why would you want to stand at your door and shout that out??!!'\n\nAlso, what names do you think are way overused?",
    "subreddit": "AskUK",
    "title": "Vets of the UK, what's the stupidest, weirdest pet name you've heard?",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7z3vg/vets_of_the_uk_whats_the_stupidest_weirdest_pet/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 13:35:06 UTC",
    "id": "1j7yqku",
    "link_flair_text": null,
    "media": null,
    "num_comments": 8,
    "score": 1,
    "secure_media": null,
    "selftext": "So I recently managed to sign up to an NHS dental practice in summer last year. I had my first checkup in September. I was told I would need a filling. They booked me back in for October. I attended in Oct and they told me the cavity was actually too big to complete the filling that day. I was booked in January. I attended in Jan, they gave me a temporary filling for some reason and booked me another appointment in February. Within a week my temp filling fell out. I attended in Feb and they finally gave me a new filling. The dentist said that I should avoid biting really hard foods with the filled tooth (it is one of my bottom left molars). Now today the filling has fell out.\n\nIs this normal? I'm worried I've registered with a dentist who has no idea what they're doing. Should I ask for another dentist in the same practice or should I go private? ",
    "subreddit": "AskUK",
    "title": "Is this a normal dentist interaction?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7yqku/is_this_a_normal_dentist_interaction/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 13:28:53 UTC",
    "id": "1j7ylup",
    "link_flair_text": null,
    "media": null,
    "num_comments": 75,
    "score": 0,
    "secure_media": null,
    "selftext": "I learned  that Margie Thatcher was correct! \"There's is no such thing as society\" 😞\n\nPeople were selfish and and childish and not thinking about greater good when they were complaining  about masks and fighting over toilet tissue and water (non of which was in short supply). ",
    "subreddit": "AskUK",
    "title": "What Did the Covid Era Teach You?",
    "upvote_ratio": 0.41,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7ylup/what_did_the_covid_era_teach_you/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 13:13:42 UTC",
    "id": "1j7yat8",
    "link_flair_text": null,
    "media": null,
    "num_comments": 44,
    "score": 0,
    "secure_media": null,
    "selftext": "I live in a small town, 80 miles outside of London. I can't help thinking how much more comfortable and optimistic I'd feel in my situation pre 2020. Why has the UK come off so much worse than other countries? I visited Melbourne, Australia and drew come comparisons.\n\n**Travel**\n\n🇬🇧 London (1hr 25 mins) costs over £100 for a peak return and a two short tube journeys.   \nPetrol is £1.40. I recall paying £2 a litre for diesel a few years back.\n\n🇦🇺 A return 30 minute train into the city and travel on trams cost less than $10 in total.  \nPetrol is $1.50 per litre.  \n  \n**Drinks**  \n  \n🇬🇧 A regular latte is now over £4. Hit and miss depending on who serves you. A pint in most pubs is £7.\n\n🇦🇺 Coffee was no more than $5 (£2.43) and usually very good quality with properly trained baristas. A pint varied between $10 and $17.\n\n**Public Services**\n\n🇬🇧 Council tax is just under £300 per month. We now have to pay extra if we want green bins collected. The parks and public areas look very run down and it's mainly local volunteers picking up litter and trimming the bushes. There is vandalism and nothing gets repaired. I cannot get seen by a doctor and I have visit the hospital if myself, wife or child is ill to receive antibiotics.\n\n🇦🇺 The parks are beautifully maintained with BBQ facilities and there is constant improvements to the infrastructure. You can get a doctor or dentist appointment on the day you call and they actually show compassion. There are Olympic standard running tracks open to the public. I didn't witness any anti social behaviour and felt very safe walking around at any time of the day.\n\n**Housing**\n\n🇬🇧 Stamp duty holidays, previously low interest rates and COVID has made the property market go bonkers. The previous owner of my house profited over 50% (they bought just before COVID) and sold less than 3 years later. They did no work to the house. I've spent over £30K on renovations so far.   \nI profited 13% in 5 years (minus renovations, new boiler etc) so more like 10%.\n\nMy neighbour paid under £10K for their house (a second home) in the 1970's and the house is rarely occupied.\n\n🇦🇺 Not as familiar with the housing situation in Australia but aware it has obviously also increased substantially although it seems more affordable than London. Although some my friend's monthly payments have gone up thousands with the interest rate rise.\n\n**Tax**\n\n🇬🇧 My effective tax rate is 43.0% if you take into account Income Tax, NI, lost personal allowance, lost Child Benefit, and nursery costs. Tax thresholds are frozen until 2028 in the UK but have been frozen since 2021.\n\n🇦🇺 Seems taxed at a similar level. Australia implemented the Stage Three tax cuts, which came into effect on 1 July 2024 and there is no date set for an increase. ",
    "subreddit": "AskUK",
    "title": "Is the quality of life in the UK going to continually nosedive?",
    "upvote_ratio": 0.32,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7yat8/is_the_quality_of_life_in_the_uk_going_to/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 10:38:45 UTC",
    "id": "1j7vozy",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "",
    "subreddit": "AskUK",
    "title": "Does anyone know what this is in my friends garden?",
    "upvote_ratio": 1.0,
    "url": "https://i.redd.it/y93p52t8cune1.jpeg",
    "url_overridden_by_dest": "https://i.redd.it/y93p52t8cune1.jpeg"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 12:45:12 UTC",
    "id": "1j7xr0g",
    "link_flair_text": null,
    "media": null,
    "num_comments": 25,
    "score": 2,
    "secure_media": null,
    "selftext": "Going camping this year but struggling to find somewhere new to visit. We have already done Cornwall, Peak District, Lake District and areas of North Yorkshire and Stratford upon Avon. \nCan anyone recommend areas worth visiting with lots to see and do? We have a dog and love beaches and historical places of interest. We like setting up camp and using it as a base\nTo go exploring. Any help would be appreciated ",
    "subreddit": "AskUK",
    "title": "Where are the Best places to camp in the UK?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7xr0g/where_are_the_best_places_to_camp_in_the_uk/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 12:41:09 UTC",
    "id": "1j7xoce",
    "link_flair_text": null,
    "media": null,
    "num_comments": 14,
    "score": 7,
    "secure_media": null,
    "selftext": "I'm in such a pickle. I work in admin/call centre and I feel like I'm having a constant panic attack all day.\n\nIt's not even a high stress job, however, my only other co-worker dropped her hours last year which means I have no one to share the workload with half the week. The people who have been asked to help out during this time either flat out refuse or do the bare minimum.\n\nI've reached a breaking point and any communication with my manager, results in maybe a week or two of improvement and then it's back to square one. \n\nI've been applying for all sorts of jobs with no luck and really don't know where to go from here. I know I can't afford to be picky but the thought of going to one terrible job to another has put me in some sort of paralysis and I have no energy. It's got to the point where every tiny part of my day triggers anxiety, even the parts that never used to.\n\n",
    "subreddit": "AskUK",
    "title": "How do I recover from burnout?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7xoce/how_do_i_recover_from_burnout/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 12:35:28 UTC",
    "id": "1j7xkpn",
    "link_flair_text": null,
    "media": null,
    "num_comments": 17,
    "score": 1,
    "secure_media": null,
    "selftext": "Hello, my two buddies and I are planning on travelling around Scotland for a week and thereafter Northern Ireland and Ireland. We were planning on renting a car to visit the Highlands, but since we're under 25 we'll have to pay a 50 GBP surcharge per day, which is a bit too expensive for us. I've seen that there's a bunch of companies that make bus tours. Is that the only option for us to visit the Highlands? Or is it e.g. possible for us to use public transportation or private coaches to get back and forth from the Highlands? We haven't been planning on visiting any specific locations yet in the Highlands\n\nEdit: the 50 GBP is only for the under 25 surcharge. the cheapest car I've found is 21 GBP. So per day we'll have to pay 71 GBP + gas per day. idk if it's worth it ",
    "subreddit": "AskUK",
    "title": "What is the best way to get around the Highlands when under 25?",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7xkpn/what_is_the_best_way_to_get_around_the_highlands/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 12:27:15 UTC",
    "id": "1j7xf9h",
    "link_flair_text": null,
    "media": null,
    "num_comments": 42,
    "score": 0,
    "secure_media": null,
    "selftext": "I'm curious, my parents put me on a direct debit for bills and it's £250pm but I'm on benefits and can't work and I'm wondering if I would be paying less in bills if I moved out. \n\nIf I moved out my rent would be paid by benefits so that wouldn't be an extra cost, only the bills. \n\nThere's 3 of us living here and I agreed to pay 1/3 of the bills so that means they're paying £750pm in bills? That sounds like way too much. Everyone I know who lives alone says that pay about £100-150 in bills per month, and I'm curious if that's true. \n\nEdit I'm talking gas/water/electric bills. The type I can't Google the price of or choose not to pay(like cleaners or streaming services) ",
    "subreddit": "AskUK",
    "title": "How much are your bills and for how many people pm?",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7xf9h/how_much_are_your_bills_and_for_how_many_people_pm/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 12:26:34 UTC",
    "id": "1j7xeux",
    "link_flair_text": null,
    "media": null,
    "num_comments": 55,
    "score": 0,
    "secure_media": null,
    "selftext": "I still don't have one for the two reasons. My old ones work properly and can't see the benefits of installing the smart meter. From what I understand, it tells me how much energy my dishwasher or iron consumes. It's not a great help, is it? ",
    "subreddit": "AskUK",
    "title": "Where are you standing on the smart meters?",
    "upvote_ratio": 0.29,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7xeux/where_are_you_standing_on_the_smart_meters/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 12:25:21 UTC",
    "id": "1j7xe4q",
    "link_flair_text": null,
    "media": null,
    "num_comments": 60,
    "score": 0,
    "secure_media": null,
    "selftext": "She said she's never known anyone be able to do that, it kinda smells like a cat in heat. I can normally smell it around 3 or 4 days before she's due to start. Her wee doesn't smell any other time.",
    "subreddit": "AskUK",
    "title": "When I use the bathroom after my Mrs has had a wee I can always smell if she's due her period. Is it usual?",
    "upvote_ratio": 0.47,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7xe4q/when_i_use_the_bathroom_after_my_mrs_has_had_a/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 12:12:00 UTC",
    "id": "1j7x5ie",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 1,
    "secure_media": null,
    "selftext": "I work in a chain coffee shop on a 20 hour contract with set days of working. \nSince January, we have been extremely quiet. Much quieter than we normally are and the store is not making as much money as ‘forecasted’. The shop is ran with a very corporate feel to it and there is a lot of focus on forecast vs actual and hours spent (hours staff work) vs ideal hours. \nFor the last 6-8 weeks I have not been given my full 20 hours and have been told time and time again that 10% under contract is allowed, however I’m consistently only getting between 16-17 hours which is more than 10%. \nThis is just what I have been giving, this does not include being sent home early to ‘save hours’\nHow can I approach this, as it is now starting to seriously impact me financially.",
    "subreddit": "AskUK",
    "title": "How can I argue being consistently under my contracted hours with my manager?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7x5ie/how_can_i_argue_being_consistently_under_my/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 12:06:25 UTC",
    "id": "1j7x236",
    "link_flair_text": null,
    "media": null,
    "num_comments": 46,
    "score": 0,
    "secure_media": null,
    "selftext": "This question, without the 'human' angle, was asked here: https://www.reddit.com/r/AskUK/comments/1j7tyj2/would_you_eat_lab_grown_meat_why_or_why_not/\n\n... The answer was a clear yes from almost everyone. \n\nBut how about if it was human meat? Assuming everything is done ethically, hygienically, etc. \n\nNutritionally, not much different to other meats; ethically, no-one and nothing suffers. \n\nWould you take that step? ",
    "subreddit": "AskUK",
    "title": "Would you eat lab grown human meat? Why or why not?",
    "upvote_ratio": 0.23,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7x236/would_you_eat_lab_grown_human_meat_why_or_why_not/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 12:04:28 UTC",
    "id": "1j7x0xn",
    "link_flair_text": null,
    "media": null,
    "num_comments": 33,
    "score": 0,
    "secure_media": null,
    "selftext": "Somehow a random compilation video of British actors drinking tea was introduced to me which led me to look up tea drinking habits in UK. I learned that you guys drink A LOT of tea. I live in U.S. and I drink tea maybe once a month; I still have tea given to me as a gift five years ago. \n\nMy question is, how often do you buy tea? From what I’ve read, it sounded like the entire household, young and old, drink tea (which is not the case for a coffee drinking household). Do you buy in bulk? The largest pack of tea I’ve seen near me is Lipton’s tea with 100 tea bags, how long would that last in your household?\n\nAlso, do you drink them in tea cups? The video that I watched implied that people in UK don’t like tumblers (insulated mugs). And after seeping the tea too long and adding milk, isn’t the tea cold? ",
    "subreddit": "AskUK",
    "title": "Do you guys buy tea in bulk?",
    "upvote_ratio": 0.25,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7x0xn/do_you_guys_buy_tea_in_bulk/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 11:57:06 UTC",
    "id": "1j7ww8a",
    "link_flair_text": null,
    "media": null,
    "num_comments": 9,
    "score": 0,
    "secure_media": null,
    "selftext": "Hi everyone I have US $1000 in cash that i wish to exchange for pounds. However Thomas exchange and Mark and Spencer are taking a high fee. I should be getting £774 but they offering £684. With a £90 difference. Is there anywhere I can go with less fees? ",
    "subreddit": "AskUK",
    "title": "Where to sell left over US dollars?",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7ww8a/where_to_sell_left_over_us_dollars/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 11:47:44 UTC",
    "id": "1j7wqom",
    "link_flair_text": null,
    "media": null,
    "num_comments": 22,
    "score": 0,
    "secure_media": null,
    "selftext": "Hi guys,\n\nI just booked an AirBnb in Dagenham London and as a solo female (East Asian) who will be working in Canary Wharf during that time, I was wondering if anyone could shed light on its safety? I've read some conflicting articles and Reddit posts (from years ago) on its safety so was hoping someone could give some recent advice/insight.\n\nFor more context, I will be living about 10 mins from Becontree station, near St Anne's church on Woodward road. \n\nEDIT: I'm only really worried about violent crimes since it’ll just be a week and I’ll mostly be at work.\n\nEDIT 2: WHAT ABOUT HACKNEY",
    "subreddit": "AskUK",
    "title": "Is Dagenham London safe?",
    "upvote_ratio": 0.3,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7wqom/is_dagenham_london_safe/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 11:43:53 UTC",
    "id": "1j7woi1",
    "link_flair_text": "Answered",
    "media": null,
    "num_comments": 20,
    "score": 0,
    "secure_media": null,
    "selftext": "Hello all. Sorry for the bit of a downer on a Monday.\n\nIt's my late dads birthday and I want to do a little post but I can't think of a secular way of wishing him a happy birthday. None of us were religious so seems weird to refer to heaven. I know it can be used just as a general term but would like peoples input if anyone has any better phrasing. \n\nThank you!",
    "subreddit": "AskUK",
    "title": "What is a secular way of saying \"happy heavenly birthday\"?",
    "upvote_ratio": 0.25,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7woi1/what_is_a_secular_way_of_saying_happy_heavenly/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 11:33:42 UTC",
    "id": "1j7wil8",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 0,
    "secure_media": null,
    "selftext": "Hi,\n\nWe saw a consultant through our employer-provided insurance company (WPA). The consultant made a wrong diagnosis and we are in the process of getting second opinions (on our own expense). But will the insurance company automatically get the diagnosis from the consultant? or do we get to get second opinions and report the insurance company the diagnosis ourselves?\n\nThank you",
    "subreddit": "AskUK",
    "title": "Does the doctor automatically share the diagnosis with the insurance provider?",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7wil8/does_the_doctor_automatically_share_the_diagnosis/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 11:08:12 UTC",
    "id": "1j7w4ir",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 1,
    "secure_media": null,
    "selftext": "Looking for a nice spot for a few guys for a birthday holiday mid April. Are there any recommendations for places that are hot, aren’t too expensive and have decent activities in the day and nightlife. I’ve been to Barcelona in the summer and that was really nice. Are there places you can find like that in April with a good balance of everything?",
    "subreddit": "AskUK",
    "title": "What is the best holiday destination for 21+ in April?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7w4ir/what_is_the_best_holiday_destination_for_21_in/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 10:58:38 UTC",
    "id": "1j7vz2t",
    "link_flair_text": null,
    "media": null,
    "num_comments": 41,
    "score": 15,
    "secure_media": null,
    "selftext": "I don’t mean in either a positive or a negative way, but just in a different way. And for those who grew up in a small town, do you think it made you who you’re?",
    "subreddit": "AskUK",
    "title": "People who grew up in, live in or have worked in small towns. How do attitudes and ways of doing things, differ from larger cities?",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7vz2t/people_who_grew_up_in_live_in_or_have_worked_in/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 10:54:54 UTC",
    "id": "1j7vx43",
    "link_flair_text": null,
    "media": null,
    "num_comments": 21,
    "score": 5,
    "secure_media": null,
    "selftext": "It looks like I can only afford leasehold flats in my area. I've only looked at properties with 999 years left on the lease. I've noticed that flats tend to sit on the market for months. Is it really as bad as people say?\n\n",
    "subreddit": "AskUK",
    "title": "What are your leasehold horror stories?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7vx43/what_are_your_leasehold_horror_stories/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 10:54:40 UTC",
    "id": "1j7vx00",
    "link_flair_text": null,
    "media": null,
    "num_comments": 37,
    "score": 0,
    "secure_media": null,
    "selftext": "So on Saturday I got into a fight, got arrested and was put in a cell for the night. It’s only come to my attention now that this can possibly harm me going to America near the end of June. I haven’t told my parents, but I am travelling with my mum. I can’t stop thinking about it.",
    "subreddit": "AskUK",
    "title": "Will I be denied into America?",
    "upvote_ratio": 0.43,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7vx00/will_i_be_denied_into_america/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 10:36:05 UTC",
    "id": "1j7vnq2",
    "link_flair_text": null,
    "media": null,
    "num_comments": 35,
    "score": 12,
    "secure_media": null,
    "selftext": "Hi everyone, this might be pretty long, so I appreciate it if you do decide to read. I just turned 21, and I work part-time in retail, which I’m absolutely sick of. I’ve had 3 retail jobs and have been working in retail since I was 16. I was homeschooled from the age of 7 or 8. The majority of my schooling was at home, and I only did a total of about 3-4 years in public school. Not to pass blame, but my parents did not think very wisely when deciding to educate me at home. My parents did buy me Maths and English books from WHSmiths, but I didn’t have a strict schedule and they weren’t always able to sit down with me and teach, so I ended up doing a lot of learning on my own. Fast forward to high school, I did around 3 months of year 7, then was homeschooled again, then 4 months of year 8, then once again was homeschooled. I was not made to do my GCSEs by my parents, so yeah, that never happened. I decided to enroll in college though when I was 16. I was doing a Health and Social Care course, but it really wasn’t something I enjoyed, so I dropped it and found a job instead. I really do want to get back into education now, but I’m finding it really difficult to figure out where to start. I’m sure there’s hope for me, but I do need a little help getting to where I want to be. My career goal would probably be something involving nursing, although I’m still trying to figure out what it is exactly that I want.\nAll advice is appreciated, and if you read to the end, thank you :)\n\nSidenote: I’m currently in the process of an ADHD diagnosis, which I believe has contributed to my inability to focus on studying. ",
    "subreddit": "AskUK",
    "title": "I’m 21 with only 3 years of schooling. where do I start?",
    "upvote_ratio": 0.83,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7vnq2/im_21_with_only_3_years_of_schooling_where_do_i/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 10:35:32 UTC",
    "id": "1j7vngg",
    "link_flair_text": null,
    "media": null,
    "num_comments": 39,
    "score": 12,
    "secure_media": null,
    "selftext": "Just a general question really that’s been bugging me for nearly 4.5 years! \nWe have lived in our flat all this time and are now due to move out Friday into our own house. Wondering if anyone can resolve the mystery before we go!\n\nIn the whole time no one has even been seen entering or exiting the flat. Huge piles of post have built up and even had to be collected by Royal Mail. Our other neighbour has lived here 2 years longer than us and never met them either. The mystery seems to be that in the current climate if this was a rental- wouldn’t it have been rented out? We live in a high demand and popular area so this wouldn’t be an issue. Or even if you owned it, would you not have sold it/popped back/ or rented it out in all that time rather than it just laying dormant? We also wondered initially if they had died but surely would have been sold/ gone through probate by now? We even wondered if the occupant is in prison!\n\nIt doesn’t really matter overall just a bit of fun speculation but wondered if anyone has any theories that could solve this mystery!\n\nTLDR- our neighbour has been absent for what appears over 6.5 years now. What’s going on?",
    "subreddit": "AskUK",
    "title": "Where is my neighbour?",
    "upvote_ratio": 0.8,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7vngg/where_is_my_neighbour/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 10:24:42 UTC",
    "id": "1j7vhun",
    "link_flair_text": null,
    "media": null,
    "num_comments": 17,
    "score": 0,
    "secure_media": null,
    "selftext": "Hi, I am an international student studying in London. I have secured myself a summer internship with a company in Cambridge. Since I would prefer not to double rent and given its short duration, would commuting between Cambridge and London be a good idea?. ",
    "subreddit": "AskUK",
    "title": "Is London - Cambridge commutable?",
    "upvote_ratio": 0.4,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7vhun/is_london_cambridge_commutable/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 08:16:15 UTC",
    "id": "1j7tt86",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 1,
    "secure_media": null,
    "selftext": "Hmrc sent me a letter that states I owe them £242 from a previous tax year. Something I have been unaware of until now. I have always been employed on a PAYE job. \n\nThey have now written to me to say that they will adjust my tax code to recoup the money. They are reducing my tax code by £1211 to recoup £242. How does this make any sense. Surely my tax code should reduce by £242?\n\nHelp am I missing something? ",
    "subreddit": "AskUK",
    "title": "I owe HMRC £242 so how has my tax free allowance has dropped by £1211?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/gallery/1j7tt86",
    "url_overridden_by_dest": "https://www.reddit.com/gallery/1j7tt86"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 10:11:33 UTC",
    "id": "1j7vbb2",
    "link_flair_text": null,
    "media": null,
    "num_comments": 9,
    "score": 3,
    "secure_media": null,
    "selftext": "https://imgur.com/a/v8IajlU\n\nThis was bought in the UK in 1986. My dad says he got it from Woolworths. I used to get my mum to cut all the labels off my toys unfortunately as they annoyed me, so I have no idea who made it. I went on holiday in about 1993-4 and found a postcard of this bear, but it had bananas instead of grapes, so it was obviously part of a collection.\n\nI can't find anything about these bears online, so I suspect they were just not well known enough to be remembered. I'm hoping that as they were in UK shops around this time, someone here will have been bought one!",
    "subreddit": "AskUK",
    "title": "This is a long shot, but was anyone else given this teddy bear when they were a kid?",
    "upvote_ratio": 0.8,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7vbb2/this_is_a_long_shot_but_was_anyone_else_given/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 10:08:44 UTC",
    "id": "1j7v9wg",
    "link_flair_text": null,
    "media": null,
    "num_comments": 366,
    "score": 822,
    "secure_media": null,
    "selftext": "So my neighbours across the street moved out and left their cat! \n\nAt first I assumed that the cat might be returning to its old home by itself.. like cats sometimes do! so I contacted them through facebook. \n\nThey read my message and  blocked me! \nIt definitely lived there because I’d see them letting it in or out everyday. \nAnd now it screams at its old front door. \n\nI’ve been feeding it and letting it sleep here the past couple of nights. So I guess I have a cat now? \n\nBut can I report my neighbours? Surely you can’t just abandon an animal and face no consequences? ",
    "subreddit": "AskUK",
    "title": "Can you just abandon a cat when you move house?",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7v9wg/can_you_just_abandon_a_cat_when_you_move_house/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 09:58:53 UTC",
    "id": "1j7v4u4",
    "link_flair_text": null,
    "media": null,
    "num_comments": 284,
    "score": 56,
    "secure_media": null,
    "selftext": "Just randomly remembered the word “brap”. Brap brap brap. \n\nWhat was everyone’s favourite school time slang words?",
    "subreddit": "AskUK",
    "title": "What was everyone’s 2000-2010 slang words?",
    "upvote_ratio": 0.79,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7v4u4/what_was_everyones_20002010_slang_words/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 09:45:02 UTC",
    "id": "1j7uyb5",
    "link_flair_text": null,
    "media": null,
    "num_comments": 12,
    "score": 3,
    "secure_media": null,
    "selftext": "So I’ve been doing some research about them, it goes from A - D with category A being the highest risk and category D is the lowest risk or open prisons. Now what I want to know is like what does that actually like  for each category. And if we assume someone is a first time offender for a violent crime they committed when they were a minor but is now say like 21. Which category are they getting sent to. (Ik no one can say for sure but we can make educated guesses).\n\nAnd for the violent crime it’s a serious violent crime but not tooo serious. It’s like borderline…like it wasn’t just a fist fight but it wasn’t anything life threatening either.",
    "subreddit": "AskUK",
    "title": "What are the differences in the uk prison categories?",
    "upvote_ratio": 0.72,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7uyb5/what_are_the_differences_in_the_uk_prison/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 09:39:51 UTC",
    "id": "1j7uvvf",
    "link_flair_text": null,
    "media": null,
    "num_comments": 10,
    "score": 0,
    "secure_media": null,
    "selftext": "Ordered off Ali express… unsure who the parcels will be sent to in the UK… the first 4 digits are correct , the last two are completely off , but it still is partly on my road / a connecting road. The address is still mine … will it be delivered still? \n\nShould be evri &amp; Royal Mail , there are two ** from what I’ve gathered … ",
    "subreddit": "AskUK",
    "title": "Right address , slightly wrong postcode - will it still be delivered ?",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7uvvf/right_address_slightly_wrong_postcode_will_it/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 09:29:02 UTC",
    "id": "1j7uqt4",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 0,
    "secure_media": null,
    "selftext": "I already have a British passport and all it says is bring your old passport do I need to bring the application form or photos as I sent one online to them and it's only because the place of birth is misspelled or what documents should I bring?",
    "subreddit": "AskUK",
    "title": "What do I need to bring for my 1 day passport service?",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7uqt4/what_do_i_need_to_bring_for_my_1_day_passport/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 09:17:07 UTC",
    "id": "1j7ul2u",
    "link_flair_text": null,
    "media": null,
    "num_comments": 34,
    "score": 4,
    "secure_media": null,
    "selftext": "Hi all, \nMy brother and I are visiting the UK this April and bought 2x tickets to Tottenham vs Nottingham on the 20st of April, which is the day before we leave for Liverpool. Now they’ve rescheduled the game to the 21st and said we can’t get a refund, but we also can’t move our accomodation around. We also really don’t want to miss out on Liverpool!\n\nWe have listed the tickets for sale but no one is taking them, so just wanting to know if they would sell or if we will just lose our money?\n\nThanks in advance :)",
    "subreddit": "AskUK",
    "title": "How possible is it to sell football tickets?",
    "upvote_ratio": 0.7,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7ul2u/how_possible_is_it_to_sell_football_tickets/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 09:04:13 UTC",
    "id": "1j7uf1z",
    "link_flair_text": null,
    "media": null,
    "num_comments": 8,
    "score": 0,
    "secure_media": null,
    "selftext": "I had an offer on my credit card for 0% interest and fees for 12 months on transfers until 10th March 2025 (today). I've just been told by the bank that I can't take advantage of the offer as it expired today and the last day I could use it was yesterday, 9th!\n\nI find it misleading. If the offer expires today, why can't I use it today? I don't discard food the day before the use by date (realistically I don't do a hard discard on food anyway but that's another conversation).\n\nI'm interested to hear UK Reddit's take on this. Do you think their offer is misleading? Which date would you think is the last date you can use it - 9th or 10th March?\n\nEdit: thanks for replies so far, I've just re-read the back of the letter with the terms, \"The 0% interest rate will only be applied to any money transfer between 11 February 2025 and 10 March 2025.\" Ok it doesn't say inclusive, but by their reasoning I couldn't have requested it on 11th February either.",
    "subreddit": "AskUK",
    "title": "0% money transfer rate on transfers until 10/3/25. What is the last date you think the transfer can be made?",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7uf1z/0_money_transfer_rate_on_transfers_until_10325/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 09:01:26 UTC",
    "id": "1j7udlz",
    "link_flair_text": null,
    "media": null,
    "num_comments": 21,
    "score": 0,
    "secure_media": null,
    "selftext": "Does anyone else hate red roses or is it just me? Cut flowers in general are a waste of money! Why give something that’s going to die in front of your eyes? Give a living plant instead and watch it grow! ",
    "subreddit": "AskUK",
    "title": "Does any one else not like Red Roses?",
    "upvote_ratio": 0.25,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7udlz/does_any_one_else_not_like_red_roses/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 08:50:08 UTC",
    "id": "1j7u8fd",
    "link_flair_text": null,
    "media": null,
    "num_comments": 25,
    "score": 0,
    "secure_media": null,
    "selftext": "I am relocating to the UK from Egypt next August and was looking for some advise. I need to make a decision on where to go.\n\nIve been a corporate guy for 13 years in marketing in different fields and the most latest as a senior middle manager.\n\nMy questions are\n\n1. Is London my only option for big corporates? Can i do Manchester for examples? Maybe Edinburgh even?\n\n2. can i get a corporate job at the same level i am currently in or do i need to aim lower to gain UK market experience first\n\n3. Is full remote jobs still a thing? Or is everyone returning to the office\n\nAny advise and tips would be helpful\nThanks appreciated\n\n",
    "subreddit": "AskUK",
    "title": "Is London the only option for corporate guys?",
    "upvote_ratio": 0.25,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7u8fd/is_london_the_only_option_for_corporate_guys/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 08:38:41 UTC",
    "id": "1j7u3b0",
    "link_flair_text": null,
    "media": null,
    "num_comments": 106,
    "score": 112,
    "secure_media": null,
    "selftext": "I'm not taking about rising up after hitting rock bottom but more like just living a below average, with a job that feels like trudgery, not having the energy or motivation/discipline to do hard5atuff, and turning it around in mid life? \n\nMaybe you had no real skills, professional or personal, but somehow managed to change or acquire those skills? \n\nGetting better on a day-to-day basis feels impossible but when I look back on the last 10 years, it's hard to imagine there was nothing I could've done to improve.... \n\nHappy Monday! ",
    "subreddit": "AskUK",
    "title": "Did anyone turn their life around in their 40s? If so, how?",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7u3b0/did_anyone_turn_their_life_around_in_their_40s_if/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 08:35:45 UTC",
    "id": "1j7u1yc",
    "link_flair_text": null,
    "media": null,
    "num_comments": 16,
    "score": 3,
    "secure_media": null,
    "selftext": "I use tons of flat leaf parsley in my food. It's my coriander substitute and it also happens to appear in many recipes I enjoy.\n\nI've never seen a recipe call for curly leaf parsley, though, so I've always been curious why it makes up half the parsley shelf at my supermarket.\n\nWhat are you guys using it for?",
    "subreddit": "AskUK",
    "title": "What are you using your curly leaf parsley for?",
    "upvote_ratio": 0.81,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7u1yc/what_are_you_using_your_curly_leaf_parsley_for/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 08:28:22 UTC",
    "id": "1j7tyj2",
    "link_flair_text": null,
    "media": null,
    "num_comments": 591,
    "score": 83,
    "secure_media": null,
    "selftext": "Would you? What are the concerns, risks, benefits or ethics involved with artificial meats?",
    "subreddit": "AskUK",
    "title": "Would you eat lab grown meat? Why or why not?",
    "upvote_ratio": 0.79,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7tyj2/would_you_eat_lab_grown_meat_why_or_why_not/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 08:13:17 UTC",
    "id": "1j7trwn",
    "link_flair_text": null,
    "media": null,
    "num_comments": 32,
    "score": 19,
    "secure_media": null,
    "selftext": "Should I be washing my empty yogurt pots? Do I need to remove the parcel tape from my cardboard boxes?",
    "subreddit": "AskUK",
    "title": "Recycling workers: what can people do to make your job easier?",
    "upvote_ratio": 0.73,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7trwn/recycling_workers_what_can_people_do_to_make_your/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 07:26:38 UTC",
    "id": "1j7t695",
    "link_flair_text": null,
    "media": null,
    "num_comments": 54,
    "score": 11,
    "secure_media": null,
    "selftext": "Inside out 2 taught me ennui, which I know is from French but is supposedly in reasonably common usage.",
    "subreddit": "AskUK",
    "title": "Adult native level speakers. How often do you learn new words?",
    "upvote_ratio": 0.82,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7t695/adult_native_level_speakers_how_often_do_you/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 07:20:51 UTC",
    "id": "1j7t3na",
    "link_flair_text": null,
    "media": null,
    "num_comments": 9,
    "score": 8,
    "secure_media": null,
    "selftext": "\nEarlier this year i discovered i was overcharged by a fellow tenant for utilities for a substantial amount. I collected all appropriate evidence, requested utility receipts, and offered to find some sort of resolution before I had no other recourse but to make a claim against them. \n\nThis is all through email correspondence; I have not engaged  with the individual at all in person. In fact i make it a point to avoid communal areas if i know they are using them. \n\nIn our correspondence, they repeatedly accused me of harassment (harassment in this case being the fact i sent emails requesting receipts for the services i paid for), and asked that i do not engage with them further. I obliged, and only communicated issues like outages due to utilities not being paid.\n\nIve recently organised my correspondence on the matter, calculated a rough estimate of what I am owed, and open med a case in small claims court. \n\nSince then, i have heard from other tenants that she and her father have been making further allegations of harassment. I sort of brushed this off.\n\nHowever over the weekend the police called me oht of the blue, asking to speak to the aforementioned housemate. I informed them that this is my phone, and that the housemate has never used it. When i pressed to ask how on earth they found my number, they become very evasive and eventually said “we cant tell you”. They then asked for the housemates number, and after confirming they were actual police, i obliged. \n\nNow i am a bit scared, because to me it sounds like the housemate has reported me to the police, and somehow cocked it up by giving them my number instead of their own. \n\nI am a large man, and i am terrified of somehow being the victim of a false allegation. Its clear to me this tenant is desperate, as the deadline for the small claim is approaching, they are resorting to trying to fabricate a “pattern of harassment”. \n\nI really feel scared to leave my room sometimes, because although the other tenants are sympathetic and have promised to vouch for my character, i just have this nightmare that ill be stuck in a he-say-she-say moment where i cant do anything to help myself. \n\nAm i over reacting? How can i quell these thoughts? Im not able to move out currently, although that is on the card ",
    "subreddit": "AskUK",
    "title": "How to protect yourself against false allegations?",
    "upvote_ratio": 0.78,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7t3na/how_to_protect_yourself_against_false_allegations/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 07:13:36 UTC",
    "id": "1j7t08h",
    "link_flair_text": null,
    "media": null,
    "num_comments": 136,
    "score": 42,
    "secure_media": null,
    "selftext": "So yeah.. starting a bit late because I decided its safer not to drive before as I've been an alcoholic for most of my adult life.\n\nNow finally sober, I've got my lessons booked and I'm excited to get going.\n\nWhat advice have you got for me?\n\nWas debating going 2-4 hours a week, reckon that's enough?\n\nHow long do you think I should wait before driving in my own car with the missus \"instructing\"?",
    "subreddit": "AskUK",
    "title": "At 31 years old I'm finally starting my driving lessons, what tips and general advice do you have for me?",
    "upvote_ratio": 0.9,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7t08h/at_31_years_old_im_finally_starting_my_driving/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 06:49:05 UTC",
    "id": "1j7so7e",
    "link_flair_text": null,
    "media": null,
    "num_comments": 129,
    "score": 268,
    "secure_media": null,
    "selftext": "I've (29m) asked them to stop but they just deny it's them. They have an Assisted Bin Service which means the bin men will collect their household, recycling and garden waste bins from their garden, so it has nothing to do with access issues.\n\nI think their thought process is that, because I'm on my own and not using my bin capacity, it's fine. But they're disposing of cat litter in my bin which is gross, and I don't want to be liable if they dispose of anything else which shouldn't go into my household waste bin.\n\nOn that note, would I be liable? I have RING which I'm sure has caught footage of the elderly lady taking a bag towards my bin and then returning without it.\n\nIs it unreasonable of me to want to use their own bin? How can I stop them? I was thinking of either moving the bin or placing a paving slab on top of it.",
    "subreddit": "AskUK",
    "title": "How should I manage elderly neighbours that keep putting their household waste in my bin?",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7so7e/how_should_i_manage_elderly_neighbours_that_keep/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 04:44:19 UTC",
    "id": "1j7quto",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 2,
    "secure_media": null,
    "selftext": "This is going to sound really weird but it's literally and I mean physically weighing on my mind. It's like the memory is heavy which is strange to say the least.\n\nIt's like the roof of my mouth is full and putting pressure on my head at the thought of unwrapping something at hyperspeed but the world is moving slowly.\n\nI know... Makes no sense right?\n\nIt's 5:38 am and I can't sleep cos I have a memory of doing something quickly but the world is moving normally? But whatever I'm 'unwrapping' mentally is making the roof of my mouth feel full, like eating a really big burger full.\n\nI have experienced this a few times in my life and was curious if anyone else has.\n\nIt literally hurts my head the same way that anxiety feels when you have an important meeting the next day.\n\nAny idea would be cool.",
    "subreddit": "AskUK",
    "title": "I have memories of a feeling that I can't quite describe?",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7quto/i_have_memories_of_a_feeling_that_i_cant_quite/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 03:11:46 UTC",
    "id": "1j7p97d",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 0,
    "secure_media": null,
    "selftext": "Luckily I've never been into apps like Instagram/TikTok, but when things aren't going particularly well in life, I tend to spend some time on Reddit. I do get some value out of Reddit, but not without being subjected to utter bollocks most of the time; I think its mostly kids, bots/ads, maybe somewhat normal people going through something or seriously weird people who you'd only get a glimpse of as they peep from their window in real life. Truthfully, I almost never want to hear anything from these groups and yet the online world is dominated by whatever comes out of them, and consuming this content is nothing but detrimental for anyone. The noise to value ratio is getting noticeably worse every month. I'm making an effort to always have a few books around the house/car, bookmarks of blogs (tech mostly) and of course doing something physical. But there is still a place for a source that I can read/browse when not paying much attention and has a chance of introducing me to something new. Subscribing to some UK centric subs has helped but these days they too are overflowing with ... anyway, what subreddits or sources on internet do you like?",
    "subreddit": "AskUK",
    "title": "What subreddits do you subscribe to?",
    "upvote_ratio": 0.22,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7p97d/what_subreddits_do_you_subscribe_to/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 02:21:24 UTC",
    "id": "1j7oaxn",
    "link_flair_text": null,
    "media": null,
    "num_comments": 61,
    "score": 1,
    "secure_media": null,
    "selftext": "Hi friends, Me and my girlfriend are moving to the UK (I’m American and she’s Pakistani) so obviously there are going to be a lot of cultural differences. What are some niche things about life in the uk and tips for living here? We’re moving to London if that helps",
    "subreddit": "AskUK",
    "title": "What are some tips for life in the UK?",
    "upvote_ratio": 0.52,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7oaxn/what_are_some_tips_for_life_in_the_uk/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 01:36:10 UTC",
    "id": "1j7nfb0",
    "link_flair_text": null,
    "media": null,
    "num_comments": 60,
    "score": 33,
    "secure_media": null,
    "selftext": "Prime example of this savagery is getting on the tube. Theres another one thats literally 2 minutes away ....",
    "subreddit": "AskUK",
    "title": "Why do Brits queue so religiously but turn into absolute savages when it comes to getting on public transport?",
    "upvote_ratio": 0.68,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7nfb0/why_do_brits_queue_so_religiously_but_turn_into/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 01:12:17 UTC",
    "id": "1j7mykp",
    "link_flair_text": null,
    "media": null,
    "num_comments": 41,
    "score": 0,
    "secure_media": null,
    "selftext": "I'm British, but decided its time to stop travelling after 8 years and return home and start a career. Probably back in my original career in corporate sales, but we'll see.\n\nI have a shortlist of towns and cities I like. But they're all places I've worked in before. \n\nManchester - basically home \n\nNewcastle - easy to find shit work if something goes wrong \n\nNorwich - dunno I liked Norwich for some reason\n \nBristol  - love Bristol but it's expensive to rent. \n\nThought I'd see what everyone else thinks. If you could up sticks and move your entire life, within the UK, where would you go? \n\nMy Key requirements:\n\nSocial opportunities for a none drinker (I'm sure that's everywhere, but if somewhere has a high number of chess clubs, games nights etc. That'd be dreamy) \n\nHigh number of jobs, even if its factory work. But preferably sales\n\nSub £600/m on a room in shared housing. Ideally around £400. Godda get my level up on",
    "subreddit": "AskUK",
    "title": "If you could move anywhere in the UK, where would it be, and why?",
    "upvote_ratio": 0.44,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7mykp/if_you_could_move_anywhere_in_the_uk_where_would/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 00:40:48 UTC",
    "id": "1j7mc3i",
    "link_flair_text": null,
    "media": null,
    "num_comments": 11,
    "score": 0,
    "secure_media": null,
    "selftext": "Hi I used to use a gaming laptop and didn’t really experience any issues too much with lag.\n\nNow I’m using a desktop and bought a tp link to connect WiFi. \n\nI can’t look to getting an Ethernet cable as it’s not feasible for me.\n\nThe pc is also in my room which is the worst place for internet connection in general \n\nMy download speed on steam is about 36-40\n\nWhat can I do to reduce lag? \n\nDo I need to get a better WiFi adapter or is it the internet itself.\n\nThanks \n\n\nEdit: I can’t get an Ethernet cable or any cable because my dad won’t allow me…. I wasn’t even gonna do\nIt myself, was gonna get electricians and all the relevant people too do it all up to my room (I’m upstairs WiFi downstairs) But his house his rules so I’ve ruled that outt.\n\n",
    "subreddit": "AskUK",
    "title": "How to reduce lag for gaming?",
    "upvote_ratio": 0.25,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7mc3i/how_to_reduce_lag_for_gaming/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 00:27:23 UTC",
    "id": "1j7m2dk",
    "link_flair_text": "Answered",
    "media": null,
    "num_comments": 55,
    "score": 0,
    "secure_media": null,
    "selftext": "Hey, guys! American here! I'm from the Southern US and it's a very common thing in the culture down here to have a vegetable garden every spring and summer. We also plant lots of fruit trees or go picking wild berries when they are ripe. Is this common in the UK too? If so what do you plant? What do your growing seasons look like? ",
    "subreddit": "AskUK",
    "title": "Do people from the UK commonly grow their own vegetables like in the US?",
    "upvote_ratio": 0.35,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7m2dk/do_people_from_the_uk_commonly_grow_their_own/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 00:03:16 UTC",
    "id": "1j7lkpn",
    "link_flair_text": null,
    "media": null,
    "num_comments": 59,
    "score": 1,
    "secure_media": null,
    "selftext": "Am visiting the uk in may (ive been out of the uk for 15 years) and wanted a day trip to London, but even booking this far in advance the prices are insane, is there a better site than TrainLine ?   ",
    "subreddit": "AskUK",
    "title": "When did train fares become so expensive ?",
    "upvote_ratio": 0.52,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7lkpn/when_did_train_fares_become_so_expensive/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 23:59:33 UTC",
    "id": "1j7lhqs",
    "link_flair_text": null,
    "media": null,
    "num_comments": 13,
    "score": 1,
    "secure_media": null,
    "selftext": "I work in a fairly “working class” profession and it has a very casual/friendly work environment for the most part - everyone is ‘mate’, subordinates and seniors alike.\n\nAre high paying workplaces similar? I’m thinking financial firms/ law firms etc. Is it all ‘Mr/ Mrs X when talking to colleagues or first names? Or is everyone you work with ‘mate’?",
    "subreddit": "AskUK",
    "title": "Do higher paying workplaces have casual work environments?",
    "upvote_ratio": 0.56,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7lhqs/do_higher_paying_workplaces_have_casual_work/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 23:50:46 UTC",
    "id": "1j7lb8a",
    "link_flair_text": "Answered",
    "media": null,
    "num_comments": 38,
    "score": 7,
    "secure_media": null,
    "selftext": "Electric blankets pre warm your bed and keeps it warm, anything that will do that but keep it cold?",
    "subreddit": "AskUK",
    "title": "Is there an equivalent for an electric blanket to keep your bed cool instead?",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7lb8a/is_there_an_equivalent_for_an_electric_blanket_to/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 23:46:36 UTC",
    "id": "1j7l85i",
    "link_flair_text": null,
    "media": null,
    "num_comments": 38,
    "score": 0,
    "secure_media": null,
    "selftext": "I ask this as I think i would have less than 5% of contacts would would reach out... Do we really care about each other?",
    "subreddit": "AskUK",
    "title": "If you deleted every single contact from your phonebook, what percentage of your contacts would reach out within one year?",
    "upvote_ratio": 0.46,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7l85i/if_you_deleted_every_single_contact_from_your/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 23:40:52 UTC",
    "id": "1j7l3y3",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 0,
    "secure_media": null,
    "selftext": "i used to get magazines as a kid, one page would be an art competition for you to win a toy. now i won a dora toy, boo toy and a my little pony toy from these art competitions as a kid and i cannot for the life of me remember what magazines they were!\n\nit would be a page with a blank square and the competition info surrounding. you’d draw your picture in the square and then a parent would put stuff like their email, phone number, your age, address, and then they would have to mail it back to the magazine company. \n\ndo these even exist anymore!! ",
    "subreddit": "AskUK",
    "title": "does anybody remember the name of the kid drawing competition magazines?",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7l3y3/does_anybody_remember_the_name_of_the_kid_drawing/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 23:20:59 UTC",
    "id": "1j7kp52",
    "link_flair_text": null,
    "media": null,
    "num_comments": 193,
    "score": 0,
    "secure_media": null,
    "selftext": "I cannot believe that this is still a thing. Department of education says ‘Academies without a religious designation must provide collective worship that is wholly or mainly of a broadly Christian character’ my wife and I are atheists. How can one religion be promoted Over others in government schools? Will it cause a fuss if our child\nOpted out? Have you done it? Or am I better to say to them to just question it all? What can be done? ",
    "subreddit": "AskUK",
    "title": "What it like Opting out of collective worship in primary schools?",
    "upvote_ratio": 0.4,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7kp52/what_it_like_opting_out_of_collective_worship_in/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 23:20:54 UTC",
    "id": "1j7kp36",
    "link_flair_text": null,
    "media": null,
    "num_comments": 40,
    "score": 0,
    "secure_media": null,
    "selftext": "Hello there,\n\nI am a student that's recently moved to Guildford for a semester abroad (US born and bred) and have practically nothing to live off of until I get paid next week. I've just got my period, haven’t bought any products yet, and can’t afford to for the next couple days. I’m hoping there was a library or something similar close to me to cover for the next couple days, but I don’t know where to look. Is there anyone who could help?\n\nMany thanks in advance!\n\nVictoria x",
    "subreddit": "AskUK",
    "title": "Where Can I Find Free Or Cheap Period Products?",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7kp36/where_can_i_find_free_or_cheap_period_products/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 23:17:46 UTC",
    "id": "1j7kmpc",
    "link_flair_text": null,
    "media": null,
    "num_comments": 9,
    "score": 0,
    "secure_media": null,
    "selftext": "I recently registered for a company's HMRC PAYE. I was given a ref number. I want to confirm how many days it usually take, can I go for a follow up. If yes, Support email will be appreciated. Thanks. ",
    "subreddit": "AskUK",
    "title": "How many days HMRC Paye registration usually takes place in Uk?",
    "upvote_ratio": 0.25,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7kmpc/how_many_days_hmrc_paye_registration_usually/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 22:50:11 UTC",
    "id": "1j7k14c",
    "link_flair_text": null,
    "media": null,
    "num_comments": 21,
    "score": 0,
    "secure_media": null,
    "selftext": "I’ve always loved playing in the mud ever since I was a little kid and continue to do it to this day.\n\nMudflats usually contain really nice quality mud, really thick and sticky, it’s so much fun to play in it.\n\nWith the sewage spillages, the sewage sediment could settle on the top layer of mud and stay there forever, unlike in the water which usually clears after a given amount of time after discharge. That could leave a top layer of raw sewage sediment on top. But I’m not entirely sure.\n\nI have noticed when playing in the mudflats many years ago, that the mud has a very strong sulphuric like smell which is a little unusual for mudflats as usually the smell is quite mild and it doesn’t have that rotten egg smell to it. The top layer also has a brown color to it, while the actual bottom layer is dark grey like it should be. \n\nI’ve never gotten ill from playing in the mud. But the strong smell leads me to wonder whether the mudflats are contaminated?\n\nDoes anyone have any thoughts or advice on this?",
    "subreddit": "AskUK",
    "title": "I want to play in the mudflats, can it be done?",
    "upvote_ratio": 0.43,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7k14c/i_want_to_play_in_the_mudflats_can_it_be_done/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 22:45:27 UTC",
    "id": "1j7jxes",
    "link_flair_text": null,
    "media": null,
    "num_comments": 33,
    "score": 0,
    "secure_media": null,
    "selftext": "We have a budget of around £300,000 and are looking for a 3-bedroom house. Our ideal location would have:\n\n\t•\tA low crime rate\n\t•\tA strong sense of community\n\t•\tGood schools\n\t•\tA good shopping centre nearby\n\t•\tPlenty of things to do locally\n\t•\tAccess to countryside (though not essential)\n\t•\tIdeally, within a 3-hour drive of London\n\nWe’d love to find somewhere that ticks all of these boxes!",
    "subreddit": "AskUK",
    "title": "Where should we move to in England? Looking for somewhere safe and affordable",
    "upvote_ratio": 0.35,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7jxes/where_should_we_move_to_in_england_looking_for/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 22:35:47 UTC",
    "id": "1j7jpsc",
    "link_flair_text": "Answered",
    "media": null,
    "num_comments": 9,
    "score": 2,
    "secure_media": null,
    "selftext": "I watch the show from time to time, and always wonder where they're getting the % of the population from. Has anyone ever been asked the questions? ",
    "subreddit": "AskUK",
    "title": "Has anyone ever been approached by The 1% Club team, who are supposedly quizzing the nation on the questions before they're asked on the show?",
    "upvote_ratio": 0.58,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7jpsc/has_anyone_ever_been_approached_by_the_1_club/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 22:29:40 UTC",
    "id": "1j7jkq8",
    "link_flair_text": null,
    "media": null,
    "num_comments": 27,
    "score": 0,
    "secure_media": null,
    "selftext": "I am trying to decide whether to proceed with sedation or not, but I don't know what to expect from the sedatives, as I don't drink, nor take drugs.\n\nHow would you describe the experience of being drugged up with these sedatives (while being scoped)? How long did the affects last, and how long to wear off? Could you go about your business soon after the procedure? Were you in control of yourself or did impulse control go? I am concerned I will start saying how hot the nurses are or something or start making vulgar jokes about anal activities and first dates (which I do not want to do and would never think of doing when conscious and alert). I do have intrusive thoughts though. I also do not have anyone to be with me for 24 hours (and don't want anyone to be with me) but I do have a lift home I can arrange.\n\nAre these drugs even safe, or should I avoid in case of any risks?",
    "subreddit": "AskUK",
    "title": "If you had a colonoscopy, what was your experience with fetano and midazapam?",
    "upvote_ratio": 0.17,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7jkq8/if_you_had_a_colonoscopy_what_was_your_experience/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 22:14:05 UTC",
    "id": "1j7j87q",
    "link_flair_text": null,
    "media": null,
    "num_comments": 201,
    "score": 145,
    "secure_media": null,
    "selftext": "My doctor recommended that I change my diet to improve my cholesterol.  One thing he recommended was salmon.  Fresh salmon is relatively expensive in the UK so I thought I would try making something with tinned salmon.  \nMy first tin from Tesco had a lot skin and bones inside.  I’ve bought tinned salmon in my home country and it is usually skinless and boneless.  I tried to pick out the skin and the bones without much success.  I chewed through some remaining bones and gave up.  \nI bought two other tins today from Sainsbury’s and Waitrose, but each was exactly the same.  I couldn’t understand why these inedible pieces would be left in the tin.  Tinned tuna doesn’t have this.  Is this normal or am I missing something?",
    "subreddit": "AskUK",
    "title": "Do people really buy the tinned salmon with the bones?",
    "upvote_ratio": 0.79,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7j87q/do_people_really_buy_the_tinned_salmon_with_the/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 21:48:17 UTC",
    "id": "1j7in1i",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 1,
    "secure_media": null,
    "selftext": "Hello, \n\nThis question is more directed towards the folks who have a desk job and especially work from home.\n\nI need chair recommendations for the home office. My wife and I mostly work from home and are looking to move away from the basic chairs we have. When I work at the office, I use [Herman Miller Sayl](https://www.johnlewis.com/herman-miller-sayl-office-chair/p111081634); I find it decently comfortable. However, for the home office, I am inclined to buy the [Herman Miller Verus](https://wellworking.co.uk/fast-delivery-chairs/verus-office-chair-dark-carbon-triflex-back-mineral-frame-fast-delivery/) for the both of us.\n\nI have checked a few economical options on Amazon and find the [SIHOO Ergonomic office chair ](https://amzn.eu/d/hD0k1Tu)a good choice. too. The [Autonomous.ai](https://www.autonomous.ai/en-GB/office-chairs/ergonomic-chair?is_open=true&amp;option_code=ErgoChairProN-ErgoChairProFoamMesh_ChairColor.CoolGray%2CStyleOptions.Mesh) Ergo Chair Pro appears to be a better version of the SIHOO chair.Does anyone have any other recommendations or reviews of the chairs listed above? \n\nFeedback would help me better utilise the money that I am going to spend on the chair. \n\nThanks.",
    "subreddit": "AskUK",
    "title": "Can you folks suggest a good Home Office Chair?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7in1i/can_you_folks_suggest_a_good_home_office_chair/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 21:45:49 UTC",
    "id": "1j7ikyx",
    "link_flair_text": null,
    "media": null,
    "num_comments": 31,
    "score": 0,
    "secure_media": null,
    "selftext": "Hi guys, some lads I know for their fantasy football punishment are throwing stuff eg eggs off a 7 storey building at their mate, around 30m high.   He has to run there and back the length of the building 10 times (around 2km overall I’m told - 100m a length). It overlooks a busy road as well as a fairly busy footpath, where pedestrians would walk underneath during the punishment. It this a smart idea or shld I try to convince them otherwise? 🤣",
    "subreddit": "AskUK",
    "title": "Is lobbing stuff off a building legal?",
    "upvote_ratio": 0.21,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7ikyx/is_lobbing_stuff_off_a_building_legal/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 21:37:42 UTC",
    "id": "1j7iebc",
    "link_flair_text": null,
    "media": null,
    "num_comments": 28,
    "score": 1,
    "secure_media": null,
    "selftext": "For me it's the 1997-2008 Vauxhall era: Zafira 1st gen, Astra G, Vectra Mk2/Mk2 Facelift, as well as some old Fords such as the Mk1 Focus, Mk2 Mondeo, and Mk5 Fiesta. The older Peugeots up to around 2010 (such as the 206) also seem to be a rare sight these days! ",
    "subreddit": "AskUK",
    "title": "What was a car you used to see 5+ years ago but not any more?",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7iebc/what_was_a_car_you_used_to_see_5_years_ago_but/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 21:19:57 UTC",
    "id": "1j7hzra",
    "link_flair_text": null,
    "media": null,
    "num_comments": 18,
    "score": 0,
    "secure_media": null,
    "selftext": "I've been hitting the gym 3 or 4 times a week for about 6 months now, and have  lost around 7kg/15lb (starting weight was around 82kg, and I'm currently 75kg). I think I look pretty good, I personally - not at my end goal, but a lot better than i did. Some of the members of my family have made remarks that I look 'too thin' and that I'm not eating enough (that I look anorexic and am eating chilt-size portions). Believe me, I eat plenty. It's getting to the point where I feel like I have to list everything I eat to prove to them that I'm not ill, just not eating as much crap as I used to. I'm so starting to feel like I don't want to talk to them at all if they're juat going to comment on my weight and accuse me  of being mentally ill. How would you feel if you were in this position?",
    "subreddit": "AskUK",
    "title": "How would you feel/react to family accusing you of having an eating disorder?",
    "upvote_ratio": 0.38,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7hzra/how_would_you_feelreact_to_family_accusing_you_of/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 21:15:09 UTC",
    "id": "1j7hvy8",
    "link_flair_text": null,
    "media": null,
    "num_comments": 303,
    "score": 197,
    "secure_media": null,
    "selftext": "Title inspired by a quote from Winston Churchill saying “when you’re in hell, keeping going.”\n\nFor me, I hate my job (used to love it ironically), my boss and my colleagues. However, my work looks reasonably good on a CV, so that is what I’d keeping my going, knowing that each day that I do, will reap dividends, in ensuring that when a job comes along that you really want, that you have the stability in your work history.",
    "subreddit": "AskUK",
    "title": "People who are going through hell right now, what is it, that is keeping you going?",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7hvy8/people_who_are_going_through_hell_right_now_what/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 21:12:56 UTC",
    "id": "1j7hu52",
    "link_flair_text": null,
    "media": null,
    "num_comments": 217,
    "score": 0,
    "secure_media": null,
    "selftext": "Unlike USA, the uk has mandatory religious education lessons in school + a focus on prayers, singing religious songs etc. would you be in favour of taking a secular approach and keeping the gov and religion separate",
    "subreddit": "AskUK",
    "title": "Would you be in favour of making religious education non mandatory in school ?",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7hu52/would_you_be_in_favour_of_making_religious/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 21:06:09 UTC",
    "id": "1j7hoo8",
    "link_flair_text": null,
    "media": null,
    "num_comments": 11,
    "score": 4,
    "secure_media": null,
    "selftext": "Hi, I've got quite a few samsung products, and just recently the 10 month old tv packed up, what a challenge it was to get it repaired, over a month of phone calls and eventually they finally agreed to repair it, now my s21 ultra has got the green line. Has anyone else noticed the quality has gone downhill? ",
    "subreddit": "AskUK",
    "title": "Is Samsung quality getting worse ?",
    "upvote_ratio": 0.84,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7hoo8/is_samsung_quality_getting_worse/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 21:04:57 UTC",
    "id": "1j7hnqe",
    "link_flair_text": null,
    "media": null,
    "num_comments": 29,
    "score": 0,
    "secure_media": null,
    "selftext": "If you've been to the states, what are your favorite American foods, snacks, or drinks?",
    "subreddit": "AskUK",
    "title": "What is your favorite American food?",
    "upvote_ratio": 0.25,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7hnqe/what_is_your_favorite_american_food/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 19:26:35 UTC",
    "id": "1j7feiq",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I’m late 20s with no kids etc, and have a job that’s 100% remote so I can work anywhere. \n\nFor the past few years I’ve been in low paying jobs so I’ve been at home in very rural Scotland (not ideal for making friends). I would love to move somewhere where I have the opportunity to have friends / meet new people - something which is difficult in a remote job. \n\nWhen you have so many possibilities, it’s difficult to narrow it down. \n\nWhat city would you move to if you could move anywhere in the UK and why?",
    "subreddit": "AskUK",
    "title": "Remote job where I can move anywhere in UK - where would you go?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7feiq/remote_job_where_i_can_move_anywhere_in_uk_where/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 20:55:35 UTC",
    "id": "1j7hg0m",
    "link_flair_text": null,
    "media": null,
    "num_comments": 18,
    "score": 0,
    "secure_media": null,
    "selftext": "I never learnt when I was a kid, my parents didn’t have time to teach me. I kind of feel like this is a skill I should know by now, but I’m not even sure how you’d begin to learn?",
    "subreddit": "AskUK",
    "title": "Is it hard to learn to ride a bike as an adult?",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7hg0m/is_it_hard_to_learn_to_ride_a_bike_as_an_adult/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 20:28:01 UTC",
    "id": "1j7gtdx",
    "link_flair_text": null,
    "media": null,
    "num_comments": 73,
    "score": 0,
    "secure_media": null,
    "selftext": "What are the funniest, most ridiculous british surnames you've heard?\n\n",
    "subreddit": "AskUK",
    "title": "What's the funniest, most ridiculous British surname you've come across?",
    "upvote_ratio": 0.2,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7gtdx/whats_the_funniest_most_ridiculous_british/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 20:07:35 UTC",
    "id": "1j7gcrw",
    "link_flair_text": null,
    "media": null,
    "num_comments": 391,
    "score": 39,
    "secure_media": null,
    "selftext": "How do people in Great Britain view Northern Ireland? I wasn't born in N. Ireland but I live in N. Ireland and it just feels and seems much more alike to the Republic of Ireland than to the rest of the UK. But I wonder how people in England, Scotland and Wales view NI? Do you think of it as just akin to the city down the road, or a 'place apart'? I don't want to get too political, just wondering what people in Great Britain thought. ",
    "subreddit": "AskUK",
    "title": "How do people in Britain view Northern Ireland?",
    "upvote_ratio": 0.65,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7gcrw/how_do_people_in_britain_view_northern_ireland/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 20:03:14 UTC",
    "id": "1j7g97i",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 0,
    "secure_media": null,
    "selftext": "Hi \n\nI moved away from a friend ( both in UK) and would like to send them something/somethings for Eid.\n\n\nI would love suggestions for your favorite things. \n\nI will be adding dates, and watermelon ( inside joke)  but what else makes it special for you?\n\nBonus points for links.\n\n\nThank you in advance ",
    "subreddit": "AskUK",
    "title": "What gifts to add to an Eid gift box?",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7g97i/what_gifts_to_add_to_an_eid_gift_box/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 19:53:25 UTC",
    "id": "1j7g141",
    "link_flair_text": null,
    "media": null,
    "num_comments": 24,
    "score": 0,
    "secure_media": null,
    "selftext": "Hello everyone, i just want some advice on how to leave my current job, its my first ever job so im unsure on how to do it. Just for more information, i am self employed but work full time hours - do not get sick pay, holiday pay and no other benefits. \n\nPlease private message me, thanks. ",
    "subreddit": "AskUK",
    "title": "How do i leave my job?",
    "upvote_ratio": 0.23,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7g141/how_do_i_leave_my_job/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 19:41:47 UTC",
    "id": "1j7frba",
    "link_flair_text": null,
    "media": null,
    "num_comments": 13,
    "score": 1,
    "secure_media": null,
    "selftext": "Hi everyone,\n\nI used to have health insurance with AXA PPP, but I didn't find it particularly helpful because when it came to making a claim (the referral itself was no issue and it was helpful to have easy access to AXA's virtual GPs), they would require my GP to sign off a personal information form, confirming that I have not been to see them for these symptoms in the past. The NHS GP surgery would then take over a month to return this form. A couple of times, there were problems with the form and I had to send it back to the GP and this took months! AXA would only accept an NHS GP, too. \n\nI would like to be able to see a specialist more quickly, if I develop new symptoms. I've looked into BUPA Global, as well as Vitality. BUPA Global have said that they would not require confirmation from the GP each time, but how easy is this process in practice? I also recall seeing a consultant for something whilst on AXA, and then later getting a bill for some diagnostic tests which were not covered, despite being told that I would be covered. Bupa is quite expensive, but what are your experiences? \n\nThanks! ",
    "subreddit": "AskUK",
    "title": "What are your experiences with health insurance?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7frba/what_are_your_experiences_with_health_insurance/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 19:36:03 UTC",
    "id": "1j7fmhz",
    "link_flair_text": null,
    "media": null,
    "num_comments": 29,
    "score": 29,
    "secure_media": null,
    "selftext": "Every now and again I have a browse on Tik Tok, and my feed is full of dozens of 'amateur' Pick 'n' Mix sellers. Often selling kg bags for a 'cheap' price. Or your traditional pick n mix selection from large tubs. \n\nIs there more than meets the eye? I know we are a nation of sweet tooths, but I am dubious of the sheer amount of sweet sellers on the platform. \n\nI'm curious because surely the margins are so tight? It also seems like you have to put in so many hours to gain traction. I.e. going live for hours on end etc. \n\nMy colleague mentioned that one common type of sweet they are selling is banned for sale from typical retail companies like supermarkets, TkMaxx etc. Because they contain certain additives. He mentioned the blue style ones. And the reason there are so many sellers is that there's money to be made as there's so much of this stock out there selling cheap at wholesale level. \n\nI just find it hard to understand how SO many of these sweet sellers are sustained. When so many of them look like they're selling out of a coverted garage, and some don't bother with any hygiene procedures etc. \n\n",
    "subreddit": "AskUK",
    "title": "Pick 'n' Mix seller's on Tik Tok. Is there more than meets the eye?",
    "upvote_ratio": 0.79,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7fmhz/pick_n_mix_sellers_on_tik_tok_is_there_more_than/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 19:27:44 UTC",
    "id": "1j7ffg8",
    "link_flair_text": null,
    "media": null,
    "num_comments": 96,
    "score": 71,
    "secure_media": null,
    "selftext": "I'm 33 and all of a sudden I'm freaking out about getting older and still being single, about lacking friendships, about not doing well enough in my career, about... everything. I know that objectively I'm ok - still have time, decent health, good comfortable job but all of a sudden my anxiety went from 0 to 100.",
    "subreddit": "AskUK",
    "title": "How did you get over your mid life crisis?",
    "upvote_ratio": 0.85,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7ffg8/how_did_you_get_over_your_mid_life_crisis/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 19:19:32 UTC",
    "id": "1j7f8rb",
    "link_flair_text": null,
    "media": null,
    "num_comments": 9,
    "score": 1,
    "secure_media": null,
    "selftext": "Renting a van from Enterprise this weekend  today I notice the front passenger side is missing the hubcap. Flipsticks- how much are they going to cane me for this? I paid the extra £25/day excess thing.\n\nI don't remember hitting a kerb or anything that might have cause it to come off.\n\nShitshitshit",
    "subreddit": "AskUK",
    "title": "Lost a hub cap on a rental van, how much trouble am I in?",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7f8rb/lost_a_hub_cap_on_a_rental_van_how_much_trouble/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 19:11:22 UTC",
    "id": "1j7f1z7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 91,
    "score": 156,
    "secure_media": null,
    "selftext": "I don't know what it is that has really started affecting me lately, but the transactional nature of modern life is really starting to get to me. Viral fads, things being 'news' or attention grabbing for a day or so and then the next one comes along.\n\nShit like only fans just turning everyone online into thinking they have something to sell. Twitter/x making everyone think they have a valid voice/opinion that has to be heard. People just living their lives 100% online.\n\nI've deleted all socials aside from Reddit and it has helped, but I still get irritated by it all. I feel like the world is having this big online party and I'm the only one looking at it thinking it's a total shit show and almost dystopian.\n\nIt's went from annoying me to actually getting me a bit down and I don't know how best to deal with it",
    "subreddit": "AskUK",
    "title": "How do you stop modern life really getting you down?",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7f1z7/how_do_you_stop_modern_life_really_getting_you/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 19:05:04 UTC",
    "id": "1j7ewob",
    "link_flair_text": null,
    "media": null,
    "num_comments": 40,
    "score": 0,
    "secure_media": null,
    "selftext": "If you could tell your younger self anything that would lead into a healthier or better sexual or social life, what would it be?",
    "subreddit": "AskUK",
    "title": "What would you tell your younger self about sexuality and sociability?",
    "upvote_ratio": 0.4,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7ewob/what_would_you_tell_your_younger_self_about/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 18:14:12 UTC",
    "id": "1j7dq4b",
    "link_flair_text": null,
    "media": null,
    "num_comments": 16,
    "score": 0,
    "secure_media": null,
    "selftext": "I’m back again guys with more UK naming convention inquiries. What do you guys think, is it better to have a posh first name or a chav first name?",
    "subreddit": "AskUK",
    "title": "Is it worse to have a posh name or a chavvy name?",
    "upvote_ratio": 0.09,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7dq4b/is_it_worse_to_have_a_posh_name_or_a_chavvy_name/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 18:42:43 UTC",
    "id": "1j7ee0t",
    "link_flair_text": null,
    "media": null,
    "num_comments": 39,
    "score": 3,
    "secure_media": null,
    "selftext": "I am 23m and an ex addict of multiple vices and have been trying to find a way to help people like me that are in recovery or are at the start of recovery and trying to better there life I’ve looked up how to speak as a volunteer and help guide people but haven’t found anything I just want to do my part as an ex addict to help people that are struggling any suggestions \n\n(Also I have applied to some charities and rehabs as a volunteer but been turned down due to being an ex addict)",
    "subreddit": "AskUK",
    "title": "Why can’t I find motivation speak as an ex addict?",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7ee0t/why_cant_i_find_motivation_speak_as_an_ex_addict/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 18:29:10 UTC",
    "id": "1j7e2rp",
    "link_flair_text": null,
    "media": null,
    "num_comments": 36,
    "score": 20,
    "secure_media": null,
    "selftext": "I know that’s a bit vague, but I’m currently in digital marketing and whilst I don’t mind the work, I hate that whether I work in an office or at home, my job is just sitting in front of the same desk all day, even more so now that all client calls are over zoom. \n\nI don’t necessarily want a job where I’m travelling the world, but recently I have had the urge to just find a job where I can see a bit more of life and the world around me, even if it’s just something as mundane as driving round the town fixing people’s broken sinks. If you have a job that isn’t just sitting at a desk 40 hours a week, what do you do? ",
    "subreddit": "AskUK",
    "title": "Those who have a job where you get out and about, what do you do and do you enjoy it?",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7e2rp/those_who_have_a_job_where_you_get_out_and_about/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 18:15:55 UTC",
    "id": "1j7drl6",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 0,
    "secure_media": null,
    "selftext": "\nHey everyone,\n\nI need some advice because I have zero experience in job hunting outside my current job. I work in customer service full-time, and my schedule is 5 days on, 3 days off.I need all the extra money i can get, Instead of just chilling on my days off, I was thinking of finding a part-time or occasional job to make some extra money.\n\nThing is, I have no idea how this works. Like:\n\nDo these kinds of jobs usually come with contracts, or is it just a casual thing where they call you when needed?\n\nHow does payment work? Do they usually pay by bank transfer or give cash in hand?\n\nHow recommended is this kind of work? Is it worth it for someone in my position?\n\nHow much could I realistically expect to make from this?\n\nWhere do I even start looking? Websites, agencies, or specific types of businesses?\n\n\nI’d love something:\n✅ Flexible – where I can say yes or no depending on my schedule.\n✅ Not too complicated – since my experience is mainly customer service.\n✅ In or around London – I can commute there.\n✅ Anything that makes sense for someone in my situation.\n\nIf you have suggestions, could you also explain why you recommend them? I want to think through all the options properly.\n\nThanks in advance for any help—I really appreciate it!",
    "subreddit": "AskUK",
    "title": "Need Advice: Looking for a Part-Time or Occasional Job in London (No Clue Where to Start!)?",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7drl6/need_advice_looking_for_a_parttime_or_occasional/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 18:15:40 UTC",
    "id": "1j7drdk",
    "link_flair_text": null,
    "media": null,
    "num_comments": 8,
    "score": 0,
    "secure_media": null,
    "selftext": "So I live in Manchester but right next to one of the worst areas! But have the postcode of that area although I’m at the very edge of it and the other side is a more affluent- ish area. Affluent areas are not too far.\n\nAnyway I hate this area so much it is heavily littered. I think it might be the school right next door! Litter everywhere and it deeply upsets me.\n\nI really like my flat! It’s a spacious 2 bed and everyone that comes round is really impressed with it. Only thing is I hate the area it surrounds as I have to go into the area to do my food shopping and the gym.\n\nI now really hate living here and it is affecting me to the point I regret buying. I have only lived here for 5 months! I don’t know what to do! It is way too early to sell but wonder if I should rent it out and then I can move to an area I actually like and rent. Does that make sense?\n\nMy plan is not to stay here longer than 2 years, the last buyers made 20grand profit in a year of living here and they sold. I would like to see how much it can go up by in two years! If by 20k I would definitely think of selling it but if not I will definitely rent it. Either way I’m not living here longer than 2 years. The area is so depressing!!",
    "subreddit": "AskUK",
    "title": "Shall I regret buying my flat in this area?",
    "upvote_ratio": 0.23,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7drdk/shall_i_regret_buying_my_flat_in_this_area/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 17:48:16 UTC",
    "id": "1j7d4kb",
    "link_flair_text": null,
    "media": null,
    "num_comments": 13,
    "score": 1,
    "secure_media": null,
    "selftext": "So me and my partner have been trying to save for a house deposit (I’m sure most can relate to how difficult this is) we both work full time Monday-Friday full time in the civil service. We have some saving but nowhere near enough.\n\nI get that there is probably a load of posts asking how to create an extra income or looking to get a passive income. However these “paid survey” and “research” websites seem to get you nowhere and is not what I’m looking for.\n\nWe are both hard workers and would be more than willing to sacrifice our weekends/evenings to pick up an extra job - but because we live in quite a remote area there is no physical work we could pick up in bars etc (we’ve relentlessly looked) and finding a work from home weekend role is near impossible or usually turn out to be scams.\n\nHas anyone been in the same boat and managed to find something that works or have any suggestions that could point us in the right direction? \n\nTIA",
    "subreddit": "AskUK",
    "title": "Is looking for an additional income possible?",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/AskUK/comments/1j7d4kb/is_looking_for_an_additional_income_possible/"
  }
]