[
  {
    "author_flair_text": null,
    "created_utc": "2025-03-12 01:16:09 UTC",
    "id": "1j97bfg",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I wanted to get this off of my chest because I have nobody else to talk about this with.\n\nI'm so glad that I'm exploring my sexuality and getting more comfortable with the idea of sex. Sex itself is very scary for me, so I feel like I'm finally breaking out of my shell after having a sexual relationship with this guy online. \n\nLast night we were sexting for almost 3 hours straight. I made him cum 4 times back to back by just talking dirty, moaning over the phone, and mutually masturbating with one another. This morning when he woke up I sexted in my car with him. It felt great to just not give a flying fuck about if someone might hear me or not. Yes, I was masturbating naked in my car out in public while he was on the phone. Although, nobody saw me because the windows are tinted and it was in the driveway of my house lol. \n\nIt just feels liberating for once to just not give a flying fuck and be as dirty as you want to be. Most of my life I've been worried about being called a whore or being body shamed if I showed my naked body but thankfully he was respectful towards me and said that he enjoys seeing me naked. My whole life I've been in fear of having sex due to what other men might think about my naked body. I'm glad that I'm starting to slowly overcome those fears little by little everyday. I'm tired of being afraid and just want to be happy. ",
    "subreddit": "confessions",
    "title": "More about the guy I'm sexting",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/confessions/comments/1j97bfg/more_about_the_guy_im_sexting/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-12 01:06:22 UTC",
    "id": "1j972km",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "Hello, I am aware since this account was made just a minute ago it seems like a bait or something like that, but it truly is not. Any help is needed please\n\nI first was introduced to porn at a very young age, which made me I guess you could say very hyper-sexual and I wanted to recreate what I saw.\n\nOne day when I was in second or third grade 7/8 years old, I feel absolutely disgusting saying this, but I am just going to be straightforward and admit I decided to recreate some things I saw with my baby sister.\n\nThis was the only time I have ever done something like this. I pulled her pants down and I put my penis on her buttocks. I went to school the next day, not realizing how heinous this was, and bragged in a joking  way telling people “i had sex with my sister” This is where it may seem fake because of the absurdity and disgustingness, but it truly is not and I need help figuring out what to think about. On one hand I want to think that I was very young and did not know better especially after being introduced to this type of thing very young, but then again it was such a disgusting and unthinkable thing to do. I need other peoples opinion about this and help about what to think. Just to let you know this is the only time I have ever done something like this.  Any questions I can answer in the comments. Please help as I am genuinely losing my mind over this. Getting other peoples opinion is the only way I will not absolutely lose it. Be completely honest. Please.",
    "subreddit": "confessions",
    "title": "Disgusting secret I have never told anyone and suddenly can’t stop thinking about it",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/confessions/comments/1j972km/disgusting_secret_i_have_never_told_anyone_and/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-12 00:52:06 UTC",
    "id": "1j96ryg",
    "link_flair_text": null,
    "media": null,
    "num_comments": 9,
    "score": 2,
    "secure_media": null,
    "selftext": "I 18M still live with my dad and he has a pretty serious girlfriend and a few days ago when I was looking for something in his room I had found a dildo on her side of the room. I couldn’t stop thinking about it and today while they were both gone I took the dildo to my room and I started to use it in various ways but my favorite was when I was blowing it  I then started blowing it and eventually made my self cum. I think im addicted to blowing things now and im not ashamed at all. ",
    "subreddit": "confessions",
    "title": "I used my dads girlfriends dildo",
    "upvote_ratio": 0.56,
    "url": "https://www.reddit.com/r/confessions/comments/1j96ryg/i_used_my_dads_girlfriends_dildo/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-12 00:36:25 UTC",
    "id": "1j96g22",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "i was younger and on whisper when i shouldn't have been. i really wanted to know alllll about different kinks and everything about the bdsm world. ive only ever told part of this story before... too ashamed to tell all of it but here it goes.\n\n\ni ofen would make posts encouraging people to \"tell me their secrets\" and stuff alike. one older guy, mid 30s, living with his mom, told me he liked watching piss play pornagraphy. i asked him all about this. asked him what he likes about it and why and what he feels about it. how long had he liked it ect ect.\n\n\ni felt like an interviewer. for science and curiosity. i wasn't sexually invested at all, it wasn't like that. i just purely was incredibly curious.\n\n\ntwo weeks of talking and he says hey, we should both piss ourselves. i didnt feel up to it. but i encouraged him to if he wanted. but time goes by and he asks again and encourages me. i have some weird piss dreams and he started to inspire my own curiosity. i wasnt necessarily sexually invested here but curious nonetheless.\n\n\nwe plan it out. i wait till my parents are asleep and its the middle of the night. its summer. i go outside in a t-shirt, shorts, and underwear. and i text him and hes ready too tho i don't remember his situation and location.\n\n\nand then i try it. i piss myself. and the very beginning was interesting but quickly felt weird and awkward mixed with shame and disgust. i was just a girl who pissed themselves on their lawn in the middle of the night. it was more than i expected. i was gross, so i penguin walked with my legs together back to the door, stripped my shorts off and ran inside and into my bathroom and quickly took a shower.\n\n\ni didnt message him for a week or so because i felt weird. but then curiosity took over about his experience and i asked him how it went and sorry i dissapeared. he then told me how exciting and wonderful his experience was. it was everything he wanted it to be and more. so much more.\n\n\ni was like oh cool man and battled curiosity while feeling like i wanted to close this chapter. at this point he trusted me more and volunteered more information. telling me how he started pissing his pants and just throwing that in his laundry hamper.\n\n\nthis progressed and he brought up the curiosity of shitting himself. this, i was quickly disinterested in. but i didn't want to shame him, i felt bad and confused. i had a self rule of no kink shaming so people felt they could talk to me.\n\n\nand so he did it. he shit himself. and guess what? he loved it.\n\n\ni dont message him for a while, maybe a month. and then i do and ask how he's been. he tells me he came home from work to find diapers on his bed. his mom bought them. his mom does his laundry. his mom found his piss and shit drawers... and without speaking to him.. gave him some adult diapers.\n\n\nhe was estatic. it was his new thing. his favorite thing. at this point, i congratulate him and fucking dissapear lmao.\n\n\ni think about this from time to time. would that man have discovered this without me? how long would that have taken? how much of a role did i play? where is he at now? does he still live with his mom? does he find love..? who knows.",
    "subreddit": "confessions",
    "title": "i accidentally opened up someones piss and skat fetish",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/confessions/comments/1j96g22/i_accidentally_opened_up_someones_piss_and_skat/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-12 00:34:28 UTC",
    "id": "1j96ejp",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 2,
    "secure_media": null,
    "selftext": "So, it's a long story. I was in a long-distance online relationship, and we broke up about two months ago. When I was with my ex, he was never really sexual with me and barely paid attention to me. Anyway, we broke up, and since then, I've been feeling sexually frustrated.\n\nAbout a week ago, I met another guy online. Initially, he reached out to support me after seeing my vent post, but after a few days of talking, things escalated, and we ended up doing a lot of sexting and phone call sex. He would masturbate on call with me. While we were masturbating together, we would talk dirty and moan a lot on the phone. Since then, we haven't stopped sexting each other. Last night, we sexted for about 2.5 to 3 hours, which was very liberating, honestly. I've never been sexually intimate with anyone like this before, so I'm glad I met him.\n\nHowever, there's an issue: he keeps feeling bad about my situation and keeps offering to help me out financially. I keep saying no to him because, firstly, I don't want to feel like a prostitute, and secondly, I don't want him to think that I'm using him for money. I've told him that I appreciate the thought, but I don't feel comfortable accepting his money. He understood, yet there's something about him wanting to give me money that rubs me the wrong way.\n\nIn addition to that, he tells me that I shouldn't tell him if I'm seeing other men because that would make him jealous. We aren't in a romantic relationship, but he's already getting possessive, even though we're just in a friends-with-benefits situation. He also told me that he would get envious if he found out that I lost my virginity to anyone besides him, yet he claims to understand. Honestly, I don't know how to feel about this.\n\nI haven't been this sexually intimate with anyone before due to my insecurities about my body. Also, I just don't know how to talk to guys in real life. I love talking to him and being myself around him while we sext. However, I can already see the red flags in him. I'm going to keep him at arm's length and not date him romantically since he comes off as a red flag. I don't know how to feel about this situation, and I just wanted to get this off my chest.",
    "subreddit": "confessions",
    "title": "I've been having a lot of phone sex with a stranger I just met and I don't regret it",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/confessions/comments/1j96ejp/ive_been_having_a_lot_of_phone_sex_with_a/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-12 00:26:47 UTC",
    "id": "1j968lv",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 8,
    "secure_media": null,
    "selftext": "For context...in South Africa we start school after we turn 6...before then your in \"preschool\". \n\nSo I kicked the fuckers legs out with a friend. He was an obnoxious brat. But my mom found out and make me invite him to my 6th birthday party to say sorry....but we had a jumping castle he was wasn't allowed on because of his rubbery gangly prosthetics. ",
    "subreddit": "confessions",
    "title": "I kicked out Oscar Pristorious legs when we were in preschool",
    "upvote_ratio": 0.83,
    "url": "https://www.reddit.com/r/confessions/comments/1j968lv/i_kicked_out_oscar_pristorious_legs_when_we_were/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-12 00:16:11 UTC",
    "id": "1j960bk",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "So, there I was, living out my Disney princess fantasy, ready to rescue a tiny, helpless creature in distress. The mouse was stuck on a glue pad, screaming its little lungs out like it was auditioning for a horror movie. Naturally, I sprang into action, armed with the most heroic tool I could find: vegetable oil. (Move over, Captain America—my shield is a bottle of canola.)\n\nI gently poured the oil, whispering sweet nothings like, “Hold on, little buddy, I’ve got you.” The mouse looked up at me with its beady eyes, and for a moment, I thought I saw gratitude. Spoiler alert: I was wrong.\n\nAs soon as its tiny feet were free, the mouse turned into a furry little demon. It lunged at my finger like it was the last piece of cheese on Earth and chomped down like it was trying to set a world record for “Longest Mouse Bite.” Fifteen seconds. FIFTEEN SECONDS. Do you know how long that feels when a rodent has a personal vendetta against your fingertip? It’s basically a lifetime.\n\nI’m standing there, bleeding like I just lost a sword fight, while this ungrateful little gremlin is hanging off my finger like it’s a carnival ride. Finally, it let go, and I released it outside, where it scampered off into the sunset without so much as a “thank you” or a “sorry for the attempted murder.”\n\nNow, I’m left with a bandaged finger, a bruised ego, and the haunting realization that I’ve been outsmarted by a creature with a brain the size of a pea. Moral of the story? No good deed goes unpunished, especially when the recipient weighs less than a slice of bread and has the temperament of a tiny, furry serial killer.\n\nThis is kind of what it looked like, except I got bitten.\n\n[https://www.youtube.com/shorts/5FucgCMswcA](https://www.youtube.com/shorts/5FucgCMswcA)  \n  \n",
    "subreddit": "confessions",
    "title": "Caught a mouse using a glue trap and it bit my finger",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/confessions/comments/1j960bk/caught_a_mouse_using_a_glue_trap_and_it_bit_my/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-12 00:15:19 UTC",
    "id": "1j95zlt",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 2,
    "secure_media": null,
    "selftext": "Well here goes nothing. I always seem to do the wrong things, even if I know they are wrong. And I don’t just mean mistakes I mean like I’m an asshole. For example, I once was able to turn my whole friend group in high school against each other by spreading lies about one person to someone else and watched it spread. And the worst part to me is the fact I was entertained I enjoyed my friends sometimes crying over the fact they lost everyone or felt betrayed and I was amused granted this was a long time ago but the point stands. I tend to lie a lot even if it seemed pointless like I’ve made up things I did both bad and good for no reason other than I could and I got this rush and thrill from lying to someone. Now granted I know someone is reading this (i hope) and thinking I’m not a good person and I agree I’m not. It’s a game to me it’s like I know my actions have consequences but really fail to care/see it’s there I know but I don’t you feel me? I hope so! I’ve considered therapy but that means I have to admit somethings wrong with me and I’m not quite ready for that (consider this me trying) have any questions feel free to ask or comment I got tons of stories I could tell! (I’m writing this after reading what I just wrote and I should say if this doesn’t meet the rule of enough details comment asking for more or sum I can always provide more)",
    "subreddit": "confessions",
    "title": "I’m genuinely not a good person but I don’t feel bad",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/confessions/comments/1j95zlt/im_genuinely_not_a_good_person_but_i_dont_feel_bad/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-12 00:12:36 UTC",
    "id": "1j95xm9",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 34,
    "secure_media": null,
    "selftext": "A lot of people assume I’m really good with money because I have a decent savings account, no major debts, and never seem too stressed about finances. The truth? I’m not some financial genius I’ve just had a few really lucky breaks, and it makes me feel like a bit of a fraud when people ask for advice.\n\n\n\nA few years ago, I got my first unexpected financial windfall. Nothing life-changing, but enough to put me in a comfortable spot. Instead of blowing it, I played it safe I put some into savings, invested a bit, and kept living as if nothing had changed. Since then, I’ve had a couple more lucky moments, and now I’m in a position where I don’t have to constantly worry about money. But when people ask how I manage my finances so well, I never know what to say. The real answer is, “I got lucky.”\n\n\n\nI don’t go around bragging about it, but I also feel weird letting people think I have some kind of special financial discipline when really, I just happened to be in the right place at the right time. At the same time, I know how frustrating it is to hear, “Just be lucky” as financial advice, so I usually just nod along when people assume I’ve been super strategic. I sometimes wonder if I should be more upfront about it, or if that would just make things awkward.",
    "subreddit": "confessions",
    "title": "People think I’m smart with money, but I’m actually just lucky",
    "upvote_ratio": 0.9,
    "url": "https://www.reddit.com/r/confessions/comments/1j95xm9/people_think_im_smart_with_money_but_im_actually/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-12 00:09:18 UTC",
    "id": "1j95v3f",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "Why….. why do I want this or think about this when that’s so morally wrong or impossible ? Confession\n\nSometimes, \nSometimes….\nI just wish I could either give birth or donate my eggs to someone from a specific country. \nI don’t want to be a mother : no. At least not yet. \nDonating eggs : seems horribly expensive and painful.\nGiving birth too. But abandoning a baby holy moly is that even WORSE. \nI just want to have a descendant somewhere, over there.\nIdk why, because it’s morally wrong. Maybe not the egg donation but wanting it to be in a specific country is merely just impossible, especially since it’s just horrifyingly expensive and I can’t be too old. I’m 26 and I’m just… maybe I’m wrong and hallucinating. Idk.  Maybe because I want a descendant ? Maybe because I can’t go to this country because it’s inaccessible ? I’m afraid of saying where it is here, I will be judged. I might read this and tell myself how wrong I was, that’s for sure. I don’t want to be pregnant, I just kind of have this urge to have a descendant somewhere specific and I can’t explain why, it’s just…. \nMaybe spectating my genes but that’s not morally right to say this. So idk. Maybe I do want children. Maybe I just want to be with someone from this country and have a child with this person even if this country isn’t near as close to me ? I clearly have an obsession. Idk why. I’m not right. But having a child = too difficult for me, my life = traumas. \n\n:( I’m bad for wanting this. I somehow want to hurt myself for this because it’s impossible and not right. \nMe, 26 years old, 2025\n",
    "subreddit": "confessions",
    "title": "Idk why I think about this. Confession",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/confessions/comments/1j95v3f/idk_why_i_think_about_this_confession/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 23:34:00 UTC",
    "id": "1j952ux",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 1,
    "secure_media": null,
    "selftext": "I notice when I’m lonely, listening to Sade seems to feel helpful\n\nAnyone agree",
    "subreddit": "confessions",
    "title": "Safe",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/confessions/comments/1j952ux/safe/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 23:30:05 UTC",
    "id": "1j94zqe",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 13,
    "secure_media": null,
    "selftext": "I use to play rpg and spent almost all time there. I didn’t have to get a job. That was years ago. I wish I could live in a video game again because there’s almost no hope I’ll be found by a man to marry, or get a friend. I’m over thirty and haven’t had a friend in over a decade. I’m lonely. All I have is my parent and imagine how lonely you feel when your parent is condescending and arrogant… you feel more alone. I’m tired of pretending , shutting up , and telling myself this is a good enough interaction. I’m lonely and I have to admit it and accept it. I guess it will never change as far as I can see. \n\nUnfortunately I can’t go play a video game anymore because I don’t have a good computer for such a game anymore and I also have to work and that is gonna take most of my energy. \n\nIdk how so many people have jobs and also video game on the side. ",
    "subreddit": "confessions",
    "title": "I miss living in a video game",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/confessions/comments/1j94zqe/i_miss_living_in_a_video_game/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 23:28:20 UTC",
    "id": "1j94ydo",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "A man liked me on hinge 4 months ago, and I decided to give him a chance in spite of him not matching my usual type. I liked his profile back.\n\nWe talked for a couple of months during the holidays, but because he lives in a different state, we ended up never getting to meet in person. He followed me on instagram and we basically interacted every now and then (though he left me on read any time I tried to strike conversation).\n\nHe came across as such a sweetheart, and I'm not sure why, his smile and the way he seemed to interact with his loved ones really stroke me as someone special. It's like I've been hypnotized ever since I met him.\n\nI decided to reach out anonymously, because any time I tried to send him a meme and start conversation, he'd just like it or leave me on read... And I'm REALLY shy, so the idea of coming forward as myself and him finding me too ugly or rejecting me for being too forward scared me...\n\nI wanted to message anonymously to see if he was as sweet as he seemed to be, or if I could find out more about his personality--to either come forward as myself and declare my intentions, or just leave it be.\n\nWell, he was freaked out and worried I was a stalker... I know it's a valid concern, especially given that I could only find his work email online... :(  \nHe still talked to me under his throwaway email for a few days, and I realized we have more in common than I could have ever anticipated. However, I realized he thought I was his ex that he still likes to this day after a while...\n\nEvery night we spoke anonymously, we would go to bed with him saying how special he felt that someone liked him this way, to the point of messaging anonymously. Then, in the morning, he'd wake up freaked out and delete me (only to re-add later on)...\n\nIn the end, I ended up calling him and coming forward. We had a really lovely conversation on the phone that lasted about 3 hours, and he wanted me to fly to see him, and that we'd make it work because he felt so flattered.\n\nThe next morning, he blocked me everywhere and said it wouldn't work. We haven't spoken ever since.\n\nI think I freaked him out. He probably thinks I'm insane, and I worry that I came across as such.\n\nHe is a lawyer and was really worried this was some type of scam. Though, he did seem to enjoy when I praised him and I feel a little used given some of the things we talked about.\n\nIt's been 3 days, and I feel horrible. I still like him, and I don't even know why I like him so much...\n\nI just have this feeling he thought I was prettier anonymously than I turned out to be. If I was prettier, he wouldn't have blocked me...\n\nHe also told me he had some complicated exes that he had to call the police on, so I hit a soft/difficult spot by reaching out anonymously...\n\nI keep thinking: what if I had just come forward without the anonymous email? What if I had just flown to his city, pretended as if it was a coincidence and texted him \"hi! I happen to be in your city :) maybe we should grab dinner and catch up?\"...\n\nI keep thinking about reaching out again, but then I know I'd be really a creep as he told me not to reach out again. I wonder if he's thinking about reaching out to me, or if I really meant nothing...\n\nI'm a fool.",
    "subreddit": "confessions",
    "title": "I created an anonymous email to declare myself to a man I barely know, but fell in love with online 4 months ago",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/confessions/comments/1j94ydo/i_created_an_anonymous_email_to_declare_myself_to/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 23:26:37 UTC",
    "id": "1j94wwd",
    "link_flair_text": null,
    "media": null,
    "num_comments": 40,
    "score": 24,
    "secure_media": null,
    "selftext": "When I was 13 I let my dog lick my private parts a few times. It's been over 4 years and I still feel the guilt all the time especially since one of my dogs is dead now. I don't know why I thought that was okay and not too long after the last time I did it I realized how gross it was and that summer I sat in regret everyday and hated myself. I've confessed this before on reddit but had people who were into beastiality trying to encourage me to do it again so I ended up deleting the post. I hope this time is a more positive outcome.",
    "subreddit": "confessions",
    "title": "I did something horrible when I was 13",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/confessions/comments/1j94wwd/i_did_something_horrible_when_i_was_13/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 23:05:59 UTC",
    "id": "1j94ftl",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 4,
    "secure_media": null,
    "selftext": "I was walking with him he invited me inside I sat down he asked me to stay a while so I did he was sitting next to me he put his arm around me i thought he was just being nice. He cuddled me we were watching hells kitchen he pulled me closer and starting squeezing my thigh and i thought nothing of it. It wasn't until he started squeezing my ass I realized he wasnt just being nice I was too scared to speak up. he started touching my vagina after he did that he starting touching my breasts. Then he unzipped my dress and forced me to strip he told me to lay on the couch after I stripped. After I layed on his couch he started eating me out I tried to push away but i couldn't because he was holding my hips in place after he finished he got up but still held me in   place and then he inserted himself inside me I was scared to speak up or tell him to stop because he was much stronger then me.",
    "subreddit": "confessions",
    "title": "How it happened",
    "upvote_ratio": 0.83,
    "url": "https://www.reddit.com/r/confessions/comments/1j94ftl/how_it_happened/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 23:00:52 UTC",
    "id": "1j94blg",
    "link_flair_text": null,
    "media": null,
    "num_comments": 8,
    "score": 8,
    "secure_media": null,
    "selftext": "This has been going on for years and I just need to get it off my chest. I’m 24 and I’m the oldest of five kids, parents are still married and all five kids are from both parents. I’ve always been a bit different, but overall I think I’m a normal person. My entire family treats me like the weird kid you tolerate until their mom comes and picks them up from the sleepover. \n\nI used to feel left out as a kid, and looking back I can see it’s because I had very different interests from my siblings and I was very oblivious to social cues. I was (and still kind of am) super nerdy, loved LEGOs (still do), and other kind of geeky interests. I always valued school really highly and my siblings hated school. I was a really outgoing kid and loved making people laugh, and I always seemed to have an easier time with people outside my family. \n\nI went out of state for college and became much better socialized. I grew a lot while I was there and I made a ton of friends through my degree program and my church. I graduated with honors and a good GPA and immediately got a job in my field. I stayed in the same state and met my fiancé, and we’re getting married this year. \n\nAll of this is to say, I love my life. I like who I am. I have good friends, a good job, and a very loving fiancé who I am so excited to marry. \n\nAnd as soon as I’m with my family, the only thing I can think about it how they don’t like me. \n\nThey constantly make jokes at my expense. They exclude me from everything. My siblings all take pictures together, go and do things together, and hang out together, and when I’m home or we’re all on vacation, I am not included in any of it. I have to fight to be included in things, which is the only reason that pictures of me and my siblings together exist. My parents make fun of what I wear. My siblings make fun of me for getting engaged quickly or for going to college (none of them have gone, which is fine, but obviously it helped me get a job, so idk what their problem is). Every single time I visit them I immediately want to leave. \n\nA few years ago when I officially moved out, my mom told me I was ruining her marriage (she didn’t want me to leave but dad supported me). When my sister did it she was “being independent.” When I was thinking about “sewage slide” in high school and early college she told me it was my fault. When my other sister was dealing with the same thing they paid for her therapy for three years. And now when I try to have conversations with my mom, she doesn’t listen or she starts conversations with other people while I’m mid sentence. I call her regularly to be a good daughter, and she doesn’t care to talk to me and degrades everything I say. My fiancé bought me a super cool LEGO set for Christmas (I almost never got LEGOs as a kid, even though it was the only thing I would ask for at Christmas or for my birthday), and my mom’s first response was, “Why doesn’t he buy you a down payment on a house?”\n\nI can never get a word in, I can never land a joke, and my siblings make it perfectly clear that they have more fun without me. It’s eating me up and I can’t deal with it anymore. I never want to visit them by myself again. ",
    "subreddit": "confessions",
    "title": "My entire family doesn’t like me and it is eating me up inside",
    "upvote_ratio": 0.84,
    "url": "https://www.reddit.com/r/confessions/comments/1j94blg/my_entire_family_doesnt_like_me_and_it_is_eating/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 22:46:49 UTC",
    "id": "1j9402n",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "",
    "subreddit": "confessions",
    "title": "What picture do you want me to see",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/confessions/comments/1j9402n/what_picture_do_you_want_me_to_see/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 22:39:44 UTC",
    "id": "1j93ue6",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "Note: I don't mean for this to be sexual or anything like that. \nAwhile back when I was single I had sex with my ex's best friend and it wasn't a great experience but ever since then my brain makes me relive certain moments that I enjoyed. \nAlmost like intrusive thoughts, I don't want to have them but I can't help it. I even have to yell their name just to make me finish when I'm masturbating. \nI feel terrible. ",
    "subreddit": "confessions",
    "title": "I feel horrible.",
    "upvote_ratio": 0.66,
    "url": "https://www.reddit.com/r/confessions/comments/1j93ue6/i_feel_horrible/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 22:36:20 UTC",
    "id": "1j93rpe",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 2,
    "secure_media": null,
    "selftext": "I'm 16 and I got molested by a 22 year old gas station worker and I don't know who to tell about it I'm scared of him and I don't know what he's going to do to me if I tell anyone.",
    "subreddit": "confessions",
    "title": "This happened 3 days ago...",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/confessions/comments/1j93rpe/this_happened_3_days_ago/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 22:26:24 UTC",
    "id": "1j93jj1",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "For three years I have lived a hard time. My mother was diagnosed with dementia and both my brother and I took care of her. With everything that entails, doctors, assistance, and a lot of suffering. That process was very painful, I had to see less of my friends to be able to take care of her on the one hand, and on the other hand I didn't feel like going out as much, and having much of a social life. A few months have passed, she passed away, and I am resuming life again, with all that that entails, since it was partially paused. I have worked a lot on grief. I attend therapy to accept it and overcome it. But lately, sometimes at social gatherings, parties, dinners with friends, I need to go to the bathroom to just be alone. Be calm for a few minutes and then leave as if nothing had happened. It's like my head, after socializing for a while, needs a break. I don't know if it's social anxiety, low self-esteem or what... the fact is that I will work on it with my psychologist but I would like to know if something similar has ever happened to you or what you think about it. Thank you so much ",
    "subreddit": "confessions",
    "title": "Social anxiety?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/confessions/comments/1j93jj1/social_anxiety/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 22:24:02 UTC",
    "id": "1j93hl2",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 1,
    "secure_media": null,
    "selftext": "I feel so fucking disgusting for the thoughts I had and the things I did, and i don't know if I am overreacting and it's not as bad as I think or if I am just a terrible person that deserves the worst.",
    "subreddit": "confessions",
    "title": "I cant tell if I am a shit person for things I have done but I am way to scared to talk about it and find out.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/confessions/comments/1j93hl2/i_cant_tell_if_i_am_a_shit_person_for_things_i/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 22:08:51 UTC",
    "id": "1j9357o",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I am sure you all know the saying that thousands of different versions of yourself exist to other people. And it’s true, but for me I truly live or lived a double life. I am a good muslim boy at home who does chores and is loved by my parents. At school I am known as someone who, has lots of friends, is pretty popular, gets good grades, talks to girls, has hobbies, wears good outfits and do my skincare and hair. And there is no reasonable explanation for how I treat myself in private. \n\nBut for the past year or more I cant recognize myself in the mirror. I have a porn addiction that i have been trying to quit for 3-4 years. This means using once up to three times a day. But sometimes it gets really bad and i start seeking more. That means trying sexting online, live cams, discord servers and other disgusting bullshit. This has ruined the way i see myself and honestly ruined my self respect.\n\n And before all you gurus come at me with advice like read the easypeasy method, watch these youtube videos punish yourself do this, do that. I have tried everything and i am not asking for advice, i know that i could quit if i wanted to but quitting is more about self image than anything else and how you change the way you see yourself is not simple and sometimes you don’t want to let yourself change it. I have at times gone weeks without using and crushing my goals only to think “if i really quit right now i dont see myself NEVER doing it again and the feeling when i relapse after however long will only be worse from here on” and so i do it and i cant convince myself otherwise. And it has affected me in so many ways people cant see.\n\nFor instance, i fell victim to sextortion, luckily nothing happened and i was let off the hook but it damaged me psychologically to an extent i still feel today, like a wake up call. Furthermore this addiction has damaged my sexual interest, my brain and more importantly my faith and some of the best years of my life. \n\nAnd everyday i ask myself how i would let me do this to myself but its always the same conclusion. I feel like an addict, and i don’t trust myself to stay consistent. And its not like i can reach out for help cause that would shatter this image that everyone has of me and thats all i have right now.\n\nIf anyone even cares to read this far, say what you want in the comments whether it be sympathy or advice i dont care..",
    "subreddit": "confessions",
    "title": "I cant define myself",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/confessions/comments/1j9357o/i_cant_define_myself/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 22:08:50 UTC",
    "id": "1j9356y",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 0,
    "secure_media": null,
    "selftext": "Recently married to an amazing and exotic lady. Have the urge to see cocks or cum on her, is that weird? I’ve seen a few tri butes before but would love to see some on her. Pics if curious…",
    "subreddit": "confessions",
    "title": "Recently married…",
    "upvote_ratio": 0.13,
    "url": "https://www.reddit.com/r/confessions/comments/1j9356y/recently_married/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 22:01:50 UTC",
    "id": "1j92z90",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 17,
    "secure_media": null,
    "selftext": "i feel so bad about it, i'm so scared of spiders and there was a big one crawling on my wall so i took a jar and put it over the spider and when it went inside the jar i put it on my table like upside down and went to get a sheet of paper to close the jar and take it outside but the spider inside was trying to escape and when i moved the jar it literally ripped some of it's legs off and the spider went crazy twitching and shit i'm crying it was so GROSS and sad 😭🪦 ",
    "subreddit": "confessions",
    "title": "i did something horrible 😓",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/confessions/comments/1j92z90/i_did_something_horrible/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 21:12:08 UTC",
    "id": "1j91sly",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 6,
    "secure_media": null,
    "selftext": "This happened when I was around 7 or 8, and my neighbor’s kid was around the same age (maybe a year younger). We used to be friends, but I feel too guilty to call her my friend since I took advantage of her.\n\nFor context, I am from a Muslim-majority country where homosexuality is still illegal. I am Muslim, and my neighbor’s kid was Hindu. None of our families were strictly religious, but homosexuality is still very taboo.\n\nSince we were around the same age, we used to play together a lot. I don’t remember exactly when it started, but I recall watching movies with my parents where the male and female leads would date and kiss, and I wanted to try that too. So one day, I convinced my neighbor’s kid to play house with me and roleplay as husband and wife. I didn’t like her or have a crush on her, but I wanted to try dating and having a boyfriend like in the movies. We weren't allowed to be around boys so that's why I was roleplaying with her. I convinced her to kiss and make out with me since we were pretending to be husband and wife. We played like this a lot.\n\nWe didn’t always play house. We also played other normal games that kids play, like hide and seek and board games. I wasn’t specifically targeting her to take advantage of her, but now that I’m older and can reflect on my actions, I see that what I did was awful. This wasn’t a one-time occasion. We frequently played like this until I moved to another country and lost touch.\n\nI haven’t been able to go back to my home country yet so I don't know how she is doing. I’m scared to see her again because of what I did. I want to apologize, but I’m also terrified that if I do, this might bring back bad memories for her or this incident could reach our family members, and I don’t know what the consequences would be. It makes me feel even guiltier that I’m afraid of the consequences, even though they would be a result of my actions.\n\nI don’t know if she would even want an apology. Maybe she doesn't recall any of this and it’s better to leave things as they are. I remember that she called my mom a few years ago and asked to speak with me after I moved, but I didn’t talk to her because I wasn’t sure if she would bring this up or not. Actually, I don’t even know if this is as big of a deal as I’m making it out to be, but I feel so horrible about it that I feel like I need to be punished.\n\nI’m 18 now, but back then, I didn’t know anything about sexuality. Since it’s a conservative country, these topics weren’t really discussed. I also suppressed this memory until now, so I don’t remember the details anymore or how she felt about us playing like this.",
    "subreddit": "confessions",
    "title": "I took advantage of my neighbor's kid",
    "upvote_ratio": 0.8,
    "url": "https://www.reddit.com/r/confessions/comments/1j91sly/i_took_advantage_of_my_neighbors_kid/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 21:07:23 UTC",
    "id": "1j91oif",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 0,
    "secure_media": null,
    "selftext": "when I was 20 on 2 seperate occasions I was approched by girls 16-17 at the time and they asked for my number and I gave it to them. I never done anything sexually with these girl's or said anything sexually. One of the girls never texted me and the other we prolly texted eachother for a day or 2 and things just fizzled out.Never even went on a date or anything like that. I eventually ended up dating girl who was more around my age soon after. I think she was year older then me. This was 9 years ago. For the longest never really gave it a second thought because nothing happened, but right now I feel guilty. I cant believe I would even entertained for a second, because I would never do anything like that now. And why are these thoughts popping up after being in the back of my mind for so long. I feel horrible. Do you guys think I'm a predator or bad person?",
    "subreddit": "confessions",
    "title": "I made a horrible decision that I now regret when I was in my early 20's",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/confessions/comments/1j91oif/i_made_a_horrible_decision_that_i_now_regret_when/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 21:06:36 UTC",
    "id": "1j91ntj",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I’m 24 about to be 25 this Friday and I live underneath my parents. I have no job and severe work anxiety feeling that I will be bullied during work or treated unfairly. It’s bad to the point I self sabotage when I’m really close to starting and feel guilty since my family needs my assistance with money. I’m in debt as well and just don’t know what to do about it.\n \nI feel worthless and I don’t want to disappoint anyone. I want to do better but the job that accept me of mentally draining and gets me freezing up. I don’t know where to look that will accept me and I won’t get scared and back out.",
    "subreddit": "confessions",
    "title": "A loser",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/confessions/comments/1j91ntj/a_loser/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 20:49:46 UTC",
    "id": "1j918xu",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 2,
    "secure_media": null,
    "selftext": "i f(15) am ready to kill myself, and i don't mean this as in the edgy way but like if things don't start going my way or if i get a little bit of good in my life i think ill desert home and kill myself out of state or maybe something like that i dont know.\n\nnothing is working for me, i lose every competition i compete it, i suck at my sport, my grades are wavering, people are relentless. I'm putting hours everyday studying all i do study and work\n\ni can't see myself getting into my dream college either but that's all i what\n\nmy parents are scorning me for being upset and sad about anything and i genuinely feel like im on edge\n\nive been writing in a google doc and i plan to write in it until may like a long letter\n\ni can't see anymore of a reason to live besides making sure my special needs sister has someone there for her\n\napologies for the pretty shit rant",
    "subreddit": "confessions",
    "title": "i’m ready to go",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/confessions/comments/1j918xu/im_ready_to_go/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 20:26:31 UTC",
    "id": "1j90opg",
    "link_flair_text": null,
    "media": null,
    "num_comments": 20,
    "score": 25,
    "secure_media": null,
    "selftext": "I am now a 14 yr girl. So basically my parents got divorced and every other weekend me and my siblings would spend the nights at my dad‘s house every single night before bed mind you at the time I was around eight, he would make me ride him and he would make out with me and keep like dirty talking me and I didn’t know that it was bad at the time because of how young I was. This is horrible to talk about and I’m embarrassed to confess it. I do not see my dad anymore because of other non-related issues. I don’t know if I should speak up about it, there was no proof of anything so it could be that I’m just lying. he is now married with a wife and two step kids. What do you guys think I should do?\n",
    "subreddit": "confessions",
    "title": "Sexually assaulted by my dad at 8-9 years old. (I am now 14F)",
    "upvote_ratio": 0.77,
    "url": "https://www.reddit.com/r/confessions/comments/1j90opg/sexually_assaulted_by_my_dad_at_89_years_old_i_am/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 20:23:34 UTC",
    "id": "1j90m6i",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 12,
    "secure_media": null,
    "selftext": " I (19f) have been living in the same building since i was around 4-5. About 2-3 years ago my parents split up and my father moved out and was gone for good, that was also around the time that my downstairs neighbor moved in with his two sons.   \n Over the time my attraction for older men grew and i seemed to really take a liking to this man. Me and his sons (17 and 23) get along pretty well and talk a lot when we can. They told me about how their mom cheated and stuff and how alone their father felt.  \nSoon enough my mother is gonna host a dinner party and she's gonna invite them as well as their father too. I'm not sure enough of his age but i do wanna get to him a bit more.\n\n(I'm sorry for any miss spelling &amp; I'm waiting ideas on how i should go about this)  \n",
    "subreddit": "confessions",
    "title": "My downstairs neighbor",
    "upvote_ratio": 0.88,
    "url": "https://www.reddit.com/r/confessions/comments/1j90m6i/my_downstairs_neighbor/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 20:18:29 UTC",
    "id": "1j90hws",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "Hey All,\n\n30 Desi husband in the Central US in an okayish marriage going on. I am going for someone who is going through the same to mutual vent with each other for mostly emotional/mental needs basically on everything.\n\nAll I need is a pure connection with someone to talk to, no toxicity , no judgement and no expectations, basically an NSA relation.\n\nAnyone going through the same patch maybe can connect , others are welcome too. People who feel guilty or regret after shagging off, please stay away from DMs\n\nPS: Sex is not the agenda here :)",
    "subreddit": "confessions",
    "title": "Anyone up for genuine long term connection for discussing daily life rant ?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/confessions/comments/1j90hws/anyone_up_for_genuine_long_term_connection_for/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 20:10:31 UTC",
    "id": "1j90b3e",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 2,
    "secure_media": null,
    "selftext": "\nHere’s a long story I’ve never told a soul. \n\nWhen I was 21, I was a junior in college. Not your typical college guy. I was shy, reserved, didn’t drink, didn’t smoke, never slept around. I had a girlfriend at the time I really liked. Typical college story though.. she met another guy on the tennis team and dropped me for him. I was devastated. \n\nI went with a friend on a trip, out of feeling so down from my breakup. I did something I normally didn’t do and went to a bar, where a lady older than me randomly came up to me very friendly and said that I looked like a “lost puppy.” She was 28 and married. She asked for my snap, then began to message me and nothing happened on our trip between she and I. But her messaging turned into about 10 months of a sexual affair. We lived far apart, so we’d just find random places. \n\nThis lady told me I was her 3rd sexual encounter outside of her marriage. She told me she had cheated at a wedding a couple years prior and on another vacation years prior. \n\nShe told me she was a “serial cheater” and had cheated on every single man she had ever been with, from high school until the present then. \n\nShe told me how she had so much nostalgia for some dude she dated in college. She said she’d wait for her husband to get drunk and she’d go message this old college flame, while her husband was passed out drunk. \n\nI was so innocent then and idk, but I think her “bad nature” drew me in.. sickening to think of now\n\nSince then, she moved even further away, left her husband and from my peeping of her socials, has been in at least one serious relationship since her marriage dissolved. \n\nAll this to say.. I have never forgiven myself. I have no clue how I went from such a good guy, to doing such a heinous and evil act. I’ve never done anything of the sort since nor will I ever. Did we get caught? Nope, but I think that made it even worse because now it’s been YEARS, but every day I think of how awful I am and how much I just wish I could go back in time and talk to that 21 year old kid and tell him how things are.. How wrong this is, how he’ll regret is badly when he gets older.. Why is he ruining his innocence and hurting a sacred covenant? These are thoughts I still live with. \n\nI’ve been in therapy since and not to make this religious, but I’ve prayed so many times for forgiveness because I feel filthy and awful and unworthy of anything now. I’ve done volunteer work and am way less judgmental of people now, because I realize we all have something in our past we aren’t proud of. I’ve tried redeeming myself, but still feel awful. \n\nA little while back, this particular girl tracked me down and messaged me… I replied in a very matter of fact way, didn’t tell her a thing about my current whereabouts. I told her I didn’t have any desire to ever communicate with her again, I told her I forgave her and hope she forgave me, because we enabled one another to do an awful thing. She hasn’t tried reaching out since. I’d be happy if I don’t hear her name until I read her obituary.. Hopefully that’s a long time away, because I don’t wish her any harm, I just want to bury that behind me for good. \n\nFWIW, karma did get me good (which I deserved), after college graduation I had a very brief stint in the Marines and was dropped during induction for medical. Then came back to my home state and met a girl I was crazy over.. She told me a little bit into our relationship she had been cheating with her ex the entire time behind my back. I was devastated.. But, I knew it was karma and i deserved it. \n\nI’ve never told a soul of what I did (other than my therapist) nor do I plan to. It’s too shameful and my guilt way too high. I hope to take it to the grave. I just hope to live a better life and maybe someday I can meet someone good and make a life together, but I guess I’ll just never forgive myself for what I did at 21. That was the worst chapter  my life and I’ll never forgive myself for it, fully. ",
    "subreddit": "confessions",
    "title": "Am i a terrible person for what I did at 21? Will I ever get a shot at a normal future?",
    "upvote_ratio": 0.63,
    "url": "https://www.reddit.com/r/confessions/comments/1j90b3e/am_i_a_terrible_person_for_what_i_did_at_21_will/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 19:34:52 UTC",
    "id": "1j8zfee",
    "link_flair_text": null,
    "media": null,
    "num_comments": 15,
    "score": 0,
    "secure_media": null,
    "selftext": "If I ever found the hottest chick with the tightest pussy, I'd do anything to fuck her and once I was addicted, I would absolutely destroy my own relationship for another chance to fuck it again.",
    "subreddit": "confessions",
    "title": "I'd ruin my relationship for the right pussy",
    "upvote_ratio": 0.29,
    "url": "https://www.reddit.com/r/confessions/comments/1j8zfee/id_ruin_my_relationship_for_the_right_pussy/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 19:04:50 UTC",
    "id": "1j8yoxu",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "I like my aunt she’s 43 and I’m 17 but i think i can get to get that any advice?",
    "subreddit": "confessions",
    "title": "I like",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/confessions/comments/1j8yoxu/i_like/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 18:21:26 UTC",
    "id": "1j8xmtn",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 8,
    "secure_media": null,
    "selftext": "I have so many complex feelings I need to express towards this woman I call my mistress. Our relationship started out as simple fun and it was absolutely exhilarating but now that things have changed I have to say that she's really left her mark on me. I've never known a woman with such a loving heart and so thoughtful and understanding. She's the most beautiful person I know inside and out and I'm forever grateful to her.  She opened my eyes to my own feelings and has even continued to support me in my journey of finding what's right for me. She has a beautiful family now and a loving boyfriend so it's no longer my place to share these feelings with her directly but if by some chance you do ever read these words I just want you know that I love you. I love you with all of my heart and more. I'll love you till the end of my days even if we never speak again. When I smile, when I cry, when I'm alone in this world I think of you and look to the moon we share at night and fall in love with the memories all over again. I could never admit that I'm love with you to your face anymore so let me say it here. I love you mistress and not just as a precious person. And even it's painful to not be the one chosen by you, you absolutely deserve the world and all the good in it. If it means you'll be happy, I'm happy to live with a hole in my heart because knowing you're happy and fulfilled and taken care brings me more joy than anything else. Okay. Got that off my chest now. Whew! I'm hopeless over this woman and so proud to be her friend. You twist me up in knots but I wouldn't have it any other way so long as I can be a part of your life. Now that I've confessed I feel more ready on now. Also, sorry mistress I know you didn't give me permission to enjoy myself since we've last spoken but I'm definitely gonna be doing that again lmao 🤣 I'm a bad boy I'm sorry.",
    "subreddit": "confessions",
    "title": "Im so grateful to you Mistress",
    "upvote_ratio": 0.83,
    "url": "https://www.reddit.com/r/confessions/comments/1j8xmtn/im_so_grateful_to_you_mistress/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 18:18:21 UTC",
    "id": "1j8xk8e",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 2,
    "secure_media": null,
    "selftext": "My father sleeps beside me and as soon as he thinks I'm asleep he'll start msging someone or call hsomeone else I'm pretty sure that he's talking to another woman he'll start mumbling about something, this has been going over a lot of time and I'm pretty sure he loves her, the thing is I think my mom too knows about this they they don't talk much these days or she's just to afriad to confront him even I feel like shit, these day's I just get so irritated and angry with him like how can he do smthg like that...\nDo you guys think I should confront him or just leave him be, I too don't wanna spoil the atmosphere in my home between them even though it's hanging by a thread.",
    "subreddit": "confessions",
    "title": "Yo need help?!",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/confessions/comments/1j8xk8e/yo_need_help/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 18:00:14 UTC",
    "id": "1j8x40h",
    "link_flair_text": null,
    "media": null,
    "num_comments": 98,
    "score": 61,
    "secure_media": null,
    "selftext": "I use my husband’s muscle relaxers and I love the high they give me. It helps me get through work. I work in customer service and it’s awful. My husband gets prescribed so many and he rarely takes them so I take them for him. He knows I take it. He doesn’t mind. I feel so chill when I take them and I’m just nicer but when it wears off I want more but I pace myself to 2 a day and I’ll skip it for a little bit and then start taking it again and when I do take them I just feel so on top of the fucking world.",
    "subreddit": "confessions",
    "title": "I’m addicted to muscle relaxers",
    "upvote_ratio": 0.84,
    "url": "https://www.reddit.com/r/confessions/comments/1j8x40h/im_addicted_to_muscle_relaxers/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 17:57:14 UTC",
    "id": "1j8x198",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 3,
    "secure_media": null,
    "selftext": "I can't stop thinking about what it would feel like to cheat on my girlfriend. I have a huge homewrecker fetish/fantasy. It's even hotter if she would blackmail me with the information and power she now wields.\n\nIt's driving me crazy.",
    "subreddit": "confessions",
    "title": "Something I can't seem to get off my mind recently.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/confessions/comments/1j8x198/something_i_cant_seem_to_get_off_my_mind_recently/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 17:47:15 UTC",
    "id": "1j8wsg3",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 4,
    "secure_media": null,
    "selftext": "I've never told anyone this story, and I'm in 11th grade now, so I figured it was a better time than ever to get this off my chest.\n\nI had some pretty severe stealing tendencies in the 4th grade. I'd swipe anything I could get my hands on. Slime, pokemon cards, snacks, you name it. One day I was sent back to the classroom to get my teachers clipboard, and my classmates backpack was wide open. I decided it wouldn't hurt to take a little peak as long as I was quick about it.\n\nHer phone was in the big pocket and I had always wanted a phone. I decided to take it, I shoved it in the bottom of my bag and went home with it.\n\nSomething I hadn't considered was the fact that phones had passwords, and I couldn't figure out hers for the life of me. A few hours after I had gotten home, it began to ring, and it scared the shit out of me. It was someone calling her, and a bit after that, it was someone pinging the location of the phone. I buried the phone in my closet and went to bed, and then took it back to school the next day.\n\nShe had announced to the whole class that her phone was stolen, and that her mom knew the location of the phone, and I took the opportunity to get up, take the phone to the bathroom, and shove it in a trashcan.\n\nWhen I went back to class, I told her that I had heard a buzzing noise in the trash and opened it up to see a phone, and told her it might be hers.\n\nShe went to the bathroom, came back with the phone, and she had no idea that I was the person who had swiped it. She didn't know for the rest of the year, and still doesn't to this day.\n\nI also stole a substantially large tub of slime from her later in the year and never gave it back 🤦‍♀️",
    "subreddit": "confessions",
    "title": "I stole a girls phone in the 4th grade.",
    "upvote_ratio": 0.83,
    "url": "https://www.reddit.com/r/confessions/comments/1j8wsg3/i_stole_a_girls_phone_in_the_4th_grade/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 17:13:05 UTC",
    "id": "1j8vy7s",
    "link_flair_text": null,
    "media": null,
    "num_comments": 18,
    "score": 17,
    "secure_media": null,
    "selftext": "Providing context: I, 16f, met my friend, 15f, when I transferred to a new school this year. She invited me to sit next to her and we’ve been friends since. We bonded over our love for reading, but also over our vast differences. We like very different music, books, artists, guys, etc. The last few days she has been talking more and more about God, Jesus, the Bible, Church, etc. She is an evangelical Christian. I am a former Christian, but left the church and became agnostic around age 10 for many reasons (I am against homophobia, I believe the Bible is often used to propagate sexist gender roles, and I just don’t believe it is real). Yesterday we were chatting, and she randomly said that her goal for this year is to convert me to Christianity. I respect her religion, and am glad that it works for her, but it doesn’t for me. She explained that she doesn’t want me to burn in hell forever, and she feels good with God so she wants me to feel good with God. I understand she has good intentions, but she knows I am not Christian anymore.\n\nThe thing is I am part of the LGBTQ+ community (I’m not sure if she knows), and she has occasionally made homophobic remarks. She says “she tolerates but doesn’t support it”, but I’m not sure. Apart from that I am pagan, and practice witchcraft. I gained interest in those beliefs around the same time I left the church, and I honestly feel more secure and empowered with my current beliefs than I did then. \n\nThis is not to hate anybody’s religion since you have the right to believe what you want to believe, but I feel like if she finds out I’m pagan and queer our friendship dynamic might change, or she may take it as a challenge to further convert me, which I find a bit uncomfortable.",
    "subreddit": "confessions",
    "title": "My religious friend wants to convert me, but I am secretly pagan.",
    "upvote_ratio": 0.82,
    "url": "https://www.reddit.com/r/confessions/comments/1j8vy7s/my_religious_friend_wants_to_convert_me_but_i_am/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 17:08:15 UTC",
    "id": "1j8vu08",
    "link_flair_text": null,
    "media": null,
    "num_comments": 11,
    "score": 12,
    "secure_media": null,
    "selftext": "I think my ultimate sexual fantasy would be a young woman who is seemingly innocent to myself and everybody she encounters. Then we get behind closed, she keeps up the charade of being innocent, luring me in, deeper and deeper. Then it turns out shes the biggest freak and wants to do all kinds of kinky taboo stuff and flex the power she has over me. ",
    "subreddit": "confessions",
    "title": "My Ultimate Fantasy",
    "upvote_ratio": 0.64,
    "url": "https://www.reddit.com/r/confessions/comments/1j8vu08/my_ultimate_fantasy/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 16:51:45 UTC",
    "id": "1j8vf3q",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 0,
    "secure_media": null,
    "selftext": "I‘ve been sexually attracted towards my\nSister for a while now and it turns me on so much. She always makes me cum so hard I love it. DM to talk more",
    "subreddit": "confessions",
    "title": "I jerk off thinking about my sister",
    "upvote_ratio": 0.18,
    "url": "https://www.reddit.com/r/confessions/comments/1j8vf3q/i_jerk_off_thinking_about_my_sister/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 16:41:45 UTC",
    "id": "1j8v6fp",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 2,
    "secure_media": null,
    "selftext": "I currently live in a studio apartment. But my bills keep piling up. My credit cards are only putting me more in debt. I have a good job. Pays quite a bit higher than minimum wage. However, I live in an expensive city. At this point even if I move or find roommates for reduced rent, it would take about 5 years to pay my debts off. However if I live in my car I can pay them off within a year. The worst part is I don’t see how I can keep my dogs anymore. I have 2 shepherds so finding roommates is nearly impossible and haven’t had any luck moving in with friends. Im not the type to just get rid of them because it’s convenient. I’ve always taken care of my dogs until they pass away and am a firm believer it’s a life commitment. But I’m at my limit. I don’t have any family I can move in with for help. I think this is my only option.",
    "subreddit": "confessions",
    "title": "I may have to become homeless, and rehome my dogs.",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/confessions/comments/1j8v6fp/i_may_have_to_become_homeless_and_rehome_my_dogs/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 16:37:59 UTC",
    "id": "1j8v31e",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 3,
    "secure_media": null,
    "selftext": "I actually fell for a fake job gig. I graduated a year early in college just to be forced to work an unrelated job for over a yr. I was so fed up and felt like i wasted the year i earned. I started applying everywhere in my field again and finally got a call back as a Work From Home Customer Service Agent. I was trying to do IT so this was a step in that direction. \n\nAfter interviewing they took all my information and said I would be training during a 2 month probationary period and be paid in the end. \n\nThey actually assigned me daily work over the course of a month and I was “supposed to be paid“ after my six weeks were up. But weird things started happening.\n\nFirst, I got a call from a random lady from Texas, claiming I friended her on Zelle. Then I got an email a couple weeks later saying my banking information was successfully transferred to a new financial institution, which I never approved or attempted. And finally someone claiming to be with the FBI called me saying I’m under investigation for stealing $3000 from someone’s bank account. He was not an FBI agent. At this point i called my bank to report potential fraud. That email and “FBI” call both happened within 30 minutes. \n\nAll in all, just in case the money was real I sort of did the work but didn’t expect much. I locked my account so nothing can be taken, but money can be added. \n\nI was wholeheartedly impressed by the scam I fell for so I wasn’t even mad. I usually play along with scams just to fuck with them but this was some next level shit lmao. \n\nThe website they used and everything was falsified to look so real, with references and all. \n\nSo, what did I do?  I added that to my resume as two months of experience in the field adding all the shit that’d look good for my actual career, even though that was a lie. Shortly after that, I got an actual job in IT finally. They were unable to actually call the job but could check the website for “verification” lol. I even gave myself a nice recommendation letter from my boss. \n\nSo technically, I lied on my resume, but did I really?\n\n***TL;DR:***\n&gt;**I fell for a job scam and did the fake work for 2 months. After realizing I was bamboozled in these people’s Genjutsu, I used the wasted time as job experience on my resume and got the job i was really searching for.**",
    "subreddit": "confessions",
    "title": "That time I fell for a fake job scam but it worked in my favor",
    "upvote_ratio": 0.8,
    "url": "https://www.reddit.com/r/confessions/comments/1j8v31e/that_time_i_fell_for_a_fake_job_scam_but_it/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 16:26:52 UTC",
    "id": "1j8utfp",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 7,
    "secure_media": null,
    "selftext": "Im a 22 year old male. Growing up both my parents worked and had to rely on babysitters to look after me when my school day was over. Well one of those babysitters was a close family friend. From ages 6-8 she continuously made me grope her breast, used my hand/ fingers to pleasure herself, and made me preform sexual motions over her body while she laid on her back. Growing up I never understood the magnitude of what I experienced. I felt so \"cool\" knowing I was able to go through that at such a young age. Now I realize that im a victim to my abuse and its taking a toll on my mental health. I am addicted to Porn. I cant seem to escape myself and only bury myself deeper into my addiction. I try to keep myself distracted. Social media dosent help. I cant bring myself to speak to anyone close to me about this. I mean how do you do it after nearly 15 years? Im exhausted. Just had to get it off my chest.",
    "subreddit": "confessions",
    "title": "I was Sexually Assaulted as a Minor",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/confessions/comments/1j8utfp/i_was_sexually_assaulted_as_a_minor/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 15:24:10 UTC",
    "id": "1j8tbdi",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 12,
    "secure_media": null,
    "selftext": "Just don’t wanna put her thru any pain remotely similar to my own but heavily starting to accept the lack of a god despite all of those emphasizing he gives his hardest battles to his strongest soldiers. Long story short, he should’ve known I was too fucking young to be in ANY army let alone go what I went through. Repeatedly. If he does exist, I wanna see him for my fair one before I go fuck on his bro for eternity. ",
    "subreddit": "confessions",
    "title": "I have every intention of killing myself after my mom dies.",
    "upvote_ratio": 0.84,
    "url": "https://www.reddit.com/r/confessions/comments/1j8tbdi/i_have_every_intention_of_killing_myself_after_my/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 15:04:42 UTC",
    "id": "1j8suww",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 1,
    "secure_media": null,
    "selftext": "You’re an amazing person and I wish you were the one, but I guess you’re not. I’m sorry.",
    "subreddit": "confessions",
    "title": "I thought that I was ready to settle down with you. I now realise I was not.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/confessions/comments/1j8suww/i_thought_that_i_was_ready_to_settle_down_with/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 14:58:16 UTC",
    "id": "1j8sph7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "So I work in retail and my manager often has me work on my aisle to make sure things are in check ( mostly cause I talk a lot and being alone fixing the place would help lol) anyways my job is to keep things nice and clean and help customers if they need help. And that’s where I met her. \n\nShe was slightly shorter, long curly hair and a pretty smile. She wore that uniform like it she was doing it a favor. She was quiet but would talk tia. Few girls in that specific section and ofc how I’m out going and polite I was like why not she’s cute and she’s quite my top 2 things I like in a girl. I felt like she was the one and as the months passed I progressed little by little and thought about her all the time. \n\n One night in august me and my homies from the stock room decide to get a big group and my close friend Alex was like yo dude this is ur perfect chance, invite her and try to get her social at the same time. I was scared but I made the confidence to talk to her and in the end she did. Sadly she did not go out with us for personal reasons but she texted me , i responded, she added me to her close friends, and we began to talk more and more. \n\nLooking back I think it was the fact she was darker then me that made me like her more lol ( I’m pale asf) and she was also a Salvi. When we college started we would meet up and it led to us revealing we wanted to get to know each other more. I still remember that day we sat outside , behind the science building at our campus. We sit next to each other after she says goodbye to her friend and we make eye contact. My hearts beating as we sit close together and I’m scared but I know what I wanna say. I honestly enjoy being with you and I wanna get to know you more if that’s cool with you. “ I wanna get to know you too. You look like the type of person I wanna get to know” \n\n2 days later we shared our first kiss in her car and I sometimes think about how smooth and sweet her lips were.( she vaped so it tasted like strawberries) as the weeks passed we progressed to… well I will admit I’m at fault I rushed a few things as in making out, and nearly having sex. I respected her wishes as in waiting or to do it in a better spot. ( we would mostly make out in her car cause both our places got people) regardless I started to lose feelings mostly due to the fact how she was really starting to… be a bit weird the more I progressed with her. I was also seeing her nearly 5 days a week 3 extra times in school and maybe 2 days to myself so this came into a factor as well. Also that… she looked different well not entirely different but she relied a lot on makeup. \n\nHer friends were interesting, mainly gay which does not bother me but most would be talking about stuff or cracking jokes that I did not  understand. I was always nice don’t get me wrong but I felt… a bit out of place and weirded out due to certain graphic topics that came up. 3 weeks in I told her I can’t do this and it did hurt… however I did not diss her or tell people oh cause of this. I kept it private and… well a month flew by and we tried again… but then again it did not work out well. \n\nIk her very well and she’s a hard working individual and one of the most funniest. It’s been 5 months since and I still got her IG. I message maybe once in a while but stopped to not let her catch any feelings. We both have this bond or… I guess work bond you can say? Looking back I feel like “ did work make us do this? Like did work make us ignore certain things about us that we were blind and got a reality check? Regardless she is one of the best females I ever dated and I will always remember her. ",
    "subreddit": "confessions",
    "title": "I dated a coworker who I was head over heels for a summer.. did not end well",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/confessions/comments/1j8sph7/i_dated_a_coworker_who_i_was_head_over_heels_for/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 14:57:57 UTC",
    "id": "1j8sp7o",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "I been living with my great aunt and uncle for nearly 10 years. I have a really terrible childhood that if I was to tell the story it would need to be a whole other Reddit post cause of the amount of shit I been thru. However when I turned 18 my aunt was beginning to hit me over little things that no family member should do. As I mentioned they are Jehovah’s Witness and my aunt who i was living with at the time is  related to is my mother. Aka my Tia abuela or grandma aunt. \n\nAnyways my family especially from this side i was raised in have a ton of anger, depression and mental issues and often the old heads just bury there feelings or trauma with something. Claiming that mental health ain’t a thing that your just lazy or don’t believe in god.  this aunt I was with used this religion to cover up her trauma and just leased it out on me. \n\nOnce when early Saturday morning, before the people came to our house for service my aunt got mad for something and grabbed me by the collar while dressed up ready to go preaching, she grabbed me so hard she ripped a button off and later got mad when I told her while it was ripped.\n\nOne time she got mad at something I did and grabbed me by my collar and broke my chain my grandma gave me and I cried later cause I had to use a string to fix it… I was 13 both times \n\nOnce I called my mother the 2nd year I was with them cause my aunt  and her husband were so old school that they would hit us thinking it was right. Was about 8 and eventually gave up after a fight broke out with them both…\n\nI felt growing up with her it was eggshells and ofc she took the basic stuff to take care of me and my sister like food and shelter but I felt… like that love was not there. You ever speak to someone and be open? Like you tell them how you’re feeling and they add on to it? That’s something I did not feel like I could do with her cause she scared me..\n\nIn 2023 when I turned 18 she placed her hands on me more cause I would speak up or back at her. What confused me more was that she would hit me or slap me and take it as a challenge if I put my hands up which was just a basic mechanism to protect myself.  I would tell her how can she be acting like this before or after church? It made no sense for a women to be the wife of an elder to act so innocent and happy but say the harshest things to me and cover my arms in scratches.\n\nOnce we had a special circuit overseer ( a traveling missionary in that religion ) come over for dinner. It was a Saturday so I was studying and while my uncle was cooking steak outside she was like go watch him cook and learn. I said: I know how to cook, every time I’m with the people from the English congregation they always let me. Tio does not let me. \n\nShe got mad and told me to go do it and so I walk downstairs and grab my shoes and toss them on the ground after she yelled something. When the I tossed my shoes she slapped her dishes and walked up to me and grabbed my wrist and yelled at her to let go and she scratched my arms so bad that even my friends at my part time job were concerned about me. It was bad… whats crazy my uncle never said anything to her after he asked me what happed to my arms cause he saw the claw like marks and my aunt that night was just smiling and happy talking to the missionary’s and his wife…\n\nMy final straw was when she started to hit me early in the morning after she saw me sleeping in after our 3 day convention which are like 8 hours max and for us cause they were both high ranking officials so I had to be there early asf with them and what I found crazy this woman was slapping and hitting me in the head like I did the worst thing in the world just for sleeping in 1 day  during summer school and what’s funny I told her I can just take it online here at home. 7:00 in the morning she’s yelling and I get up as she grabs me and yell at her how is she acting like this after a the convention? ( literally yesterday)… \n",
    "subreddit": "confessions",
    "title": "I was raised by an aunt and uncle who were JWs but were physically abusive.  Part 1",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/confessions/comments/1j8sp7o/i_was_raised_by_an_aunt_and_uncle_who_were_jws/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 14:56:48 UTC",
    "id": "1j8soa5",
    "link_flair_text": null,
    "media": null,
    "num_comments": 15,
    "score": 9,
    "secure_media": null,
    "selftext": "Just wondering if anybody on here has ever done or thought about this?  Also to the women have your husbands ever done this for you?  \nI’m not sure if this would be right for my wife.  As far as I know, I’m the only man she’s been with. But I have MS.  She sees me as a sick old man than a lover. It would be interesting what it would be like to give her a night with a handsome fit, man that’s her type.   She’s conservative so I don’t think she’d go for it.  \nComparing what I can do in what the escort can do:  I can take her somewhere and have a romantic time.  Go back to the hotel.  I do everything I can to satisfy her.  But he would be much fitter than me.  She wouldn’t have to think of my illness at least for a night.",
    "subreddit": "confessions",
    "title": "Who has ever ordered a callboy or escort for their wife?",
    "upvote_ratio": 0.64,
    "url": "https://www.reddit.com/r/confessions/comments/1j8soa5/who_has_ever_ordered_a_callboy_or_escort_for/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 14:46:45 UTC",
    "id": "1j8sg1c",
    "link_flair_text": null,
    "media": null,
    "num_comments": 8,
    "score": 9,
    "secure_media": null,
    "selftext": "I have been lying to my coworkers and the person I’m casually dating about my age. I’m 19, I’ve been a CNA since 17. I live alone and don’t really have any friends that are my age, so work is my main social interaction. I got a job on an ICU floor in the hospital 6 months ago. When one of my coworkers asked me how old I am, I was genuinely embarrassed because I was the youngest person there by far, the majority of my coworkers are in their mid 20s-30s and a few 40+. I was scared that they wouldn’t think I wasn’t competent to work in the ICU at such a young age, so I said I panicked and lied that I was 21. I have told several coworkers this when they ask. I also recently started seeing a guy who is 22, we met on social media and I saw that he had mutual connections with 2 people from work so I lied to him as well. We have went on several dates and he has been to my apartment, but every time he asks to go out for drinks I always make up an excuse (since I’m actually not of drinking age in the US). It hasn’t got too serious just yet but I really like him and would like for the relationship to progress. I feel incredibly embarrassed and guilty for lying but I don’t see any possible way that I could tell the truth without people thinking I’m weird. I’m absolutely terrified that someone will find out and expose me. I wish that instead of feeling embarrassed, I would be proud of having a good job and living independently at 19, but now I have dug myself into a hole by lying. ",
    "subreddit": "confessions",
    "title": "I have been lying about my age",
    "upvote_ratio": 0.76,
    "url": "https://www.reddit.com/r/confessions/comments/1j8sg1c/i_have_been_lying_about_my_age/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 14:36:01 UTC",
    "id": "1j8s78j",
    "link_flair_text": null,
    "media": null,
    "num_comments": 8,
    "score": 0,
    "secure_media": null,
    "selftext": "So like I got too intoxicated and gotten into a fight. My cps worker doesn’t know if I’m getting my son back. But it’s probably best… I’m so not me rn😭💔 ",
    "subreddit": "confessions",
    "title": "So I got drunk last night, and fought",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/confessions/comments/1j8s78j/so_i_got_drunk_last_night_and_fought/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 14:11:18 UTC",
    "id": "1j8rnu3",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "i hope my life is short, although life is really short as the idiom says. but i have an intense loathe towards myself even at a very young age. i feel like raising me isn't really worth it. there are few children who really are a mistake at birth, and i know i am one of them. i don't deserve this life, if only i could donate a sould to someone who wants to extend their few moments on earth, i really would give it. but right now, i just fucking hate myself. i cannot see anything worth loving within my identity. i hate my life, and i much hate myself even more. so there's that, i hope i won't live in the earth much, i cannot take it anymore. i don't wanna be a burden to anyone's life anymore, so for anyone's betterment, i hope i would end soonest, it's no longer healthy for anyone's. ",
    "subreddit": "confessions",
    "title": "I have an intense hate towards myself",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/confessions/comments/1j8rnu3/i_have_an_intense_hate_towards_myself/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 11:55:29 UTC",
    "id": "1j8oz2w",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 5,
    "secure_media": null,
    "selftext": "When I was a teenager and I met this girl who at the time was 17-18 and I was 13f. I am now 30. I looked up to this girl bc she would say how pretty she was and how her friends would do anything for her. Anyways, I slept over some nights and one night she asked me if I wanted to have sex and I didn’t know what that was, I was 13 never experienced anything. She said she would call her friend named Jake(fake name) to which I replied that I needed to know that person to have sex, bc in reality I didn’t want to do anything that I didn’t know. Anyways, she then proceeds to ask to me if I wanted to be fingered or be eaten out. I just replied to being fingered. Because I didn’t know what that was. \n\nETA: she did continue to finger me. \n\nIt took me a while to get over how when I was older I could’ve had sex when I was younger. Idk why? \n\nA few nights ago I had a dream where she was there, mind you I haven’t seen her in years. I was telling her how I looked up to her and she just replied “oh yeah, I am pretty” like stuck up. Next interaction I had with her she was annoyed with me. Then I had a 3rd interaction with her and was trying to talk to her but she was really annoyed, and tried to stop me from asking her something. When I finally could say something I said “just answer me this question, why did you SA me when I was younger?” \n\nI woke up really sad I couldn’t believe that maybe that’s what happened. I’ve been thinking about it ever since. Could my real life interaction be SA? Or am I just overthinking/overreacting?",
    "subreddit": "confessions",
    "title": "Thoughts?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/confessions/comments/1j8oz2w/thoughts/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 11:27:44 UTC",
    "id": "1j8oiyf",
    "link_flair_text": null,
    "media": null,
    "num_comments": 17,
    "score": 3,
    "secure_media": null,
    "selftext": "Im a 22F. I had a couple of rough weeks because of my drinking. I ran out of money before the end of the month because I spent it on booze, didnt eat much for a couple of days and then I didnt even have booze left. I wasnt even having WD but the idea of not having any alcohol made me panic so I went into Bumble and set dates with two guys who agreed to buy me a bottle of vodka. The first date was a disaster as I got blackout drunk. I got blackout drunk several times again the following week so I decided it was time for (another) attempt at a sober period. Nope, I skipped my two glasses of wine during lunch but by evening I had downed three drinks without even realizing. I should be mad at myself and pour all the liquor down the drain but I won't do it. I'm mostly relieved and kinda resigned.",
    "subreddit": "confessions",
    "title": "I failed my attempt at sobriety after half a day and I'm not even that upset about it",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/confessions/comments/1j8oiyf/i_failed_my_attempt_at_sobriety_after_half_a_day/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 10:55:17 UTC",
    "id": "1j8o0xz",
    "link_flair_text": null,
    "media": null,
    "num_comments": 8,
    "score": 0,
    "secure_media": null,
    "selftext": "I'm getting old. I'm 19. I've never hugged a woman, I've never kissed a women(family excluded obs). I don't think I've even spoken to a woman, since HS ended. I study CS at a commuter University in Australia, so there isn't much opportunities to make friends. Friends are a pre requisite to meeting women\n\nBut here lies the problem. I don't actually even want friends. Had \"friends\" in HS, and never spoke to em again after HS ended, and I'm happy for it. Having no friends is a lot easier than having friends. I don't enjoy social activities, and much prefer doing shit myself. \n\nI'm not really a likable person either lol, so other people don't really like talking to me, I never heard the end of it from Parents/classmates . I'm apparently a self centered person with no empathy for other people, something I'm not gonna deny.\n\nWithout friends, I can't really meet any women. There is no one to introduce me, and no one to take pictures with for dating apps. I also hate bars/clubs. I don't think dating apps would work without friends. I\"m Indian, so white people in the pics, would definitely be a huge help\n\nLike my Uni has board games nights, movie nights and even sometimes parties, but I really really don't want to go. I don't give a fuck about any of those activities, nor do I even give a shit about the people who run/attend them, unless they're the women I'm looking for.\n\nLife is so hard. Not unfair, but hard. How I wish I gave a shit about people, and actually cared about them.  ",
    "subreddit": "confessions",
    "title": "I've got a fairly unique dating problem",
    "upvote_ratio": 0.2,
    "url": "https://www.reddit.com/r/confessions/comments/1j8o0xz/ive_got_a_fairly_unique_dating_problem/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 10:38:19 UTC",
    "id": "1j8ns4h",
    "link_flair_text": null,
    "media": null,
    "num_comments": 77,
    "score": 459,
    "secure_media": null,
    "selftext": "I’m 21f and I discovered that I have a misogyny kink. So I will occasionally go to hardware stores or tech stores and ask male employees really dumb, bimbo questions whilst dressed provocatively. I feel weird about it but I enjoy it so much. ",
    "subreddit": "confessions",
    "title": "I enjoy being mansplained to",
    "upvote_ratio": 0.84,
    "url": "https://www.reddit.com/r/confessions/comments/1j8ns4h/i_enjoy_being_mansplained_to/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 08:53:55 UTC",
    "id": "1j8md5i",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 0,
    "secure_media": null,
    "selftext": "I (m18) don't know why but ever since i was young i have always had a fetish for incest porn idk why or how it turns me on but it does is this normal? ",
    "subreddit": "confessions",
    "title": "I have a fetish for incest porn",
    "upvote_ratio": 0.29,
    "url": "https://www.reddit.com/r/confessions/comments/1j8md5i/i_have_a_fetish_for_incest_porn/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 08:35:36 UTC",
    "id": "1j8m54g",
    "link_flair_text": null,
    "media": null,
    "num_comments": 20,
    "score": 0,
    "secure_media": null,
    "selftext": "This happened from 2020-2023. The thought of what I did ruminates in my mind EVERYDAY. The shame and guilt it causes me to have makes me suicidal. It makes me feel worthless. Everytime I’m with friends or family, my mind goes “i bet no one else here has jerked off to their aunt”. My mind is KILLING me. I think about the thought of my aunt AT LEAST 5 times a day. It just comes and goes. I don’t know what to do. I’m at my wits end. It’s like i don’t have the ability to forgive myself. I’ll be talking to my mom and I’ll get thoughts of telling my mom what i did. I do NOT want to tell my mom what I did. I’m tired. I’m really fucking tired of this thought. I just want it to go away. It clouds my mind 24/7 man. The anxiety is crippling. Anyways that’s all I wanted to confess. I hope I find some closure. ",
    "subreddit": "confessions",
    "title": "I used to jerk off to my aunt a couple years ago and the guilt and shame I feel is making me suicidal to this day.",
    "upvote_ratio": 0.25,
    "url": "https://www.reddit.com/r/confessions/comments/1j8m54g/i_used_to_jerk_off_to_my_aunt_a_couple_years_ago/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 08:25:23 UTC",
    "id": "1j8m0n7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 24,
    "score": 249,
    "secure_media": null,
    "selftext": "So a while ago my wife got pregnant and we were so extremely happy we were finally going to start a family. A few weeks into the pregnancy she had a miscarriage. You can imagine the pain she felt and the sorrow and the distraught. I \"manned up\" and consoled her for however long she needed because I love her and it's not her fault. I made sure she knew it wasn't her fault and that I love her. This happened in October of 2024. \n\nToday I was working and I was listening to my music. I have apple music so I had created a station where it plays music it thinks I would like. One song came out where it talks about how children are gifts from God and little kids started singing at a part. I don't know why it hit me like a truck today. I felt like exploding in years but I couldn't cause I was working.\n\nNo one consoled me when it happened. I don't ask why it happened. I know things happen for a reason. I've always asked myself if I'm still considered a dad. I don't know if I do. I asked google because I just didn't know and it said I am considered a father to an unborn child. That just broke my heart and now I'm just in a state of sadness and sorrow.",
    "subreddit": "confessions",
    "title": "Am I still a dad??",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/confessions/comments/1j8m0n7/am_i_still_a_dad/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 07:53:17 UTC",
    "id": "1j8llxq",
    "link_flair_text": null,
    "media": null,
    "num_comments": 24,
    "score": 25,
    "secure_media": null,
    "selftext": "TW!! Sexual assault\n\nHey reddit! \nSo I’m not sure on how to really write this and I’m very emotional right now writing this but anyways here it goes\n\nSo I (20F) was at my best friend’s house about a week ago and his cousin Jake(fake name)(30M) was there. Now I have liked Jake for a while and i have known him since i was 15 and he was 25. we were both drinking and we kissed. He wanted to have s3x and he told me he has wanted to do this since we met (which i found a bit creepy since i was 15 and he was 25)\n\nAnyways he kept asking and i said no and he continued to ask while attempting to undo my pants. I said no a few more times and eventually allowed it to happen. \n\nAfter that night i was taken to the doctor to be tested for any STIs/STDs for it was unprotected. And i had so many invasive tests done in the trauma unit. \n\nI have been in an emotional state since and im not sure why \n\nMy parents and friends are saying i was assaulted but I’m still not sure\nbut i did feel like i was taken advantage of. \nIm so confused on if i was actually assaulted or if I’m being dramatic because i feel guilty because my body enjoyed it. \n\nI don’t want to get the police involved or to get a case. I just want to forget about it. \nAnd also the fact that I’m not sure if it was sexual assault. So i don’t want to ruin someone’s life because of something i may have overreacted to. \n\nSo i just wanted another opinion \n\n",
    "subreddit": "confessions",
    "title": "I think i was sexually assaulted",
    "upvote_ratio": 0.83,
    "url": "https://www.reddit.com/r/confessions/comments/1j8llxq/i_think_i_was_sexually_assaulted/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 07:46:51 UTC",
    "id": "1j8lizq",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 0,
    "secure_media": null,
    "selftext": "Hate doing this but I just gambled my wages when drunk last night and now I’m screwed got rent coming up if anyone could help me you’ll be greatly appreciated ",
    "subreddit": "confessions",
    "title": "I need cash",
    "upvote_ratio": 0.25,
    "url": "https://www.reddit.com/r/confessions/comments/1j8lizq/i_need_cash/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 06:57:01 UTC",
    "id": "1j8kviv",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 14,
    "secure_media": null,
    "selftext": "My childhood wasn’t something any child should experience. My parents were always fighting. When they weren't fighting, they would rather go outside, leaving me alone with a babysitter. The neighbors didn’t like it when I played with their children due to my family’s condition.\n\nI found it difficult to study and I had trouble staying focused on the topics in class, which led me to be the dumbest kid in class. Other children didn’t want to play with me because they thought I was odd. The only time they let me hang out with them was when I promised to carry their bags wherever they went. I will please everyone, lick their shoes if I have to as long as I can be friends with them, but most of the time I just sat alone on the swing in the school playground.\n\nDuring my teenage years, I was bullied because of my appearance. My hair was tangled, falling out, and thinning due to stress. My skin looked dulled and I had acne. My body didn't fit the beauty standards in the place where I lived. Oh right, I forgot to mention that I’m still struggling academically. I have short attention span, I get distracted very easily and it’s difficult to concentrate.\n\nNow back to my parents. I know I'm not supposed to self-diagnose, but I believe my parents have untreated mental health issues. Every time I told them I was interested in learning something, they would tell me no because they thought it was a waste of time, just a phase, and that I’d get bored by it later.\n\nFor example, when I told them I’d like to learn piano, they said no. When I asked if I could take a sewing class, they said I’m not good enough and just gonna waste their money. When I received a job offer outside of town, they told me that I cannot bring any of the things they have purchased for me, which includes laptops for work, my phone, and my clothes (I was only allowed to take one empty bag to put my documents and the clothes I was wearing at that time). As a result, I lock myself in my room for a long time\n\nI got very depressed at some point, but now I’m a little stable. I became a very hateful person, envious of those who have their lives together. I learned how to manipulate people, only befriending them if they could bring me benefits and taking advantage of them. I ruined my friend’s relationship with her boyfriend because I envy her. I regret it so much. Every time I did something bad, I feel guilty and ashamed of myself. I wanted to be a good person since I was a child, but I crave revenge for everything I went through as I grew up. I’m conflicted with my own feelings. I want to stop, but my thoughts will give me reasons why it’s useless to be a good person",
    "subreddit": "confessions",
    "title": "Hurt people, hurt people. I've turned into the kind of person that I hated as a child",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/confessions/comments/1j8kviv/hurt_people_hurt_people_ive_turned_into_the_kind/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 06:31:52 UTC",
    "id": "1j8kjea",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 0,
    "secure_media": null,
    "selftext": "My husband regularly cheats on me with other women. I ve no idea where he picks them up from or who those women are, mostly. But I ve a camera in my bedroom and guest room. He generally brings those women home when my kids are at school. I recognize some of those women, like he once brought his friend's wife and the other time it was neighbor's wife.\n\nAnd I love watching him fuck those women in private. I wonder if I should ask him for threesomes. But I can never confess to to him about this bcuz I don't know what he will do. I am scared of divorce. I love him the most in this world.\n\nMay be some day I can join him...",
    "subreddit": "confessions",
    "title": "I know my husband cheats.",
    "upvote_ratio": 0.26,
    "url": "https://www.reddit.com/r/confessions/comments/1j8kjea/i_know_my_husband_cheats/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 05:49:33 UTC",
    "id": "1j8jyag",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "The past decade has been a crazy tumultuous time for me. I have dealt with so much and am trying to get my life together and get my career going.\n\nI lost my Dad 5 years ago to alcohol abuse. He drank himself to death and it was a difficult time for me to put it mildly. He lost his job and started drinking away as a means to cope and he would hit me if I tried to take the alcohol away. In the months before his passing he would tell me that he would pass away eventually and I was in so much pain. \n\nI remember coming home from school and seeing him collapse and pass away, it was the most painful and difficult situation of my life.\n\nEveryone in my neighborhood made fun of me and tormented me following my father’s passing. My neighbor drove drunk into my driveway and started harassing me calling me the N word and saying I didn’t belong in the neighborhood and that my dad died because he hates me. She knew where I went to university and while I was there she falsified a report to the police that I was dangerous. Campus police pulled me over and put a gun in my face, I thought I was going to die. Furthermore due to PTSD I crashed my vehicle a month later however I got it back through insurance. I continued having mental health issues.\n\nA few months after this I started working in IT and it was the most fun job I ever had, I love technology and solving issues related to it was so much fun for me. I met this girl I really liked and we started dating. The friend group I was in felt that I wasn’t giving them as much attention as I should so they started putting me down and talking negatively about my relationship and myself in hopes of gaining control of me and keeping me within the confines of the group. \n\nAround the time I started working in IT, I lost 40 pounds and got dreads. My friends commented initially that I started to look more attractive and they liked the look and my girlfriend agreed. It ended up being a point of contention when my friends realized my girlfriend was White and I was African-American. They used to talk down to me and kept saying “You think you’re better than all of us” when I had never said that in my life.\n\nThe hispanic friends within my group had the most vitriol and hate for my which I will never understand. The last day I ever hung out with these people I was dropping home one of them and he asked me if I wanted to hang out with him and I said sure. He took me to a nightclub without telling me and gave me alcohol, I drank and this girl came up to me and we started talking in the club. He was on the other side of the room seething in anger and later that night tried to rob me. When I realized the situation, I left the club and took an Uber home. After his failed attempt to rob me, the group chat was filled with constant threats against me and racist remarks. I decided at this point to leave the group and never look back. The guy who tried to rob me later attempted to break into my house at 4am and my mother called the police and he was placed on a criminal trespassing charge. Following the charge, as retribution he attempted to sue me in court for harassment however this did not go anywhere and the case was dismissed for insufficient evidence.\n\nThroughout my life I treated everyone as human beings not by their colors, it only made sense with ancestors from the civil rights movement. Thats the way I was raised and I care more about respect and character than the appearance of a person.\n\nI want to become a software engineer and applied for a Master’s in Comp Sci program online. Hopefully I get in. In the meantime I’m dealing with depression as I treat my vitamin and mineral deficiencies with supplements, when I feel better I plan to learn how to code everyday. It’s basically code or die trying at this point, tech is the only thing I’ve ever been interested in and cared about.",
    "subreddit": "confessions",
    "title": "Trying to better myself and beat my mental health issues and become something",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/confessions/comments/1j8jyag/trying_to_better_myself_and_beat_my_mental_health/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 05:47:31 UTC",
    "id": "1j8jxa6",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "\n\nToday I cut myself. \nNot because I was looking for attention I honestly didn’t even think about people noticing it until after the moment passed and I realized what I did. \nToday I cut myself, because I wanted to be the thing that caused my own pain. Not like the usual pain I feel from the hands of someone else. \nToday I cut myself, stuck in what felt like a trance because the first cut was an accident, but the rest were intentional.  For the first time in 15 years I finally slipped and let the intrusive thought win. \n\nToday I cut myself. \n\nToday I hit rock bottom, the only thing lower is in a coffin. \n\nToday I realized that I don’t want this to be my story anymore. \n\nToday I chose to save me. ",
    "subreddit": "confessions",
    "title": "Today I cut myself.",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/confessions/comments/1j8jxa6/today_i_cut_myself/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 05:35:06 UTC",
    "id": "1j8jr23",
    "link_flair_text": null,
    "media": null,
    "num_comments": 17,
    "score": 0,
    "secure_media": null,
    "selftext": "Idek why the fuck I decided that was a good idea. She didn’t tell me she was trans until I was already at the building, which made me feel slightly manipulated, and then I just went along with it and it felt so weird in the moment and so disgusting and idk why I stayed. It’s not cuz she was trans that makes it bad but she wasn’t someone who I was attracted to, I didn’t even see what she looked like cuz she was like, already in the closet and I just got in. \n\nI’m so fucking stupid and I literally hate myself rn, idk how I can keep going and now I should probably just get tested and what the fuck is wrong with me",
    "subreddit": "confessions",
    "title": "I got head from a random trans woman in a storage closet",
    "upvote_ratio": 0.44,
    "url": "https://www.reddit.com/r/confessions/comments/1j8jr23/i_got_head_from_a_random_trans_woman_in_a_storage/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 05:26:53 UTC",
    "id": "1j8jmj3",
    "link_flair_text": null,
    "media": null,
    "num_comments": 16,
    "score": 7,
    "secure_media": null,
    "selftext": "I have spoken to two women from gen z,that think anything not involving penetration is not fully cheating,and that's it different for girls.Newsflash,if your boyfriend or husband got do it or get it from another women without you getting mad and feeling cheating on,then it's cheating even if you do it.I can only hope most of you know that,if not yall are cooked.",
    "subreddit": "confessions",
    "title": "Disgusting behavior",
    "upvote_ratio": 0.61,
    "url": "https://www.reddit.com/r/confessions/comments/1j8jmj3/disgusting_behavior/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 05:00:57 UTC",
    "id": "1j8j83p",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "My best friend in university is a really pretty girl. I may have been attracted to her at some point, but we’ve always just been close. We chat a lot and usually go to the movies together about four times a year.  \n\nRecently, she suggested that we should see a movie on Friday since she was free. Jokingly, I told her, \"Only if you'll let me kiss you.\" I’ve told her many times before that she has perfect lips, but to my surprise, she actually said yes.  \n\nAt the movie, I asked for the kiss, and she said, \"Maybe on the cheek.\" So I teased, \"What about the neck?\" and she agreed. Within minutes, things escalated—I was all over her, and she was stroking me. She was breathing heavily but then said, \"Let's stop.\" This happened about three times before I finally got a hold of myself.  \n\nAfter the movie, we ordered a cab and dropped her off somewhere since she had errands to run. Since then, we've been busy with university, so we just text occasionally, acting as if nothing happened. Neither of us has mentioned that day.  \n\nNow, I don’t know what to think. I asked her in the cinema if everything was okay, and she said it was \"totally normal.\" But I still wonder—did I push things too far? Or was she okay with it?",
    "subreddit": "confessions",
    "title": "Mixed Signals and Unspoken Thoughts",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/confessions/comments/1j8j83p/mixed_signals_and_unspoken_thoughts/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 04:59:48 UTC",
    "id": "1j8j7cx",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 1,
    "secure_media": null,
    "selftext": "In march of 2023 when i was 19 i received a benefits affair of 10k from the government.\nIn holland Around 2014 the government taxed alot of parents for childcare. For invalid reasons. So in 2023 they paid back the children and parents who suffered. I grew up with a single mom who tried her best to make ends meet. She always told me to be careful about spending money since we didn’t have much. I always had trouble managing the little money i had. So when i received the benefits affair i got really excited. The first few months i really saved alot and only spent 1-2k of the money. I wanted to save for my drivers license and the future. At the end of 2023 somebody told me about this escort site. I thought about it but let it fade quickly cause I wanted my first time to be special.\nFew months later i was failing school and had trouble passing my school and driving exams.\nAll of my friends where throwing their sexual lives in my face which made me insecure and they didn’t know i was a 20 yr old virgin. I’m good looking so i was told and in my life 2 girls approached me but i was too shy and insecure. I remembered the escort site and decided to go since i felt ashamed for being a virgin and im too shy and insecure for a relationship. I became addicted and in total i slept with 100+ i think. I spent all my money so i searched jobs and worked. On work a few colleagues were gambling on breaks and was making money. Since I didn’t had much i thought i could make it through sports gambling wich seemed easy. I think you know how that went. I won like 500 and since then it went all bad. I quit my job cause of depression snd suicidal thoughts. I told my mom about the gambling and now im seeing a psychologist. Im still very depressed and worried about my future. I never had a relationship cause im afraid to get cheated on and get hurt. But i made some goals for myself like going back to school and doing social work maybe. Just wanted to vent. Thanks\n",
    "subreddit": "confessions",
    "title": "I have a confession. Im ashamed but i want to do better . M21",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/confessions/comments/1j8j7cx/i_have_a_confession_im_ashamed_but_i_want_to_do/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 04:42:33 UTC",
    "id": "1j8ixh7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "I am a 20-year-old boy, I am at university, I have a friend from 2 years ago, we go to the same classes, the same places and even the same parties. but it was in one of these where what I am going to tell you happened (more than once).\n\nI have witnessed this and I have heard rumors about it, at the last party we went to she drank as usual, we drank, we danced and being very drunk we kissed in the bathroom at the party, that was when another friend arrived and told me that it was a shame to stay in the bathroom sitting vomiting and too drunk to let her go out in a taxi, I told him that there was no problem that I was going to go with her but he and other friends who were also seeing the state she was in. My friend insisted that I spend the night at the house of the colleague who organized the party. Then between 2 boys and 2 girls they put her in the room.\n\nWhen I wanted to go in to see it, they told me to stay outside, I insisted but the others pushed me and left me on the couch. It was very suspicious that they wouldn't let me in. I told another friend what happened and she told me to calm down that she would be fine. I listened to her and the party continued.\n\nWhen it was time to leave, I asked about my friend and the girl told me that she would stay with her and her boyfriend. I wasn't too sure about leaving her, but my other friend lived far away and asked me if I could accompany her, I went with her and I didn't hear from my friend until Monday. She arrived at the university normal, I told her that she was fine and she responded that yes, she seemed normal until on the way to the lockers I heard those from the party say \"she was so asleep that she didn't even realize, I took photos and videos of her\" you could hear the boys and girls who in theory were going to take care of her laughing.\n\n I told her what I heard and she went to confront them but they denied everything and apparently deleted all the photos and videos. She asked me if I heard correctly why I lied (I didn't). She stopped talking to me for a while because of these flyers telling her lies about me that maybe I did that.\n\nDays passed and I told a friend about it and with a slightly worried look she told me \"that's not new.\" She told me that at all the parties she went to they did that to her and then I understood why she told me that whenever she drank she lost consciousness and didn't remember anything. Those bastards forced her to drink on purpose.\n\nI was shocked, I didn't know what to say, but it was no use telling her since she wasn't going to believe me without proof and she also stopped talking to me a few days later, that happened a year ago, I haven't spoken to her since then, I'm not going to lie, I feel bad for her.\n\nSurely he will continue going to those “parties” and they will continue doing the same thing until he gets tired or bored.\n\nI'm not asking you for advice, I just want to show you that there are people who are so used to their lifestyle that you can't change them.",
    "subreddit": "confessions",
    "title": "Violaron a mi amiga (varias veces)",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/confessions/comments/1j8ixh7/violaron_a_mi_amiga_varias_veces/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 04:17:22 UTC",
    "id": "1j8iip0",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "My friend has been trying to go viral on TikTok for a while and posted a screenshot of a twitter meme and it got over a million likes and I can’t stop seeing videos about it. Almost no one outside of our friend group knows they’re quoting his meme. It was eating me alive so I just had to tell someone ",
    "subreddit": "confessions",
    "title": "My best friend started the Subaru meme…",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/confessions/comments/1j8iip0/my_best_friend_started_the_subaru_meme/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 04:00:30 UTC",
    "id": "1j8i808",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 1,
    "secure_media": null,
    "selftext": "When I was like 12-13 I used to listen to Three Days Grace on a cd player with headphones and read the Warriors cats series",
    "subreddit": "confessions",
    "title": "Nuclear cringe I just remembered",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/confessions/comments/1j8i808/nuclear_cringe_i_just_remembered/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 02:28:44 UTC",
    "id": "1j8gisl",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 0,
    "secure_media": null,
    "selftext": "My man goes into the bathroom to walk if im not in the mood. Usually cos I've just fucked too much and he has a massive dick so I bleed and need to heal. Still I want to but can't and he goes to wank. ",
    "subreddit": "confessions",
    "title": "Should my man watch porn if I don't want sex?",
    "upvote_ratio": 0.29,
    "url": "https://www.reddit.com/r/confessions/comments/1j8gisl/should_my_man_watch_porn_if_i_dont_want_sex/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 02:23:20 UTC",
    "id": "1j8gey7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 1,
    "secure_media": null,
    "selftext": "Did you ever have to negotiate having sex, rules, rewards, compromises? ",
    "subreddit": "confessions",
    "title": "Did you ever have to compromise for sex?",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/confessions/comments/1j8gey7/did_you_ever_have_to_compromise_for_sex/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 02:02:40 UTC",
    "id": "1j8g08n",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 19,
    "secure_media": null,
    "selftext": "I’m embarrassed as a grown man.",
    "subreddit": "confessions",
    "title": "life didn’t give me lemons it gave me pants and i’ve shït them",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/confessions/comments/1j8g08n/life_didnt_give_me_lemons_it_gave_me_pants_and/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 01:46:02 UTC",
    "id": "1j8fnwq",
    "link_flair_text": null,
    "media": null,
    "num_comments": 38,
    "score": 0,
    "secure_media": null,
    "selftext": "As I mentioned in my last confession, I present myself as a modest hijabi to everyone. We all know Ramadan is a holy month where sins, like physical relationships or other impure acts, are forbidden, and we’re expected to focus on worship and purity. However, since Ramadan began, I’ve been struggling intensely. I’ve had to fight strong urges every single day. Not a day has passed without me watching explicit content or engaging in dirty talk with my male friends. Just a day before yesterday, I gave in to my desires and met up with a friend. We made out wildly and sloppily, with our bodies touching and pressing against each other. But as soon as I remembered I was fasting, I pushed him away and left. Since then, my urges have been uncontrollable, like they’ve reached the peak of Everest. I apologized to the better part of myself, but today, I couldn’t hold back anymore. My friend (who’s also my ex) and I made a plan, met up, rented a hotel room, and just… we just fucked. And honestly, it was such a relief! I feel guilty because I was fasting during Ramadan, but the release was incredible. He held back for a while, and so did I, but it turned into one of the roughest and most passionate experiences I’ve ever had. I don’t know what people will think of me, and I might face criticism, but I did what I felt I had to do. I couldn’t resist my urges.",
    "subreddit": "confessions",
    "title": "F28 hijabi.. Struggling to hold the urges in the month of ramadhan",
    "upvote_ratio": 0.39,
    "url": "https://www.reddit.com/r/confessions/comments/1j8fnwq/f28_hijabi_struggling_to_hold_the_urges_in_the/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 01:09:52 UTC",
    "id": "1j8exmr",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "This is mainly a vent post, but I'm also curious if anyonelse is in my shoes with this one.\nSo I'm a different nationality than the country I was born and live in, and my parents thought it would be a great idea to give me a rare (nationally specific) name that has no translation to any other language and it's very hard to pronounce if you don't speak the language , and the short version of it sounds weird and funny too. So basicly nobody is ever able to pronounce it right and i had a fair share of bullying while growing up because of it. It also turns any meeting with new people into an awkard situation. Something that should take a few seconds \"hi, i'm x, nice to meet you\" into either them struggling to get it right or, even worse, a whole conversation about the name. I'm an adult now so i don't mind it that much, and i don't meet new people that often, but i think it kind of scarred me, or at least surely added to my introversion and social awkwardness. \nLately i heard again some \"sales advice\" that says to call people by their name because everybody loves to hear their name. Well I don't. Oh and to add to it, my last name is difficult to pronounce too. \nAnybody else with shitty names? ",
    "subreddit": "confessions",
    "title": "I hate my name",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/confessions/comments/1j8exmr/i_hate_my_name/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 01:09:35 UTC",
    "id": "1j8exfj",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "I’ve met a few married women who enjoyed the secretive nature of confide (or telegram etc) for anonymous confessions and sharing. Or just random banter to fill some of the time. I freely admit it’s addictive and sim seeking someone new to share the thrill",
    "subreddit": "confessions",
    "title": "M4F, 40s+, confessions on Confide",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/confessions/comments/1j8exfj/m4f_40s_confessions_on_confide/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 00:39:07 UTC",
    "id": "1j8eal0",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 7,
    "secure_media": null,
    "selftext": "I lied to people that I got the second highest grade in my class. But I regret it now and feel extremely guilty. I’ll never lie about something so stupid like that ever again :(",
    "subreddit": "confessions",
    "title": "I lied about my grade",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/confessions/comments/1j8eal0/i_lied_about_my_grade/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 00:32:49 UTC",
    "id": "1j8e60r",
    "link_flair_text": null,
    "media": null,
    "num_comments": 19,
    "score": 16,
    "secure_media": null,
    "selftext": "I quit drinking August 2020, I had a bad problem and was drunk every night, black out but very functional at work.  Was in the military and just got back from a deployment which is a perfect storm of enabling alcoholism. Everyone drank to stupor and that was the culture.  I go through phases where I don't think about it at all but lately I've been grappling with the idea that I'm ready to \"just have one\". I miss how it helped with my anxiety and I miss sleeping normally. I also miss the social aspect of being at a bar or buying a stranger a drink and bonding late into the night. I never miss the blackouts or the failed relationships or the looks on my kids faces when i was shit faced but I really, really miss drinking right now. ",
    "subreddit": "confessions",
    "title": "I miss drinking so bad",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/confessions/comments/1j8e60r/i_miss_drinking_so_bad/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 00:30:39 UTC",
    "id": "1j8e4f0",
    "link_flair_text": null,
    "media": null,
    "num_comments": 125,
    "score": 1147,
    "secure_media": null,
    "selftext": "This happened 10 years ago, It was my fault, I shouldn't have snapped. It still eats me up from the inside every single day. If I could go back and do things differently, I would in a heartbeat. \n\nTen years ago, when I was 16 years old, this new kid started at school. I was really into Minecraft back then, and he was wearing a Minecraft t-shirt. I didn't have anyone to play with, so I approached him and tried to start a conversation. He was really hesitant and shy at first, but when I asked him about the shirt and complimented it, he lit up. We got to know each other a bit and planned to play together.\n\nWe played together for quite a few times and had fun, but eventually I got bored of the game and went outside with my friends instead. My friends didn't like him, so we never invited him; and that's when he started to get a little clingy, he would constantly keep asking to play and wouldn't take the hint if I said no. He had also asked our friend group if he could play outside with us quite a few times, and I didn't mind him and would have welcomed him, some people in the group didn't want him there, so I went along with it.\n\nHe started following me around a bit later and pestering me quite often. He would follow me around and talk about memes, YouTube videos, and Minecraft, often talking about it nonstop for up to 10 minutes without even giving me a chance to speak.. This kept going on for quite a while, and the whole time, I was getting more and more irritated, yet the more we spoke, the more I was getting irritated. I was too scared to back out of the conversation politely, which led to my irritation building up over time.\n\n*Then I had one bad day, which took away a life.*\n\nOne day, we were at the bus station, and he approached me and started chatting. At one point, all the anger built up over time inside me exploded, and I snapped and I told him:\n\n ***\"Just shut up! I was never your friend; we just played Minecraft together a few times. You are extremely annoying and nobody likes you\"***\n\nThe next day, the teacher sat us down and told us that he had committed suicide, my entire world shattered. I instantly knew that what I said caused this and that I had caused him to commit suicide.\n\nI was invited to the funeral, during which his parents spoke to me and revealed an extremely important detail about him. It turns out he was very autistic and had severe trouble making friends all his life, and he was obsessed with MC. When he met me and we played, he became really happy and wouldn't stop talking to his parents about how he finally made a good friend, they knew me as his best friend. \n\nThis shattered my world, I didn't know he was autistic and considered me his only friend, I didn't realise how important our sessions playing together were for him.  But that doesn't justify what I did, I should have never said that. I still can't play Minecraft after a decade.\n\nToday is the 10th anniversary of his death, and I needed to post his because it should have been me, not him.",
    "subreddit": "confessions",
    "title": "I caused a suicide in high school.",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/confessions/comments/1j8e4f0/i_caused_a_suicide_in_high_school/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 00:16:58 UTC",
    "id": "1j8du3q",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 0,
    "secure_media": null,
    "selftext": "I  suck a lot of cock to please my DaddyDom cause he loves seeing guys cum all over my mouth and tits. Typically, this is done at a sex club through a glory hole or by him inviting strangers to cum on me as he fucks me. I (28F)don't talk to or even really look at any of these men, and my Daddy doesn't entertain small talk with them either, straight to business kinda deal lol. I've lost track of how many cocks I've sucked tbh. But I have kept track of how many loads I've gotten and am currently at 75. Daddy tells me the more loads I take for him the more he loves me. I've currently been debating on how I can celebrate my 100th. Trying to think of some funny and cheesy way to celebrate with my Daddy, or maybe like some kinda #100 token to give to whatever dude delivers the 100th.",
    "subreddit": "confessions",
    "title": "Debating on how to celebrate my 100th load of cum from a stranger",
    "upvote_ratio": 0.15,
    "url": "https://www.reddit.com/r/confessions/comments/1j8du3q/debating_on_how_to_celebrate_my_100th_load_of_cum/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 00:03:54 UTC",
    "id": "1j8dk9j",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 0,
    "secure_media": null,
    "selftext": "Is that ",
    "subreddit": "confessions",
    "title": "I'm straight but i like to show my ass on the internet",
    "upvote_ratio": 0.3,
    "url": "https://www.reddit.com/r/confessions/comments/1j8dk9j/im_straight_but_i_like_to_show_my_ass_on_the/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 23:59:31 UTC",
    "id": "1j8dgpp",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 0,
    "secure_media": null,
    "selftext": "I enjoy getting them so irritated and itching that the membrane of my eyelid(inside) wants to come off…Ive bleed before it was scary but I did like it",
    "subreddit": "confessions",
    "title": "I like doing picking my eyes",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/confessions/comments/1j8dgpp/i_like_doing_picking_my_eyes/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 23:47:39 UTC",
    "id": "1j8d7hn",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 0,
    "secure_media": null,
    "selftext": "I was once talking to a woman I encountered at work tell me a funny story. She was probably 25 and very cute, maybe a little chubby. She was a pizza delivery girl. I asked her what her funniest delivery was. She said a guy who about 40 answered the door completely naked. I asked what she did and she said she just stood there with a big smile on her face. She was laughing as she told me. I asked her if it made her nervous and she said no, she thought it was awesome. He gave her a good tip too. She said she went back to her store and told her boss just to make sure she didn't get in trouble. It made me horny knowing that she actually enjoyed it and wasn't creeped out.",
    "subreddit": "confessions",
    "title": "Pizza girl story made me horny.",
    "upvote_ratio": 0.14,
    "url": "https://www.reddit.com/r/confessions/comments/1j8d7hn/pizza_girl_story_made_me_horny/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 23:25:59 UTC",
    "id": "1j8cqpi",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 0,
    "secure_media": null,
    "selftext": "I’ve always assumed I was straight but recently I shagged a guy. I’ve always been very dominant and into submissive girls. When I was getting changed recently in the gym lockers I noticed this skinny pretty boy kept staring at me. I know that I am blessed downstairs and assumed that he was just looking. Thinking about it got me hard and I didn’t realise that I was then standing there full mast and made eye contact. He clearly took it as an invitation and walked over and grabbed it.\n\nI didn’t know what to do it caught me by surprise but instinctively I just said ‘get in your knees’ he dropped straight away and eagerly used his mouth and for a good minute I just stood there a bit stunned.\n\nAfter a while I realised someone could walk in so I pulled him into the showers. At this point he was grinding up against me and had gotten me so turned on. I didn’t even think and just stuck it in. I then proceeded to have the best sex I’ve ever had. It wasn’t until I finished that I truly thought about what I just did. But afterwards he just gave me a full on kiss thanked me and left. \n\nWalked home in a bit of a daze but then realised that I liked boys too.",
    "subreddit": "confessions",
    "title": "Realised that I’m bi",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/confessions/comments/1j8cqpi/realised_that_im_bi/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 23:21:01 UTC",
    "id": "1j8cmoe",
    "link_flair_text": null,
    "media": null,
    "num_comments": 26,
    "score": 0,
    "secure_media": null,
    "selftext": "I don’t know who else to go to for advice, I’m so utterly ashamed of myself. He initiated it, but I continued and went along with it. At the time I enjoyed it, but a few days have passed and none of us have mentioned anything. I’m genuinely disgusted with my actions, as I am 24 years old, and my brother is almost 19. Even though he’s an adult, I still feel disgusted as I've grown up with him.\n\nI can give context if needed, please let me know your thoughts.",
    "subreddit": "confessions",
    "title": "I committed gay incest.",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/confessions/comments/1j8cmoe/i_committed_gay_incest/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 23:14:16 UTC",
    "id": "1j8ch8j",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "Well, first of all I apologize for my lousy English, I'm using Google Translate and English is not my native language. I don't think this is very interesting either, I might even be a little boring but I really don't have anyone to talk to about this.\n\nWell I met this girl in a class in college and I was immediately attracted to her, she's very pretty and to top it off she's very nice, she's funny and she likes video games. Unfortunately for me, she has a boyfriend and it's obvious that this girl would have a partner, she's that kind of woman that every weird guy would want as a girlfriend. Besides, I'm not a very attractive person, in fact, I think I'm uglier than average, so I shouldn't even think about a relationship or being attracted to her.\n\nThe truth is that this kind of thing happens to me frequently, I like someone but for one reason or another I don't have a chance. I think I'm an incel or something, I don't do well with women and I can understand why. Still, these kinds of situations are very frustrating and at the same time I feel guilty when I'm attracted to someone, because I don't really have something to offer.\n\nToday she looked great, I admit that I am writing this because she was wearing a very low cut blouse and that left me very “shocked”, I can't stop thinking about it. She is a little short in height, voluptuous body,..., she has a nice ass and big breasts, and her hair is red (dyed). I told you she has a very good sense of humor, she's funny and likes video games, she's totally my type.",
    "subreddit": "confessions",
    "title": "I am overly attracted to a classmate",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/confessions/comments/1j8ch8j/i_am_overly_attracted_to_a_classmate/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 23:12:22 UTC",
    "id": "1j8cfpf",
    "link_flair_text": null,
    "media": null,
    "num_comments": 18,
    "score": 0,
    "secure_media": null,
    "selftext": "before anything, i wanna say this happened long ago, and im changed.\n\nsome time ago, i was meeting this girl, i'll be calling her \"claire\". me and claire were both good friends at school before dating, i started liking her, and she started liking me. things were going well, we started dating, and so we started having sex.\n\nafter some time dating her, i started to get bored lf her, and so i cheated, treated her badly, used to ap her in the face for various reasons, etc.\n\nthat's already bad by itself, but it got worse. as i was being an asshole with her, she got obviously sick of having sex with me. and so i forced her. said things like \"if you don't want to have sex w me, why would i even bother to be with you?\", \"that's why i cheat on you\", \"you treat me like a friend\". this kind of talk worked and she continued to have sex with me. although, i'd still do her when she went to sleep. she wouldn't wake up easily, so it was no problem.\n\nafter some time, though, she developed depression, and had to move to somewhere else, because i convinced her to go and falsely accuse her step-dad of r4ping her. she moved away to live with her step-mother but then was sent to a mental hospital due to her suicidal thoughts and failed attempts, consequently, she couldn't give me what i wanted; so i broke up with her. i burned all of her gifts, and pretended she didn't exist for a while.\n\ni know what i did was awful, but i don't think i need therapy, since i know i won't do that again, and this event hasn't changed my mental state anyways. but i want to know if what i did is redeemable in any way, if im a bad person, and if my past defines who i am.",
    "subreddit": "confessions",
    "title": "i abused my girlfriend",
    "upvote_ratio": 0.07,
    "url": "https://www.reddit.com/r/confessions/comments/1j8cfpf/i_abused_my_girlfriend/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 22:26:22 UTC",
    "id": "1j8bbpn",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "Bear with me I'm not good w explaining. \n\nI was out with my group mates form school that said they smoke weed n I wanted too. So when we were all sitting there outside, me watching them roll 2 blunts, I smoked ig half of both cause I wanted it to work more. We didn't have any more water, after some minutes I realized it's gotten brighter but there was no moon. So I got up, walked up the hill looking down at them. Suddenly I got a horrible worst uncomfortable feeling ever as I was entering a bright light standing there in the darkness. When I got out of it they all were on the hill with me but even though it was dark, there was a bright light as a stage projector above the river that apparently only I could see. It was so clear that even the trees had shadows behind them n could see persons faces. Anyway, I started having an uneasy feeling that I kept looking around confused (I'm not used to not being in my head all the time), felt like unending deja vu that I tried to escape so I wouldn't experience that horrible feeling again. Everywhere I looked I looked there before, could hear myself swallowing and people's footsteps. Kept repeating the same words like- this is a nightmare. Was being decisive whether to go towards the light or with them. Tried resisting the spotlight but it was PULLING me like a moth to a flame. Think I went through 5 stages of acceptance or grief and the last stage I accepted that I was in the backrooms and that there's no way out of them so I laid down on the ground hoping I'll get out. They dragged me to lay against a tree where, at the moment I laid down, I couldn't move couldn't feel my body could hear myself swallowing, but still heard them talking and stressing what to do. The 5 minute coma felt like not knowing anything about time anymore, about years. What I was seeing were 📈📉📈 these lines that go up n down all the time like in hospitals and lie detectors, and in my head I thought this what life is, you follow the lines and think. Think so long about living, that you go into and fuse those thoughts and memories so it feels real. Then gained consciousness a little bit and got stood up, tried to think what I did that day to this point so I could snap out of it. Once I was almost out, the light came back into me, when it did, I regained my hearing just like when u wake up and opened my eyes. It was so relieving to be back in my body.\n\nThey said I could've drowned if didn't stop me.\n\nFound out it was marijuana and that it alters your perception of time.\n\nIt couldn't be laced cause everyone smoked and my head had just never been right.\n\nWhat I'm most curious about is the light.",
    "subreddit": "confessions",
    "title": "Might be my ultimate original experience (feat. weed)",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/confessions/comments/1j8bbpn/might_be_my_ultimate_original_experience_feat_weed/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 22:24:31 UTC",
    "id": "1j8ba7r",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 5,
    "secure_media": null,
    "selftext": "I really wish I was hyperfeminine. Like the full works. Blonde hair, pink everything, absurdly pretty. But I grew up on a farm. I'm used to having dirt under my nails. I'm not naturally pretty. I wear boots and hoodies. I honestly just wish I could be skinny and pretty and have pink everything and just be perfect. I feel like it's just not in the cards for me though.",
    "subreddit": "confessions",
    "title": "I really wish I was hyperfeminine sometimes, even thought I don’t act like it",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/confessions/comments/1j8ba7r/i_really_wish_i_was_hyperfeminine_sometimes_even/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 22:22:55 UTC",
    "id": "1j8b8xu",
    "link_flair_text": null,
    "media": null,
    "num_comments": 8,
    "score": 0,
    "secure_media": null,
    "selftext": "Well that escalated quickly 😱",
    "subreddit": "confessions",
    "title": "I used to be addicted 2 watching men touch their huge cocks. Now I’m addicted to seeing them die",
    "upvote_ratio": 0.18,
    "url": "https://www.reddit.com/r/confessions/comments/1j8b8xu/i_used_to_be_addicted_2_watching_men_touch_their/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 22:10:52 UTC",
    "id": "1j8ayxd",
    "link_flair_text": null,
    "media": null,
    "num_comments": 8,
    "score": 13,
    "secure_media": null,
    "selftext": "As the title says. I pride myself on being able to give very concise and easy to follow directions and I love helping people trying to get to their destination. Shame not many people ask for them anymore :( ",
    "subreddit": "confessions",
    "title": "I love being asked for directions",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/confessions/comments/1j8ayxd/i_love_being_asked_for_directions/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 22:03:57 UTC",
    "id": "1j8at75",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 1,
    "secure_media": null,
    "selftext": "My mom has always made it clear as I got older that she wants nothing more than to be a grandmother. I’ve always wanted kids and I truly think I’d be fantastic at raising them. I also know my mom would be the best Nan in the world.\n\nI’m nearing 30, in a dysfunctional space life wise, and medically cannot easily have children. I don’t foresee myself becoming financially stable enough to be able to afford adoption, surrogacy, or other medical aids. I also don’t feel comfortable having a child past the age of 45 for their sake. I feel like my mom is understanding but she’s deeply sad about the situation and so am I. \n\nI feel so guilty for ending the family line or knowing that if I do have children my mother will likely not be around to meet them.",
    "subreddit": "confessions",
    "title": "I’ll probably never have children, it causes me so much pain and guilt",
    "upvote_ratio": 0.57,
    "url": "https://www.reddit.com/r/confessions/comments/1j8at75/ill_probably_never_have_children_it_causes_me_so/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 21:02:07 UTC",
    "id": "1j89bw3",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 2,
    "secure_media": null,
    "selftext": "I was in relationship with a guy and he broke up with me and I did everything you're not supposed to do. I cried, begged, stalked his ex. Finally Ended up in a situationship with him. \n\nI am pretty lonely and don't take risks or do anything that people won't approve of so this secret is killing me from inside. \n\n",
    "subreddit": "confessions",
    "title": "I was in a situationship with my ex and nobody knew about it",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/confessions/comments/1j89bw3/i_was_in_a_situationship_with_my_ex_and_nobody/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 20:44:26 UTC",
    "id": "1j88w9d",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 0,
    "secure_media": null,
    "selftext": "Ambidexterous isn't the exact term because I can't actually do most things like writing with either hand, but anyways...some times when people see me carry my wallet and phone on my left side they assume I'm left handed. The reality is I'm actually right side dominant, and the true reason I use my phone left handed is that I watched concerning amounts of porn when I was in middle school which lead to me developing my left hands proformance for scrolling. As for my wallet, it just feels more natural and it frees up my dominant hand to use my card and type on the pin pad without having to fumble my wallet around, I just hold it in my left hand while I pay and when I'm done it frees up my right hand to grab my items while also putting my wallet back in my pocket.",
    "subreddit": "confessions",
    "title": "Explaining my \"ambidexterous\" hands",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/confessions/comments/1j88w9d/explaining_my_ambidexterous_hands/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 20:08:06 UTC",
    "id": "1j880th",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "THIS IS SO EMBARRASSING PLEASE OMG I JUST NEED TO SAY THIS OR ELSE I WILL DIE INTERNALLY.\n\nI (20F) was with my friend as he went to an open audition for a acting company. The way we got there was via bus...... we both don't have a car. The place where the auditions were being held was in a town I was super unfamiliar with, like SUPER unfamiliar. Anyways, as my friend went into the audition room, I, of course, wasn't allowed in since I wasn't auditioning.. I needed to pee *SO bad.* the closest bathroom was across a MASSIVE FIELD (One of those park field things that have bathrooms on the opposite side),, I speedwalked with a full bladder, only to find out the bathroom had a gate that was locked with a fucking chain and fat lock (it was 12pm on a Thursday????). So I walked back across this massive field, full bladder. THERE IS NO BATHROOM ANYWHERE. NO BUILDINGS. NO FRIENDLY LOOKING HOUSES. I pissed my pants and ended up pulling my pants down to piss against a tree... ass to tree btw........  \nI have never felt so disgusting and shameful in my LIFE. I also, have never peed my pants in public before. I seriously thought I'd be able to hold it in, I've made fun of multiple people for their 'pissing my pants' story, so I guess karma hits hard. After absolutely soaking my pants and shoes, I knew I had to get home ASAP. My phone was dead, and it had BEEN dead for the past DAY. I was staying the week at my friends house and halfway through the week my phone gave up on me, meaning, I was fully dependent  on my friend and *his* phone. I happened to cross paths with a very kind lady (F maybe 26?) and decided to explain how my phone wasn't working and how I didn't know where tf I was. She then invited me into her car and offered to drive me home, I never told her I had pissed my pants. I sat in her car, slowly soaking her car seat in my piss. Oh and guess what, I came home to realize I was on my period. So not only was my piss on her car seat.... my period blood too. I *would* tell you the cover up story I told everyone to protect my shame, but, I'm so scared that they'll somehow see this. I'm so embarrassed.\n\nTLDR;; I pissed my pants in a field/park, located in an area I didn't know. My phone was dead and I had to ask a random lady to take me home, I proceeded to sit in her car with my piss pants whilst she was oblivious of my accident. Came home to find I was on my period. Piss and period blood, embedded into her car seat.\n\nLife Lesson;;; ALWAYS PEE BEFORE YOU LEAVE THE HOUSE. EVEN IF YOU THINK YOU DON'T NEED TO. EVEN. IF. YOU. DON'T. THINK. YOU. NEED. TO.",
    "subreddit": "confessions",
    "title": "pissed my pants and then sat in a strangers car without them knowing my pants were soaked",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/confessions/comments/1j880th/pissed_my_pants_and_then_sat_in_a_strangers_car/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 20:06:05 UTC",
    "id": "1j87z2n",
    "link_flair_text": null,
    "media": null,
    "num_comments": 8,
    "score": 5,
    "secure_media": null,
    "selftext": "Me(30f), fiancé(35m), and I  have the most vanilla sex life ever. I hate it so much. Before I got with him, I was into bondage, praise kink, rough sex, spontaneous sex, and a little bit of pegging. I am up for anything! I’ll try it at least once, lol. When we first got together, it wasn’t that bad. I was able to introduce toy play (only on me) and get him to do some other things. Nothing too crazy for him.  After we had our child, he barely even touches me. We have had sex 4 times in one year, and that was me basically forcing myself on this man. He does nothing. He’s so boring, and it takes everything inside of me to not step out of this relationship to feel another person’s touch to be fucked. \n\nI feel like I am stuck in this relationship. He wanted nothing more than a family, and I don’t want to take that away from him, but my god, do I hate my life. ",
    "subreddit": "confessions",
    "title": "I just need something more",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/confessions/comments/1j87z2n/i_just_need_something_more/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 20:05:25 UTC",
    "id": "1j87yi9",
    "link_flair_text": null,
    "media": null,
    "num_comments": 13,
    "score": 0,
    "secure_media": null,
    "selftext": "I was waiting for her at the job to work on a team project, but she didn't show up. After work, my manager texted me the details and sent me the photos of her face. Her eyes were swollen and blackened. Bruises all over her face and arms. Lips broken, nose cut. It looked like a lawnmower drove over her. \n\nHer asshole gambling husband, who always sponges off of her and steals her money had somehow found out that we were going to a hotel a few towns over.\n\nShe recovered at the hospital, then fled the country with her kids. Since then, I don't shit where I eat.",
    "subreddit": "confessions",
    "title": "Colleague's husband discovered our affair and hospitalized her",
    "upvote_ratio": 0.36,
    "url": "https://www.reddit.com/r/confessions/comments/1j87yi9/colleagues_husband_discovered_our_affair_and/"
  }
]