[
  {
    "postId": "t3_1j7aw9k",
    "title": "i should probably stop talking to my best friend but i cant",
    "content": "my friend might be (by my own definition) a bad person, at the very least they have awful ideals, but im too attached to them to stop being friends with them. i feel like such a fraud to both them and myself.",
    "score": "1",
    "comments": "7"
  },
  {
    "postId": "t3_1j7av98",
    "title": "I don't believe in anything anymore, I don't know what I should believe in anymore.",
    "content": "I come from a very religious family But right now I don't believe in god anymore, The idea of god itself is just doesn't make sense anymore to me and Honestly it never did from the start I was just praying and believing because I was told to do so.But also Atheism doesn't make any sense to me either and I don't know what I should believe in now.Of course my family does not know that and if they did they would probably kick me out of the house.Right now I am in a state of \"I don't know\" and I fucking hate it.",
    "score": "1",
    "comments": "16"
  },
  {
    "postId": "t3_1j74aag",
    "title": "My family spends time with my ex and his family when I’m not around",
    "content": "Any special occasion when I’m not in my hometown, my family will invite my ex boyfriend and his family that I broke up with 2 years ago. I understand my family can still like them but my ex is blocked on all of my social media because he sent me threatening and weird text messages trying to get me back. I’ve set the boundary with my mother and grandmother several times that I will go no contact the next time they hang out with him but guilt pulled me back in. Not this time. I moved 1,000 miles away to get away from them and their bullshit. I have a new boyfriend and it’s extremely disrespectful to me and my relationship to keep my ex around. I feel it’s borderline stalking because him and his family want to hear about my life. I think they’re waiting for an opportunity for him to get me back. I’m so hurt that my family is doing this especially because I’m an only child but I guess I will get more comfortable with my boyfriend’s family. I’ve felt bad that I haven’t been communicating with my family that much since I’ve moved out but the phone works both ways and they’ve been spending more time with people I told them not to spend time with. I feel like inviting my grandma’s ex husband and my dad’s ex wife to their next get together to see how they like it. I don’t know what will make them understand.",
    "score": "3",
    "comments": "0"
  },
  {
    "postId": "t3_1j7abdn",
    "title": "I'm unbearable to work with because of my mental illness",
    "content": "I'm extremely anal about following rules to a tee at work. I've even gone to one of my bosses before to report the fact coworkers won't stop forcing me into their rule-breaking (In all fairness, I tell coworkers I want no part of their rule-breaking antics...yet they force me in anyway. They really have no one to blame but themselves if they get in trouble or fired as a result of me informing my boss)\n\nHere's what my coworkers don't realize though: I'd love nothing more than to let my hair down like they do.\n\nMental illness is the only reason I'm such a stickler about rules.\n\nI can explain. As a result of my severe mental illness, the mere thought of having to work at any other company makes me want to kill myself (I have a hard time adjusting to new workplaces. Plus, I'm extremely picky about which jobs I'm willing to do. That's why I cling to this job like it's gold)\n\nYou see, I'm rigid about rules not because I want to be, but because this job is a matter of literal life or death for me. I feel like I can't afford any sort of blemish on my workplace reputation.\n\nIt's pretty ironic my fixation on having a flawless workplace reputation ends up making me not very likeable to work with.\n\nIs it my coworkers' fault I have such a severe mental illness I'd rather die than get a job elsewhere? Absolutely not.\n\nIt is, however, 100% my coworkers' fault that they pull me into their rule-breaking antics after I've already said no.",
    "score": "1",
    "comments": "0"
  },
  {
    "postId": "t3_1j7if3s",
    "title": "I feel weird about my friend (F35) talking to a 20-year-old she met on a dating app",
    "content": "I just need to get this off my chest because it’s been sitting weird with me. A friend of mine (F35) recently started talking to a 20-year-old she met on a dating app. She insists they’re “just friends” now, but the fact that it started on a dating app doesn’t sit right with me. She even said she feels like they’re on the \"same wavelength,\" which honestly just makes me uncomfortable.\n\nI know they’re both legal adults, but the life experience gap feels huge. At 20, you’re still figuring out so much, while someone in their mid-30s has a completely different level of maturity and perspective. It’s making me rethink my friendship with her, but at the same time, I’m questioning if I’m overreacting.\n\nI don’t know—maybe it’s my own past experiences influencing how I see this, but it just doesn’t feel right. I needed to get this out somewhere.",
    "score": "0",
    "comments": "21"
  },
  {
    "postId": "t3_1j7a7x6",
    "title": "I need therapy, I'm so tired....",
    "content": "I'm so tired...of the debts, these emotions, the fights with my boyfriend and being so afraid for my 10 month old baby daughter's future. We're so behind on our bills, we're in so much debt...we owe so many people money. Our friends, our families....I'm so ashamed to face them, I don't even talk to some of them anymore because I'm so ashamed. I feel so guilty...I want to pay them back but I don't have the means to....whatever little money we get we use to pay for food and our utilities. There's never any extra left. We're stuck in a constant loop of borrowing money to pay for all our debts, and we've been stuck for years...nearly as long as we've been together. We know it has to stop but then how will we pay for things?\n\nWe're constantly looking through job postings and sending out applications, I actually got a response from 1 of them but it doesn't start until April (if I can submit all the requirements, which is proving hard to do because we have no funds for it...it sucks that you need money to make money), my boyfriend hasn't found anything yet, though he reassured me after one of our fights that he is looking at every job posting out there and stepping out of his comfort zone, like I finally did last year. Our fights have mainly been about our relationship (we're like roommates, raising a baby) and money troubles, that usually leads to fighting about his difficulty finding a job. Some days I understand that it's just really hard to find one, also we stayed in one industry for so many years that branching out now is....hard. And some days I doubt that he's actually expanded his options, because I expanded mine and I found one so why can't he?\n\nOur relationship is suffering almost just as much as our finances, it's dying. I'm barely interested in sex, meanwhile being intimate physically is his love language. He's barely interested in other forms of intimacy, which is my love language. We've had so many discussions to try and find a compromise but to no avail. Most days I think our relationship is actually over, I've actually tried to break up with him in the past. A few times before I even got pregnant, a lot while I was pregnant and a few times after our baby was born. All those times tho he's refused, says he wants to keep fighting for our relationship.\n\nI had..or maybe, have really bad post-partum depression, it took me 3 months to even \"like\" my baby. I was depressed and anxious the entire pregnancy, but he was just so....unreliable. Like yeah, he did what he could to make sure I got my check-ups and other needs but he wasn't a good emotional support system, he did the bare minimum is what I would call it. He was feeling a lot of pressure and stress, you could just tell.  I know how this makes him sound but he's not so terrible, just...dense I guess and pessimistic. I also know how this makes me sound but I was working during my pregnancy because we couldn't afford for me to not be working too. We both know that we both definitely should have stepped up when I got pregnant and looked for a better job than the ones we had, but we didn't. We were both scared, and we've regretted it ever since. Because even now that decision is bleeding into our current issues.\n\nI've considered just taking my baby and leaving so my boyfriend and I can get some much needed time apart, to think. But there's nowhere I can  go. I also have like a lot of cats that I don't want to leave him with because that would be an AH move, they're mainly my responsibility not his. And yes I know they add to the expenses but they barely eat anymore because we can't afford to feed them regularly. We've tried to get them adopted but no one here wants rescued stray cats. Most people in our country think they're a waste of time and money...\n\nI know we need therapy, together and separately..but that costs money...and...money is the one thing we just don't have....\n\nThese issues have been weighing so heavily on me for a long time, but as I'm typing it I just feel silly...like these aren't really problems...other people have bigger problems is what my brain is saying. Insecurities I guess....\n\nTLDR; My bf and I are broke, in debt, still looking for jobs, have a baby together, dying relationship, exhausted, fighting all the time and DEFINITELY need some form of therapy...",
    "score": "1",
    "comments": "2"
  },
  {
    "postId": "t3_1j7a757",
    "title": "losing feeling",
    "content": "i 33 female is married to 27 male, we have been together for about 5 years going in 6, married for almost 4 years, april will be our anniversary, i love him sooo much, but i cant help shaking off that we are falling out of love, we dont go out together we dont have date night, we dont have time for us as a couple, the days he has off from work he never wants to spend it with me, like watching movies or just being together, i know we have 2 kids a 15 year old female and 4 year old male, we all go out as a family every week, we always make time for our kids, we love them, they are our everything, but he is not paying attention to me, we had sex, i feel our sex is boring, there is no fun out if it, we just do it to do it, i want couple counseling, but he dosent, he buys me everything i want, anything i can think im tired of having the world handed to me, all i want is his attention love, but i seem not to get it at all, i dont know what else to do, i love him trully, but im getting tired of all this, i dont know if its my depression getting to me, or its him that he dont love me anymore",
    "score": "1",
    "comments": "0"
  },
  {
    "postId": "t3_1j744xg",
    "title": "The Internet is slowly getting less and less fun each day for me",
    "content": "I swear, I've been thinking about going on a digital detox soon because I'm just getting so sick and tired of having to rely on the Internet for everything. Tired of social media and having it take over our lives and shit. Tired of having to see trolls and bots and reposts everywhere I go. I want to be les shy and more extroverted and read books again. I'm tired of having to carry a huge brick around me everywhere I go and would rather just redirect my dopamine releases to engage in social activities and life-fulfilling hobbies and conversate with others. I want to stop pulling all-nighters, prioritize my sleep, practice mindfulness, spend time in nature, manage my stress, regain my focus, minimize pornography and mindless YouTube videos, recharge my body and energize myself by incorporate exercises and eating healthier, implementing self-care (dental and skin) into my life and feel rejuvenated, and surround myself within an environment free of distractions. I've considered downgrading to a flip phone I'm so desperate, as stupid as that choice may sound to some. Like it's easy for people to say \"just uninstall apps you don't need\", but doing so would only temp me to reinstall it soon after.",
    "score": "3",
    "comments": "2"
  },
  {
    "postId": "t3_1j7a13g",
    "title": "I feel like I want to act out...",
    "content": "Idk what's wrong lately. I have been trying to be a good daughter, get good grades, do chores, stay home, not spending parents money, don't pass curfew, interact, talk, always tell them where I am, no boyfriends, etc.\n\nBeing a good daughter isn't enough. So I gave them money hoping that would spend it to ease themselves. But I guess that isn't working either.\n\nParents.They obviously don't like each other, has been almost a year since they slept in the same bed. And said nasty things about each other within my, very obvious, ear shot.\n\nI can't take sides, because I understand both sides. Which is stupid, why am I like this. Always sympathetic.\n\nWas divorce ever an option in their mind? Am I cruel for this narrow suggestion?\n\nTheir comments, I can't help it. It's driving me crazy. What do you mean by, \"I don't know how long can I sleep.\" as I talk about getting the house a new couch. A sofa bed, to replace the broken one and to improve sleeping arrangements as things are obviously not changing. Is it the finance to afford it? You're not paying, but I'm! I'm trying to make a change, I'm putting my wants on hold. My needs too!\n\n\"Good, quickly finish your course. I'm tired.\" I know what it means and I'm in denial. What. Are you timing it? To just dramatically out after my Diploma?? Am I not doing enough? Am I not enough of reason to make you stay?\n\nI gave it all. I listen when you told me not to look for a job. To just stay home and watch the house. For a year. I missed out on experiences.\n\nI gave you all of my leftovers money, granted by the scholarship. What was supposed to be mine and yet I gave it all to you as you vented financial frustration.\n\nWhat if I act out. What if don't care and just stay out late and come back late? What if I don't come home for the night as I try to get high somewhere with someone? Will that give you a sense of purpose? A reason to hold conversation with one another?\n\nAm in my 20s. I have yet to know life beyond books, education and grades. While you. You had it all. Travels, partners, jobs, income, big decisions, all the adult experiences.\n\nAm I selfish? Are you selfish?",
    "score": "1",
    "comments": "0"
  },
  {
    "postId": "t3_1j79fof",
    "title": "I'm a bad person I think",
    "content": "I'm using an ALT account because if I was ever discovered I think Id just die. I have been cheating on my girlfriend. There was this girl I meant while on a trip to Italy and we lost it for each other but I love my girlfriend she is my everything she has brought me so far every single time I think about this other girl I feel so much guilt and so much infatuation. I know I'm a bad person for this I know I'm horrid. If I ever admitted this to her I would lose her and I can't bear that. I don't know what to do.",
    "score": "0",
    "comments": "3"
  },
  {
    "postId": "t3_1j7ee5a",
    "title": "I'm a content creator known by many as a woman but I'm starting to realize I'm a trans man.",
    "content": "5 years of content creation now. I guess my most impressive metric is 50000 YouTube subs. I am not massive but I have a community that I could never leave behind.\n\nI also have another job - sometimes people assume once I say I'm a content creator that it's my only source of income. I think people overestimate the money content creators make. Even with 50000 subs, your barely be making enough for rent and maybe food.\n\nI'm known for being the woman of my streaming group, which is predominantly men. I get targeted with a lot of female-oriented questions during streams - sometimes sexist jokes but usually stuff like \"Hey, X, you're a girl so is it true women feel X on their period?\" - just as an example.\n\nI started streaming when I was 19. I'm 24 now. In these last five years, I've learned a lot about myself. Including that I have simply never truly felt like a woman. It's always felt like a costume and a role. I've reached more self awareness and understanding of myself and I know for certain, I am not a woman. Mentally, at least.\n\nI don't know what to do. I know the most important thing is \"to thine own self be true.\"\n\nBut I kinda wish I could transition and continue to play the role I've had in my group. Part of me revels in the thought of just being \"one of the dudes,\" but I know it would never be that easy. I know it will be awkward. I know that I will be misgendered and mocked. I know that there will be people in my community who are supportive but I know there will be many who are not.\n\nI am losing my whole identity, as a person and as a member of my group. I am scared to change the dynamic of our streaming group. I am scared to admit I am trans and find out that there may be people in my streaming group or my community who will not take this reveal kindly. I am scared of all the jokes and commentary that will be made.\n\nI am just scared, uncertain, and shaky. My husband has been a rock at this time, but I'm even afraid of losing him in transitioning.\n\nThanks for listening.",
    "score": "0",
    "comments": "4"
  },
  {
    "postId": "t3_1j75dyd",
    "title": "I love her",
    "content": "All my friends and family tell me I need to get out of this relationship.\n\nI know I do too.\n\nI feel like I've aged a decade in just a year.\n\nMy girlfriend has been battling mental health issues her entire life.  And no, not some mild case of anxiety or whatever.\n\nAn actually very serious mental health that is debilitating and she can't hold down a job, and is in and out of the mental hospital...\n\nWhen things are good... they're amazing.  Our first 6 months together was incredible.  I fell madly in love with her.  But since then.......... she had a trigger and it's been downhill for the past 8 months.\n\nShe was in an episode and assaulted someone.  She was arrested then locked in a mental health hospital for a month.  She got out and she was in a really bad mental state.  She lost her job, which caused her to spiral and do drugs, then a week later... she was back in the hospital.\n\nWhen she's having her episodes, she doesn't remember who I am and is extremely aggressive.  i don't think I've been to the police and hospital more times in my life than I have in the past couple months.\n\nI'm at a point where I'm going broke from constantly taking off work and driving and staying in a hotel near the hospital and helping her with her rent/bills after she lost her job.\n\nI'm exhausted.\n\nI don't want to leave her.  I do love her.  And she's incredible when she's fine.  But......... she's not fine.  She is seriously two COMPLETELY different people, night and day.  When she's fine, she's incredibly smart, chill, honest, sweet.  She's probably the most laid back person I know\n\nBut when she's having episodes... it's....... bad.  Again, aggressive and violent.  It's scary how she completely changes.\n\nI want to help her and take care of her but I really don't know how without destroying my own life.....",
    "score": "2",
    "comments": "0"
  },
  {
    "postId": "t3_1j796vy",
    "title": "I fear any possible future relationships for 1 particular reason.",
    "content": "I'm in my early 20s, and I've technically only had 2 relationships. I say technically because the first was so on-off that it didn't even count as one, plus she ended up cheating.\n\nBut what I've noticed since the that one is that I tend to be overcaring, sometimes clingy and think about whoever I have feelings for constantly, as if an image of her is burned into my mind no matter where I look or even if my eyes are closed.\n\nI've been through some brutal ones where a girl I met at university (a mate's mate but single) was so unbelievably beautiful, funny, well-mannered and smart that it was painful to keep thinking about her until I asked her out but she polited declined.\n\nThe other relationship was when I met an American girl studying here who actually liked me for who I am which was a surprise considering I believe myself to be the equivalent of Rocky Dennis in terms of looks, but with the way I was around and to her I realise now I was too overcaring right at the start treating her as an already long term girlfriend when we just started dating for 2 days.\n\nAnd then, after a while of dating she tells me something resulting in a glorious stab in the heart where she quite literally said \"over these past few weeks dating you has made me realise I miss my ex\" and proceeded to fly back to Murica (reddit won't let me say it properly for some reason) THE NEXT DAMN WEEK FFS so naturally I crashed out and drank a lot.\n\nSo referring to the title of this the one main thing as to why I don't want a relationship is that I don't want to lose her, ruin her life or make her detest me because of how I am with overcaring. I hate it but better to stay alone than to ruin someone's life.\n\nAnd for those of you who say work on changing yourself, trust me I've tried but it's pretty hard when you have little experience in the dating scene because you look like a damn goblin from clash of clans.",
    "score": "0",
    "comments": "0"
  },
  {
    "postId": "t3_1j5rl29",
    "title": "I feel like my boyfriend’s sex doll",
    "content": "My boyfriends of a year is only my 3rd sexual partner. When we met he told me he hated getting oral but loved giving it.\n\nWhen we first started having sex it was really good. I was worried he told me he was a porn addict previously but the sex was very focused on my pleasure and I was pleased.  I did try to give him oral but he would stop it after a couple of minutes and move on to me. During those attempts I could tell what he didn’t like and did so I stopped doing the things he didn’t enjoy when I would go down.\n\nAbout a month into sex he one day pulled my hair and started face fucking me. After he asked me if I liked having him control me when down there or if I preferred being in control. I told him I was really uncomfortable being held down there and I was really uncomfortable being face fucked. He claimed he liked me being in control.\n\nLast 2 months or so sex has completely shifted. He hasn’t gone down on me. I feel like a rag doll he uses. He grabs my legs and moves me where he wants me and grabs my head and pushes me into giving him oral often while holding me down there.\n\nThen last weekend happened.  I said I wanted to try anal but have been scared. We tried it once before but it hurt and I cried out and he stopped. It wasn’t off the table to try again.\n\nHe woke me in the middle of the night while I was asleep on my side by entering me from behind (on his side too). It felt good and he and I have an agreement to “wake up sex” when we spend the night together even middle of the night.\n\nA few minutes in he pulls out and aims at my ass. He pushed in a little I cried out and pulled away (no lube used and he has a big dick).  He put his hand over my mouth and grabbed my waist and pulled me hard back onto his cock. I started crying from the pain but he just held me there while he finished with his hand on my mouth. When he was done I told him it hurt and all he said was I never said no and rolled over and went to sleep. Then he woke me up again a few hours later and repeated the whole thing so I was super sore and have been since.\n\nI love him but I don’t love feeling like his sex toy.\n\nEdit:\n\nI’m sitting here crying. I felt used but never really thought about the fact I was violated. I grew up in an abusive household and sometimes boundaries and normal things don’t feel normal and abuse and bad things do.  I’ve been really emotionally numb to this all and I guess I needed a wake up call to see this isn’t okay behavior.",
    "score": "6393",
    "comments": "947"
  },
  {
    "postId": "t3_1j6t5fl",
    "title": "Emotional cheating?",
    "content": "My boyfriend and I have been together for 3months. Before we met he met a girl from a dating app; when we first met then he texted her information about us. Sometimes during dates he would text her constantly and tell me that she is lovey dovey with him saying “thank you for being the brother I never had.” She rejected him from dating app but suggested they be friends. I didn’t say anything initially but as we started getting serious I asked him to delete and stop talking to her. And he did. Fast forward to now, we have had some issues and almost broke up a couple of times.\n\nSome examples of problems include but not limited to incidences when we talk about the future plan and type of children we would have, he says they would have “chinky eyes” because it is a dominant gene. Or when I’m driving he always says “they are probably thinking why is that Chinese driving so terribly.” (I’m not even of Chinese descent btw). Or when I'm going to work and wearing a mask because I didn't want to get others sick, he would say that they would think “that Chinese is spreading covid” when confronted, he would say that he is only saying what the general population is thinking, and I shouldn't take it personally.\n\nRecently, I found that she texted him and they have been referring me as “chinita” (I’m Asian descent and they are Hispanic. Then they would talk about relationship life and sex life, as well as how her mother is doing (she is ill).\n\nWhen I confronted him why he kept saying “I don’t know why I texted back” and that there is nothing going on that is flirtatious. He is now crying profusely apologizing saying he loves me.\n\nIs this emotional cheating?\n\nUpdate 1: he keeps saying “I can’t lose you ur the love of my life I blocked her, and ur my wife”\n\nUpdate 2: he threatened to take his own life when I tried breaking up with him.",
    "score": "17",
    "comments": "27"
  },
  {
    "postId": "t3_1j6z9id",
    "title": "General depression post I suppose (28m)",
    "content": "Hey, Team! I've been feeling super duper down in the dumps lately and want to vent serious style without fear of personal societal repercussions! This is a throw away account n such. Not really curating this post just typing about whatever comes to mind.\n\nI've never really been the happiest of people. Even in my youth I remember being melancholic more than not. Didn't have the best upbringing (not the worst by a long shot either). My parents fought with each other all the time if I didn't have someone over. I remember hiding in my room hearing them arguing downstairs hoping against hope it wouldn't lead into my room with them competing for my favoritism. There were times either my mom or dad would try to drag me out of the house to stay at a hotel with them because the other parent was \"crazy and untrustworthy\". Events like this were common place (once or twice a month) in the house up until I was around 14 when it all kinda just died out. My parents stopped fighting daily, maybe once a month or so until not at all. They never even acknowledge the horrors they would put me through. They just tell me it wasn't as bad as I think but it totally fucking was. It was hell, not to mention how often they would remind me how abnormal of a human I am.\n\nI've been diagnosed either adhd and I highly suspect I have high-functioning autism. I never really managed to fit in around others as a kid, often doing things my own way. Friends were hard and socializing was harder. My parents would try with all their might to assimilate me into \"normal\" behavior. My mom didn't let me shop for my own clothes until I left the house. I bought some shirts with some cats on them with one of my first paychecks (maybe 16 yrs old). She took and hid them from me because she was afraid people would \"think I'm girly, or gay\" which blew my mind. My dad wasn't the most supportive of my interests either. I recall a time when i was in grade school I really liked filming and doing stop motion Lego things.. I probably just caught him at a bad time (wasn't very many good times).. forgot what I asked but I remember his reply was along the lines of \"it doesn't matter anyway, it won't go anywhere\" in regards to my short-lived hobby. I don't think I picked up that camera again after that. I wish I did. Can't blame myself there i guess.. I was young and impressionable.. I wonder often how things play out if he never said those words. Probably not much different but maybe..  instead I just spent most of my time online, hiding behind headphones blocking out the screaming.\n\nDidn't have many friends growing up. I'd typically just pick one person I liked and puppy dog around them. I was pretty shy and often to target of harassment from some of the meaner kids in school. I got used to being the butt of jokes and such pretty early. It didn't bother me much but it definitely scared me off from trying to form connections. That said I managed enough. I had a lunch table to sit at most of the time. I wasn't usually the star attraction but the folks there didn't seem to mind my presence. I recall once I didn't really feel comfortable sitting at any table so I sat at an empty one. This prompted the principal to come over and with good intentions have me sit at a table with a bunch of strangers I didn't really know. Horrifying experience. That said, I didn't really spend too much time hanging out with friends irl. I unfortunely found connections on the world wide web..\n\nDespite how strict my parents could be they let me have unfiltered internet access from the very get go when i got my first laptop at 12 or so. They never monitored my activity, or set restrictions on screen time or anything. Long-story short I end up in some unsavory online spaces. I met people who at the time I thought were nice friends, parental figures, people to talk to when I didn't have parents I could. It wasn't until a bit later in my life I realized how groomed I got. I never thought much about it at the time. It seemed like people finally enjoyed my company, wanted to invite me to chat and stuff. I didn't see the harm at the time at all. Just some text-based roleplays, maybe a picture or two without my face. Whags the harm? Now in my adulthood I feel like I'm able to see the effects more. My libido is so high yet the thinking about sex makes me extremely uncomfortable in a way that's hard to describe. I get jealous, disgusted, confused, lustful, etc etc etc whenever I see or am reminded of the mere concept of penetration. What's worse is I think it's effected my love language too. I feel I have a really difficult time feeling like I'm showing I love someone if I'm not having sex relatively often. I doubt myself, and if I'm able to provide and be a good partner. I know there's so much more to a relationship but my brain always defaults back to thoughts along these lines. I hate it but the nature of the issue causes me to love it. Its such a conflicting mess of sexual frustration. I have no idea how to do a segway here so... :3\n\nAnxiety is a big thing in my life. It wasn't so bad when I was younger, mostly manifesting in social anxiety around new people or crowds. Nowadays I sometimes feel anxious just leaving my apartment. Going to the store is a massive panic attack and I have no reasons why. I desperately want to put myself out there, meet new people and enjoy this life I have but the exhaustion from the anxiety and depression just constantly kick my dick straight into the dirt.\n\nDepression is the worst. It's only gotten worse since I broke up with my seven year long partner (we were engaged too at the time). The break up is a long story with no heroes and only villains and victims. I don't want to dive into it here. I'm a bastard, theyre a bastard. Point is I'm a total bastard livid with regret over such minute details. I miss my ex... I care about them... but I don't trust them anymore and I loathe the mere memory of them. It's such a dissonance... I can't think back to the early days and not wonder if any of it was real at all. I'm sure there was true love between us sometime... I wonder when we lost it, and I fear they mightve never felt love for me like I did for them. We were young when we met. Stupid too, probably. Grew up and got distant yadayada... happens.. I still miss them.. their quirks and such. The way they talked and the way they ate. Even the things that annoyed me I miss... its wild how much I miss the things that pissed me off...\n\nAnyway, this post is going a bit long. It's bedtime for me. Thanks for reading my cool, epic post. Might post more vents like this.",
    "score": "6",
    "comments": "0"
  },
  {
    "postId": "t3_1j77mhi",
    "title": "Was sent to the hospital for trying to end my life leaving me with more problems.",
    "content": "I honestly don't know what else to say..i was supposed to die..i cant live on anymore and i wish the people who found me never had to send me there and fend for my own to leave me to pay my bills when im already having problems financially which is one of the many reasons why i wanted to end my life. im really tired and i just wish this nightmare will end..",
    "score": "1",
    "comments": "3"
  },
  {
    "postId": "t3_1j746t9",
    "title": "I (20M) have no clue what I’m doing with my life and I have no one to talk to about this, im desperate and lonely and frankly tired. I somehow wish I was living any other existence.",
    "content": "Let me start off by listing a few factors:\n\nI have terrible terrible insomnia. I can’t remember the last time I fell asleep before 4 AM. It doesn’t matter how exhausted I am, I end up getting most of my sleep in between classes.\n\nI’m in an expensive university in a first-world country, my tuition is being paid for by my rich parents. This comes with a weird kind of pressure. It’s like I’m living someone else’s dream.\n\nI have no idea if my university is worth it. The more time I spend here, the more I wonder if this place is actually good or if it’s just an overpriced scam for ppl who couldn’t get into A list schools, especially for an English degree? Idfk\n\nI have no friends. I’m extremely shy, and socializing feels like an impossible task, I had a girlfriend through most of my first year here who I met early but she left me out of boredom and since my entire social group consisted of her friends (since she grew up here) im now a extreme loner. I barely ever leave the house unless I have to go to class.\n\n(No seriously how tf do I come from a family with so many degrees in prestigious top 100 universities and end up in this niche hellhole? Its mind boggling to me.)\n\nIt is completely meaningless to me. I do not really learn anything, all I do is put the bare minimum effort in my classes to pass because they’re all extremely contrived. Instead of helping me develop knowledge and useful skills, it is making me extremely stressed, unconcentrated, feel empty, like I'm losing my identity and living the most meaningless life there is.\n\nI was homeschooled for most of HS, I hated it but being here is honestly making me wish I could turn back time because at least I had my parents to talk to all the time and not over the phone? now it’s a different type of lonely.\n\nSo what am I gonna do with my life? I have no clue. Anyways its 6:35 by the time im done posting this and still no sign of any tiredness.",
    "score": "2",
    "comments": "5"
  },
  {
    "postId": "t3_1j77a87",
    "title": "I live in an aviary",
    "content": "I recently moved into a house with some trees and shit in the backyard. When I tell you… I never knew or could have guessed how annoying and disruptive BIRDS could be. It is all kinds of bird sounds every single morning and it is LOUD. Our bedroom window is right next to a thick line of trees and it’s driving me insane.\n\nI was woken up at 6am, as i am every day, by birds. They hoot and holler for hours on end every morning before the sun is up. I don’t know how tf i’m supposed to get used to this, it’s been months as it is. My first thought upon waking shouldn’t be how bad i wanna shoot every damn bird in my backyard. I’m 27 and I don’t think i’ve ever heard birds make so much fucking noise.",
    "score": "1",
    "comments": "3"
  },
  {
    "postId": "t3_1j726r7",
    "title": "My mom acts like a child",
    "content": "My mom acts like a kid when she's sick... I'm currently argued with my mom, she's sick right now (bed sick) she can't get up, has a high fever etc. Anyway today I was looking for my cat and she was in my moms room, I was minding my own business getting my cat telling her she could get sick so I'll take her. She made a comment that is still bothering me, \"oh so you care more about the cat, but not about me, ok\", \"I'm sick and you don't bother checking in on me\".\n\nFor context my mom and I... we don't have the best relationship, growing up she was never the most loving, kind towards me, it was a very toxic environment, It is a lot better now compared to how she was before tho. Anyway, I really hate it when she says stupid shit like this, is not the first time. When I'm fkn sick, dying sick, she's not there for me, she's not the type to go out of her way to get me medicine, or make me a warm soup... I'm not the fkn mom, I'm in my 20s but to this day, at my grown age, it would be nice to have or feel the love of a pampering mother specially when you're sick.\n\nI got so mad I wanted to tell her off, \"why would you expect that from me? If I haven't experienced that myself?\" \"Do you think im your mother or something?\" \"What you sow you reap\"... so many things, but I kept my cool, \"yeah i do care a lot about my cat\" is all i said and went about my day.\n\nIt made me even more mad, because I am also fkn sick, I have a bad stomach bug that has been going on for 4 days now, and guess what??? She hasn't done sht for me, hasn't asked how I've been if I'm better or what... \"probably something you ate\" is all she said when I first told her, and off to work I went. Didn't bother to check in, didn't bother to ask how I was doing, if she could make me something to help me... and she has the audacity to say that sht to me?... and guess what, im hating myself for this but here goes.\n\nThe day before, she went to work fkn sick when I had told her the night before not to, because she was literally dying with a high fever. She still goes cause she's a workaholic, Anyway, it's 2pm and I see i have a missing call from this woman, I was showering getting ready to go out with my boyfriend. I call back i asked her what does she need, she tell me to go pick her up because she can't drive back home, that she feels weak... i tell her why I didn't answer when she called, this is what she says \"why didn't you shower earlier, you need to be more attentive\".... wtf??? Why would I pause my day for her? Does she want me to just sit there and wait around for her to get home or call me and finally function, for her? Wtf.\n\nLong story short, I call my boyfriend and let him know what happend, he ended up giving me a ride. So we rushed to get ready he ended up givin me a ride to her work place to pick her up and drive her back home. On the way back, she just kept going on about, why didn't I answer when she called, why am I not paying attention, why was I still sleeping late... I don't fkn know maybe cause I'm also sick and fkn tired from work???? No a thank you to me or my boyfriend, nothing.\n\nI did that sht just for her to be telling me \"you care more about the cat than me\"... but she's right, I don't care as much about her than i do about my cat, I don't love her, but I don't hate her, I see her as the person that gave birth to me, which gives her the mother title, but she is no mother to me emotionally.\n\nAnyway, i wanted to get this sht off my chest, so thank you of you took the time to read this! Have a good night 👍🏻",
    "score": "3",
    "comments": "0"
  },
  {
    "postId": "t3_1j6sqct",
    "title": "I don’t think I actually want a dream job",
    "content": "People always say to “find a job you love” but honestly I think I just want a job that pays the bills and lets me enjoy my life outside of work. I don’t want to be obsessed with my career. I don’t want my identity to be tied to what I do for money. I just want to work, go home, and not think about it.\n\nIs that really so bad?",
    "score": "15",
    "comments": "9"
  },
  {
    "postId": "t3_1j777at",
    "title": "I feel so stupid for how bad my finances have gotten",
    "content": "As title says, I (25m) feel dumb for how bad me and my partner have handled our money. We've been living in the same place for about 3 years and we were pretty fine for the first 2 but this last year we have just made every dumb decision possible with our money and now we are majorly behind on rent for the second time and I have no idea what to do. I used to work long hours with decent pay, but quit for mental health. When I did have money i burned through it. When I started making less, I didn't adjust and kept burning through it. First time we were behind, it was by about 3k and eventually we paid it. Now we're about 1500 behind and as I'm working still for very little, I don't really have a way to catch up quick and since it's the second time, our landlord whose kind of just a buddy wants us to pay by a certain date or leave (fair). Definitely don't have money to move, definitely can't catch up just by working the way i am. Deeply scared to try and go back to working long hours. I have no formal training or schooling. Definitely have analyzed the past few years and have realized I'm mentally ill and unmedicated. It's also so hard for me to get my head together because I feel like the country is going to shit and it feels so useless to try to do anything. I also recently stopped talking to my parents which was a good decision, but I didn't realize how much of a toll that would take on me. I just feel so stupid about everything.",
    "score": "1",
    "comments": "1"
  },
  {
    "postId": "t3_1j6tmay",
    "title": "I feel guilty that I miss having cancer",
    "content": "So I was diagnosed with Ovarian cancer in 2009. My life was pretty boring and the recession had just happened and couldn't seem to find a good job and I still lived at home. Boom I get cancer, such a surreal thing to have happen to you when you are a young adult out of college trying to make your way. Everyone and I mean EVERYONE came out of the woodwork giving me stuff, loving on me, etc and I adored staying in the hospital because I felt safe, taken care of, and honestly, other than the psychological stuff (losing all my hair) once I had the first surgery I wasn't in that much pain, tolerated chemo well, etc. I am in the middle after almost 16 years possibly facing the C word again but it isn't a for sure thing as there are other possibilities for my symptoms. I have seen my mother waste away and die from it so it isn't the cancer I want it is the break from life the permission to just be without guilt, time to bingewatch and get caught up on reading etc. Am I a bad person? I don't have Munchousens I would never do something to myself or fake an illness or even worse make someone else sick (by proxy) I just really need a break from life.",
    "score": "13",
    "comments": "3"
  },
  {
    "postId": "t3_1j73pe0",
    "title": "I (24F) am going on a proper blind date tomorrow night and I genuinely don’t know how to feel about it.",
    "content": "Hello there. This is my first Reddit post so please bear with me.\n\nA couple of days ago I received this text from my mom, “Hi. I am at the nail salon with Susan. She knows of a young eligible bachelor with an affinity for Lord of the rings who really would like to date a nice young lady. We’re setting you up on a blind date.” A minute later she texted me with more personal details about him that would possibly be of interest to me like his career and degree which are both awesome.\n\nSome context: I am a massive nerd who has struggled with dating for quite a while now. I know being 24 lends itself to the thought that “a while” is an exaggeration but, when you’re a hopeless romantic, I promise it’s not. I’ve been in two serious relationships that both weren’t great. The first was with an emotionally manipulative and hateful guy, the other with a guy who thought hiding insults behind the guise of jokes was hilarious (including calling me chubby and saying I have a mustache). Beyond them, I’ve gone on a few first dates with guys and girls from dating apps that have all panned out to be quite awful and many of them have said I was “too much” or “a lot” or have just ghosted me.\n\nI will say, I do have quite a big personality and a lot to say which can feel really intense to people. Especially if they’re just looking for a hookup which I never have. I’m also awful at flirting because I’m just a dorky lady who truly has no concept of that. For gods sake I have two Lord of the Rings swords on either said of my bed. I’m always thoroughly myself which I know can be a lot for some people but I stopped apologizing for that or letting people make me feel bad about it. It also goes without saying that I’ve matured quite a bit throughout the 6 years of being in the adult dating world. I digress.\n\nBack to the topic at hand. I called my mom to ask what was even happening and if she really was setting me up on a blind date. She made clear that this was indeed happening whether I liked it or not. My mom can be quite the character and since she quit teaching a year ago I think it’s given her more time to think about the future including her kids’. I am one of four siblings but I’m the only one who is 100% about wanting to settle down and have a family someday. Granted, my little sister is 12 so she still has time. Anyways, my mom and I chatted for quite a while about how this all happened and how she was talking about my genuine struggles but eagerness to find a life partner. My aunt Susan thought of a family friend of hers whose son has had much of the same issues I have had with dating. And how actually great we would get along, largely because of many common interests as well as being huge romantics and finding that hard to express amongst the modern dating scene.\n\nSo after finagling some of the details, Sunday night I’m going to be having dinner with him at a local pizza place. I’m incredibly nervous for a few reasons. One, our parents have made sure we didn’t get each others numbers beforehand so we are genuinely meeting for the first time with little context, that way we can be more genuine without too much of a vision of each other in our heads. Two, literally there’s no vision of each other because we have also both not been shown what the other looks like so we keep from making judgements too quickly like on dating apps. Although, my mom assured me she would never set me up with a guy she didn’t think was at least a little handsome. And three, this all terrifies me because I have awful anticipatory anxiety as well as a lack of control over my facial expressions. Meaning I don’t know who I’ll be looking for which I’m sure my mom will help me clarify before I get there. But it also means if I don’t find him attractive off the bat, he will likely know right away. I’m not too worried about that as much as how I nervous talk which is why many dates have found me to be a handful. At the same time, whomever I spend my life with is going to have to love that I’m, as my sister coined it, “a professional yapper.”\n\nI guess I’m just feeling very anxious due to the fact that I really get my hopes up before every date but I always feel like I tend to ruin them because I talk so much. I also have a sense of anxiety because I truly know nothing going into this except we have a lot of common ground and that he can be a talker too. All of this also excites me in a way because it would make for a great story whether it does work out or not. I’m really posting here because I don’t know who else to throw up my anxiety on because I’ve spent three days now pondering about how this is going to go. I guess I just need a vote of confidence and maybe some preemptive first date advice because I’m a little rusty (been 7 months since I’ve been on a date). Any advice would be greatly appreciated.",
    "score": "2",
    "comments": "0"
  },
  {
    "postId": "t3_1j7jc97",
    "title": "I don’t pay for can pet food or otc medicine.",
    "content": "I’ll pay for human food because as a human I always come first before my cat, but with raising grocery cost I have completely stopped paying for can cat food. Yup it goes straight to my pockets same with otc medicine straight to my pockets. It’s the only 2 things I justify doing a 5 finger discount for. I’m 25 and live on my own. I’m not paying for cat food for if I can’t afford to feed myself somedays…but I won’t let my poor cat starve either. With all the stray cats outside in my neighborhood I’m feel like I’m doing something good by at least feeding my own cat that my mother gave to me recently. I didn’t realize how expensive a cat was. I wanted a cat but i was gonna adopt when when I could afford one, getting one as a gift was unexpected but I love my boy, he’s like my child would you let your son starve?\n\nI also don’t pay for medicine if I don’t have too lol because I’m the name of Luigi medicine should be free!",
    "score": "0",
    "comments": "1"
  },
  {
    "postId": "t3_1j6z0ce",
    "title": "I feel like my cat doesn’t like me",
    "content": "I adopted my cat back in September last year. She’s about 3, an absolute sweetheart, and loves to play, but lately I’ve felt like she hasn’t taken much of a liking to me. I don’t know what’s wrong.\n\nShe’s in my roommate’s room all the time. My bedroom is on the first floor, 4 roommates are upstairs (I have 5 roommates total). Unless she’s meowing at me to feed her, she’s up there. I hardly even see her much around the house anymore, and she doesn’t sleep on my bed with me like she used to. She’s always up there with one of my roommates.\n\nI play with her a lot, give her attention and treats, brush her and clip her nails, everything, but she still prefers my roommate over me.\n\nThis is probably a really silly thing to be sad about because at the end of the day she is still my cat, but I want to have a better bond with her and I don’t know what I could be doing wrong.\n\nFor the first couple months, she would always greet me at the door meowing and rubbing against my legs, sleep on my bed with me while purring like a train, all that good stuff.\n\nBut now she doesn’t anymore. Gradually less and less, staying upstairs and hardly coming near me. It’s feeling more like she’s my roommate’s cat now.\n\nI’m just repeating myself now, but I don’t know what to do.",
    "score": "5",
    "comments": "4"
  },
  {
    "postId": "t3_1j73hth",
    "title": "The nightmare was the final straw.",
    "content": "Me and my girlfriend have been having a lot of issues and this was the one I wanted to marry. But its gotten so bad that I don't have any energy left to give.\n\nLast night I had the most gut renching dream about her cheating on me and what made it so brutal is that in the dream when I confronted her about it...she used all the same conversational and argument tactics she does IRL. Avoiding the question, gaslighting me, talking over me when I tried to speak, flipping it around on me, trying to exit the conversation after saying her part only, not listening, insulting me, constant non-sequiturs, raising her voice to stop me from saying my part, saying everything I had to say was bullshit....I felt so voiceless. I wanted to demolish everything around me and then I woke up.\n\nSome people would say I should talk to my partner about this...but the issue is that the fundamental communication skills or at least the intellectual honesty to have a real conversation isn't there...I literally can't trust her words.\n\nI haven't had a nightmare like this in a long time but for those who believe in the other...there was a black cat in my dream (I have some gypsy in me) and I had it in the morning (I'm a Hindu).\n\nWhen I woke up...I was so fucking gutpunched and sick-feeling, that I realised this was the last straw. This nightmare has shown me the core issue which is that she cannot be trusted.\n\nIf I ever had to suspect her of cheating....the next level degree of how untrustworthy her mode of communication is...would leave me completely unsure forever.\n\nTrust is all. Communicatìon is all.",
    "score": "2",
    "comments": "0"
  },
  {
    "postId": "t3_1j6d14d",
    "title": "I don't feel sad my parents died and I'm tired of how weird people act about it",
    "content": "Tldr: I don't care my parents died and people act weird about it.\n\nMy parents died while I was growing up. Painful deaths and I recognize how horrible that probably was for them if they where conscious for all of it. I don't really feel anything past that anymore. I know that sounds like \"edge lord\" shit but I don't mean it in an edgy way. I cried my whole childhood for them and as an adult I just can't care anymore. It's simply a fact but when people find out they always say the same shit and it's so annoying and then they act like I'm weird when I say it's been awhile I'm passed it. Like dude am I supposed to grieve them my whole life? Am I supposed to pretend it's a sore subject?  Plus they always ask how and then get really weird about the answer. Like bitch you asked! Don't ask if you don't want an answer.",
    "score": "164",
    "comments": "23"
  },
  {
    "postId": "t3_1j67rm0",
    "title": "I overheard my boyfriend’s brother talking to his mistress about leaving his pregnant wife",
    "content": "I’ve been in a bit of a rut and when I finally decided to leave the damn house I went to my boyfriends little family gathering his mom was hosting. I’ll skip to the damn point.\n\nI was having drinks with my boyfriend and we both overheard a conversation between his brother and some woman on the phone. His brother was in the bathroom and his wife was talking to other family. So being the nosy assholes we are we listened.\n\nTurns out his brother has been having an AFFAIR on his PREGNANT WIFE. We heard the woman tell him that she wanted him to divorce his wife for her but to wait until after his wife gives birth which is in a few months. Apparently she ‘doesn’t want him to stress his wife out into a miscarriage’. And that she still wants him to be in the child’s life and she’s be an ‘amazing step mother’. What’s worse is he agreed though I don’t know if he’d actually go through with it or not.\n\nWhat. The. Fuck. Is. Wrong. With. People.\n\nShe said she had ‘morals’ on the call. BULLSHIT! If she had any damn morals she wouldn’t be sleeping with a married man especially with a pregnant wife! My boyfriend and I don’t know wether to tell his wife or not. We don’t really want to risk stress her out but idk. We are stumped. We never thought he’d be that kind of sick bastard. It makes me feel sick just thinking about it.\n\nWhat the hell are we supposed to do?\n\nEDIT: Just to make things a bit more clear shes high risk from what I’m aware of. She’s 6 months so far. I don’t know much about pregnancy or how stress can affect the fetus but I know she wants that kid. She’s been trying for years to get pregnant and had a miscarriage in the past.",
    "score": "440",
    "comments": "130"
  },
  {
    "postId": "t3_1j6ruyf",
    "title": "My dog just died",
    "content": "He was 3 years old. Just a regular morning, nothing out of the ordinary. Come noon he started vomiting. I call the doctor immediately and he tells me I have nothing to worry about. I called every one hour when his symptoms got worse and he told me not to worry. My dog couldnt move, and he told me that catatonia is normal when facing such an infection, and that he should be up and about in the morning. 30 minutes later I watched him choke in front of my bare eyes and there was nothing I could do. Me and my gf rushed him to the hospital immediately and disregarded the orders from the vet, but it was too late. I dont know what to do, I dont know how to move on. I feel so numb. So Im over here on Reddit for advice, how does one learn to cope with such a loss? What helped you fellow redditors overcome this feeling of hopelessness? Any advice is welcome, please help me…",
    "score": "13",
    "comments": "10"
  },
  {
    "postId": "t3_1j6wm2x",
    "title": "Living in Fear for years",
    "content": "I don’t know where to start because my life feels like a complete mess. I’m 17 (F), and I live in Europe with my mom, dad, and 10 siblings. My dad, however, has 12 more children from his previous marriages in Asia. He has three spouses in total, and my mom is the last one.\n\nMy dad is extremely strict. If my 3-year-old brother cries, he gets yelled at or even beaten. The house has to be quiet all the time. If my dad sees any dirt on the floor, he calls all the girls and gives us a two-hour lecture while insulting us.\n\nI first met my dad when I was six because, before that, he lived with his other wife and children. Now he’s here with us, and life has been unbearable. My 7-year-old sister has nonverbal autism—she can’t talk or understand what we say. When she cries or yells, my dad beats her. Imagine that—beating a child with a disability for something she can’t control.\n\nHe constantly compares us to our half-siblings and calls us \"useless\" and \"stupid\" every single day. My mom wants to protect us and has considered divorce, but she’s terrified that he’ll take us away or even stalk us if she tries to escape. He also beats her, and that’s the worst part. I always think, I’d rather he hit me instead of her, but I’m too scared to say anything.\n\nA few months ago, my half-siblings and their moms moved to Europe to live near us. It was the first time I met them in person, and they seemed nice at first. But my dad always loved them while treating us like garbage. My siblings and I work hard—my sister is studying medicine, my brother and I are in engineering—but our half-siblings see it as a competition. They take information from us but feel jealous instead of happy for us. Most of them didn’t even finish school in Asia, but now they want to study. My dad supports them completely and seems to want us to fail.\n\nHe actively tries to sabotage us. If I have homework, he finds random tasks to keep me busy. Even when I study late at night, he calls me out to do useless chores. It’s not just me—he does this to all of us, except for the half-siblings.\n\nAnd now, things have gotten even worse.\n\nLast week, he became stricter than ever. He yells more and beats us over nothing. If my mom speaks up, he tells her to \"shut up,\" and if she says anything back, even just \"huh?\" he threatens to beat her.\n\nYesterday, he gathered all 11 of us in a room, closed the door, and talked for three hours. He said that if my mom ever speaks after he tells her to shut up, he will beat her so badly that her bones will break and she won’t be able to do anything again. He also warned us that if any of us try to stop him, he’ll break our bones too.\n\nI’m scared. I can’t live like this anymore. A father should be someone who protects you, but mine only brings fear. Every time he talks to my mom, I get so stressed, afraid of what will happen next. Even at school, I can’t focus because I’m constantly thinking about them.",
    "score": "6",
    "comments": "4"
  },
  {
    "postId": "t3_1j7el6u",
    "title": "I don’t understand why he won’t let me block him",
    "content": "Hi everyone, so I have a rocky relationship with my ex who I dated for 6 months. We had a great relationship but broke up due to distance and he’s still in college in my hometown so I’d go visit him sometimes and we became fwb. We were on and off for two years and he did a lot of stuff to make me feel used and like a sex toy even though we supposedly were also good friends.\n\nI’ve blocked him 3 times before because I wanted to be done with him and each time we’ve gotten back into contact but each time nothing was solved that was bothering me so it kept coming up. So about two weeks ago I’m so over this friendship and I decide to send him a very mean but honest text about how I am not over how he’s made me feel and I want to block him.\n\nI’ve already blocked him on everything else but due to my own guilty conscience I don’t want to block him out of nowhere so after I sent that text we argued a bit and we’re both very upset at each other so I thought for sure we were done. He insisted that I should just delete him number and not block him and I’m not understanding why.\n\nHe doesn’t seem to have feelings and doesn’t really put any effort in our texts so I don’t understand why it matters so much to him if I block him. I assume he only wants me as a backup plan if nothing else works out but even then he lives so far away.\n\nAny thoughts?",
    "score": "0",
    "comments": "10"
  },
  {
    "postId": "t3_1j7ftyw",
    "title": "I hate voluntarily pregnant people clogging the healthcare system",
    "content": "Throwaway for obvious reasons.\n\nLike the title says, I hate pregnant people that choose to become pregnant. Let me explain.\n\nI have endometriosis and a family history of ovarian cancer. I have tumors in my uterus and I have undergone surgery multiple times.\n\nAnd whenever I needed my doctors for the reasons mentioned above, things that are out of my control, I'm always met with: \"Oh sorry but if you're not pregnant I can't give you an early appointment. Best I can do is 8 weeks from now.\"\n\nOh I'm sorry, in what world is someone who chooses to breed more important than my tumors? Just make a new baby or ADOPT ffs. They're easily replacable.\n\nIt makes me so bitter.\n\nAnd I can already smell the comments: Hurr durr an antinatalist in the wild, Oh you're evil, kys, you're a bad person. No, I'm none of those. I'm just sad and bitter and always in pain and can't get help because ha ha if you're not pregnant I cant help you :)\n\nDisclaimer: I never wanted children, yes I have been in therapy since I was 8 years old and been to multiple specialists about this, no I'm not a sociopath, no I'm not a narcissist, no I'm not evil, no I wouldn't hurt a child if they stood before me. I'm just super frustrated and angry.\n\nThe whole system and its treatment of cell clumps just made me super angry. I'm in pain and can't see my doctors as easily as I should because some people choose to breed. Just get a dog or a hobby please.\n\nGod I wish all pregnant people would stop clogging the healthcare system.",
    "score": "0",
    "comments": "12"
  },
  {
    "postId": "t3_1j7fkqc",
    "title": "I feel like i'll never find a woman because im too sexual and horny all the time lol",
    "content": "As a man although im looking for a relationship but it seems like most women are very vanila or just not really into sex as much, I might be wrong but I feel like I will never be fully sexually satisfied in a relationship. Im also autistic and can be quiet awkward at times",
    "score": "0",
    "comments": "3"
  },
  {
    "postId": "t3_1j6h0tu",
    "title": "I am so glad I was able to escape obesity before I turned 30.",
    "content": "I just turned 29 last week. Down to 155lbs\n\nFor the majority of my 20's, my weight never went below 250, even at 6'1, that's very bad. In 2022, at the height of the pandemic, I ballooned to 300+, which was a wakeup call to me. In 2023, I began my journey and the impetus was a trip to Vegas with my friends and we were all at a beach club watching a concert.\n\nIt was a looong journey, the whole process took 15 plus months, I started from 282, did a lot of cardio, in the middle of it all, used hydroxycut supplements to speed up the process.\n\nI'll never forget the day in 2024, I looked at the scale and saw 170 lbs, and how light my body felt. I'm glad I was able to pull this off while I still have my youth.\n\nCurrently, I'm resting from exercises as per the doctor, taking a break from physical activity (I have to wait at least 4 to 6 months before I can go back to the grind), lying in my bed as I'm typing this. This is a lesson to myself that, moving forward, I have to make better decisions about my health.\n\nETA: SORRY FOR THE WRONG TENSE IN THE TITLE",
    "score": "52",
    "comments": "15"
  },
  {
    "postId": "t3_1j7547j",
    "title": "I feel like I'm ' stuck ' in a relationship and don't know what to do",
    "content": "I (25F) have been in a long-distance relationship with this guy (23M) for the past 1.5 years. He was really sweet and caring in the beginning, and I talked to him for a considerable amount of time before starting a relationship with him. It's just that I think his behavior has changed compared to how it was during the talking stage and the first few months of the relationship. He says he's a fault-finder and that it's just a part of his personality.\n\nIn the beginning, he only used to praise my appearance, but over time, he started commenting on my facial features (nose, forehead, etc.) and many other things. I’ve had a bad case of acne throughout my adolescence due to sensitive skin and genetic factors, so it couldn’t be cured completely. While I don’t have cystic acne all over my face anymore, I still occasionally get breakouts. The skin on my body also gets inflamed easily after waxing.\n\nEarlier, he never said anything about it—in fact, he used to love and support me despite all of this. But eventually, he started telling me to use certain products to improve my skin. I’ve told him multiple times that this isn’t how things work (since I’ve undergone treatment for most of my life), but he gets irritated and says I don’t even want to try and that I lose hope too easily. Similarly, he made comments on my facial features and said I need to get plastic surgery. When I got upset, he claimed it was just a joke.\n\nI have a very chirpy, bubbly personality and get excited easily. We recently went to a concert, and everything was fine until we were walking back. As we were side by side with his arm around my neck, we reached a narrow space where only one of us could pass at a time. I was focused on our conversation, so I stood there for a second or two before moving. He got annoyed, removed his arm, grabbed me from behind, and pushed me through the space.\n\nAfter that, he started scolding me for being \"too dumb\" to stand there and not move immediately (which I don’t think is even a reason to fight). For the next hour, he kept verbally abusing me, asking if I was really dumb or just pretending to be around him. He even mocked my excitable personality, saying I get too excited to see him and then start acting dumb. He also said I don’t deserve anything he does for me (including the concert, which was my birthday present from him). He kept going on and on while we walked back for an entire hour. My head hung low, and I was holding back tears the entire time.\n\nWhen I had to catch the train to return home, he held my backpack tightly from behind and forced me to jump onto the moving train, even though I was scared and there was a huge risk involved in doing something like this, I mean, anything could have gone wrong! We had gotten late and almost missed it.\n\nJust two weeks ago, he \"faked\" breaking up with me to \"teach me a lesson\" because he thought that was the only way I would understand. He said he had fought with me multiple times over a single issue, and since I didn’t seem to get it, he had to do this. At first, I thought he was just angry and didn’t take it seriously. But the next day, he texted me dryly and told me it was final. I was heartbroken and broke down in tears, desperately trying to reach out to him.\n\nThat afternoon, I video-called him while crying hysterically, begging him to come back. He laughed in my face and told me not to cry, that everything would be fine in two to three months, and that I should just leave him. He was completely unemotional and unnecessarily cold. Each word hit me hard, and I kept wondering where all his love had gone.\n\nHe knows I’ve had traumatic experiences in my past relationships, yet he took advantage of my biggest emotional vulnerability. He knows I get anxious, overthink everything, and become inconsolable. Despite that, he played on my emotions. The very next day, he went on a five-day trip with his friends, which they had been planning since the previous week. He barely responded to my texts or calls while I was a crying mess, unable to eat, sleep, or work properly.\n\nWhen he came back, I decided to talk to him one last time because I was so hurt that I had finally made up my mind to end things. But when I called him, he acted as if nothing had happened. I lashed out and told him everything he had done wrong and how I felt all those days. After listening, he finally realized how horribly he had treated me and admitted that he thought we would reconcile. He had only pretended to break up with me so I would \"realize my mistake.\" It was never real. He thought we’d just talk and sort it out.\n\nI wasn’t in the right headspace, but I still gave him another chance.\n\nThere are other things that bother me, and I’ve told him a million times to work on them. I always get excited for the weekends because we’re busy all week, and I look forward to spending time together. I usually plan for us to watch a movie, and he always promises to be there at a certain time. But then, he keeps postponing because his roommates drag him along, saying he can’t stop them. He keeps pushing it forward until it’s too late, and I end up waiting. At the end of the night, I just say, \"I understand,\" and go to sleep. He apologizes, promises it won’t happen again, and then does it again the next weekend.\n\nAfter the \"breakup\" drama, we discussed this, and he promised to change. But that very day, he did it again. And then again this weekend.\n\nHe has also told me multiple times that if I don’t start making \"good money\" and move in with him soon, he might get attracted to someone else and leave me.\n\nHe constantly tries to make me jealous by talking about other girls, even saying he doesn’t want to waste the best years of his life in a long-distance relationship and wants to hook up with other girls. Later, he claims he’s just joking and doing it to \"motivate\" me to work harder, earn well, and move in with him.\n\nOn the other hand, I’ve never belittled him or made negative comments about his appearance or insecurities. He has acne scars and body dysmorphia, but I’ve always loved him as he is, making sure he feels comfortable in his own skin. I tell him he’s the most perfect guy for me and that he doesn’t need to change anything to feel good or deserving.\n\nBut he constantly criticizes me, mocks me when I express my struggles, and calls me \"weak\" whenever I try to talk about things that hurt me. He says he doesn’t like weak people who \"crib all the time,\" which makes me feel like I can’t even discuss my problems with him. If I do, he gets annoyed, fights with me, and tells me I’m playing the victim instead of being strong.\n\nHonestly, I’m just really confused. I love him and don’t want to leave, but I don’t know if he’s good for me.\n\nPS: The \"mistake\" he wanted me to realize was that he thinks I need to develop new skills to switch to a better job. My current job is hectic and low-paying, but I have to work hard throughout the week. With my parents' declining health, I can’t study every weekend. Sometimes, I slack off because I’m overwhelmed and need to cool off. He tells me I need to hurry up, and when I explain my situation, he fights with me, mocks me, and says I’ll never earn well or do anything in life because I’m not trying hard enough.\n\nEdit : Additionally, he has told me multiple times that other people’s opinions of him matter a lot. He wants to be \"likable\" to everyone. He said he used to get a lot of attention before developing acne, but things changed after that, which is why he constantly seeks validation from others. He gets upset when girls, in general, don’t give him attention. Whenever I ask why he seeks attention from other girls when I’ve always appreciated and motivated him, he simply says it’s because I’m his \"girlfriend,\" so my words don’t count. He also gets noticeably excited and happy whenever he finds out that a girl is interested in him, as it satisfies his need for validation. I've always brushed it off but idk if it's a concern or not.",
    "score": "1",
    "comments": "3"
  },
  {
    "postId": "t3_1j5umng",
    "title": "Motherland is calling. But I ain't going.",
    "content": "That is, Motherland is calling for duty. But, damn, I don't wanna die. Of course, I hate to hide in my apartment like a coward. But they are seeking men for that, and they are taking men from streets. This is so fucked up. On the one hand there are foes, invaders, murderers, obvious aggressors. On the other hand my fellas are completely indifferent to my fait, you know what I mean? They don't really care about their own people, everyone's just covering their own asses. And things aren't getting better. A lot of people have died, and I'm not gonna be the next. I don't expect you understand that, but belive me, folks, this is no joke.",
    "score": "1893",
    "comments": "286"
  },
  {
    "postId": "t3_1j7czd9",
    "title": "I'm so cooked",
    "content": "Literally I (19m) yesterday got a msg on insta asking me why I was hanging with teens and that I look 40. Bro its over, I can't, I'm so cooked, my life be like ooohh ahhh.",
    "score": "0",
    "comments": "0"
  },
  {
    "postId": "t3_1j6llo1",
    "title": "My USPS packages were SO close. Now they are all over",
    "content": "I ordered prescription glasses and a boatload of yarn from two different online stores 2 weeks ago. By a boatload of yarn, I mean enough that it's in two packages. Last weekend, all 3 packages reached a hub near Seattle, which is less than 30 miles from my home. So I got excited. For new glasses and to start on my crochet projects. They were in Seattle on Monday. By Wednesday all three were in Coppell Texas. Now? One pack of yarn is in LA, the other yarn is in Denver and the glasses, they're in frickin Houston. So a week ago they were close enough that I could have driven to pick them up. Now they're all over. I'm so annoyed",
    "score": "22",
    "comments": "9"
  },
  {
    "postId": "t3_1j74b4s",
    "title": "My vision is getting weird and it's making me nervous.",
    "content": "This is the second time in two days this has happened. Sorry for any errors but I'm in the middle of the second one and it makes reading a real bitch.\n\nThe trigger is bright light. Up until two days ago if I looked at a bright light I'd just get this dark smudge in my vision which went away soon.\n\nWell, on Friday I looked at something bright. Don't even remember what it was, maybe the light reflecting off a car, it was sunny. I went into Maccas to pick up a burger for my mother and I had trouble reading past the black splotch. Ordered the burger, scrolled tumblr while I waited.\n\nThe black splotch soon disappeared but there was nothing where it had been. I was reading something about COVID and it was hard to read. I could see only the top third of the C and the bottom left of the O in COVID was also gone.\n\nAnd then I got this static that appeared. This flashing rainbow static. It started moving out across the left of my vision, and I could see directly in front of me but the blind spot was getting bigger and moving. If I held up my hands in front of me I couldn't see my left hand at all.\n\nI made it home OK but half an hour after it started the left of my peripheral vision was gone.\n\nLuckily in another half hour my peripheral vision was back, but augh, it just happened again. I looked at a candle and went to read a book, and oh shit, I can barely read again, and oh no there's the small flashing staticky crescent, and it went and spread across the left of my vision again. Like a ripple going outwards.\n\nMy peripheral vision on my left is gone again.\n\nI hope this isn't going to become a thing. I had a similar thing happen to me fifteen years ago, once, but this is twice in two days. Am I going to have to start making sure I don't look at bright lights now? What if it gets worse? I'm seeing my doctor about something unrelated on Monday but I often struggle to get taken seriously by doctors (yep, I'm a woman) and I'm tired of going to battle every time there's something wrong with me.",
    "score": "1",
    "comments": "9"
  },
  {
    "postId": "t3_1j6vk3t",
    "title": "I don't know how to leave the house",
    "content": "Like I do but like... Where do you go? What do you do? I'm extremely socially isolated and I really just don't know if that's ever gonna change. I don't know how to talk to people at all and it sounds simple but I dont even know how to be safe in public. I'm not expecting anything out of this I just want someone other than me or my parents to know I guess.",
    "score": "5",
    "comments": "12"
  },
  {
    "postId": "t3_1j70sdg",
    "title": "Opposition",
    "content": "Not found",
    "score": "2",
    "comments": "0"
  },
  {
    "postId": "t3_1j70sbw",
    "title": "I'm about to drop out of college because I can't choose a major",
    "content": "I was between molecular/cell biology, integrative (human bio/ecology/basically everything else), math, and physics. I don't want to waste two years and the associated money only to find myself committed to a field of work I don't like. I'm a sophomore and I'll need to declare a major before I can enroll in next semester. I don't know if I could see myself doing molecular biology work my whole career, and the integrative bio is beginning to seem useless without grad school. I'm not sure it's worthwhile spending two years just studying advanced math like real analysis and algebraic topology, and I don't even if I could graduate in physics, the last class was too difficult for me. I don't really have a motivation to do any of these degrees so I expect I'll just leave after the semester ends.",
    "score": "2",
    "comments": "5"
  },
  {
    "postId": "t3_1j73xj2",
    "title": "I still think about him",
    "content": "My brain knows that he’s not the person for me. I have qualities that I want my soulmate to have and he doesn’t have any of them. In fact, he has the qualities that I hate. He cares too much about what people think about him. He’s not affectionate. He’s not sweet. He doesn’t make me feel pretty. he doesn’t make me feel loved. He doesn’t make me feel wanted. He doesn’t make me feel good about myself. He doesn’t even make me feel like he cares about me. In fact I know he doesn’t care about me. He told me himself when we broke up that he didn’t mean it when he said he never wanted to be away from me. I honestly can’t think of a really amazing time or really romantic time that we have even had together. I can’t even think of one reason to miss him. He constantly chose other people (friends, girls) over me and put me last. I can’t think of anything positive about him when it comes to our past relationship. For some reason, I still think about him every day. I still think about the very few good moments that we had together. They play in my head over and over again. My head doesn’t want him but my heart does and i dont understand why. I just don’t get it. I know God has better for me and I know my real soulmate is out there but I know I won’t get him until I fully move past this. It was my fault the relationship ended and I learned my lesson so I don’t know what else this experience wants from me. I don’t know what else to get from it. I already learned my lesson so why can’t I just get over it and move on. I have been hurt and cried over this for too long and too many times while i know hes living his best life and having sex with other girls and probably even dating someone else by now. Its not fair. Its not fair. Im so tired of being hurt while the other person is ok. Im so fucking sick of this i feel like im being haunted by something that could never even make me fully happy. I wish I was enough to make him want to be the person i needed. If he loved me enough he wouldve done anything to make it work. He gave up so easily and didn’t even care. I wouldve done anything and changed anything about myself to make it work. Im so sick of my heart hurting",
    "score": "1",
    "comments": "2"
  },
  {
    "postId": "t3_1j73u2x",
    "title": "To late to regret but happy",
    "content": "I know the title makes no sense but it's how I feel. I, 36f, have been living with the regret that I could never apologize to someone back from high school. To give some context to that. I was in a sort of common/uncommon situation back in high school. Being viciously bullied at school and abused outside of it. Lead me to be somewhat of a target. The only thing was girl bullies don't normally bully to your face they do everything, if not most behind your back, which lead me to blaming the only person who openly made fun of me but what he did wasn't even that bad. Example he would snicker to his friends where I could hear or throw snow balls at me. Chomp change in comparison to what I was going through at the time. Although it was enough for me to tell everyone I hated, loathed and despised him. For Years and only when I became an adult did I realize that what I was saying about him was somewhat the same as what I heard about myself. Hatred with no context. I've felt bad ever since and even though it's been 20 years I've always wanted to say \"I'm sorry\" but could never find him. Till tonight at 2am I found him and he's engaged and looks very happy. So I just wanted to get this off my chest, since I will stop looking now, I have no intention of trying anymore cuz he deserves to not have this random piece of knowledge. That's otherwise useless to his happy life and is more so for me.",
    "score": "1",
    "comments": "1"
  },
  {
    "postId": "t3_1j70c5v",
    "title": "Want to leave my nice life",
    "content": "Nice life, parents, friends, work, nice city.\n\nNo big problems but I want to explore new places and be in nature",
    "score": "2",
    "comments": "0"
  },
  {
    "postId": "t3_1j6pyo0",
    "title": "I witnessed domestic violence and didn't do anything about it",
    "content": "I was walking home from school, this was the 90s so we were all just walking around freely for miles, and passed by the same neighborhoods I always passed. There was this one small house on the left side of the road and coming up on it, I could hear splitting noises like someone was being hit but I think I couldn't believe it until I actually got close enough. There was this guy, 20s maybe both of them, standing over his wife or girlfriend on the front lawn, she was lying down on her side and had her arm stretched out. Then as I walked by slowly, unable to stop for some reason, he started beating and slapping her and grabbing her by the hair and yanking her towards the house. He also kicked her multiple times. I think he might have called her Alicia. But the eerie thing was that she was surprisingly quiet about it, not like crazy screaming, but just like, please stop! You would think she'd be screaming and crying out for help or something. I remember that I was just walking in horror, the guy didn't seem to notice me or if he did, he didn't care. I couldn't stop and I couldn't stop looking at them. I think I was trying to figure out what street I was on but I had never thought to memorize the alley way streets so I didn't know. The whole scene moved in slow motion but I still remember the entire beating, the sounds, the sounds of grass scraping, the shape of his hands. Just broad daylight at 3pm on a weekday, front lawn, no one else on the street but them and me, springtime.\n\nI ran home in tears and told my mom who just told me not to get involved. When I tried to tell her that I think he was going to kill her, she asked me what street and address this happened because if we report it, I'll have to know all these things. I had no idea, so again, she told me to mind my own business.\n\nI was 10 or so when this happened and I'm in my 30s now. I still have the exact same fantasy memory of having gone back in time and instead of walking away and running away from the scene, I get in between them and save her somehow. If not save, but at least make such a fuss that someone calls the cops. It's always the same thing - that I don't care if I get hurt in the process, I would have done the brave thing. Instead of what I actually did... just run away in literal horror. I feel so haunted by this scene. I don't think I'll ever forget it for the rest of my life, honestly.",
    "score": "10",
    "comments": "10"
  },
  {
    "postId": "t3_1j73i5g",
    "title": "Dreams",
    "content": "I’m so tired. I just woke up from a dream (nightmare) where I was going back to a school dance that I left to get Wendy’s. I was really drunk and pulled in hard next to a black Charger. A few guys got out and were looking into my car and for some reason my pants were down. They opened my door and tried to take my key (I was on the passenger side for some reason), I fought back and they shot me 4 times. They then proceeded to start to rob me while I pleaded and said I would give them what they wanted.\n\nI have so many fucking dreams like this and it makes me terrified to fucking sleep. I feel everything when I’m in them and it’s so scary. I can never actually rest because of them, they feel like my regular life but I’m aware of a few differences but. It’s starting to get to the point that I’m too scared to sleep.\n\nAnd I have multiples of the same types of dreams. I usually end up shot and bleeding out, it’s been in the back of my head, my chest, my legs etc. Nobody takes it really serious cause they are dreams but it’s fucking traumatizing man. I die in 40% of them, and am working stressed in 25%. I can’t do this shit anymore. I don’t feel safe anymore, I have to be up in 4 hours but will likely not get anymore rest.\n\nH E L P",
    "score": "1",
    "comments": "0"
  },
  {
    "postId": "t3_1j73e1b",
    "title": "I killed my dog and it’s been haunting me for a long time now",
    "content": "A bit of backstory: I used to live in the countryside with an older relative and she had a habit of acquiring pets she was unable and unwilling to take care of, eventually we ended up with four dogs, two small and two large. The problem is that every time we would open the front gate to take the car out the dogs would run out into the brush and potentially put themselves in danger, so we’d lock them in a tiny cage for a few minutes while we drove out and then come back in and let them out into the yard. The two large dogs started to get too big and the relative refused to buy a new larger cage for them and told me to figure it out (it was my job to lock up the dogs and this relative could basically boss me around all she wanted.) eventually I started putting one of the smaller dogs in an open plastic barrel while the others stayed in the cage, but she learned to jump out, so I would put a lid on it for more than five minutes. I hate myself for it, but I am an extremely, almost medically, forgetful person. And one day, I simply forgot about the dogs, and went to work, truly believing that I had let them out as usual. I came back to find that the dog had suffocated in the covered barrel. I can’t explain the emotions I had in that day, but that happened when I was 16 and it still makes me nauseous to think about. I’ve had a very hard life, but for some reason I think that this day was the worst day. There was a lot of screaming and crying from both the relative and I and she made me wrap the dog in an old dog food bag and carry it to the car so that I could dump it far from our property, unceremoniously. It still fucking haunts me. Everyone tells me it was an accident, but I still have nightmares about it. All I can think about is how horrible it must be to be a tiny innocent thing suffocating in a plastic barrel on a hot day. It eats me alive. Everything makes me anxious, I don’t want to be responsible for something like that happening again, I want to have kids one day, but how can I knowing that there’s a possibility that they can meet a horrible end just because my mind is in the clouds. The only time I spoke of this event was the day it happened, to various online friends, and then I never spoke of it again since until now. I’m laying in bed and trying to sleep, and maybe it would help if someone knew.\n\nI’m sorry Lila, I didn’t mean to.",
    "score": "0",
    "comments": "1"
  },
  {
    "postId": "t3_1j73abs",
    "title": "I Ran Away from Home at 13 to Escape Abuse Now I'm Trying to Change My Life",
    "content": "I Ran Away from Home at 13 to Escape Abuse Now I'm Trying to Change My Life\n\nI don’t know if my story matters to anyone, but I feel like I need to let it out. Maybe someone out there understands what it’s like.\n\nI grew up with my grandmother when I was little, and she made me feel loved. She taught me kindness, humility, and the importance of sharing, even when you don’t have much. I still carry that with me today. But when I was five, she had to leave, and I was sent to live with my mom. She tried her best she worked abroad to support me. Eventually, I was left along with my half siblings to their grandmother, and that’s when everything changed.\n\nFrom the time I was six until I was thirteen, I was abused. Not just words physical beatings that left my skin red and bruised. My teachers saw the marks, but I told them I fell. What else was I supposed to say? No one would have believed me anyway. My only escape was watching TV dramas. I cried along with the characters because, for a moment, it felt like I wasn’t alone. I had no phone, no way to tell my mom, no one to vent to.\n\nI tried everything to please her. I got good grades. I cleaned the house. I did the dishes. Nothing was ever enough. Because in her eyes, I didn’t belong I wasn’t of her blood. No matter what I did, I was unwanted.\n\nSo one day, I left.\n\nI walked nearly 6 kilometers to my grandmother’s place. It wasn’t my first time running away I even did it once when I was six, but that time, I brought a school friend with me. Their grandmother was furious that I brought their grandchild along with me tbh I didn't know what I was thinking I was still a child that time in 2nd Grade. But this time, I was alone and determined. When I finally arrived, my grandmother wasn’t upset she was happy to see me. She took me in without question. It was only after the third time I ran away that she finally got mad and went straight to confront the woman who had abused me.\n\nThat was the moment I finally felt safe. My grandmother has been my safe space ever since.\n\nBut the past doesn’t just disappear. Even after escaping, I still struggled. In 7th grade, I got dengue and had to be hospitalized for a month. That’s when the doctors found other health issues, but I was never told what they were. No one ever explained anything to me. At least my stay was covered by PhilHealth, so it didn’t add to my problems.\n\nNow I’m 19, but I still feel stuck. I have trust issues. I struggle with self-worth. Sometimes, I wonder if I’m the problem, if I’ve just been blaming my childhood for everything. But I also know I want to break free from this cycle. I want to change.\n\nI want a better life. I want to help others like me. I want to leave an impact and make a difference. And if I want that, I have to keep going.",
    "score": "1",
    "comments": "0"
  }
]