[
  {
    "postId": "t3_1j7c4t1",
    "title": "I’m coming to terms with the fact that I am a terrible person",
    "content": "I am 21 years old. I am in school. I’m moving forward in life but I have been a terrible person. I’ve lied about jobs, I’ve lied about health, I’ve lied about where I live and my age. I’ve lied about what other people have said and done. I’ve lied about past experiences. I’ve lied about relationships. I’ve lied about going to therapy. Hell I lied about when I got my drivers license. The majority of the time for no reason at all. I haven’t gained anything from any of this. If anything, I’ve lost friends and fumbled opportunities. But it just happens. I’ve almost never admitted to a lie. I’ve barely been caught in one either. I’ve lied to strangers and lied to people I trust. And I’ve gotten good enough at it that sometimes I don’t even realize that I’ve lied. I’ve made up entire profiles of fake people I created in my head. I’ve talked to people I know personally in real life as these people. I catfished my ex-girlfriend with one of these fake profiles just to make it easier for me to ghost her. It was during COVID and I didn’t want to keep up with the relationship. I don’t know what’s wrong with me. I try to feel bad about these things. But I simply don’t, as much as I pretend to. I can’t even feel bad for people who trust me and who I trust, because I can’t bring myself to even really care about them. I don’t miss people. I don’t feel much towards anyone at all really. Even family. I know I am not beyond redemption. But I don’t think redemption is in my path when I’ve done absolutely nothing to attempt to improve myself. I don’t really deserve it either. I’m just having the realization that I really am a terrible person. If I could start life over I would.",
    "score": "7",
    "comments": "3"
  },
  {
    "postId": "t3_1j71v04",
    "title": "Dude I'm stoned watching Ghost Adventures. It's just people my age and older yelling at air.",
    "content": "I'm extremely high and think about it. These guys get paid to travel the world and be overdramatic with electronics. The show is entertaining even though you think it's occasionally ridiculous. These guys got rich doing the bullshit we did when we were 12 years old 🤦‍♂️",
    "score": "45",
    "comments": "5"
  },
  {
    "postId": "t3_1j7hzxj",
    "title": "Weird coincidence",
    "content": "What’s with all the recent sexual assault stories while sleeping one where a daughter was touching her father while he slept and one where a brother his touching his sister. Seems like karma farming.",
    "score": "3",
    "comments": "0"
  },
  {
    "postId": "t3_1j6pwmy",
    "title": "My sister invited our brother to her wedding, even though she knows how I feel about him",
    "content": "Recently my sister got engaged, and she asked me to be a part of her bridal party. Initially I was very excited to have a role in her wedding, kind of still am, but now I'm feeling iffy because she invited our brother, who I don’t have a positive relationship with.\n\nFor context, I’m the youngest out of the three of us and we were raised by a single mother who worked a lot. Because of this, my sister took a lot of responsibility over us when our mother couldn’t. She’s like a second mother to me and my brother even though she shouldn’t have been. My brother, on the other hand, was kind of a weirdo growing up. He dressed alternatively and had “nerdy” interests, something that younger-me at the time thought was really cool, and was all around awkward.\n\nI was maybe 8 and he was 14 when he started getting curious with his body, and that eventually led to him sexually assaulting me. It didn’t happen for long, thank god, but the experience left a disgusting stain on me. Eventually I realized that what had happened to me was wrong, and it wasn't until I was 13 that I finally had the chance and courage to talk to someone.\n\nI was removed from my home and placed in a children’s psych unit, and my case was being handled by a social worker. Of course, they informed my mother, who then told a few others, my sister included. I didn’t know this at the time, but some of the adults around her pressured her into convincing me to recant my statement. So when she visited me, she asked me to do just that. I was obviously so betrayed and angry, she was my role model and the one person I relied on the most at the time. I can’t recall the rest of our conversation, I just remember leaving the visitation area and completely losing it in my room.\n\nBut I was young, impressional, and ruminating a lot at this time, so I did end up recanting my statement. My case worker didn’t agree with my decision but respected it anyway. For the sake of procedure, my case was still investigated, but without the victim’s statement it fell through. It didn’t erase anything that happened to me, but it felt like it did with how everyone else around me went about their lives like nothing happened. It was jarring and fucked with my head, and I slowly started believing that I made the whole thing up for attention. My memory wasn’t the best, and it could’ve just been a messed up dream I had. I started feeling disgusted and I couldn’t trust myself anymore, and I began spiraling.\n\nFastward to when I was 17, I was hospitalized for almost taking my life. For some reason, this was much more serious than before. I was finally put on medication and was put into a program for other at-risk teens. It was through group therapy I started thinking about getting closure for myself, so after a lot of mental and emotional preparation, I confronted my brother. At the last minute I decided to record the conversation without him knowing, and I actually got a confession. I went to my social worker, and after a few days he was removed from the house.\n\nAfter that, I was both relieved and stressed by the events that came next. To be honest I didn’t follow too closely with the court proceedings, I couldn’t bring myself to care what happened to him, all I remember was being interviewed by SVU and getting monthly check ups by social services. But the whole ordeal was mentally and emotionally draining for me and my family. My mom couldn’t believe it at first, and briefly experienced religious psychosis, but no one took it harder than my sister. I guess she felt guilty, because 1) such a serious thing happened between two of her siblings right under her nose, and 2) she didn’t have my back when I first came forward about it. I don’t blame her, or anyone really, for not noticing what was happening. I can’t bring myself to blame anyone, no one wants to believe that someone you love is capable of something as horrible as sexual assault.\n\nA few years have passed since then, and I’ve been working on improving my mental health. My sister was my rock throughout the process, the most understanding of me and my circumstances, and after a while I thought I had made peace with the whole situation, until her wedding. My sister’s decision to invite our brother, after years of no-contact between the two of us, kind of blindsided me. Not because I didn’t expect her to, but because she didn’t tell me. Now here’s the thing, I would never ask my sister to choose between me or our brother. I understand that she loves the both of us despite what had happened, so to ask her to do that wouldn’t be fair. But I would’ve liked a heads-up. I had to ask her myself if he was coming, and I’m glad I did. The thought of walking into the venue and seeing him in the crowd without warning would’ve sent me into a panic.\n\nAnd because of this I started to rethink my relationship with her. She’s done a lot for me, and I’ll go as far as to say that she has a bigger impact on me than our mother does. I want to give her some grace for this, but I still feel so uncomfortable with his presence. He’s also still in good standing with our extended family, who don’t know of the situation, so the possibility of them joking around and having fun with him without knowing what he’s done doesn’t sit right with me.\n\nI most likely won’t do anything regarding my sister’s wedding because I don’t want to ruin her big day, but it’ll probably change the way I see her. Like I said, I won’t ask her to choose between me or him, but that doesn’t mean I can’t. It’s a scary realization that my relationship with my sister can change, I really don’t want it to, but I can’t ignore how she’s willing to look past what our brother has done to me when I haven’t. I want to start by having a proper conversation with her about this first though, after the wedding. I want to fully understand her side of the story and her perspective before making this big decision.\n\nI honestly don’t know what to expect or hope for, but I feel like if I don’t do something then all the improvement I’ve made will come undone and I don’t think I’ll recover this time.",
    "score": "281",
    "comments": "86"
  },
  {
    "postId": "t3_1j7f4bn",
    "title": "i am the result of my dad's selfishness",
    "content": "its 1 in the morning right now and i really need to get something off my chest\n\nBack when my dad was in his 20s, he got married happily and had 1 son and 1 daughter on the way. they used to be financially stable and was able to live pretty comfortably. not rich, but comfortable. but one day, my dad decided to travel to a big city to \"find a better job\"\n\nthis is where the problem starts. he met my mom and fell hard for her. as soon as he met my mom, he filed a divorce letter to his ex wife (who was pregnant at that time). he left his wife just to be with my mom, also abandoning his 2 children. my mom didnt know this at the time and thought he was just a nice person. eventually, she did eventually find out about the family that he left behind when they were engaged, however because the wedding is so close, she didnt wanna cancel the wedding and decided to go through with it. (bad decision imo, but whatever)\n\nmy dad and mom managed to run a very successful business. like upper class stuff. they got married and had me. (20m). ive always thought that i had a very spoiled life. being able to afford things most people would kill for and even going to an expensive private school.\n\nmy dad did not pay a single penny for child support. it was my MOM who sends his ex wife money. keep in mind, i was kept in the dark about this until my parents eventually divorced when i was 13-14 for reasons i dont feel comfortable explaining. i was eventually told that i have half siblings from my dad's previous marriage. and what's worse is learning that they are financially struggling, all because of my dad abandoning his own family just to have me. and now? he did the same with me. i havent seen my dad in months now and we are living with less money than we had.\n\ni feel guilty. the fact that i was born into a family where i was fed with a silver spoon, while not knowing the financial struggles my half siblings are in. if my dad was not an asshole, i wouldn't've existed by now.\n\nto add salt to the wound. my dad remarried and tried conceiving a baby through IVF. i was so fucking pissed hearing that. he abandoned my 2 older half siblings to have me, and now hes abandoning me for an ivf baby?\n\nmy mom says that despite all of this, i should still love my father as \"hes your father afterall\" but i just cant.  i really... really... cant....",
    "score": "4",
    "comments": "2"
  },
  {
    "postId": "t3_1j7gz23",
    "title": "bf keeps threatening to khs",
    "content": "idk what to do. he threatens to do this so often, im so drained. i love him to pieces and i feel like i cant break up, not just because of this but because im so attached. he tells me he wants to hurt me. whenever hes angry he calls me so many things. i dont know what to do, last night we had a massive argument and he threatened to leak pictures of me with rumors captioned on it if i hang up. i dont want to end things, i love him too much but im scared. i dont know what he will do. im young, weve been together for a year. i cant do this anymore and its driving me off the edge myself. its making me want to die. were otp rn and hes still threatening to khs, i have no one to tell about this.",
    "score": "3",
    "comments": "2"
  },
  {
    "postId": "t3_1j7jusp",
    "title": "i failed...",
    "content": "i failed as a son, as a lover, and as a friend.. i feel so uncomfortable with myself rn, i have this huge guilt that i don't think i could live with it for longer.. i failed.. i made my parents disappointed, and now they don't see me the same, but still they care cuz i'm their son.. but i can't after what i've given to them.. they don't deserve a son like me.. i'm just a piece of trash or something even worse.. this is not the first time.. i have disappointed them many times... i'm sorry mom dad.. i'm sorry.. i wish i was better., i know you still love me and care for me, but i don't think i have the guts to even face you.. don't worry, I'll make at least 1% better.. I'll hold on to it until i can.. i'm sorry",
    "score": "2",
    "comments": "1"
  },
  {
    "postId": "t3_1j70oru",
    "title": "My partner of 6 years is cheating on me on RuneScape while I’m 8 months post partum",
    "content": "I just want to throw up. He started playing about three months before I gave birth and said he wanted to max his account to kill time while the baby was young. It turned into a full time habit. Dude doesn’t work. the fact that I stayed is a big part of the problem - I admit that.\n\nI just hate him at this point. I stayed through so many hard times with him and now I hate myself for it. He made friends with this girl on the game and I asked so many times if he had anything to tell me regarding their relationship. I found receipts tonight and honestly it’s as devastating as it is embarrassing. Two grown adults with children and both with partners telling each other they are shaking and crying over each other. Lamenting that they wished they had other lives where they could be together essentially. All the while I’m in the same house while these things are going on about each other. He’s adamant it didn’t go any further and he even turned down nudes (I know…very valiant). Obviously I am not really buying that.\n\nI’m just disgusted and this has been the turning stone for me. The true victim in this is our 8 month old son who has a stupid mother who allowed herself to be abused for years and now has a split family.",
    "score": "43",
    "comments": "5"
  },
  {
    "postId": "t3_1j7j16a",
    "title": "I have had intrusive thoughts to cheat on just about every partner I've ever had, and have followed through in the past.",
    "content": "Throwaway, for obvious reasons. I've made my mistakes in life, having entirely followed these urges in my past with previous partners. It's something I am deeply ashamed of, and could never do again. But the thoughts linger and remain. Oftentimes, it'll result in me becoming increasingly anxious. Sometimes I worry that, someday, karma is going to swing back around and my fiancee will one day cheat on me; perhaps that persistent anxiety is the true retribution. I'd like to seek therapy, but it isn't feasible for me at the moment. I think that some amount of it has to do with abandonment issues. I think my brain convinced itself that having more than one person would always leave me with someone if anybody had abandoned me again, in quite an unhealthy coping mechanism for everyone involved. Who knows. Maybe one day I'll conquer these demons.",
    "score": "2",
    "comments": "0"
  },
  {
    "postId": "t3_1j7foz6",
    "title": "My mom cares more about public opinión than my wellbeing...",
    "content": "I am currently in family therapy and in one of the sessions where we were talking about my SA and how it affected us both and our relationship, we discovered that I needed some closure. This meant that I would have to talk to a family member (from my mom's side) to tell her what happened. My mom ended up confessing that she would much rather keep the family in peace and still have a relationship with them, then be with me and support me when I do talk to that aunt.  Since then, I haven't been able to calm my anxiety, I feel like shit every day (I have been in a state of derealization that is driving me crazy). Since my dad left when I was 3 I have always put my mom's needs and feelings before mine, sadly all I have learned during these sessions is that I am not the daughter she wants, that I am always wrong and that she literally can't name 1 good thing about me. It is super confusing because she hasn't stopped helping me pay for uni, she still helps me buy new clothes for my new job, but yet again she won't hesitate to tall me how mean or inconsiderate I am. I am honestly exhausted, I wanted to better our relationship, I am the one who started with the idea of family therapy, but It has become one of the worst decisions of my life. (I appologize for any mistakes englis is my second lenguage)\n\nI wonder if this has ever happened to anyone, is it normal for single mothers to hate thir childern? Am I actually the worst like she says?",
    "score": "3",
    "comments": "2"
  },
  {
    "postId": "t3_1j70zu7",
    "title": "I keep accidentally buying green apple white claw and I cant help but think who tf asked for this flavor",
    "content": "I just bought a 6 pack of green apple white claws by accident for the third time and i hate whoever is behind this flavor. The first time, I picked them up and assumed they were lime because, green. My usual. Didn't even know the green apple flavor was a thing. I've just unwittingly bought another 6 pack at a different store that historically always had the lime flavor in a 6 pack and I don't know how I haven't learned my lesson about shopping for these by color by now. That is all.",
    "score": "35",
    "comments": "21"
  },
  {
    "postId": "t3_1j7bprp",
    "title": "I'm (24f) am not interested in a relationship with my brother",
    "content": "My mother (65), who adopted me from Ghana, West Africa, when I was 6 years old, emotionally abused and neglected me throughout my childhood. She's Canadian. Most of my memories are filled with babysitters, while she was living it up, school bullying and therapists, while she refused to believe that any of my problems stemmed from my relationship with her.\n\nUs moving often because of school bullying and money problems also prevented me from creating lasting friendships.\n\nI've been slowly working through my own trauma with a therapist, and now live several hours away from her, and now I work a full time job as a news producer, thanks to one of my amazing former professors.\n\nMy older brother not biological is in his 40s and met my mother when he was in his late 20s. She couldn't legally adopt him but was moved by his story and took him in as a son. He spent some time with us when I was 7 and 8, but ultimately moved to begin his own life. From there, he would be someone I saw in every blue moon. My mother would talk about him a lot, but I never really knew who he was, and still don't.\n\nHe's in his late 40s now and lives in Canada with his family. He absolutely adores my mother and never challenges her on anything despite the way she talks about him and his family to me in private. They talk on a daily basis, and my mother will try to guilt trip me by bragging about how much he loves her and talks to her on a daily basis.\n\nHe use to force himself to connect with other people in my mothers biological family, but stopped when she moved to the U.S., and when my aunt who would often coax him out, passed away from cancer in 2022.\n\nHis relationship with any other family member besides my mother is more out of obligation and love for my mother, and that's how it's been with me for a long time.\n\nHe's basically been a stranger to me my entire life. He never reaches out to me, has never sent me a birthday card, and if he does reach out, it's usually because it has something to do with my mother. My mother excuses and enables his actions by blaming them for his early upbringing.\n\nAll my attempts to build a relationship with him have ended in silence, despite even my mothers own attempts to get us closer. It just won't happen.\n\nHe himself has only seen my mother a couple of times within the last 10-15 years. Whenever something has happened with my mother, medically, I have to be the one constantly giving him updates. My mother says he has money problems, but I find that hard to believe, especially when he's been getting expensive remodeling work done on his house for the last couple of years.\n\nA couple years ago to please my mother, he started doing these weekly Zoom videos with my mother and I, and it's 100% clear it's just a way for him to show my mother that he is making an effort to get closer with me, and even then he's barely engaged. Now it's my mother or I that have to start the video chats.\n\nI'm getting emotionally tired of the charades and have decided to distance myself from him, but I am in the process of not letting my mother guilt trip me when I know I've done nothing wrong.\n\nI started therapy once I found out my birth mother, who would be 47, passed away not too long ago. My biological grandmother is still alive, and I have 4 biological brothers. I hope to reconnect with them someday soon.",
    "score": "4",
    "comments": "0"
  },
  {
    "postId": "t3_1j7ks9r",
    "title": "I knowingly manipulate my friends and feel ashamed.",
    "content": "I don't really know how to start this or end it or what I'm really trying to say, so please excuse any rambling/unnecessary information.\n\nI'm a 22 year old female who had little to no experience having friends throughout high school. In elementary school I had a fairly large circle of friends, but around the time puberty hit and I became more self aware I realized that my peers found me weird. I was pretty much exclusively friends with guys and I was basically a full head taller than anyone around me, including my male friends. I was pretty bad at actually holding a conversation (I still am) and my interests strayed from even my small group of friends. Middle school came, and that was fine, I still had my group of friends. But in classes where I wasn't sitting with them or we had differing lunch periods, I was basically silent. I was too nervous to make any attempt to talk to those around me or try out social skills.\n\nHigh school was terrible. At first I had the same lunch period as my friends, but then my table slowly filled with other people until my seat was seized by other people and my \"friends\" made no attempt to save me a spot. It felt like I was unable to speak anymore. I had a surgery that took me out of school for 6 weeks, and by the time I came back I was basically a stranger. I unironically tried to live high school like a shadow, keeping my mouth shut except to participate in classes that required it and to participate in group projects.\n\nI didn't really consider myself as having friends until I joined this group on discord. The people in it have changed and we've hopped servers a few times, but the central people have stayed the same. The most relevant are (Fake names, although I'm not worried they'll find this) Cas, NB 22, Ian, M 22, and James, M 23. These people form the core of my friend group.\n\nI don't really know when it started. I think I was about 19. I had been feeling depressed for a few weeks, and self harming was basically my exclusive way of relieving stress. I was questioning my worth even as a human being, fantasizing about ways to remove myself from this world. I guess I started questioning if my larger friend group even wanted me around, since I was so easily discarded by the one I had since childhood. I didn't disclose my depression, didn't mention self harm, didn't share that I wanted to die. I wanted them to feel bad for me, so I accused them of not valuing me as a friend and then, to them, disappeared off the platform for two weeks.\n\nThe next time I checked discord, I had paragraphs of apologies and worried messages basically begging me to come back. It felt euphoric. Even people outside the circle that I consider my closest friends were messaging me, wondering when I'd be back. At the time I don't think I even realize I was being manipulative. But I definitely got hooked on the euphoria of their reaction. The feeling of being wanted.\n\nI've spent the last 3 years doing basically the same thing. Not at the same level. I would guilt trip them for hanging out with other friends. If they said something mean to me I would sulk for days until they apologized, even if it was my fault. I give them the cold shoulder if they do something that displeases me even to a minor degree. I push their buttons until they snap to see what they let me get away with. If I'm angry, they get quiet and relent to anything I say or do. Even then, they always come back.\n\nRecently Cas has been hanging out with two different groups of friends more than us. They keep getting involved in new communities related to their interests and being an important part of other peoples groups. The time they spend with me and the others has dwindled so significantly that I've become a twisted amount of jealous. I've been thinking of ways to convince them to cut those people off. Ways to convince them that the others aren't worth their time, or that they're bad people. I actively want to isolate them from the other groups so that their only choice is us. I want to make them feel bad for thinking that they should devote attention to anything else.\n\nI got on anti depressants a month ago and started attending therapy. The combination is opening my eyes to the things that I do. I am disgusted with myself. I am afraid that I'm going to go to far and they're going to realize what I do and cut me off. I deserve it. I want to be better for them, but as I am now I'm probably more comparable to cancer on the group than a friend. I think I'm afraid that it's too late. I don't know. I don't really want pity.  I'm even disgusted that I feel pity for myself when I put myself in this situation. Even now I don't know if I can be a better person, but I'm too deep into anti depressants to think that I should just remove myself from this world. I just needed to tell someone.",
    "score": "2",
    "comments": "0"
  },
  {
    "postId": "t3_1j7kq3p",
    "title": "I bought my wife a new shirt because the store wouldn’t accept a refund",
    "content": "I am a horrible secret keeper so I’m posting here to just get it out.\n\nMy wife and I attended a convention. We don’t do a lot of extra curricular due to budget constraints but  we decided to splurge and bought some cute matching shirts.\n\nThey were pre-wrapped so we didn’t look at them until we got home and went to wash them about 3 days after the convention. Mine was OK but hers had a giant stain on it.\n\nI reached out to the vendor who said (reasonably) that too much time has passed since the convention to be able to prove that we didn’t stain it.\n\nI didn’t have the heart to tell her that they said no, so I secretly went onto their website and ordered a new one for her. It arrived and I told her they sent a replacement.\n\nThey are Asia based so the shipping was 2X cost the shirt itself.. but seeing her so excited, I’d do it again. Best $100 I’ve spent.",
    "score": "4",
    "comments": "0"
  },
  {
    "postId": "t3_1j7knoh",
    "title": "Reconnecting with someone but I'm so sensitive to their teasing comments",
    "content": "Not really looking for any advice on this, I just need to vent as I don't feel it's a big enough deal to bring it up to them 😅\n\nI've recently been talking to someone I lost touch with ages ago. We used to be extremely close, and always teased each other jokingly.\n\nBut since reconnecting with them, I've just been feeling a lot more sensitive to their comments? It feels silly as I know they don't mean anything bad by their words, but I just find myself wondering if they even really like me as a person or if they're judging me.\n\nCouple of examples: I have pet cats and this friend knows I love them. They've never liked cats, which is fine. They sent over a funny video of a cat, but that somehow devolved into them telling me how much they hate cats, and talking about how they also thought cats made their owners bitches, etc... I just tried to brush it off and joke back, defending my stance on cats a little bit. This isn't the first time I've had to hear about someone's grievances with cats, but it's just such a conversation killer for me. Like cool, you hate the animals I happen to really like. I am so glad you have given me this reminder lol.\n\nThe other thing that bothered me a bit was just a comment that made me feel like they thought I was immature. I said something like \"Oh this slaps\" and they immediately said \"Don't say that, you're 31.\" It's such a small thing but I guess I've always been a bit anxious about seeming \"mature\" enough to people, so it did sting a bit.\n\nI imagine a lot of this is just my own anxieties getting the best of me, as well as the fact that it's been so long that we're almost strangers in a lot of ways. I guess I don't really know what they think do me anymore.\n\nIf you made it this far, thanks for reading! 😅",
    "score": "1",
    "comments": "0"
  },
  {
    "postId": "t3_1j77pyz",
    "title": "I really wish I had a terminal illness",
    "content": "Hi, I'm 24 (M), and I just hate my life and myself. I've always been extremely lazy, boring, and anxious.\n\nI hate the way I am. I've spent my entire life doing nothing, and I don’t see anything that could change that.\n\nI've always wanted to do things—learn languages, read books, get into photography or history. But I ALWAYS fail. I lose interest and motivation so quickly that I just give up.\n\nI have no curiosity at all. I hate new experiences—except for traveling. There's no college course that interests me. I even failed college, and when I was too afraid to start working, I enrolled in another course—completely useless. Now, I have a shitty job and no skills. I'm scared of ANY kind of job because I feel so fucking dumb. I can't even concentrate when I’m around people. And at the same time, I'm too lazy to do anything about it.\n\nYesterday, I had a dream about joining a language course and trying to learn French or Italian. But I know I’m too lazy. Even now, I feel too lazy to learn just one phrase.\n\nI have no interesting or valuable memories. None. Even summer camp was awful—everyone had fun except me.\n\nSince I can remember, my days have always looked the same—scrolling on my phone, eating junk food, watching South Park, and being too lazy to do anything on my own. If something isn’t strictly imposed on me, I won’t do it. I often even feel too lazy to brush my teeth if I’m not going out.\n\nI’ve been to multiple therapists, but it didn’t help at all. I’m sure I don’t have depression. I probably don’t have any disorder or anything—it’s just my personality, and I absolutely HATE that.\n\nEvery personality test showed that I have extremely low openness and conscientiousness. And I have extremely high neuroticism.\n\nI’m not suicidal because I’m too scared. But my dream is to be told that I have a terminal illness and only a month left to live. That’s literally my fucking dream. My personality is so difficult that it’s impossible for me to enjoy life or even do something with it. I'm just too lazy, avoidant and pessimistic.",
    "score": "6",
    "comments": "5"
  },
  {
    "postId": "t3_1j7fegc",
    "title": "I guess life isn't really for me",
    "content": "I've seriously been trying to find a less nihilist way to look at life, but it's the only thing that makes sense to me. Any form of meaning like a passion/hobby, religion or living for the little moments feels very pointless, because objectively speaking, it is pointless in the long run. Besides, I've always felt very useless. Like I'm not truly good at anything no matter how much time I devote to it. I've been fucking up everything to be honest with you. I even dropped out of college a year ago because I was just doing terribly. I think I'm just really dumb. Even if I passed what the fuck is the point? I'll still work my ass off majority of my life for no reason whatsoever. I've never really shared my views on life with anyone besides my therapists, so I just wanna leave something behind before going through with it. I know it's irrational, but I guess being irrational is just a part of being a human and any living creature now that I think about it. I wish you better luck.",
    "score": "2",
    "comments": "2"
  },
  {
    "postId": "t3_1j7k0kz",
    "title": "My mom keeps talking to strangers online.",
    "content": "Some back ground: She never has any money for the things she needs! Constantly asking for money for ubers to get to the doctors, door dash, and food for lunch. She has called multiple ambulance this year and each time they kick her out the hospital because there's nothing wrong with her! The last she went, she called cause she thought she was having a stroke but texted me to bring her tablet to the hospital. When I got to the hospital i told her \"people who are actually sick don't care about having their tablets.\" This caused her to snap at me about not caring about her.\n\nToday, she left her tablet open in my dad's office (they are divorced but live together for now) and I saw her messages with her online boyfriend. He's talking about visiting her and they're saying I love you but she's never met this man! It's always the same damn story too: Military man, has a young child, and they are stationed aboard. Can she be that gullible to keep believing it??\n\nI get it. She an adult (56) but my mom does not seem mentally sound. She has lost countless bank accounts talking to these online boyfriends! She once gave one $700 to \"invest\" in his business and he ghosted her, all while demanding my dad help her pay for medication. She's constantly \"falling\", which is her throwing herself to the ground. She did it in front of my cousin once and she [my cousin] said she didn't want to come over anymore because my mother was irritating. She is the reason one of my sisters rarely comes around and my other sister is NC with her!\n\nEverything is everyone else's fault! I'm so frustrated because she's not understanding the urgency! My dad is not staying in this apartment and finally moving on with his life while her credit is in the shitter! She's barely at work! She spends most of her money on door dash and shitty shit from Temu! I'm trying to have empathy for her (because of how she was raised) but the constant lying, calling out of work, not helping clean or cook or buy groceries, and being almost allergic to accountability, is weighting on me.",
    "score": "1",
    "comments": "1"
  },
  {
    "postId": "t3_1j7jpzr",
    "title": "My hopes and dreams are now for it to be quick",
    "content": "I don't want my pets to suffer radiation sickness, panic or thirst. I don't want to die suffering horribly. I don't want to be brain dead and coasting in a hospital bed with no possibility of recovery.\n\nThat's it.\n\nThe world will not get better. 1945-2000 was an anomaly. It'll never happen again within our lifetime.\n\nI just want it to be quick and I don't want to watch my family or pets suffering.",
    "score": "1",
    "comments": "0"
  },
  {
    "postId": "t3_1j7izp6",
    "title": "Today, I was that 'Karen' that people vent about when they're just trying to do their job, and I feel so embarrassed",
    "content": "I really need to take this off my chest because today I f*cked up multiple times and I feel extremely embarrassed.\n\nMaybe I am in my head but I'm definitely somewhere in the wrong.\n\nOk so my day started fine with me taking a ride to the airport. The driver, a super nice guy from Pakistan, shared with me that he is fasting and he will only get to have water or something to eat after 6pm. So what do I do? I get all excited about Pakistani food and ask him to tell me what are his favorite dishes from his hometown. Then I proceed to describe in excruciating detail all my favorite dishes from my country. Recipes, mouthwatering ingredients, the whole thing. By the time I realized that he must be starving (it was 4pm after all), I was already rambling for about an hour already. I apologized immediately and he was super nice about it, but this doesn't make me less of an idiot.\n\nSo after this great success, fast forward to a few hours later - I am on the plane, seated near  the back, squeezed into the middle seat. We are about to depart, the plane is on the move and I realize that my seatbelt gets loose without me lifting the little lever thingy. I ask for assistance and the flight attendant tells me \"Don't worry, the seatbelt will work later\". So I ask him \"How is this possible...?\", thinking that I really don't do well during flights, that I used to get panic attacks, that I managed to control after a lot of therapy and <<OMG I am about to fly and if something happens I will break my neck crashing on the roof of the plane!!!>>.\n\nHe sighs, then tells me he will replace the belt and goes away. Comes back after a minute or so and he says that the plane needs to depart and that there is no time, they will need to move me. There is quickly some commotion, all the flight attendants make some signals to each other and they find me a free row at the front. So I thank them profoundly, I apologize for the last minute chaos that I caused and go to my new princess seat, but the window with extra legroom that I didn't pay for. I sit down, I put the seatbelt on.... and I realize that the new seatbelt ALSO gets loose if I push the metal thing! I test it out a little bit and then it hits me. If I just pull the belt, it stays locked. If I put my finger under the metallic thing and push slightly it gets loose. So that means that I did all this.... for no reason.\n\nI close my eyes and start thinking that it can't be that I'm so inconsiderate today. And how embarrassing. Meanwhile I'm doing my breathing exercises trying to relax. There is turbulence today and my mouth is dry, I can't handle it anymore. I open my eyes and soon as I see the flight attendant handing out chocolates, I ask for some water. She says \"I will check if we still have\", and I'm thinking \"Oh wow, how strange! It can't be that they don't have at least one bottle\". Quickly she comes back, hads me one and finally I drink some water. \"Finally I can try to relax\", I'm thinking. Then I realize must have dropped the chocolate she gave me. I start looking around and then I look to my left and I freeze. On the seat next to me there is yet another water bottle that the flight attendants must have left for me while I was trying to \"breathe iiiiin, hooooold, exhaaale, the plane is safe the plane is safe the plane is safe\".\n\nSo that's it. This is another successful day. I am sitting here patiently, writing this to distract myself and I think I will post as soon as we land.\n\nThank you for listening to my rambling dear reader <3",
    "score": "0",
    "comments": "5"
  },
  {
    "postId": "t3_1j7ik5i",
    "title": "7-layer carrot cake --- The shame. Not death but pretty similar to a death sentence.",
    "content": "The way \"life\" taught me about sex. Not my mom or dad, or a sex ed teacher. But life.\n\nLet's keep in mind that as humans we have an innate instinct to procreate.\n\nMy dad used to babysit me while my mom would go to work. He would put Asian music videos on in the living room and I would sing and dance to the songs all day long. I was 4. I was a sociable outspoken singing daddy's girl and I loved people because they would dote on me. What I'm really trying to say here is, at 4, I could recognize humans and human beings.\n\nMy dad took me over to his buddy's house. His buddy had two sons. One was about 7 and the other son was about 4 as well. While he and his buddies were hanging out downstairs, the older boy (7) showed me a book his dad had of naked people in all sorts of sexual positions, kind of like a Kama Sutra. He proceeded to usher me into a closet and took off all my clothes. My dad found me naked in the closet and helped me put all my clothes back on and we went home.\n\nAt around 5 years old, I woke up one morning and looked around. My little brother was sleeping in a separate bed in the same room as me. As you know and as I have mentioned above, I loved watching TV because of the music videos, and because of Barney and other things I would watch on TV. So this somber morning, I woke up, walked to my parents room and they were sleeping and I didn't want to wake them up. I walked back to my room where my brother was sleeping. We had a TV in our room and laying around on the floor were a VHS tapes. So I picked one up and popped it in. It was a porn tape. I remembered the naked people from the book that one kid had showed me and this porn tape had the same people. Naked and actively doing things. I somehow knew it was bad. So I turned down the volume, and I watched the whole thing instead of taking out the VHS. Let's just say, curiosity killed the cat and I was the very curious kitten.\n\nThen around the same year, at 5 years old, I was molested by my uncle. He was living in the same house as us in the basement. It happened (to my memory) one time and one time only. I knew what had happened to me the moment it happened. I knew something bad had happened to me, and I knew what sex was but I just didn't know the exact words for what everything was.\n\nThat is my 7-layor carrot cake story. Not exactly 7 layers but it just seems that bad things of a sexual nature kept making its way into my very short life and I came out on the other side too knowing, and too knowledgable way too soon. Every day I wish I had had the chance to be innocent and to be trusting of others and of people. I wish I had the chance to be a happy-go-lucky kid unburdened. But I was denied that. I grew up with no friends at all because of the amount of guilt I felt. The fact I understood sex at such a young age, and being molested, it was like an awkward secret I just kept inside. But secrets weight on you. Even if you don't think they do. It's a physical manifestation and I was not the beautiful child I always wished I was. I was dark, and small, and always was a little heavier than other girls. Because of all those reasons, I still have no friends, I have never made a friend. I still have extremely low self-esteem paired with a high body count.\n\nI'm just not normal. It feels this way at all times. I always stick to myself and I never look anyone in the eye. The shame.\n\nI also want to note, to anybody that was raised around too many males. Just don't. It's not safe for any parent with a small female child to be around that many men/males all at once and even if you \"trust\" them I would say you should always have a considerable amount of doubt and remove your child from danger or harm.",
    "score": "1",
    "comments": "0"
  },
  {
    "postId": "t3_1j73qfo",
    "title": "My partner is completely irresponsible with money and I'm considering breaking up",
    "content": "I apologize in advance for any grammar/spelling mistakes, english is not my first language.For context: me (27F) and my bf (25M) have been in a relationship for 5 years and living together in my father's house for 4 (in my country living costs are really high so it's pretty common to still stay with your parents beyond your 20's).At the end of last year my bf decided he needed a new phone for posting content (tiktok and reels) since his current phone's camera wasn't good and his career (gym instructor/ personal trainer) could use a boost from social media. While I agreed that a new phone with a better camera would help and I knew that he had saved some money, I asked him to wait a little longer (1 month or 2) before making any impulsive puchases since I was unemployed at the time and that money could be used for any emergencies.Well, he disregarded everything I said and decided to buy the phone anyway, and to make a long story short, it was a scam in wich he lost almost $800. To say I was disappointed is an understatement because i told him before, that even though the money was his and he could use it any way he wanted, the shop was really suspicious and it was better to buy from an official store if he was going to spend that much in a phone.It was really frustrating but I tried to help him contact his bank to see if there was anything we could do and to my surprise they refund almost half of the money, but my happiness was short lived because the very next day he fell for another scam and lost both the recovered money plus $300 ($250 from his account and $50 from mine). I was livid at this point, the car had broken down (another $600 expense), we had no way to pay our share of the bills plus the repair costs and he had to ask for money from his mother (bless her) to solve everything, but we survived.Well, now I'm employed and things were better until yesterday when he told me he was thinking again about buying the phone, to wich I told him: \"no way, not right now\", since we're not completely stable yet to spend that much money and I thought he would be at least a bit more mindful since we're still paying for his poor decisions from last year and we barely have money for bills, but he didn't want to listen to my reasoning, kept justifying why he needed it and I'm sure he'll buy it even though he knows that if he does that I'll have to cover his share of house expenses and I'm honestly mentally and emotionally exhausted, I feel like he isn't my partner anymore, just an oversized toddler and it's draining me.For additional context: he's been betting his money on soccer games and although he wins most of them, last week he almost lost all of the grocery money :)Our currency is not USD, so those are all approximate values.If you survived my ranting, thank you for reading everything.",
    "score": "10",
    "comments": "5"
  },
  {
    "postId": "t3_1j7cy98",
    "title": "I'm so cripplingly lonely at 21 I genuinely can't take it anymore",
    "content": "When I was a kid, I used to stand and watch the other kids play and I remember the deep longing I had to join in but couldn't because I'm autistic. I went to school and had no idea how to make friends so I just followed people I knew around. Dropped out at 12 and stayed isolated in my empty white bedroom because I felt too undeserving to decorate it. My birthdays have been filled with screaming and crying and shouting at my mom who would insist on forcing me to celebrate and buying a birthday cake I would force myself to eat and then make myself sick afterwards. I see no point in celebrating 21 years of pure suffering every single day. What am I meant to do? Have an awkward gathering with my shitty dysfunctional chaotic family?? There is so much I want to do and so many things I want to see but I can't because I am so lonely. No one understands the agony of waking up alone and going to sleep alone. I wasted 2 years of someone elses life in a weird half abusive relationship because I forced them to date me and promised I'd be a different person when I knew that I couldn't; I just didnt want to go back to being alone again. I made them aggressive and hateful towards me which is no wonder when I behave the way I do.\n\nI mourn the years of my life that I have lot. I feel sick with grief when I see kids playing on their bikes or with their friends or teenagers just existing. I didn't even get to leave my house once. the first time i walked down my road by myself was when i was 19. I'm so pitiful I hate it so much. i am in actual agony i cant take it anymore",
    "score": "2",
    "comments": "1"
  },
  {
    "postId": "t3_1j7cxzj",
    "title": "I was dumped yesterday but I had been thinking about the breakup for a year, it hurts so much",
    "content": "I (25F) was in a relationship (25M) for almost 2 years. It started off very very well, very dreamy and romantic where I told my friends that I had found the guy I had been looking for all this while etc etc. 2 months after our first date, i lost my job and i realised how emotionally unavailable he was, because all he cared about was his job and his work stress - he didnt know how to empathise with me or support me or help me out (for context the city we live and work in is his hometown) but i thought probably my expectations are a bit much because we are so early in the relationship. But i have known since aug 2023 that this isnt right for me. I am going to bulletise the problems:\n\n• spending time: despite living in the same city, he only saw me once a week, fri-sat, which i initially found weird but adjusted around it. However, because he is an insane workaholic, we didnt do anything special, just stayed in. There were no date nights. When we went out on date nights, i planned all of them, i initiated them, and i convinced him. I wanted to spend more time with him, see him more, but that he told was not possible because it messes with his routines. A lot of his habits and ideas of how we should be were straight up selfish, inconsiderate and disreputable tbh.\n\n• A twisted definition of ambition, different definitions of meaning of life: He has a well paying, reputable, steady job but he wants to start his own thing so that he is doing something “meaningful “ in life. What that means for us is insane working hours, no downtime, no quality time no matter how much i tried to adjust. When breaking up, he said the kind of relationship i want works for people who have job stability and dont want to do much outside of that - and i disagree so much. All i wanted was someone to spend my weekends with, have that quality time. Isnt that the bare minimum? Also, if he cant do this, how will he ever be in a relationship? For me, i am super ambitious and have built a career in a foreign country from the ground up, but for me ambition means being good at job and liking it enough to login every morning to do a good job. Meaning of life doesnt come from the job as i work for the paycheck, but meaning comes from travel, experiences, relationships and friendships.\n\n• His routine: he was obsessed with his routines. Wake up at 6, sleep at 10, gym at 7am, work 8-9 kinda guy. Which is ok, routines are good, but what that meant was he only saw me fridays, and called me daily 9:30-10 (he didnt call me initially at all and we foughjt a lot to get here). Anything outside of that was not possible. This didnt emotionally sit right with me because i couldnt trust, depend, rely on him. In fact, when we were breaking up, he told me he calculated (????) the amount of time he spends with me or talking to me, and thats about 12h/week, which is not possible for him right now. What this translated in my head was, i am not worth the 12h/week\n\n• his spending habits: he lives at home with his parents, earns a LOT more than me, and saves and invests all that he earns to an obsessive degree. He has enough to retire rn, and i respect that. But what that meant for us was, he was extremely stingy and calculative. We split stuff but he just wasnt happy spending - on date nights, dinners, gifts. Heck, he even calculated the transport cost from his home to mine. He even liked to lecture me about how i should spend money, when i already live below my means because i have a loan. He also said that he is saving enough for the both of us, but that never gave me confidence because i saw that as an attack on my independence - i cant live on the money he has earned or saved because it is not mine, he will always reinforce that, and i will have a lesser of a say in how we spend that money. He definitely wanted a prenup if we were to marry which i dont mind, but his general attitude towards money and being too calculative wasnt reassuring\n\nBasically, these were long-standing problems which i identified very early on in the relationship and communicated why i find them problematic. However, after each time i communicated he gave me something new to cling my hope on to, and i hoped things would get better because i genuinely wanted this to work. They never got better, we kept on arguing, until yesterday when he asked the question and i agreed - i felt a bit blindsided tbh because he never told me he is thinking about it too. I guess there are 2 lessons for me:\n\nTo be in a relationship and live in the present and not with the person’s potential and what it could be\n\nTo not be so obsessed with the idea of relationships and building a life and the feeling of home with someone that i keep putting up with shit\n\nHaving said all of this, the feeling of loss is immense and i still miss him and have been bawling my eyes out, when it was me who had been considering breaking up for the past year and i know in my heart he is not the one for me.",
    "score": "2",
    "comments": "0"
  },
  {
    "postId": "t3_1j7i2tw",
    "title": "Let me rephrase: I do not encourage violence, but I have something I’d like to get off my chest: It makes me satisfied and I, in certain situations,  agree with someone gettin’ the ole boot in the hiney.",
    "content": "Last post violated rules.",
    "score": "0",
    "comments": "0"
  }
]