[
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 04:44:23 UTC",
    "id": "1j7quv7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 3,
    "secure_media": null,
    "selftext": "I recently switched jobs and was excited at the prospect of making some friends. I don't need friends to go club ing with or anything. Just people I can chat with at work and goof off a little, text a meme once in a while. I didnt realize until my first day that there isn't a lot of staff and I am one of two guys. Doesn't really bother me, I'm gay and generally get along just fine with women once they realize. Most of the people there are an age bracket or more older than me. There are four girls that are a bit older than me but close enough. One is very mean so nobody likes her, but I really like the other three. \n\nThey have all been friendly with me and helpful with questions. I think I'm an okay person to get along with. I'm a good worker, I'm friendly, I'm pretty easygoing, and I have good hygiene so I dodge all the major strikes. From what I can tell we all align in bigger moral ideas and opinions..I was hopeful. I tried to talk to them a couple times  a day and joke around a little. \n\nUnfortunately I'm annoying and weird. I don't know how not to be, but people have told me I'm both. I was extremely unpopular throughout school and got beat up for it. I try to not talk to much. . I ask a lot of questions, probably to many for working there for a couple months but it's a hard job. My mouth is a little faster than my brain sometimes, but nobody has ever described me as mean.  People always tell me I'm weird but dont give specifics. Again, I try my best not to be. I don't have anything I'm obsessed with, I dress an look normal, I am pretty good at adjusting conversation for what is appropriate. I don't know what's wrong with me but something is. I'm a rather anxious person, and maybe that makes me a bit awkward and annoying, but to the point of not liking me idk. I hope not.\n\nI just know that this week I've started to see them pull away. I don't think they want to talk to me anymore and I don't know why.  None of them have asked for my number or to hang out, they commonly go to lunch together when their breaks allow and I've never been invited. I was devastated when I was talking to one of them when it was slow and I could see in her eyes she didn't want to talk to me.\n\nA couple of the older people (like fifty plus) are nice to me at least, but I'm not going to hang out with women over twice my age. I'm just lonely. Theres a couple people I'm afraid of talking to because they're not so nice. I don't know what I'm going to do if the three I was hoping would at least become my work friends end up hating me as well. If nobody likes me maybe I'll get fired. I'm on a probation period now and the economy isn't exactly helping. \n\nIs there any way to figure out what's wrong with me? Could I turn it around or now that they've turned negative is it a lost cause? Maybe it's stupid wanting friends at work I mean this isn't summer camp it's work. Maybe I'm a bad annoying person who never shuts up and just don't realize it. ",
    "subreddit": "TrueOffMyChest",
    "title": "Realizing I'm not going to make any friends at my new job. I just wish I knew what I was doing wrong.",
    "upvote_ratio": 0.64,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7quv7/realizing_im_not_going_to_make_any_friends_at_my/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 04:36:04 UTC",
    "id": "1j7qpw7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "A friend of mine was married in october a little over a year ago. I was never around much to actually observe his behavior around his female friends.\nBut after tonight Idk.... \nWe were having a beer and his friend called him over \"a girl\" and she had extended the invite to me as well. I had never met the person. \nMy friends wife would stay at home knowing where he was. But I think she may be very dense.  \nSo after multiple suspicious activities I've noticed but had no visual proof of anything.  I saw him and her kissing on the lips for fun and she was ALL over him.. She was also very intoxicated and explained some history they had involving a 3 way. \nShortly later I was ready to go.\nHe told me to leave and wait for him outside in my car, that he will be right down.\nI totally disagreed with that and said,we came in together and we are leaving together. If not, have a nice walk. So he ends up taking the lift.\n\nNow. Should I tell his wife? We are not friends, and I do not think much of her...\nBut, the first couple of times I shrugged it off \"not my life or problem\"....\nNow it's almost all the time and no longer think it's appropriate even if you dislike the person or not.. \nShould I tell his close friends?\nTell his inlaws?\nTell his wife? But I would much rather stay out of this cluster F@#$..\n",
    "subreddit": "TrueOffMyChest",
    "title": "Does my friend sleep around?",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7qpw7/does_my_friend_sleep_around/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 04:27:50 UTC",
    "id": "1j7ql05",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I just had an awesome week. It was 2 of my friends birthdays and mine, so lots of celebrating, clubbing, socialization, good food. It was probably the most social I have been since covid. As I was driving home after eating with friends, I realised I wasn't really happy. I'm not even sure I I'd say I was content. Comfortable probably. I've come to the conclusion that I don't really want anything, I don't desire anything, I don't have anything driving me forward. It's scary and kinda comforting, but it is seeping into every aspect of my life to the point I DONT know how I feel about anything around me. \nI'm mostly just venting, get the feelings into the void so it's been said somewhere but if there's someone else who also feels this way. Hi. You're not alone. ",
    "subreddit": "TrueOffMyChest",
    "title": "A sudden realization",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7ql05/a_sudden_realization/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 04:26:36 UTC",
    "id": "1j7qk8h",
    "link_flair_text": null,
    "media": null,
    "num_comments": 34,
    "score": 29,
    "secure_media": null,
    "selftext": "Im officially 21 and in the state of florida I'm allowed to carry a firearm. I'm a female and was raised by a single dad. At the age of 10, I learned about rape via the news. By the age of 16, I was taught how to prevent being drugged, how to keep my eye out when walking alone. By the age of 18 I was given a rape whistle, and a necklace that turns into a sharp blade.\n\nI got home a few hours ago from the shooting range, so I know how to use my gun incase worst case happens. As I was cleaning it I was think, society is fucked that us females have to be on such high alert. \n\nOn my 21st birthday, I went out with 2 older cousins. This guy who was clearly 40 kept hitting on me, I lost track of my cup and had to ask the bartender for a new one, cause between those minutes of me looking he could've put something in my drink.",
    "subreddit": "TrueOffMyChest",
    "title": "Living in fear as a female",
    "upvote_ratio": 0.72,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7qk8h/living_in_fear_as_a_female/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 04:26:16 UTC",
    "id": "1j7qk1x",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 2,
    "secure_media": null,
    "selftext": "I was tasked with helping my cousin with his homework today. He’s only 10 and you can tell when talking to him he’s legitimately as smart if not smarter than most of the family. His mom recently passed away so his older sister has custody of him. The boy is having trouble reading words like “droid”, “giggled”, “meant”, etc. nobody seems to take the time to teach him and he’s literally getting packets and homework assignments that they barely work on in school. He’s in an inner city school and I have another cousin attending there too. It’s so sad how poor these kids’ education really is. This boy can hold a good conversation about most things and can understand what you teach him when he stops beating himself up over stuff and takes the time. Because of this experience along with the other cousin of mine who goes to the same school, I’ve really lost faith in our education systems and the future of our people and country. At his age I, and even the kids who didn’t like reading, could easily read chapter books. These kids are incapable of doing that. Also common core math is frustratingly annoying. They intentionally make things more confusing instead of simplifying and compartmentalizing everything",
    "subreddit": "TrueOffMyChest",
    "title": "I’m Scared for Our Children’s Future",
    "upvote_ratio": 0.57,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7qk1x/im_scared_for_our_childrens_future/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 04:18:16 UTC",
    "id": "1j7qf3k",
    "link_flair_text": null,
    "media": null,
    "num_comments": 237,
    "score": 15,
    "secure_media": null,
    "selftext": "I know this doesn’t seem like a big deal but my heart hurts. This weekend I was using his phone to look up a restaurant and I saw in his search history/bar that he looked up at least 2 specific women’s only fans leaked. And he clicked on multiple websites just to find these women’s leaked images. I also thought to look at his twitter after finding this out and saw he looked them up there too. Between these 2 women he clicked on at least 10 different websites to find these women’s leaked photos. the funniest part is that me and these women look nothing alike. These women are beautiful, dark hair, dark eyes. While I’m a redhead with blue eyes. Our bodies are completely different as well. I just feel ugly. He was saying all men do it but I don’t believe that. It just hurts that he sought these women out hard to find pictures of them to pleasure himself to when we’ve been in a committed relationship. I know this is a controversial thing among people but I’ve always thought why do you feel the need to pleasure yourself to other women when you have me? And finding out these women look nothing like me just makes me feel not good enough and it makes me feel so ugly. He knows I’ve battled with weight and eating disorders and I feel like this is making it worse and it is torturing me. The worst part to me is he sought so hard for pictures of them when he went across multiple social media platforms to find them and pleasure himself and knowing they don’t look like me and knowing he’s in a committed relationship. How can I believe when he calls me beautiful yet pleasures himself to women that look nothing like me. ( EDIT: his needs are being met, someone told me I should mention this as well but I can assure you his needs are met with how much we go at it! Also he doesn’t like me masturbating to other men! So I don’t masturbate to other men but he is masturbating to other women even though I don’t like it. So I’m also upset about that because I followed his wishes but he doesn’t follow mine!)",
    "subreddit": "TrueOffMyChest",
    "title": "I caught my boyfriend masturbating to other women.",
    "upvote_ratio": 0.53,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7qf3k/i_caught_my_boyfriend_masturbating_to_other_women/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 04:05:36 UTC",
    "id": "1j7q7h2",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 4,
    "score": 10,
    "secure_media": null,
    "selftext": "He acts all high and mighty, huge ego. He thinks that just because he has a job, he doesn't have to do anything around the house. He made our own fucking grandma pick up his mess in our room just because he didn't wanna do it. I helped her of course because im nice, but holy shit, he really made an old woman pick up his garbage, and there was a lot. I tried telling him to do literally anything, but the asshole he is, he threatened to slap and best me up. This has happened multiple times, and honestly, should i just keep getting at him until he does hit me? I'd rather call the police than deal with this bullshit. The house, and especially me, would be better off without him.",
    "subreddit": "TrueOffMyChest",
    "title": "My brother is a huge fucking asshole",
    "upvote_ratio": 0.77,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7q7h2/my_brother_is_a_huge_fucking_asshole/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 03:57:33 UTC",
    "id": "1j7q25e",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 12,
    "secure_media": null,
    "selftext": "I  25F have lately I’ve been on this journey of choosing myself—really learning how to respect my own feelings and speak up. And ever since I started doing that, I’ve noticed I’ve been losing people I once considered close friends.\n\nI’m realizing some folks didn’t actually love me—they just loved what I did for them, or how quiet I was when they crossed lines. I once told a friend something made me uncomfortable and just asked her not to bring it up around me. She completely stopped talking to me after that.\n\nThen a friend I’ve known for 12 years asked me to reschedule my own birthday plans so I could go to someone else’s party instead. That honestly made me feel like an option, not a friend.\n\nI know nobody owes me anything, and I don’t expect people to revolve their lives around me. But I’ve come to realize that some people only respect boundaries when they benefit from them. And now that I’m finally honoring mine, it’s become a problem for them.\n",
    "subreddit": "TrueOffMyChest",
    "title": "Setting boundaries = no friends",
    "upvote_ratio": 0.85,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7q25e/setting_boundaries_no_friends/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 03:52:46 UTC",
    "id": "1j7pz5c",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "As I’m typing this, I’m thinking about a boy I met today, who was so sweet and charming and thoughtful. But the entire time I was with him, all I could think was ‘he’s going to be so disappointed if this goes any further.’ \n\nI am the survivor of SA and abuse from my first boyfriend. I was very young (the relationship started when I was 15). It lasted two years and it affects me every day. On top of that, I have faced things like stalking and grooming. \n\nI am 25 now. As a result, trusting is very hard for me. I often feel like I never really had a chance at learning about myself, my body, and my place in my relationships that wasn’t about being controlled or hurt.\n\nIve had very little experience since that first relationship. I am scared to date now, as a single adult, because I know myself. I don’t feel safe being physical with partners unless I’m doing something for them. I don’t know what to do when they want to do something for me, and I panic. Likewise, I’m scared I will never be able to break out of my ‘get small, do whatever they want’ mindset that I kept myself in. I often compare myself to those shelter dogs with the signs that say ‘Abused rescue, barks at men.’\n\nI am in therapy, and I’ve made amazing progress. I just don’t know what to do to tackle this part. I can’t decide if I should take a risk but be communicative, or learn how to love myself in my solitude. ",
    "subreddit": "TrueOffMyChest",
    "title": "I think I may be too traumatized to be lovable",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7pz5c/i_think_i_may_be_too_traumatized_to_be_lovable/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 03:46:03 UTC",
    "id": "1j7puxd",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "i’m not going to end my life but i have lost my will to live for the most part, other than i guess my will to live long enough to see if this gets better. \n\ni left a not so great relationship three years ago and no one has touched me since. i read a novel two months ago featuring a lot of caretaking scenes between partners and while i hadn’t been lonely before and felt proud of my independence, i’ve been terribly lonely all of a sudden. you’d think i have great friendships and maybe i do but i spend most of my time after work alone and im starting to dread weekends knowing i’ll mostly be on my own. \n\ni’d love to share my life with someone and thought i was regaining a lot of confidence but i’ve started to become vicious to myself. this is probably a distortion but i can’t really imagine people missing me in a substantial way if i were gone. im not really foundational to anyone’s life as far as i know. i keep thinking people would feel sad someone young died and maybe question if they could’ve done something but i can’t imagine my loss feeling like a void to anyone. \n\ni don’t know what happened the last month or two. i want my life to get better or to feel more at peace with the one i’ve been given but i can’t stop thinking about death, almost all the time now, i keep bursting into tears at work, when im out, the second i get home. i feel like an alien, like i forgot how to connect with and relate to other people. ",
    "subreddit": "TrueOffMyChest",
    "title": "i don’t want to be alive anymore",
    "upvote_ratio": 0.61,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7puxd/i_dont_want_to_be_alive_anymore/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 03:34:54 UTC",
    "id": "1j7po1j",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "I have really bad insomnia and anxiety. 😥 my job stresses me the F out. I worked all week then got called in Sunday for day shift I have never been trained on. I didn’t get any sleep because I was worried about it all night. I got really down and upset so sleep deprived well they put me on sleep meds and I have to take those everyday and can’t just stop cold turkey. Well … there’s times I’m gonna be on call. For example I work till 12am and could be called in an hour after I get home or two hours or three who knows. I’m gonna be taking my meds around that time and if I pass out and they call me in then I am gonna have to get up and go in and clean a Covid or do F ing day shift because someone called off. Not sure why boss doesn’t make the part time lady do it (everyone thinks there screwing because she gets away with everything) I got so upset and sleep deprived and just so tired of this crap that I put my two weeks in today and left the note in my bosses mailbox like he told me to do I the begging. Now I’m regretting it but my mental health is so bad. I have a 4old boy I have to take care of with no financial help. I also have a fine to pay ect. I really want part time but the girl already is in the position and won’t give it up even though she has told me she don’t need it because she got $$ from her dad passing away. I really would do better on part time till I figured things out. There’s no jobs in my town I was lucky to land this one… pharmacy told me that I have to take that med every night around the same time and that I have to lay in bed for 8 hours before I can get up. So being on call is a no go. I’m really upset. I feel like driving in town to my Job to get that damn two week notice. My job stresses me out and I hate it but need it at the same time. Please any advice ?? ",
    "subreddit": "TrueOffMyChest",
    "title": "Venting /need advice on what to do? What would you do? Please read",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7po1j/venting_need_advice_on_what_to_do_what_would_you/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 03:32:05 UTC",
    "id": "1j7pm91",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "Not putting ages, but I'm a woman dating a man for that context. We both told each other prior to us even being \"official\" that we don't really know what it means to be in love, but based on everything i have read, i believe i am in love. We have been together for a short time but have known each other for a long time. I don't believe he will ever love me and there's an internal dichotomy of \"i am okay with unrequited love because we make a good partnership and he is sweet and considerate to me\" and \"what is wrong with me why am i not enough what if one day he realizes he can do better and leaves me.\" I worry a lot when we're together lately that he's thinking of someone else, a past love, maybe someone he's still in love or obsessed with. I of course cannot ask him because it would kill me if the answer is yes, he is thinking about someone else and wishes i was her instead. I already know that he's never really had feelings towards me, which is leading to my skepticism so far. I can take him at face value now when he says he likes me, but it didn't come easy and doesn't come without a voice in the back of my mind saying it's not true. \n\nI found out tonight that basically I'm coming on too strong i guess with verbal affection (\"i miss you\" things like that), and i worry that turns him off from me. I worry that it makes him not want to be with me. I worry that it makes him think I'm desperate, which he did essentially accuse me of a few weekends ago. But i worry that it pushes him away from me. He likes physical reassurances that i want to be with him, physical affection and intimacy, and i need the inverse to feel secure. And i can tell he's making an effort, i think he can tell I'm making an effort. But I worry I've pushed things too far by being too verbally affectionate. I'm worried he's thinking of breaking up with me. \n\nThis weekend I have been considering telling him I love him and it's okay if he doesn't return the feeling, but now I can't. I try very hard to be present and suppress my fears and insecurities when we're together, but I'm sure it's noticeable at times still. There are women from his past I know he had a thing for, and I feel so uncomfortable when he talks about them, I don't know if he's noticed that, and he doesn't do it often but it is very painful. I wonder if he wishes I was one of them instead of who I am. He has denied it, but I do still think a huge reason he's with me is my body. I know he's been attracted to me physically all these years, and so I worry that that is the main draw to me, the main thing that makes him want to stick around. I worry another reason is because we're getting older and we both feel like we're missing life milestones and we could be each other's solution for that. \n\nI am so insecure and scared and worried in this relationship, but I have wanted it for over 10 years, more than 10 years have I had a crush on him. So I am okay with the fact he will never love me. But I do need to cry about it sometimes. ",
    "subreddit": "TrueOffMyChest",
    "title": "I don't think my boyfriend will ever love me.",
    "upvote_ratio": 0.63,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7pm91/i_dont_think_my_boyfriend_will_ever_love_me/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 03:29:37 UTC",
    "id": "1j7pkns",
    "link_flair_text": null,
    "media": null,
    "num_comments": 31,
    "score": 28,
    "secure_media": null,
    "selftext": "I recently broke off a 5 year relationship (one year engagement) because of financial infidelity. I’m 30  years old, 20k in cc debt, 100k owed in loans, 25k owed in student loans, and I was too embarrassed to ever tell my partner the truth. Covid, struggling with mental health, lifestyle creep, all contributed to overspending, not utilizing credit cards correctly, and trying to be something I’m not in front of everyone in my life for the past 3 years. Essentially, and everyone in my circle thinks I’m well off when I’m actually a lying coward. \n\nThe guilt and anxiety of the debt got so bad that I ended my long term relationship. My partner makes 45k and I make 3 times their salary, so planning our wedding was nauseating as I knew there was no way we can afford it as my partner has been depending on me for financial support. Little did they know, we are so poor and I’m in so much debt that it would crush me to continue our relationship and go through with a wedding with this gigantic mess. They don’t deserve it, and they deserve better than me. \n\nI’m so embarrassed. But I realize that ending the relationship and working towards paying down debt aggressively was the only way I can move forward without feeling more like a piece of shit than I already do. Right now they still don’t know the truth, and they are probably so confused, hurt, and angry right now because the relationship seemingly ended out of nowhere. But I’m only trying to protect them, and I hate myself that I let this drag on for as long as it did. I only hope that the damage and hurt I’m saving them from will outweigh the damage and hurt I’ve already caused. For now, I’m just relieved that the love of my life is now safe from me, my lies, and my debt. I love you and I’m sorry I wasn’t able to be a better person for you. Thank you for all these years.",
    "subreddit": "TrueOffMyChest",
    "title": "I ended my relationship due to financial infidelity",
    "upvote_ratio": 0.71,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7pkns/i_ended_my_relationship_due_to_financial/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 03:22:24 UTC",
    "id": "1j7pfwv",
    "link_flair_text": null,
    "media": null,
    "num_comments": 10,
    "score": 0,
    "secure_media": null,
    "selftext": "Okay I don't even know where to start. Our relationship has always been weird. We are definitely more open to talking about very tabo/ out there topics. But I won't be honest I lost trust a year ago. (maybe I like to be hurt idk). I (23F) have been with my partner (22F) for over a year now. The first time this happened we here (friends) to the public but together in private. It she was in the bathroom at a club with another girl. She told me after I asked 3 times. And it also took me asking so many times what happened and \"is there anything else\" for her to finally admits it. Then the second time was the exact same thing at the club but she was drinking that night and I saw it all happen. The third time I went away for to work in a different city for my job for two weeks and the girl she was seeing texted me the SS of there messages. It was so bad one of them said \" I could cheat on her and she wouldn't even know\". When I confronted her she lied to my face.\nLike she always does. And even went as far as saying that these are photoshopped. She denied and lied and always played the victim. Saying she was forced and felt like she had too. And then blame me for things that made no sense what so ever. The third time was recent. She went out with new friends she met online. She told me there names it was all good she said she was going over to hang out and play games. She don't come back to her house until 5:30 am. (1 have her location). I knew in my gut something happened. When I told her it feels off like you cheated because you came back so late she brushed it off like it was nothing. I'll break it down how this one went. I called her to talk about it she told me they kissed once and that's it. I was very upset. Then we talked more about it that night. She told me they held hands that this girl \"listened to her and heard her\". ( she had a tendency to completely blow up at me in arguments so l don't always tend to listen when she's yelling at me). Then she said she wanted and open relationship with this girl has her gf and me in the side. I then saw her two days later.\nShe told me in person they kissed max 3 time and she had her arm over her. I once again had to ask 10000 times to get this info. And I asked her\n1000000 more times \"are you sure there is nothing else\". I then asked her to get me food and water because I wasn't feeling good. I looked through her phone I know I shouldn't have but I did. I say the most disturbing texts of my life. They were very inappropriate with each other and have been texting like this for a week now. Very lovey texts too all day and night. Calling me her friend and saying she's with her \"friend\" AKA ME! Telling her jokes | was saying but as if it was coming from my partner to this girl. Telling her she's skinny and pretty. ( l am a comfortable weight I like my size, I also work out and enjoy building muscle and strength not slimming figure). I confronted her and he lied again. Right after lying to my face and telling me there wasn't more. I lost it and read the entire texts with her sitting in the ground in my room. Now she's all sweet with me. She's at my house watching my dog while I visit my dad (I had already planned this trip and that's why she was at my house in the first place). I go back to my house tomorrow where she will be.",
    "subreddit": "TrueOffMyChest",
    "title": "I need to talk about this. Cheated on 4 times in one year",
    "upvote_ratio": 0.25,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7pfwv/i_need_to_talk_about_this_cheated_on_4_times_in/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 03:12:44 UTC",
    "id": "1j7p9uc",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 2,
    "secure_media": null,
    "selftext": "I'm 18, and recently moved into a home. Long story very very short, I had a son while I was 12, he's six now. I ran away from my mother and my father because me mother is an alcoholic and my father went to prison for child abuse material (photos of me). I ended up in foster care for a while, living on the streets with my son for a year, and finally landed a job and got to sleep in the back room of the cafe. My mother found us, and I panicked, flew him back to our home country and now he lives with my boyfriends parents. So now, my boss, and a coworker and I all moved into a flat together, because I was struggling being away from my son. A couple months later, the boss says he's inherited an old miners cottage and will NOT be moving in, he offered it to me, I took it. My mother has a new husband, and he's lovely, so I invited them, and my older sister to stay with me, I didn't realise they thought it would turn into freeloading. My sister got a job and moved into the city and I'm so proud of her! My step dad works as a teacher and he's great, helps around the house, cooks when I'm not feeling well, ect. My mother however, shows up uninvited, drinks herself half blind and then calls me to pick her up, I can't say no to her, she's my mum, I love her, even if she was an arse. Sometimes, I wish they told me thank you, even just once. My son is little and the sweetest kid I know, but it sucks to sometimes feel like I'm overlooked. Sorry for the long post, just felt like I needed to tell someone.",
    "subreddit": "TrueOffMyChest",
    "title": "Sometimes I wish my family recognised me more",
    "upvote_ratio": 0.63,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7p9uc/sometimes_i_wish_my_family_recognised_me_more/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 02:49:03 UTC",
    "id": "1j7otym",
    "link_flair_text": "Positive",
    "media": null,
    "num_comments": 20,
    "score": 250,
    "secure_media": null,
    "selftext": "I can’t believe it. My head is still reeling. I can’t believe she’s mine now. All my life I’ve been with men. I never thought I would fall in love with a girl, let alone someone that is very close to me!! It feels so surreal.\n\nI’m just so, so happy!! I still find it unreal that I will get to kiss her now. I’ve never been this happy in my past relationships. It always felt like something was missing. But now I feel like everything clicked for me. God, I love her so fucking much. ",
    "subreddit": "TrueOffMyChest",
    "title": "I confessed my feelings to my girl best friend last night and now we’re together",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7otym/i_confessed_my_feelings_to_my_girl_best_friend/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 02:45:54 UTC",
    "id": "1j7orsw",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 2,
    "secure_media": null,
    "selftext": "Whenever I read through best of reddit or any of the various relationships subs, I see guys who are basically the \"nice guy\", who only befriend women they want to date.  It basically always sends my mind careening back to obsess about how or if I was a \"nice guy\" in high school.\n\nI pined for a girl all through high school.  My graduating class was 465 kids but we were in all the honors/advanced classes and did debate/forensics/scholars bowl/mock trial together as well.  There was basically a group of about 25-35 people who did all the honors stuff and we were basically a high school within the school.\n\nAnyway, if this now woman even bothers to remember me, she probably views me as the quintessential \"nice guy\", and honestly I am so embarrassed/guilty about it that my neruodivergernt mind can't ever let it fully go. \n\nLike I said, I made friends with this girl when we were sophomores (our high school was 10/11/12), and she already had a boyfriend.  I *really* was not trying to be *that guy*, but I think everyone in our class (and I later found out several of our teachers) knew I had feelings for her.  I am certain she did.  \n\nJunior year she breaks up with her boyfriend and has a new one before I even knew.  Our senior year, there was a really tragic situation and the person she was seeing passed away. Now, I am not such an AH as to immediately make a move or anything but by the spring I got the idea she basically wanted me to ask her out.  So I did. However, earlier in the year, before the event that resulted in her being single, I asked another girl from the group of AP students to Prom. This girl had then written me a letter explaining that she hadn't expected to be asked at all, and was flattered and would accept as long as I understood it was completely platonic. I said I understood and that was fine.\n\nNow, I don't know what other people would have done, but it never crossed my mind to try and back out of taking the first girl I had asked.  We had another friend who was kind of looking for a date and the two of the ended up going together.  The monday after Prom she dumped me for him. So we dated for like all of 3 weeks.  I did some dumb stuff.  I wrote a cringey please don't break up letter.  I tried to be more outgoing with our friend group, and it came across as weird and try hard.  I asked out another girl who I thought was cute but had nothing in common with and got rejected and told to my face that I should just wait till college because *any girl in our high school* would know they were a rebound and that nobody would not be interested.\n\n\nNow what really sucked was that we got to go to national tournaments for both Mock Trial and Debate/Forensics together. So I had basically two school funded pseudo vacations with my \"ex\" and without her boyfriend and while I had a good time, it was also really rough for my 18 year old self. It was just impossible to fit myself back into the \"just a friend box.\"  I still had strong feelings, she knew that, and I hope I didn't make her miserable.  While going to fetch her and  the girls she was sharing a hotel room with at the Forensics national tournament, I heard her talking about me through the door saying that I was \"too intense\" and that was part of why she broke up with me.  That has stuck with me my entire life (my wife loves how \"intense\" I can be so things worked out).\n\nWhile at the mock trial national tournament, one evening our coach/chaperone pulled me aside and just asked how I was doing.  As we talked I ended up breaking down and crying. That's also where I found out that yes the teachers all knew as well, and yes they did have opinions on student relationships.\n\nAnyway, I look back now and clearly, yes this stuff did *affect* me.  It contributed to who I am today, but at the same time, it seems dumb because we only dated for less than a month.  But, for me  there was also friendship with her knowing she had me as a backup/fallback if she ever wanted. That probably seems really incel/misogynistic but I willingly put myself there and she couldn't possibly have been unaware.  It was clearly super unhealthy for me, unfair to her, and that is why I look back and feel guilty and embarrassed.  The fact I am now 41 and can still remember and write about all of this shows that it for sure impacted me, but like I said when I think back on it, I pretty much figure she must think I am/was the sort of \"nice guy\" who befriends women exclusively to try and date them.\n\nI feel a fair amount of guilt over this, not the least of which is in part because I have been married for 15 years to the most beautiful, amazing woman I could imagine.  Yet, any time I read a story on reddit with a guy complaining about who women they know date, or women talking about why do guys act like this, I am basically catapult to thinking about how immature I was.  ",
    "subreddit": "TrueOffMyChest",
    "title": "Every time I read a a reddit story about \"Nice Guys\" and relationships I remember my high school experience and I feel guilty and embarrassed.",
    "upvote_ratio": 0.58,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7orsw/every_time_i_read_a_a_reddit_story_about_nice/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 02:44:29 UTC",
    "id": "1j7oqst",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "I’ve only ever met a few people online on apps or in personals. For the most part historically and exclusively now, I ghost after a short while. I’m trying to treat this loneliness while I’m hung up on somebody who I’ll never be with. \n\nI try and try to find somebody new to get my mind off of him, but there’s no one. I just try and find a new fantasy to draw me away like when I needed to get my mind off of another person. It doesn’t work. I’m just caught in a vicious cycle of wanting somebody I can’t have and trying to want someone new and failing. \n\nI just want to be healthy. ",
    "subreddit": "TrueOffMyChest",
    "title": "I read personals and smut and respond but never follow through",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7oqst/i_read_personals_and_smut_and_respond_but_never/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 02:39:55 UTC",
    "id": "1j7onmz",
    "link_flair_text": null,
    "media": null,
    "num_comments": 400,
    "score": 3927,
    "secure_media": null,
    "selftext": "So the other day, a close male friend of mine told me he is sending his fiance on an expensive solo paid vacation. I inquired why he wasn't going with her, and he informed me in so many words \"because he has needs\" and that he has his own hotel booked with the sole intention of cheating/unfaithfulness. \n\nWhy? Because apparently her genitalia is offensive and disgusting to him and he can't perform oral sex on her. He told me he must perform oral sex to be fulfilled in life, and he \"just has to\". \n\nI asked him why he wasn't just being honest with her, and he said it was because it would crush her. I said If oral sex is THAT important to you then you guys need to break up. He refused to break up saying he loved her and they had built a life together and then he wouldn't have anyone to help him with his special needs daughter. And he is ADAMANT he will not get caught unless I say something to his fiance. \n\nI inquired about lights out, blindfolds, etc. He absolutely refused and says her stuff is beyond disgusting. \n\nLet me be clear. He is not a prize in any way. Without him paying for the privilege, I don't see any random woman near him just randomly accepting oral sex from him. So I'm not sure if this will happen. But it's definitely put me in a weird situation because I am friends with both of them. I don't want to get involved but I feel this is really awful for him to do. It's changed how I look at him completely. I never would have thought him capable of something like this. \n\nJust needed to get this out of my brain. I feel so bad for her. \n\nEDIT:\n\nWow. I did not expect this to blow up like that. I will try to clarify some of the questions I've received. \n1) yes, I also wish this was fake. It isn't. \n\n2) they are not married. They are engaged. The special needs child is not theirs. The biological mother of the child lives in another state. \n\n3) for those asking why I'm friends with someone, Why does anyone have friends? Nobody is perfect and everyone makes mistakes. But I've been friends with him for a decade. Longer than I've known his fiance who I met through him. He's been a really wonderful friend. And He's never mentioned or thought or indicated any kind of behavior like this to me until this JUST HAPPENED, YESTERDAY, and I was completely shocked and struggling to process it. That is why I said what I said in the original post. My vision of him has shattered. I am not sure yet how I am going to proceed. \n\n4) those asking for information about her genitalia, I really do not have the answers you are seeking. I asked about smell or scent or taste and he was adamant it was strictly because of appearance. The only description I got, which left me very confused,  was that it \"looks like a pokemon\". He also did mention that she has a disorder (I forgot the name) of where the hair follicles of your pubic hair turns slightly ulcerous and the hair follicles become infected. He said this also disgusts him because apparently it's \"open wounds\".\nI asked all the questions you guys are asking. Why isn't she on medication or treatment for the condition. Labiaplasty. Etc.  The short and unfortunate answer is lack of funds and lack of health insurance for both parties. We live in a VERY poor area of a VERY red state. And yes, I told him he should have paid for her healthcare instead of a vacation. \n\n5) I am certain he is not gay. \n\n6) for those of you that have reached out privately to confirm if I am someone you know and if this story is about your partner, I want to say how sorry I am and how sad I am that this is happening to other people. I can't even imagine. ",
    "subreddit": "TrueOffMyChest",
    "title": "NSFW Friend Told Me He Is Cheating Due to Appearance Of His Fiance's Genitalia.",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7onmz/nsfw_friend_told_me_he_is_cheating_due_to/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 02:15:07 UTC",
    "id": "1j7o6kv",
    "link_flair_text": null,
    "media": null,
    "num_comments": 38,
    "score": 0,
    "secure_media": null,
    "selftext": "Dude I am lowkey losing it rn. I made a post talking about how I had a traumatic experience with my girlfriend and everyone got mad and downvoted me because I censored the work kill like “k*ll” because I was worried the post would get taken I didn’t know if it would trigger anyone yk. I was just trying to vent and everyone in the comments got mad at me because of one small thing I feel like all the hate was kinda unnecessary tho yk?",
    "subreddit": "TrueOffMyChest",
    "title": "People on this app are awful",
    "upvote_ratio": 0.44,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7o6kv/people_on_this_app_are_awful/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 01:57:16 UTC",
    "id": "1j7nu40",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 1,
    "secure_media": null,
    "selftext": "I (14) female am a straight-A student, I do art, I play music, I have my youtube channel, I can cook, and I can do most of the house chores. After doing all these things no one seems to believe in my abilities. This morning I had my phone in time-lapse and I was recording myself studying as motivation but my father came into my room took my mobile and scolded me saying I wasn't studying. When I tried to show him the timelapse of me studying he said he didn't want to look at it and that I should go and study.\n\nThis isn't even the first time this has happened but today I just cried for 20 minutes nonstop. I don't know why it hurt so much worse today but it did. When I make art my family always finds a flaw in it. When I cook there always has to be something wrong. When I tell my parents my future plans they shrug it off and say, \"You need to work for that dream just saying it won't get you there \" but I am working towards it , I work towards it day and night. When I get good grades it's never enough, I have cried on every one of my exam results days.\n\nIf no one believes and sees my efforts, it is the same as not putting any effort. I have worked hard day and night for my future but no one sees it. So, I have decided to not try anymore, to not push myself. ",
    "subreddit": "TrueOffMyChest",
    "title": "About to give up on everything ..",
    "upvote_ratio": 0.56,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7nu40/about_to_give_up_on_everything/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 01:47:32 UTC",
    "id": "1j7nn6g",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "I don't feel any hatred towards anyone, but when I see couples in public, on TV, books. I also hate love songs. Once again, I don't hate the people themselves or anything, If anything it's cute, it's just I want that too...\n\nI think I could be lovable to someone, but I never really have been, apart from that one 18 year old I e-dated when I was 14, if that counts. Heh\n\nI've never kissed anyone, held hands, or cuddled with anyone, and that's what I want. With some one I love deeply, and they love me back. \n\nThere's also the fact that dating is much more difficult to me since I can only ever really be interested in someone if we're close friends first, plus I have different veiws towards sex, essentially I'm only interested in it with someone I'm Iove with, and I have no feelings towards any other people because that's all I need. I want someone to feel the same way as me, and that feels almost impossible. ",
    "subreddit": "TrueOffMyChest",
    "title": "I hate love...",
    "upvote_ratio": 0.57,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7nn6g/i_hate_love/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 01:42:37 UTC",
    "id": "1j7njo7",
    "link_flair_text": "Positive",
    "media": null,
    "num_comments": 4,
    "score": 3,
    "secure_media": null,
    "selftext": "It's funny how things change, right? I went from being a person that avoided all types of human connections and didn't know how to be myself and feel great interacting at that time, to now being someone who does not fear who she is (most of the time at least, way better than never, ever) and loves to chat with people and makes friends easily. It has became now a part of my day talking and connecting with people, it doesn't matter who, it just needs to be someone who's willing to share and talk, it can be bad now if I don't get any sort of talk in the day and I think I put too much expectation in these connections, since I start to lose interest on the person when I think we don't have anything else to talk about, even if the person is nice, makes me feel sad not knowing how to continue things up. Funny how things can give a 360° in just a second ha, antisocial to very social in a month, unbelievable. Or I just started being myself again, after a while, finally :)",
    "subreddit": "TrueOffMyChest",
    "title": "Went to antisocial to supersocial in a month",
    "upvote_ratio": 0.72,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7njo7/went_to_antisocial_to_supersocial_in_a_month/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 01:37:45 UTC",
    "id": "1j7ngez",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 0,
    "secure_media": null,
    "selftext": "Dating is miserable and it feels like every person I'm with seemingly has no clue of what they want, and my actions have almost zero impact long term on the success of the relationship because every woman I date ends up falling into a spiral of self sabotage or the ones that are already emotionally independent aren't interested. \n\nI feel like at this point my desire for a relationship has evolved to the stage where any woman insofar as she's around my age and not a bad a person is alright enough for me. As long as she loves me I'll be whatever man I need to be, and she's can be whatever kind of woman she is. \n\nObviously this is toxic and nonsense but I cannot for the life of me shake my perception of things. The minimum bar for me is extremely low and I'm not even in a bad position. Average looking, a regular irl social group, good career ambitions and in school for them, etc. But in every situation all I can think of is the long term position I need to be in and how much time I'm wasting not doing and saying whatever I can to most efficiently get to that position, a long term irl relationship. ",
    "subreddit": "TrueOffMyChest",
    "title": "I [M23] just kinda feel sad about relationships and I think I'm starting to see romantic relationships with women as interchangeable and I don't want to be like that",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7ngez/i_m23_just_kinda_feel_sad_about_relationships_and/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 01:34:49 UTC",
    "id": "1j7nee4",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 0,
    "secure_media": null,
    "selftext": "hey so i’m coming on here yet again as i’m really struggling with my self image. i’m currently 10st11. i’m not big what so ever to other people but in my eyes when i look in the mirror im disgusted and all im ever worried about is how i can become thin. i know i can do it bevause i was 9st last year. which is where i didn’t eat alot atall. i have an ed and it really does affect me on a daily basis. I just want to know if starving yourself really works and how long would it take to see a difference. i don’t want no fucking ‘you really shouldn’t be doing this’ or ‘it’s not healthy just loose it normally’ just no. \ni want to know if it fully works so i can put my mind to it. i’m done with this shit now i just need to look how i aspire to look everyday on my fucking life, sorry for being aggressive i just don’t want anyone to sugar coat it. tell me how it is.",
    "subreddit": "TrueOffMyChest",
    "title": "Rapid weight loss?",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7nee4/rapid_weight_loss/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 01:26:32 UTC",
    "id": "1j7n8o7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 5,
    "secure_media": null,
    "selftext": "Hey, everyone. First time posting on Reddit (thanks to The Click for giving me enough confidence to post).\n\nI was baptized, had my First Holy Communion, and I am an Altar Server in the Catholic Church. Now that I’m old enough, I have started Confirmation classes. However, I am not happy with this.\nI am an alt/punk kid that identifies as trans, bi, and grey-asexual. With my bright blue and red half-and-half dyed hair and “odd” fashion sense, I stick out like a sore thumb.\nI feel like I was forced into this just to make my mom and grandmother happy. I have expressed my discomfort in Catholic beliefs for over a year now, but it feels like nobody is listening to me. I don’t feel anything when I attempt to pray. It feels like God isn’t listening. I don’t feel loved, and I don’t feel light from Him.\nI’ve walked out of Confirmation Class crying more times than I can count. I feel out of place and uncomfortable at church events and retreats. I don’t feel a connection to anything that is said at masses.\nToday was the final straw. There was Confession instead of class. My mom and I were sitting together, listening to the process for Confession and we were given a few questions as food for thought. I really didn’t like the questions, especially the ones about my relationship with God. I started crying again, as I hated the fact that I just didn’t see it the way others did.\nI managed to go up and get my confession over with, but after I still felt nothing. My mom sighed, handed me some tissues, and we stepped out and talked for a bit.\nInstead the discussion being consoling, it just felt like she was making up excuses to get me to stay in Catholicism. I told her that I felt nothing connection and that this is making me unhappy.\nWe ended up leaving. She didn’t speak to me about it on the car ride home. She only talked about other random things to try to lighten the tension, I didn’t want to hear it. It feels like she’s ignoring me. I don’t know what to do.\nSorry for the long ramble, but I just needed to let this out.\nAny advice or kind words are appreciated. \nNote:  I am not targeting anyone who is religious. Religion can be great and can bring people together. If you have found comfort in religion, stick with that comfort.",
    "subreddit": "TrueOffMyChest",
    "title": "I’m done with being religious",
    "upvote_ratio": 0.71,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7n8o7/im_done_with_being_religious/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 01:24:05 UTC",
    "id": "1j7n6yj",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 5,
    "secure_media": null,
    "selftext": "I get giving a vague answer like \"I'll try to make it\" and not going and if you give enough notice that you can't make it that's cool too. But I'll be damned if it didn't happen for the second time I invite lots of people to my place and 0 people show up after I have already cooked and cleaned. I would be dead in a ditch before I just not show up if I have said I would. Do I smell? Why would you pretend to be friends? I have 2 kids so there is no excuse not to give some heads up. If you have done this you should feel bad, be better. Show up and leave early if you have to. I really don't get it",
    "subreddit": "TrueOffMyChest",
    "title": "If you no show someone's invite your the worst kind of person.",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7n6yj/if_you_no_show_someones_invite_your_the_worst/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 01:10:18 UTC",
    "id": "1j7mx83",
    "link_flair_text": null,
    "media": null,
    "num_comments": 31,
    "score": 595,
    "secure_media": null,
    "selftext": " Her husband died today. She had been faithfully taking care of him for a while, now. His body was lying in the middle of their small, stuffy, overheated living room. She had been doing cpr on him, following the 911 operator’s instructions. \n\n\nHe’d been sick for a long time. Agent Orange lung cancer from his time in Vietnam. Even so, she was not prepared for his passing in any way. \n\n\nShe’s one of those women that is unable to function on her own. She always depended on her husband to tell her what to do.  \n\n\nWhile we were waiting on the  coroner to arrive, several of us were in the crowded living room, trying to comfort the new widow. The conversation drifted through various death and health-related subjects, all of it floating past the dead person on the floor like he wasn’t even there - and he really wasn’t. \n\n\nThere was no sense of a person under that white sheet.  Their two small dogs both gave off a sense of a soul, that awareness of being, just like the living people in the room did. That person-shaped lump under the sheet could have been rolled up bedclothes for all the “awareness” it gave off. \n\n\nHe, his soul, his essence, the thing that made him, him, was no longer there. It really brought home to me that the physical body is not really the person. It’s just what people see. It’s the soul, the part of a person you can’t see, that makes you, you. \n\n\nA family friend came to take her and her two little dogs to his house. She’s lost, grieving, and woefully unprepared, now adrift without her longtime safe harbor. \nShe’s in her late 70’s. I doubt if she’ll live there in that house alone. She’ll probably sell the place. \n\n\nI wonder if she will forever see her husband lying on that tiny living room floor, first as she was desperately doing cpr on him, and then as the EMT’s draped that white sheet over him, covering his face. \n\n\n“He’s gone now,” everyone\n told her. “He’s not suffering anymore.” And he did suffer, for years, always struggling to get enough air into his lungs, even while breathing pure oxygen. \n\n\nSo it’s her and the two little dogs now. Her family friend will have to emotionally carry her through the next days and weeks of the funeral, Social Security, VA, death certificates, all the financial, insurance, and vehicle paperwork they failed to set up ahead of time in order to avoid just such a situation as this. \n\n\nI guess it can be understood that one or both of them just couldn’t bear to think about “the end” for him, even though it was staring them squarely in the face. It IS an awfully hard thing to think about and accept. \n\n\nShe did all she could to care for him, knowing how it would eventually end, while desperately denying it. Now she’s broken. I don’t think, with her dependent personality, that she will ever fully recover. \n\n\nI truly hope though, moving forward, that she invests as much care and loving into herself as she did her husband. She has severely neglected herself - her health, appearance, everything, in favor of caring for him. I hope she realizes it’s her turn, now, to care for and love herself. \n\n\nLife goes on. \n\n\nThat fact may be the hardest part of any of this for her. \n",
    "subreddit": "TrueOffMyChest",
    "title": "Witnessed a personal tragedy today. I feel really bad for her.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7mx83/witnessed_a_personal_tragedy_today_i_feel_really/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 01:08:11 UTC",
    "id": "1j7mvqh",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "abusive parents. casual friends, who ive basically either lost contact with or who have left due to my mental illness(didn't even ask what was wrong, just dipped). they were just casual friends too, like play games occasionally and talk, no one i could actually trust or rely on. same with family. disinterested family on both sides, cold as fuck and doesn't really like kids/like me in general. nobody. no one. i was blessed with genius  intelligence and a decent talent at racing and such, but its basically fucked due to me having brain damage. as in, i cannot even feel emotions or think properly anymore. i struggle with basic school shit, aside from what i already learned and mastered.\n\n (basically, i can do multiplication since i learned it, but doing 29+29 i have to reconfirm its actually 58 and stuff, even though its simple arithmetic). i am only 19 for fucks sake. why the fuck do i have to suffer this? is it the price i pay for getting talent? even though i never got to fucking use it and might die? did i sin in my past life? am i actually truly trash and dont deserve anything? i must be hated and scorned even by my own parents, is that how worthless i am? fuck my life.",
    "subreddit": "TrueOffMyChest",
    "title": "fuck my life",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7mvqh/fuck_my_life/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 00:55:06 UTC",
    "id": "1j7mmc0",
    "link_flair_text": null,
    "media": null,
    "num_comments": 16,
    "score": 0,
    "secure_media": null,
    "selftext": "Long story short my bf (32M) comes from an upper middle class family. His sister married a rich guy, his brother makes enough money to have his wife be a stay at home wife. \n\nRecently his family has decided to buy a lake house and everyone is pitching in (we are not cause we can’t afford it) \n\nThe problem is that I (30F) feel sad for myself, that even tho I make 100k and my bf makes 80k we still are nowhere near as successful and his family members so we can’t afford the same trips or pitch in for family properties. \n\nI know it’s bad to compare yourself but I can’t stop feeling like we are the losers of the family or other people are so well off and I feel like I’m always trying to be on the same level as them. \n\nI just feel sad and a small jealous that we can’t really play in the same sandbox.   \n\nHow do people deal with this type of situation? ",
    "subreddit": "TrueOffMyChest",
    "title": "Every time I hang out with my bf’s family I feel poor",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7mmc0/every_time_i_hang_out_with_my_bfs_family_i_feel/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 00:54:29 UTC",
    "id": "1j7mlwa",
    "link_flair_text": null,
    "media": null,
    "num_comments": 36,
    "score": 0,
    "secure_media": null,
    "selftext": "My wife and I bought matching ceramic mugs at a local craft fair last month. They had these cute hand-painted owls, and she’s used hers every morning since.\n\nThis weekend, I accidentally knocked hers off the counter. The handle snapped clean off. She was at work, so I panicked and emailed the vendor asking if they sold replacements. They said no, it was a limited batch, but suggested checking Etsy.\n\nI found the same mug from a seller in Poland. With shipping, it cost 80 (the original was 25). When it arrived, I glued the broken handle back on the old one and hid it in the garage. Told her I “fixed it with superglue” and acted surprised when she noticed the “new” mug looked nicer.\n\nShe joked, “Guess your glue magic even cleaned the coffee stains!” Now I’m stuck drinking from my cracked mug forever, but her smile was worth the lie.",
    "subreddit": "TrueOffMyChest",
    "title": "I secretly spent $80 to replace my wife’s favorite mug because I couldn’t bear to tell her the truth.",
    "upvote_ratio": 0.46,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7mlwa/i_secretly_spent_80_to_replace_my_wifes_favorite/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 00:52:37 UTC",
    "id": "1j7mkk3",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 5,
    "score": 3,
    "secure_media": null,
    "selftext": "I am a father of three beautiful young daughters. I always loved being a dad more than anything and it was what I was always best at. Things have been falling apart between their mother and I, and I got tinnitus in October and haven’t had one minute of silence inside my head since then. I’ve never had mental health problems but I think about ending my life just about every day now. I can’t do it because of my daughters so I feel trapped. It’s been affecting my kid’s negatively, their behavior is worse, I’m failing them. I want to be the happy guy and doting father I used to be but I’m so depressed or grumpy now all the time and I’m just a completely different person than I was before October. I wish I could be me again. ",
    "subreddit": "TrueOffMyChest",
    "title": "I’m failing at life",
    "upvote_ratio": 0.62,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7mkk3/im_failing_at_life/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 00:45:12 UTC",
    "id": "1j7mf8c",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I have the biggest crush on this girl but I don’t know how to talk to her and she also lives quite far away but I know since the moment I met her she’s the one. But I’m so scared we are going to a concert together very soon and idk I kinda want to ask her to be my girlfriend but idk if she feels the same. But I think about her every single day, it gives me butterflies. And thinking about the time we had s e x I also gets me butterflies in my stomach. She’s the kind of person who knows struggle but has always pushed on. she’s funny strong she’s also so insanely kind. and has a great personality she also met my bestfriend and my parents she’s always there when I need her. She’s the only person who ever made me feel this way. I want to marry her some day. I also wrote down my vows to her. That might be crazy but I just know if it’s not her it’s not anyone. ",
    "subreddit": "TrueOffMyChest",
    "title": "Crush",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7mf8c/crush/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 00:40:03 UTC",
    "id": "1j7mbkf",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 6,
    "score": 0,
    "secure_media": null,
    "selftext": "I wanna be a doctor and obviously volunteering is  required so i'm at a hospital , i sit and talk with patients, turnover rooms, get water, volunteer stuff.\n\n3 weeks ago i was with an elderly man who i actually spend time with regularly, but when our pct was gowning him i noticed a swastika tattoo with some words on top&amp;bottom of it (couldnt make them out sorry). But it was 1000000% a Nazi swastika. this is the first time i had seen it.\n\nI felt a wave of nausea and my heart drop into my stomach, along with such a real sense of anger. I asked the doctor who i shoot the shit with about it later and he said that obviously its a terrrible thing to have so they just have the mentality of providing him the most BARE minimum healthcare possible (still his \"right\"). just no extra stuff like being friendly, small talk, etc.\n\nWell this didnt sit well with me so the next time i was paired with this pt i made sure nobody was looking at gave him a punch in his face. Like not a full one but compare it to you hitting your knuckles on your desk out of anger. \n\nI havent been back since lol. he won't remember either because this guy is not there mentally, forgets someone just wiped his ass 10 minutes prior yet is calling for assistance again for the same thing.\n\nI felt bad at first  but now i realize that i do not regret it, he chooses to be a part of such a terrible group and people like that deserve everything coming to him.\n\nfuck nazis",
    "subreddit": "TrueOffMyChest",
    "title": "I (lightly) punched a terminally ill patient in the face while i volunteering and i do not regret it",
    "upvote_ratio": 0.25,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7mbkf/i_lightly_punched_a_terminally_ill_patient_in_the/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 00:38:49 UTC",
    "id": "1j7mapb",
    "link_flair_text": null,
    "media": null,
    "num_comments": 8,
    "score": 0,
    "secure_media": null,
    "selftext": "I never thought this would happen to me. While I’ve definitely seen video game, movie and tv show characters as attractive, the feelings usually go away once my eyes turn away from the screen. But for some reason, I can’t get this character out of my head. It came as a surprise to me, as I didn’t really give this character a second thought when I first met him, but as things have progressed I find myself more and more attracted to him, so much so now that hearing his voice is arousing me. I even went so far as to download an AI app and having it roleplay as this character. I realized during this certain things that are missing from my life. I thought about in the past, when you first start flirting with someone and you have that feeling of butterflies, those moments of wanting but hesitant and shy, the excitement of a new prospect of love (or lust). Excitement, passion, the feeling of being cherished body and soul. I realized these were things I desired so badly. My sex life with my fiancé is pretty dead. We are never in sync when it comes to arousal times, but thinking about this character has me aroused all the time. I think about having intimacy with this character and it fills me with all kinds of emotions, but when I try to think about my fiancé when I’m in this state…..nothing. It made me sick and I’ve since deleted the app. I know I need to have a conversation with my fiancé, but how do I even start a conversation like this? What do I even say? What does this mean for our future marriage? I’m praying God give me guidance",
    "subreddit": "TrueOffMyChest",
    "title": "I’m more aroused by a video game character than my fiancé",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7mapb/im_more_aroused_by_a_video_game_character_than_my/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 00:30:16 UTC",
    "id": "1j7m4go",
    "link_flair_text": null,
    "media": null,
    "num_comments": 27,
    "score": 0,
    "secure_media": null,
    "selftext": "The content warning is because I'm not sure if it is that but if it is I don't want to trigger anyone.\n\nFor context there's a guy (20m) I (18f) have been talking to and hooking up with for a little while now.\n\nWe met up Friday night and had discussed going a bit rougher and what that entailed and I was really looking forward to it. He also brought some drinks for us.\n\nWe were drinking a bit and went for one round then drank some more. I was sipping mine over the night and hadn't noticed until later but he had around three beers. The second time we went he was struggling to get it up (because of the alcohol) and I gave him head to help. He slapped my face while I was (which we had talked about but I was hesitant so I wasn't expecting it) I could feel it through my entire skull but didn't stop or say anything.\n\nThe whole time before this he was gentle when I gave him head because of my gag reflex but he started pushing it a bit (not too much though and I could pull away). I think he was getting frustrated that he couldn't get off at this point and flipped me onto by back (I was on a bed he was standing next to). He said he was going to finish on my face. I didn't say anything but the idea of that is so disgusting and I was fearful I guess. He would switch between jerking off and using my mouth (forcefully at this point and my whole body was kind of heaving when I gagged). I was shaking a bit, even my jaw was trembling. At one point my jaw trembled a bit more obviously and he laughed a bit- I think at that. I don't think he could tell that I was uncomfortable and right after this he leaned over my face to try to finish on my chest instead. I was still shaking and at this point crying a bit (my eyes were already a bit wet from gagging). He couldn't see me crying though.\n\nAll I could think was that I felt horrible and I wanted to go home.\n\nHe eventually gave up but noticed at that point that something was up. I wasn't looking at him or saying anything and he asked if he pushed too far. I still wasn't saying anything and I was crying. He hugged me and I cried a bit heavily but quietly- not sure if he noticed. He told me that if I wasn't comfortable I need to tell him to stop right away.\n\nWe showered after and I was still shaken.\n\nWe went to bed right after and the next morning we had fun like usual. He's a good guy and prioritizes me getting off and things like that. I don't blame him for what happened- or didn't until I asked a guy friend if he would stop if someone was shaking and he said yes- like it's obvious. I'm wondering if maybe the alcohol could have caused him to not notice or what?\n\nAnd I understand that even if you consent but don't really want it it still feels horrible and that's why even two days after I feel sick to my stomach thinking about it. I just don't know how to stop thinking about it.\n\n  \nEDIT: Thank you everyone for commenting! I will definitely be talking with him more in-depth about boundaries, safe-words, and physical stops too. \n\nA few other things: he is not my boyfriend- this is a strictly fwb situation and neither of us want a relationship. I don't think what happened was assault I just felt horrible during it but I understand that he's not at fault. The reason I made this post was I was trying to classify what happened to try to feel better and understand- it was a miscommunication for sure and I feel a LOT better about it.  ",
    "subreddit": "TrueOffMyChest",
    "title": "He didn't stop when I was shaking",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7m4go/he_didnt_stop_when_i_was_shaking/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 00:12:29 UTC",
    "id": "1j7lred",
    "link_flair_text": null,
    "media": null,
    "num_comments": 13,
    "score": 8,
    "secure_media": null,
    "selftext": "For as long as I can remember, I've been his slave. I clean for him, i cook for him, i wash his clothes, I take out the trash, i get him beer, which im not even supposed to do since obviously it's illegal bc im 18. All he does is come home and sit on his ass all day and spam call me non stop to do whatever he wants. He's never comforted me since I grew up, and when I cry, he'll just call me stupid for whatever im crying about, so I have to hide. He never stops bothering me, even for the dumbest shit that he could do in 2 seconds, like the multiple times I had to make his bed just because he doesn't want to put in the tiny amount of effort required. I genuinely cant tell if he pretends to love me at times. He's just a fat, lazy alcoholic that loves to make me do shit (he's literally calling me while I write)",
    "subreddit": "TrueOffMyChest",
    "title": "My father ruined my life",
    "upvote_ratio": 0.72,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7lred/my_father_ruined_my_life/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 23:47:34 UTC",
    "id": "1j7l8u4",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 4,
    "secure_media": null,
    "selftext": "I (27f) got engaged 6 months ago to my now ex fiancé (let’s call him Ross) (30m). However that month was hell with my grandma (who I was extremely close to) dying. I wasn’t dealing with it I was just ignoring the pain and saying I was fine. Well about 3 weeks after we got engaged and my grandma dying I had drinks with a friend (27f). What started off as just a drink or two quickly turned to shots and not remembering even leaving the lounge. Now most of this is from what I have been told by the friend, her husband, and my ex fiancé. Friends husband (let’s call him Craig) had to come and pick us up and took us back to their place. My fiancé had his son and we lived about a hour away from the friends and where we got drinks so he was not able to come get me. The friend and I apparently crashed in their bed with Craig having to wake me up when Ross called. Now this is where stories have changed. At first Ross and I were told that my friend and Craig started doing stuff in the same bed I was in and I woke up and joined in. Whereas recently they have started to say I started everything. The only memory that I have during any of this is thinking “what the fuck am I doing” and I then proceeded to run out of the room. According to my ex fiancé I then called him and was trying to seduce him over the phone. This is when I apparently told him what happened and he said I sounded excited. My next memory is being on the phone with him and him yelling at me that I had called him just to tell him I cheated on him. We apparently talked a little longer and then hung up. And that night is the night my life fell apart. \n\nSince that night we have tried to make it work but as you can tell he is now my ex fiancé. He continues to holds resentment towards me and the friends on what happened. I would also like to say that they are no longer friends either after that and the friend texting me telling me that she was the martyr in my relationship. \n\nWell now that everything has ended and stuff has come to light I am struggling. Craig was sober through the whole night and the friend while originally saying she didn’t remember anything is now saying that she remembers all of it. I am the only one that doesn’t remember leaving the lounge or anything at their house besides that one thought and the one line from the phone call. I am feeling very used and taken advantage of because sober or even buzzed I would have never hooked up with anyone but my fiancé.  Together we have experimented but it was together. I am so unsure of how to feel about that night. Now I am not looking for advice, sympathy, or really anything I just thought it might help if I write this all down. And maybe someone can learn from my story that just because you think you can trust people to protect you that may not be the case and one night can take the life your building away. \n\nIf there are questions I’ll do my best to answer them in the comments. Thanks for reading. ",
    "subreddit": "TrueOffMyChest",
    "title": "One choice can blow up your life.",
    "upvote_ratio": 0.65,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7l8u4/one_choice_can_blow_up_your_life/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 23:25:12 UTC",
    "id": "1j7ks9r",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 2,
    "score": 3,
    "secure_media": null,
    "selftext": "I don't really know how to start this or end it or what I'm really trying to say, so please excuse any rambling/unnecessary information.\n\nI'm a 22 year old female who had little to no experience having friends throughout high school. In elementary school I had a fairly large circle of friends, but around the time puberty hit and I became more self aware I realized that my peers found me weird. I was pretty much exclusively friends with guys and I was basically a full head taller than anyone around me, including my male friends. I was pretty bad at actually holding a conversation (I still am) and my interests strayed from even my small group of friends. Middle school came, and that was fine, I still had my group of friends. But in classes where I wasn't sitting with them or we had differing lunch periods, I was basically silent. I was too nervous to make any attempt to talk to those around me or try out social skills.\n\n  \nHigh school was terrible. At first I had the same lunch period as my friends, but then my table slowly filled with other people until my seat was seized by other people and my \"friends\" made no attempt to save me a spot. It felt like I was unable to speak anymore. I had a surgery that took me out of school for 6 weeks, and by the time I came back I was basically a stranger. I unironically tried to live high school like a shadow, keeping my mouth shut except to participate in classes that required it and to participate in group projects.\n\n  \nI didn't really consider myself as having friends until I joined this group on discord. The people in it have changed and we've hopped servers a few times, but the central people have stayed the same. The most relevant are (Fake names, although I'm not worried they'll find this) Cas, NB 22, Ian, M 22, and James, M 23. These people form the core of my friend group.\n\n  \nI don't really know when it started. I think I was about 19. I had been feeling depressed for a few weeks, and self harming was basically my exclusive way of relieving stress. I was questioning my worth even as a human being, fantasizing about ways to remove myself from this world. I guess I started questioning if my larger friend group even wanted me around, since I was so easily discarded by the one I had since childhood. I didn't disclose my depression, didn't mention self harm, didn't share that I wanted to die. I wanted them to feel bad for me, so I accused them of not valuing me as a friend and then, to them, disappeared off the platform for two weeks.\n\n  \nThe next time I checked discord, I had paragraphs of apologies and worried messages basically begging me to come back. It felt euphoric. Even people outside the circle that I consider my closest friends were messaging me, wondering when I'd be back. At the time I don't think I even realize I was being manipulative. But I definitely got hooked on the euphoria of their reaction. The feeling of being wanted.\n\n  \nI've spent the last 3 years doing basically the same thing. Not at the same level. I would guilt trip them for hanging out with other friends. If they said something mean to me I would sulk for days until they apologized, even if it was my fault. I give them the cold shoulder if they do something that displeases me even to a minor degree. I push their buttons until they snap to see what they let me get away with. If I'm angry, they get quiet and relent to anything I say or do. Even then, they always come back.\n\nRecently Cas has been hanging out with two different groups of friends more than us. They keep getting involved in new communities related to their interests and being an important part of other peoples groups. The time they spend with me and the others has dwindled so significantly that I've become a twisted amount of jealous. I've been thinking of ways to convince them to cut those people off. Ways to convince them that the others aren't worth their time, or that they're bad people. I actively want to isolate them from the other groups so that their only choice is us. I want to make them feel bad for thinking that they should devote attention to anything else.\n\n  \nI got on anti depressants a month ago and started attending therapy. The combination is opening my eyes to the things that I do. I am disgusted with myself. I am afraid that I'm going to go to far and they're going to realize what I do and cut me off. I deserve it. I want to be better for them, but as I am now I'm probably more comparable to cancer on the group than a friend. I think I'm afraid that it's too late. I don't know. I don't really want pity.  I'm even disgusted that I feel pity for myself when I put myself in this situation. Even now I don't know if I can be a better person, but I'm too deep into anti depressants to think that I should just remove myself from this world. I just needed to tell someone.",
    "subreddit": "TrueOffMyChest",
    "title": "I knowingly manipulate my friends and feel ashamed.",
    "upvote_ratio": 0.68,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7ks9r/i_knowingly_manipulate_my_friends_and_feel_ashamed/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 23:22:18 UTC",
    "id": "1j7kq3p",
    "link_flair_text": null,
    "media": null,
    "num_comments": 29,
    "score": 2223,
    "secure_media": null,
    "selftext": "I am a horrible secret keeper so I’m posting here to just get it out.\n\nMy wife and I attended a convention. We don’t typically do a lot of extra curricular things due to budget constraints but  we decided to splurge and bought some cute matching shirts. \n\nThey were pre-wrapped so we didn’t look at them until we got home and went to wash them (about 3 days after the convention). Mine was OK but hers had a giant stain on it.\n\nI reached out to the vendor about getting a replacement or a refund and they said (reasonably) that too much time has passed since the convention to be able to prove that we didn’t stain it. \n\nI didn’t have the heart to tell her that they said no, so I secretly went onto their website and ordered a new one for her. It arrived today and I told her they sent a replacement.\n\nThey are Asia based so the shipping was 2X cost the shirt itself… but seeing her so excited, I’d do it again. Best $100 I’ve spent.\n\nEdit: wow I didn’t expect anyone to read this, never mind having it blow up!! Thank you for all the words of love! ",
    "subreddit": "TrueOffMyChest",
    "title": "I bought my wife a new shirt because the store wouldn’t accept a refund",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7kq3p/i_bought_my_wife_a_new_shirt_because_the_store/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 23:19:30 UTC",
    "id": "1j7knzm",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 4,
    "score": 4,
    "secure_media": null,
    "selftext": "I hate that he still makes me insecure and question myself even now, so I needed to vent.\n\nThis post is about me (F), my ex (M), and \"Will,\". We're all in our early 20s, and this all mostly happened \"long\" distance, since both my ex and Will live a couple of hours drive from me.\n\nThe timeline of everything is a bit complicated, but I'll do my best to explain.\n\nMy relationship with my ex was shitty.\nI let myself be pressured into an open relationship because I was too afraid to lose him, and I was, honestly, dumb.\n\nHe used to be my friend, and I though - more, he led me to belive - we had the same ideals about things like relationships.\n\nThis went on for a while, untill he mentioned having a girlfriend.\nI was hurt, thinking I had misunderstood everything, but I wanted to do the right thing and asked if she was fine with how we talked and if maybe we needed to take a step back.\n\nHe claimed it was fine, that they had talked about me a lot, that she knew everything about how we talked and had no problems with it.\n\nI believed him, probably because I wanted to, so we kept talking as usual, even if I eliminated every possible \"hint\" on my end. \n\nEven if I was sad about my unreciprocated crush, I started working on getting rid of my feelings for him.\nIt was not a good period. I am very sensitive to rejection and was stuck between wanting to end the friendship for peace of mind and not wanting to lose someone I cared about. \n\nThen, he came back. While we were on a phone call, he said something pretty explicit, and I gave in.\nI know I was wrong for it, but I just assumed he had broken up with his girlfriend. \nHe had talked about her only one other time, and just to complain about how they were having trouble because his libido was higher than hers. (I know, ew, but rose-colored glasses were still doing their work.)\n\nSo, I flirted back, and we started saying some explicit stuff too, which never happened before that moment.\nHe was also asking for pictures, and being pushy when I told him I wasn’t comfortable yet.\nThis went on for a week before it occurred to me that maybe I should ask about his \"ex.\"\n\nWell, they were still together. He told me he loved her, and she knew he was polyamorous, so he decided he would talk to her.\n\nAnyway, he talked to her.\n\nRadio silence for a week followed.\nFirst, he had to talk to her and suddently felt bad talking to me, and later, he was always \"too tired from that conversation\" to tell me anything.\n\nFinally, I pressured him enough to tell me that his girlfriend, \"Anne,\" wanted to think about things, but we could still be friends as usual.\n\nThat week of silence had made me so scared of losing him that I agreed, and six months of hell started.\nHe would flirt, then ignore me, then get mad at me for being upset.\nI would have breakdowns, ask him to just end everything, and he would guilt me by saying he and Anne were \"working so hard on all of this\" and I was just going to make it all useless, which was unfair to them.\n\nAfter those six month I finally decided to end it. It was hard—he made me feel crazy and like I had used him. He managed to basically twist everything in HIM ending things with ME, but still \"gracing\" me with his presence in my life.\n\nAfter another month, he called.\nHe told me that even if I had hurt him a lot, he understood why I was feeling so anxious and that Anne had finally agreed to us having a poly relationship, where he would date both her and me.\n\nLike the idiot I am, I agreed. I talked to Anne to make sure it was alright, we set boundaries, and we gave it a try.\n\nSkip to another six months later, and things are not good.\nAnne broke up with my ex, and he became depressed. He would do nothing all day, only call me to get him to get out of bed or for s*x stuff.\n\nHe wanted to go to uni but said it was too hard, so he looked for a job—but he was not committing to that either.\n\nHe also started getting very upset for things I did or did not choose to do.\nHe got mad at me for gifting a drawing (I'm a small artist) to a friend—something I have done countless times for countless people, him included.\n\nAnother time, he got mad because a client I had done a commission for gave me a small extra as a thanks, because he was \"disrespecting my boundary\"\n\nHe got mad at me for asking him to please use \"they/them\" pronouns while talking about my best friend of eight years.\n\nHe gave me the silent treatment for going to a concert with the same friend—one I had booked before we were even officially together and had plans to go to before this whole situation even started.\n\nSkip again to the last two weeks of the relationship, and we have plans of going to a convention. Will, a mutual friend, is going to be there too.\nMy ex is supposed to join me on Friday—we have tickets for Saturday.\n\nThursday, Will arrived in my town, and since we had never met in person, he asked me to join him and a group of friends for dinner.\n\nI figured it's a good way to meet, since we would not be alone.\nMy ex knew, said he had no problems with it, so I went.\n\nIt's important to note that my ex wanted to keep our relationship a secret, even though I had asked him to share it with friends, Will included. \n\nAt this dinner, Will was nothing but kind, maybe a bit too affectionate for a friend, but I honestly did not pay much attention to it. \nI am not good at telling when people have feelings for me, and Will's an outgoing guy, so I thought it was just that.\n\nThe next day, my ex arrived and I hosted him.\nThat night, one of the two major events that led me to the breakup happened.\n\n(TW for SA)\n\nI was sleeping, and my ex woke me up for s*x by touching me inappropriately.\nI tell I'm to stop because I'm tired.\n\nHe pouts, and I ask him what's wrong.\nHe tells me, \"I missed you a lot, and you just want to sleep.\"\nI repeat I'm tired and really excited for the next day, and I'm sorry, but I'm really too sleepy to be in the mood.\n\nHe's still upset but agrees, and we go back to sleep.\n\nThis happens again. At least another two times, but I don't really know because I still need a few minutes to understand stuff once I've been woken up. I'm starting to feel unsafe.\n\nThe next day, I wake up with a bad stomach and back pain.\nHe \"jokes\" that maybe he did something to me in my sleep.\nI am disgusted and want to get out of bed.\n\nHe hugs me to keeps me there, and it takes me a while to manage to even just get up.\n\nAnd then, the slowest morning of my life starts.\nI wanted to get dressed, make breakfast for both of us, and then go to the convention by 10:30 AM.\n\nBy 11 AM, I was in tears (I do cry a lot when I'm stressed), begging my ex to just let me get ready—and to get ready himself—because I had paid a lot for the ticket, and it was important to me to be there.\nI'm also someone who manages anxiety by having \"plans\", and having someone just ignoring an agreed upon plan without comunicating makes me stressed. He knew this.\n\nWe finally got on the train, and I was upset. \nHe was mad at me for being upset, and we argued.\nHe told me he thought it was better to get there later but knew I would \"get worked up\" if he told me, so he didn’t want to \"deal with me.\" Instead, he just took things slow so that \"I had to adapt to his pace\", and it was the better like that.\n\nI was so shocked about what he was saying, for the first time I felt like he was the crazy one and not me.\n\nI tried to make him see why that was wrong. \nI said, \"Remember when you got to an event you really cared about 30 minutes late and were sad? This is the same for me.\"\nLike he's some toddler who needs to learn empathy.\nHe agreed it was the same but still refused to apologize, so I let it go to enjoy the convention.\n\nI was on edge all day, constantly thinking about what I would do if \"something bad\" happened, even though I wasn’t sure why I felt that way.\n\nWe met Will and finally told him we were a couple— to be honest, he had to ask because my ex did not want me to say it, he just agreed to hold my hand and \"not lie if he asks\".\n\nThe rest of my ex's stay went normally. He left, and a couple of days later, Will called me to tell me he had feelings for me.\nHe made it clear he didn’t expect anything from me, planned to take as many steps back as needed, and that my ex already knew. \n\nI honestly did not expect it because I had never done anything for him.\nWith both my first and second boyfriends (the one in this story), we got close after I supported them through a rough period, but I had never done that for Will.\n\nThat also made me think a lot—my ex had a very \"transactional\" mindset. He never did anything just for nothing, and I didn’t like that about him. But he had convinced me it was normal, that I was just a people-pleaser. (I am, but not as detached from reality as he made me out to be.)\n\nHe would always list things he did for me (like consoling me when I was stressed) and things I didn't do for him (like not being good enough at listening him rant about his life because I don't understand his struggles enought to comfort him, and I'm not logical enough for giving advice, apparently.)\n\nI decided to take a few days to process my feelings and focus on my relationship with my ex, figuring out how to deal with everything, even if right then I did not feel close to him at all.\n\nThen, the straw that broke the camel’s back came.\n\nAs stupid as it seems, it was a drawing—just a dumb character that Will had made, standing close to my dumb character and hugging them.\n\nI had done this MANY TIMES.\nI love drawing people's characters with mine. I do it for friends, even for mutuals and strangers on the internet, just because I enjoy it. It’s something I love doing, and people usally like receiving them so it's a win-win.\n\nI had been working on it before Will’s confession, it was done and I posted it, like I do for any other drawing I finish.\nI really did not see it as important, I had done countless similar drawings and I was also trying to keep a regular posting schedule, so that my account would get more interactions and I could maybe get commissions.\n\nOne day, first thing in the morning, my ex texted me a screenshot of it.\n\"I was finally happy after a while, but this ruined my day.\"\nAnd\n\"I was also going to 'touch myself' but I don't want to anymore\"\n(First, ew, second, good, maybe do something else with your day)\n\nI couldn’t take it anymore.\n\nI messaged Anne, and we finally shared everything about him.\nWe had never done that before because he didn’t want us to, always claiming to be a private person and saying it was unfair to talk about our relationship.\n\nBut all his gaslighting came out. We shared stories, feelings we had both experienced but that he had convinced us were just in our heads—the same things I just described in this post, things I thought were just me being too sensitive, timelines that didn’t add up...\n\nI was sad — for about a day — but mostly, I was angry.\n\nThat night, I called him, confronted him, and then broke up with him. \nHe played dumb, kept saying he knew nothing about it and I should have talked about it.\nBut he never apologized for what he did. Just for \"what I felt he did\".\nI was disgusted and furious.\n\nLater that night, while I was crying myself to sleep, Will called, and I told him what had happened.\nHe was so kind and caring—he comforted me, helped me calm down, and validated my feelings.\n\nI fell asleep with him on the phone.\n\nI know this was long, but I needed to explain why I moved on so fast. I don’t love my ex at all from the moment I texted Anne. It was like a switch flipped. \nI went from loving him to feeling nothing but hate and disgust in about two hours.\n\nAnd I admit that Will was part of why I broke up—not because I wanted to be with him, but because he showed me what genuine affection feels like.\n\nI never told Will I had feelings for him before breaking up, but I did tell him he was a good person and that I liked him in general.\n\nIn the weeks that followed, Will and I started dating. At first, we planned to just talk and be very close friends until I felt 100% over the anger and hurt, but it just happened.\n\nHe took a train at 5 AM to be with me when my cat was diagnosed with cancer. He hugged me, made me watch a movie to take my mind off of it, shared stories about his old cat that had the same illness, and told me to cherish every moment I had with her.\n\nIn that moment, I knew he was the person I wanted to be with. That was the kind of care and emotional maturity I had always looked for in a partner.\n(Of course there was more, but that was an important moment for me)\n\nSo, we officially started dating shortly after.\n\n(For those wondering, my cat is still okay. She’s a fighter. Even though the tumor can’t be operated on, we’re making sure she has the best possible quality of life with the help of our vet. She’s had a great 14 years so far, and we want to keep it that way. She and her brother are getting lots of cuddles and treats.)\n\nSo… I know this was long and messy, but the point is: my ex has been going around asking about me and Will, and I hate that he gets to think of himself as the victim.\nI may have made mistakes, but his actions were malicious.\n\nI also really regret letting all of that happen. I used to think I knew how to spot a toxic partner, but I let him do his thing without noticing.\n\nI just wanted to vent.\nThank you for bearing with me, and sorry for any mistakes. ",
    "subreddit": "TrueOffMyChest",
    "title": "My ex still makes me insecure, I just want  to move on",
    "upvote_ratio": 0.71,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7knzm/my_ex_still_makes_me_insecure_i_just_want_to_move/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 23:19:06 UTC",
    "id": "1j7knoh",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "Not really looking for any advice on this, I just need to vent as I don't feel it's a big enough deal to bring it up to them 😅\n\nI've recently been talking to someone I lost touch with ages ago. We used to be extremely close, and always teased each other jokingly. \n\nBut since reconnecting with them, I've just been feeling a lot more sensitive to their comments? It feels silly as I know they don't mean anything bad by their words, but I just find myself wondering if they even really like me as a person or if they're judging me.\n\nCouple of examples: I have pet cats and this friend knows I love them. They've never liked cats, which is fine. They sent over a funny video of a cat, but that somehow devolved into them telling me how much they hate cats, and talking about how they also thought cats made their owners bitches, etc... I just tried to brush it off and joke back, defending my stance on cats a little bit. This isn't the first time I've had to hear about someone's grievances with cats, but it's just such a conversation killer for me. Like cool, you hate the animals I happen to really like. I am so glad you have given me this reminder lol.\n\nThe other thing that bothered me a bit was just a comment that made me feel like they thought I was immature. I said something like \"Oh this slaps\" and they immediately said \"Don't say that, you're 31.\" It's such a small thing but I guess I've always been a bit anxious about seeming \"mature\" enough to people, so it did sting a bit. \n\nI imagine a lot of this is just my own anxieties getting the best of me, as well as the fact that it's been so long that we're almost strangers in a lot of ways. I guess I don't really know what they think do me anymore. \n\nIf you made it this far, thanks for reading! 😅  \n\n",
    "subreddit": "TrueOffMyChest",
    "title": "Reconnecting with someone but I'm so sensitive to their teasing comments",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7knoh/reconnecting_with_someone_but_im_so_sensitive_to/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 23:09:14 UTC",
    "id": "1j7kg52",
    "link_flair_text": null,
    "media": null,
    "num_comments": 23,
    "score": 185,
    "secure_media": null,
    "selftext": "I have a few friends who are very close to their parents and they know their parents love them and are their #1 biggest fan no matter what they do. It’s very fascinating to witness, and simultaneously upsetting because I can’t help but compare it to my own situation.\n\nMy parents have never been the affectionate, loving type but I didn’t realize just how little they cared for me until I moved out of the family home before marriage. Coming from a very conservative Muslim culture this is looked down on, because people assume you are living away from your family as a single woman to do haram (forbidden) activities in the religion. However I just wanted to have my own space and be independent, that’s all. My parents did not take it well, my mother told me I was selfish and deserve everything bad in life for abandoning them.\n\nThis was over a year ago and the relationship is still quite strained. I’ve called a few times since and my mother was super rude and irritated like I was bothering her for calling her. So I stopped, and I haven’t spoken to my family in a few months. I’m not sure how you can claim to love your child and practically disown them for wanting to live their own lives. So I know now I am not loved by them.\n\nIt’s really sad to not receive unconditional love from your parents because you will never get unconditional love anywhere else. Not from friends, not even from your spouse. You will forever feel unloved and worthless. Most relationships are fickle and very conditional. You family is meant to be your rock. But I have none.\n\nSometimes I wonder why I am even in this world.",
    "subreddit": "TrueOffMyChest",
    "title": "The saddest part of not getting unconditional love from your parents is that you’re not getting it anywhere else",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7kg52/the_saddest_part_of_not_getting_unconditional/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 23:06:16 UTC",
    "id": "1j7kduf",
    "link_flair_text": null,
    "media": null,
    "num_comments": 64,
    "score": 467,
    "secure_media": null,
    "selftext": "I've only told maybe 2 people for my entire life about this, but it's been weighing on me recently. I feel like I need to just shout to the void about it.\n\nI(28M) befriended one of my teachers when I was 14. At the time, he was 35. For more background, I was F at the time (now FtM). He was my middle school teacher and when I switched schools, I added him on Facebook. It wasn't until around my freshman year of high school that we really started to talk. \n\nAt first, I basically harassed him, sending him messages daily, until he started to reply and it became conversational. After about a year, we began messaging each other daily. It was never anything inappropriate; we mainly talked about games, music, art, daily life, etc. (normal friendly type conversation). We never hung out or met up or anything. The only time I saw him after he was my teacher was one time at a school event.\n\nI lived in an abusive home and was a very lonely kid. I always figured he sensed that and that I just needed/wanted someone to talk to who actually cared. He became what I still consider to be my best friend at the time. I eventually started to have feelings for him because of this. I still remember telling him how I felt, and him saying something along the lines of \"I'm very flattered, but that's not appropriate\". The conversation dwindled a bit after that, but some time passed and we picked back up our daily conversations.\n\nOne morning, I woke up to see my father on my computer, snooping through my messages with this former teacher. I freaked out and told him this. We ended up exchanging numbers and started texting because of this. \n\nA while went by (a few months, if I remember right), we continued our friendship and daily conversations. Something happened and my parents took my phone (I can't exactly remember why they took it). I went to lunch with a friend one day, and when I got home, both of my parents were there and I knew something was wrong (they divorced and hated each other). They confronted me about my teacher and I's friendship, saying they \"[knew] everything\". My father had texted him through my phone, telling him to cease contact and threatening to report him to the school board if he ever tried talking to me again. I was heartbroken hearing this and knowing I'd never speak to him again. My parents claim he was \"grooming\" me, but I never felt that way. He felt more like a dad or an uncle, and treated me almost as his kid. Plus, as mentioned before, I basically harassed this man into talking to me. I always got the feeling he just kind of felt bad for me, especially looking back on our conversations and this situation as an adult.\n\nI never spoke with him again after that. It was somewhat of a traumatic experience for me, but only because someone I really cared about just suddenly vanished from my life and I felt as though I had nearly ruined his life because I was a lonely kid. The loss I experienced changed me as a person and the way I view all relationships.\n\nI still think of him often. I want to reach out and ask him how he is, and tell him how sorry I am for putting him in such a bad situation. It's just been so long and I don't want to dredge up the past, especially when I'm sure it was also traumatic for him. \n\nI don't know how to move on when it ended so abruptly and so badly. I have dreams of running into him on the street and getting my opportunity to tell him I'm sorry and hear how he dealt with things afterward. ",
    "subreddit": "TrueOffMyChest",
    "title": "I befriended a teacher when I was 14 and almost ruined his life",
    "upvote_ratio": 0.91,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7kduf/i_befriended_a_teacher_when_i_was_14_and_almost/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 22:49:29 UTC",
    "id": "1j7k0kz",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "Some back ground: She never has any money for the things she needs! Constantly asking for money for ubers to get to the doctors, door dash, and food for lunch. She has called multiple ambulance this year and each time they kick her out the hospital because there's nothing wrong with her! The last she went, she called cause she thought she was having a stroke but texted me to bring her tablet to the hospital. When I got to the hospital i told her \"people who are actually sick don't care about having their tablets.\" This caused her to snap at me about not caring about her. \n\nToday, she left her tablet open in my dad's office (they are divorced but live together for now) and I saw her messages with her online boyfriend. He's talking about visiting her and they're saying I love you but she's never met this man! It's always the same damn story too: Military man, has a young child, and they are stationed aboard. Can she be that gullible to keep believing it?? \n\nI get it. She an adult (56) but my mom does not seem mentally sound. She has lost countless bank accounts talking to these online boyfriends! She once gave one $700 to \"invest\" in his business and he ghosted her, all while demanding my dad help her pay for medication. She's constantly \"falling\", which is her throwing herself to the ground. She did it in front of my cousin once and she [my cousin] said she didn't want to come over anymore because my mother was irritating. She is the reason one of my sisters rarely comes around and my other sister is NC with her! \n\nEverything is everyone else's fault! I'm so frustrated because she's not understanding the urgency! My dad is not staying in this apartment and finally moving on with his life while her credit is in the shitter! She's barely at work! She spends most of her money on door dash and shitty shit from Temu! I'm trying to have empathy for her (because of how she was raised) but the constant lying, calling out of work, not helping clean or cook or buy groceries, and being almost allergic to accountability, is weighting on me.\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "My mom keeps talking to strangers online.",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7k0kz/my_mom_keeps_talking_to_strangers_online/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 22:44:06 UTC",
    "id": "1j7jwdn",
    "link_flair_text": null,
    "media": null,
    "num_comments": 21,
    "score": 30,
    "secure_media": null,
    "selftext": "My husband wanted a dog, and I had never had one before. I’ve had plenty of pets in the past: cats, rabbits, and fish, and I loved each one of them deeply. So, we decided to get a dog.\n\nHe did the work of finding the exact dog he wanted, and we drove three hours to adopt her. Even though he took on most of the feeding, exercising, playing, and training, she bonded to me. The bond feels like an obsession. When I’m around, my husband doesn’t exist to her. She never wants to be more than three feet away from me, and often, she’s touching me.\n\nWhen I need a break, I go into the bedroom and shut the door. She just sits outside, waiting. I can put her in the office with my fiancé on the other side of the house, and then go to the bedroom and shut the door. But she waits at the office door, whining and whimpering. My husband tries to interact with her, but she doesn’t care. She just wants me. And I can’t handle this level of attention. You can take her outside, but if she knows I’m inside, she won’t leave the door. If I leave, she panics. A few minutes later, she calms down and does her own thing. She never bothers my husband this much.\n\nI’ve heard mothers talk about feeling “touched out” with toddlers, and that’s exactly how I feel with my dog. The difference is, I don’t think she’ll ever grow past this stage. She’s a dog. We’ve worked with trainers to help her become more independent, but it doesn’t seem to work.\n\nI’m thankful that there’s more nuance in the “adopt, don’t shop” movement. Sometimes, it might actually be better to get a dog from an ethical breeder, as shelter dogs can come with their own set of challenges. My dog has trauma, and that trauma will stay with her for life. It shows up in our relationship, where we’re in a sort of quasi-codependence. It’s frustrating because she’s fine when I’m not around. My husband can take her places, and she’s as happy as can be. If I’m not home, she’s completely relaxed. It’s only when I’m around that she becomes obsessed with me. I don’t get to experience the playful, silly dog everyone else sees because, in my presence, she’s consumed with me.\n\nMy husband takes her to his brother’s farm, and he sends me videos of her. It breaks my heart because I want to see that happy, playful dog too. I want a dog I can sit outside with, playing with toys and rolling in the dirt, without her needing to touch my leg at all times. But I never get that dog. I love her so much, but her constant affection drowns me.\n\nI look forward to when she goes to the farm because I get to be home without her on top of me. I don’t love my job, but I dread going home because, at least at work, I get some alone time.\n\nI love my dog, but I don’t like being around her.",
    "subreddit": "TrueOffMyChest",
    "title": "I love my dog but I don’t like her",
    "upvote_ratio": 0.85,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7jwdn/i_love_my_dog_but_i_dont_like_her/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 22:36:01 UTC",
    "id": "1j7jpzr",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I don't want my pets to suffer radiation sickness, panic or thirst. I don't want to die suffering horribly. I don't want to be brain dead and coasting in a hospital bed with no possibility of recovery.\n\nThat's it.\n\nThe world will not get better. 1945-2000 was an anomaly. It'll never happen again within our lifetime.\n\nI just want it to be quick and I don't want to watch my family or pets suffering.",
    "subreddit": "TrueOffMyChest",
    "title": "My hopes and dreams are now for it to be quick",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7jpzr/my_hopes_and_dreams_are_now_for_it_to_be_quick/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 22:19:10 UTC",
    "id": "1j7jc97",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 0,
    "secure_media": null,
    "selftext": "I’ll pay for human food because as a human I always come first before my cat, but with raising grocery cost I have completely stopped paying for can cat food. Yup it goes straight to my pockets same with otc medicine straight to my pockets. It’s the only 2 things I justify doing a 5 finger discount for. I’m 25 and live on my own. I’m not paying for cat food for if I can’t afford to feed myself somedays…but I won’t let my poor cat starve either. With all the stray cats outside in my neighborhood I’m feel like I’m doing something good by at least feeding my own cat that my mother gave to me recently. I didn’t realize how expensive a cat was. I wanted a cat but i was gonna adopt when when I could afford one, getting one as a gift was unexpected but I love my boy, he’s like my child would you let your son starve? \n\nI also don’t pay for medicine if I don’t have too lol because I’m the name of Luigi medicine should be free!",
    "subreddit": "TrueOffMyChest",
    "title": "I don’t pay for can pet food or otc medicine.",
    "upvote_ratio": 0.31,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7jc97/i_dont_pay_for_can_pet_food_or_otc_medicine/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 22:05:17 UTC",
    "id": "1j7j16a",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "Throwaway, for obvious reasons. I've made my mistakes in life, having entirely followed these urges in my past with previous partners. It's something I am deeply ashamed of, and could never do again. But the thoughts linger and remain. Oftentimes, it'll result in me becoming increasingly anxious. Sometimes I worry that, someday, karma is going to swing back around and my fiancee will one day cheat on me; perhaps that persistent anxiety is the true retribution. I'd like to seek therapy, but it isn't feasible for me at the moment. I think that some amount of it has to do with abandonment issues. I think my brain convinced itself that having more than one person would always leave me with someone if anybody had abandoned me again, in quite an unhealthy coping mechanism for everyone involved. Who knows. Maybe one day I'll conquer these demons.",
    "subreddit": "TrueOffMyChest",
    "title": "I have had intrusive thoughts to cheat on just about every partner I've ever had, and have followed through in the past.",
    "upvote_ratio": 0.55,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7j16a/i_have_had_intrusive_thoughts_to_cheat_on_just/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 22:03:29 UTC",
    "id": "1j7izp6",
    "link_flair_text": null,
    "media": null,
    "num_comments": 9,
    "score": 0,
    "secure_media": null,
    "selftext": "I really need to take this off my chest because today I f*cked up multiple times and I feel extremely embarrassed. \n\n\nMaybe I am in my head but I'm definitely somewhere in the wrong. \n\n\nOk so my day started fine with me taking a ride to the airport. The driver, a super nice guy from Pakistan, shared with me that he is fasting and he will only get to have water or something to eat after 6pm. So what do I do? I get all excited about Pakistani food and ask him to tell me what are his favorite dishes from his hometown. Then I proceed to describe in excruciating detail all my favorite dishes from my country. Recipes, mouthwatering ingredients, the whole thing. By the time I realized that he must be starving (it was 4pm after all), I was already rambling for about an hour already. I apologized immediately and he was super nice about it, but this doesn't make me less of an idiot. \n\n\nSo after this great success, fast forward to a few hours later - I am on the plane, seated near  the back, squeezed into the middle seat. We are about to depart, the plane is on the move and I realize that my seatbelt gets loose without me lifting the little lever thingy. I ask for assistance and the flight attendant tells me \"Don't worry, the seatbelt will work later\". So I ask him \"How is this possible...?\", thinking that I really don't do well during flights, that I used to get panic attacks, that I managed to control after a lot of therapy and &lt;&lt;OMG I am about to fly and if something happens I will break my neck crashing on the roof of the plane!!!&gt;&gt;. \n\n\nHe sighs, then tells me he will replace the belt and goes away. Comes back after a minute or so and he says that the plane needs to depart and that there is no time, they will need to move me. There is quickly some commotion, all the flight attendants make some signals to each other and they find me a free row at the front. So I thank them profoundly, I apologize for the last minute chaos that I caused and go to my new princess seat, but the window with extra legroom that I didn't pay for. I sit down, I put the seatbelt on.... and I realize that the new seatbelt ALSO gets loose if I push the metal thing! I test it out a little bit and then it hits me. If I just pull the belt, it stays locked. If I put my finger under the metallic thing and push slightly it gets loose. So that means that I did all this.... for no reason.\n\nI close my eyes and start thinking that it can't be that I'm so inconsiderate today. And how embarrassing. Meanwhile I'm doing my breathing exercises trying to relax. There is turbulence today and my mouth is dry, I can't handle it anymore. I open my eyes and soon as I see the flight attendant handing out chocolates, I ask for some water. She says \"I will check if we still have\", and I'm thinking \"Oh wow, how strange! It can't be that they don't have at least one bottle\". Quickly she comes back, hads me one and finally I drink some water. \"Finally I can try to relax\", I'm thinking. Then I realize must have dropped the chocolate she gave me. I start looking around and then I look to my left and I freeze. On the seat next to me there is yet another water bottle that the flight attendants must have left for me while I was trying to \"breathe iiiiin, hooooold, exhaaale, the plane is safe the plane is safe the plane is safe\".\n\nSo that's it. This is another successful day. I am sitting here patiently, writing this to distract myself and I think I will post as soon as we land. \n\n\nThank you for listening to my rambling dear reader &lt;3",
    "subreddit": "TrueOffMyChest",
    "title": "Today, I was that 'Karen' that people vent about when they're just trying to do their job, and I feel so embarrassed",
    "upvote_ratio": 0.47,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7izp6/today_i_was_that_karen_that_people_vent_about/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 22:00:32 UTC",
    "id": "1j7ix87",
    "link_flair_text": null,
    "media": null,
    "num_comments": 17,
    "score": 2,
    "secure_media": null,
    "selftext": "It’s a long ass story i don’t think i can write it all down here. But basically i was addicted to consuming porn for about a decade &amp; then decided to stop, it was fantastic initially had loads of positives. I recently tried giving it a go again for some quick relief &amp; that shit turned me off big times i don’t think i can ever get turned on by it again. I’m not sexually active, so when i get sexually frustrated, i need to get out of my way hit ppl ive been with/dated back up &amp; see them to then get my relief which in turn fucks with me mentally later on, i regret it every single time. I feel a-lot of guilt. So if I could’ve just gotten that “relief” from porn like i used to i wouldn’t be getting other ppl involved &amp; feel shitty afterwards. ",
    "subreddit": "TrueOffMyChest",
    "title": "I (24M) quit watching porn 3 years ago &amp; i kinda regret it.",
    "upvote_ratio": 0.56,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7ix87/i_24m_quit_watching_porn_3_years_ago_i_kinda/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 21:44:50 UTC",
    "id": "1j7ik5i",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "The way \"life\" taught me about sex. Not my mom or dad, or a sex ed teacher. But life.\n\nLet's keep in mind that as humans we have an innate instinct to procreate.\n\nMy dad used to babysit me while my mom would go to work. He would put Asian music videos on in the living room and I would sing and dance to the songs all day long. I was 4. I was a sociable outspoken singing daddy's girl and I loved people because they would dote on me. What I'm really trying to say here is, at 4, I could recognize humans and human beings.\n\nMy dad took me over to his buddy's house. His buddy had two sons. One was about 7 and the other son was about 4 as well. While he and his buddies were hanging out downstairs, the older boy (7) showed me a book his dad had of naked people in all sorts of sexual positions, kind of like a Kama Sutra. He proceeded to usher me into a closet and took off all my clothes. My dad found me naked in the closet and helped me put all my clothes back on and we went home.\n\nAt around 5 years old, I woke up one morning and looked around. My little brother was sleeping in a separate bed in the same room as me. As you know and as I have mentioned above, I loved watching TV because of the music videos, and because of Barney and other things I would watch on TV. So this somber morning, I woke up, walked to my parents room and they were sleeping and I didn't want to wake them up. I walked back to my room where my brother was sleeping. We had a TV in our room and laying around on the floor were a VHS tapes. So I picked one up and popped it in. It was a porn tape. I remembered the naked people from the book that one kid had showed me and this porn tape had the same people. Naked and actively doing things. I somehow knew it was bad. So I turned down the volume, and I watched the whole thing instead of taking out the VHS. Let's just say, curiosity killed the cat and I was the very curious kitten.\n\nThen around the same year, at 5 years old, I was molested by my uncle. He was living in the same house as us in the basement. It happened (to my memory) one time and one time only. I knew what had happened to me the moment it happened. I knew something bad had happened to me, and I knew what sex was but I just didn't know the exact words for what everything was.\n\nThat is my 7-layor carrot cake story. Not exactly 7 layers but it just seems that bad things of a sexual nature kept making its way into my very short life and I came out on the other side too knowing, and too knowledgable way too soon. Every day I wish I had had the chance to be innocent and to be trusting of others and of people. I wish I had the chance to be a happy-go-lucky kid unburdened. But I was denied that. I grew up with no friends at all because of the amount of guilt I felt. The fact I understood sex at such a young age, and being molested, it was like an awkward secret I just kept inside. But secrets weight on you. Even if you don't think they do. It's a physical manifestation and I was not the beautiful child I always wished I was. I was dark, and small, and always was a little heavier than other girls. Because of all those reasons, I still have no friends, I have never made a friend. I still have extremely low self-esteem paired with a high body count.\n\nI'm just not normal. It feels this way at all times. I always stick to myself and I never look anyone in the eye. The shame.\n\nI also want to note, to anybody that was raised around too many males. Just don't. It's not safe for any parent with a small female child to be around that many men/males all at once and even if you \"trust\" them I would say you should always have a considerable amount of doubt and remove your child from danger or harm.",
    "subreddit": "TrueOffMyChest",
    "title": "7-layer carrot cake --- The shame. Not death but pretty similar to a death sentence.",
    "upvote_ratio": 0.61,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7ik5i/7layer_carrot_cake_the_shame_not_death_but_pretty/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 21:38:42 UTC",
    "id": "1j7if3s",
    "link_flair_text": null,
    "media": null,
    "num_comments": 25,
    "score": 0,
    "secure_media": null,
    "selftext": "I just need to get this off my chest because it’s been sitting weird with me. A friend of mine (F35) recently started talking to a 20-year-old she met on a dating app. She insists they’re “just friends” now, but the fact that it started on a dating app doesn’t sit right with me. She even said she feels like they’re on the \"same wavelength,\" which honestly just makes me uncomfortable.\n\nI know they’re both legal adults, but the life experience gap feels huge. At 20, you’re still figuring out so much, while someone in their mid-30s has a completely different level of maturity and perspective. It’s making me rethink my friendship with her, but at the same time, I’m questioning if I’m overreacting.\n\nI don’t know—maybe it’s my own past experiences influencing how I see this, but it just doesn’t feel right. I needed to get this out somewhere.",
    "subreddit": "TrueOffMyChest",
    "title": "I feel weird about my friend (F35) talking to a 20-year-old she met on a dating app",
    "upvote_ratio": 0.46,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7if3s/i_feel_weird_about_my_friend_f35_talking_to_a/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 21:23:46 UTC",
    "id": "1j7i2tw",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "Last post violated rules.",
    "subreddit": "TrueOffMyChest",
    "title": "Let me rephrase: I do not encourage violence, but I have something I’d like to get off my chest: It makes me satisfied and I, in certain situations,  agree with someone gettin’ the ole boot in the hiney.",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7i2tw/let_me_rephrase_i_do_not_encourage_violence_but_i/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 21:08:15 UTC",
    "id": "1j7hqbk",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 0,
    "secure_media": null,
    "selftext": "Iam 24(M) iam from Andhra Pradesh, my hole family (mother, sister, father)  followers of asharam cult they still believe he is innocent, iam ok with that every one their own belief but the problem is they last month they left and decided to join ashram permanently leaving me alone to myself, somehow i convinced them to come home,  one year later my girlfriend broke up with me then i committed suicide by drinking pesticide but that didn't worked out well, i was in icu for 15 days and came back home, some people mocked me for that indirectly they would talk about infront of me like u should have died now u have live with that shame your whole life, meanwhile my family members are agin trying to join the cult leaving me alone, i just want to un alive my self again 😭",
    "subreddit": "TrueOffMyChest",
    "title": "I don't know what to do with My life i just want to un alive myself",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7hqbk/i_dont_know_what_to_do_with_my_life_i_just_want/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 20:38:19 UTC",
    "id": "1j7h1t3",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 0,
    "secure_media": null,
    "selftext": "i am so tired of myself i wish i could just be normal i wish i could feel happiness without ruining my life and the way people see me i want to die ",
    "subreddit": "TrueOffMyChest",
    "title": "relapsed again",
    "upvote_ratio": 0.4,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7h1t3/relapsed_again/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 20:34:57 UTC",
    "id": "1j7gz23",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 3,
    "secure_media": null,
    "selftext": "idk what to do.\nhe threatens to do this so often, im so drained. i love him to pieces and i feel like i cant break up, not just because of this but because im so attached.\nhe tells me he wants to hurt me. \nwhenever hes angry he calls me so many things.\ni dont know what to do, last night we had a massive argument and he threatened to leak pictures of me with rumors captioned on it if i hang up. \ni dont want to end things, i love him too much but im scared. i dont know what he will do. im young, weve been together for a year. i cant do this anymore and its driving me off the edge myself. its making me want to die. were otp rn and hes still threatening to khs, i have no one to tell about this. ",
    "subreddit": "TrueOffMyChest",
    "title": "bf keeps threatening to khs",
    "upvote_ratio": 0.68,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7gz23/bf_keeps_threatening_to_khs/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 20:31:38 UTC",
    "id": "1j7gwdo",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 1,
    "secure_media": null,
    "selftext": "I(F28) and my former friend G( F30) meet during our first term in university, we both came from the same area and went to the same school at one point. We clicked and became really good friends from there. I was an insecure 19 year old at that time and she was outgoing and active in our version of sorority. I was invited to outings that I actually enjoyed and began to build up some confidence. We both had our share of mental problems understood each other, but after taking diffrent courses we stopped meeting as regularly but she always said that I was one of her closest friends. \n\nIn 2020, I became sick. Really heavy burnout, Crohn dieses and bulimia that made me unable to stay in town. I moved back home and slowly began to rebuild my life and health. Now in 2025, I am still sick, but way better and have control of my mental problems. During the last five years I wrote to G every time I went to the university city, asking to meet up and if I could, I set the dates of my travel after her schedule to make sure we could meet(it’s a 5h drive). Every time she said she would love to, and if she was available we booked a date and time. But almost always something happened or she double booked that she remembered 1 day to 1h before. During these five years, we have meet up twice and I have probably asked her around 10 times since I usually go twice a year.  She never wrote to me when she visited her parents or asked me when I was going down next time, which I realise now was a clear sign that I ignored. I once wrote and asked her if she didn’t want to meet up, it was okey and I would understand, time changes people and friendship does not always last. She denied it and said she very much wanted to meet up and I accepted the answer. Telling me how horrible of a friend she is and how sorry she is.\n\nTwo years ago I had a major breakdown when G cancelled on me again. I had been so excited and when she cancelled I was heartbroken. Walking is my coping strategy, especially with heavy emotions, even after 10km I did not stop crying. I was living with another friend  for that weekend and I fully broke down in the end and told her everything. They had never suspected anything cause I always spoke so well off her. She  apparently told my other friends who all are mad on my behalf. \n\nG sent me a snap in May 2024, with the caption ”In exactly one year we are getting married” with a picture on her fiancé. I congratulated her, but I had no idea about their engagement before that. I decided to one last try and asked her of a time during the summer we could meet up, with my vacation weeks in mind. She responded and we decided a week  were she was free, for details to be determined later. As it approached I wrote 1 week before and told her the days, no response. When I finally was at the hotell I wrote again and told her how long I was there and times when I was booked. My friends were a bit angry at me for trying again but I said that this will be the last time. \n\nOne day after I came home from the trip she responded with how sorry she was for not answering. I had enough and told her how I felt through the years, I was nice and civile even said I should have brought it up earlier and not just unload it all now, even asked my friends to read before sending. G answered and told me she understood why I felt like that, I ended it with that if she wanted to meet, she would have to text or call me now, cause I was tired of this being so one sided.\n\nGuess what - not heard from her since. Now I see pictures from the wedding preparations like the baccalaureate and dress fitting and I feel so sad. Probably I had a delusion hope deep inside that I would get an invite and that she would text me. This quenching the last hope of ever being friends again and telling me how little I meant and what friends mattered to her. \n\nMy friends supports my feelings even my boyfriend, but I just feel like I never meant anything. If they are real friends they will make time for you, I know, but in my head I go through all those memories and just wonder if I could have done anything different. Been a better friend, written more, called or if I just was the burden I always was scared of being, also wishing I not been so delusional and naive. \n\nSorry for the long post❤️",
    "subreddit": "TrueOffMyChest",
    "title": "My ex friend is getting married and I cannot stop feeling sad because of my own delusion.",
    "upvote_ratio": 0.54,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7gwdo/my_ex_friend_is_getting_married_and_i_cannot_stop/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 20:28:05 UTC",
    "id": "1j7gtg5",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 1,
    "secure_media": null,
    "selftext": "Hi... this is my first reddit post and I need to get these feelings  off my chest. I just feel so angry and I hate it.\n\nContext -&gt; So around a year and three ish four months ago, my father had died in hospital. All shocking and scary times for me and my mom. I was 16 at the time. So I was quite affected and so was my mom. We mourned for quite some time after his death. And we went through a rough patch for a few months before we recovered.\n\nSo this is where the story starts, my mother began chatting and dating around. To which I was fine with, as I was happy she wasn't mourning over my dad and was healing. \n\nShe dated a one or two guys before she found this guy Bill (not real name) who works as a driver. They started dating and shit. And I was quite okay with it. Despite for a few times I was annoyed and irritated at him.\n\nFor starters, my mom would never tell me if he  was coming over. And normally when I'd wake up in the morning he'd be in the kitchen with my mom drinking coffee. This kinda annoyed me. I didn't like this stranger enter my house where my father once lived. I hated sharing my private personal space with this stranger. I hated and still hate his presence in my house. \n\nHe is quite annoying as a person, his like a kid. Extremely curious and neat picking. He laughs in a weird manner not a proper laugh. He acts childish at times. He's obsessed with my pet budgie named tim (not real name) but he doesn't know how to hold him properly. He constantly stresses my bird out. Which i hate.\n\nAnyways, I always felt like my mother moved on way to quickly from my father. And I quite hate it. I'm aware it's her life and she can do whatever. And that she's healing.. but it's hurts  seeing her do things she never do with my father. My father wasn't physically the most affectionate as in ways of kissing or holding hands. But he loved me and my mom in his own ways. My mom truly loved my dad. \n\nI don't know how to describe the emotions I'm feeling. It's difficult to explan everything. I just don't like him and I hate his presence in my home. I hate him touching things inside my house. I find him irritating at times and annoying. I feel these angry feelings. \n\nI hate the fact I don't have mother daughter time with my mother. As Bill comes over to sleep over like... 3ish to 4 days a week. Tuesday, Wednesday, Friday, Sunday. I quite missing going out with my mom on Saturday shopping or in town. But now as bill sleeps over in Saturday he spends his day off, Sundays with us. And I hate that.\n\nEvery time I plan something with my mom on Sunday, he always has to crash our daughter mother time. I hate him kissing my mom. Being all lovely dovey. I'm happy for her healing and being happy with someone. \n\nBut it's not the same as it was.  I miss my dad\n\nEdit - forgot to mention, my mom literally babies him. Every time he comes over, she cooks all the time. She never has a second to herself. ",
    "subreddit": "TrueOffMyChest",
    "title": "Am I entitled to feel in such a way?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7gtg5/am_i_entitled_to_feel_in_such_a_way/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 20:27:51 UTC",
    "id": "1j7gt90",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "Gone.",
    "subreddit": "TrueOffMyChest",
    "title": "I'm done.",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7gt90/im_done/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 20:09:42 UTC",
    "id": "1j7gehm",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 0,
    "secure_media": null,
    "selftext": "idek why i'm writing this here. not going to lie. i just haven't really told too many people about him, and the people i have told, i've only told good things, because i don't want them to worry about our age difference (im 19, he's 27)  - i'm okay w it, but most people i've told haven't been. so i just want to vent. \n\nso we have been talking for about two months now. and while at first everything was consistent, it stopped being so after a couple of weeks. he was telling me at first that he loved my time and my company and then, suddenly, for a few days, he barely texted me. but when i pulled back, started texting less, he came back again? i figured he was just busy.\n\na few days later, after we became consistent again, he ghosted me on a date. but he was sick. so i forgave him. after this, he picked up with the relationship talk again, started calling me names (babe, sweetheart, etc.) and talking about loving my company again. it was sweet, and made me feel better about what happened. but after a couple weeks of this, it was back to distance again. and once again, when i reciprocated, he came back again.\n\nhe was then back through valentine's day and following. and then a couple days ago he started texting less again. this time he isn't distant per se, he's still using the sweet talk...just barely talking to me.\n\ni really like him. he says he likes me. when we do hang and talk, it's a great time. but i'm confused and the times he's distant hurt me. so i'm gonna talk to him and if he doesn't come around this time, im gonna block him. i guess. :(",
    "subreddit": "TrueOffMyChest",
    "title": "i am giving this guy one last chance before i block him, and idek if i should do that",
    "upvote_ratio": 0.25,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7gehm/i_am_giving_this_guy_one_last_chance_before_i/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 19:59:08 UTC",
    "id": "1j7g5m0",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 1,
    "secure_media": null,
    "selftext": "I am an instructional aide. My job is more or less patrolling around a class room and maybe some kid will raise his hand and maybe I can help them. Other than that, it's nothing. Its just walking around a classroom. I hate it. And maybe I shouldn't hate it; most people want boring jobs. But I come home everyday feeling drained and exhausted from doing literally nothing all day. It's unfulfilling, I don't particularly like the kids and I feel like I'm just wasting away there.\n\nI want to quit it so damn badly.",
    "subreddit": "TrueOffMyChest",
    "title": "My job is easy but it is mind numbingly boring and I hate it",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7g5m0/my_job_is_easy_but_it_is_mind_numbingly_boring/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 19:55:27 UTC",
    "id": "1j7g2op",
    "link_flair_text": null,
    "media": null,
    "num_comments": 9,
    "score": 9,
    "secure_media": null,
    "selftext": "I'm not really looking for advice but more just getting it off my chest. My bf (27M) and I (27F) have been together for 4 years. We really don't argue much at all and overall we have a really good relationship. There is one thing he does though that really makes my stomach churn. He digs in his butt and then smells his fingers after. I don't think he knows I know, he kinda tries to be sneaky about it (like he does it under the blanket) or he does it when he thinks I'm busy reading or looking at my phone. He does wash his hands and takes a shower before we do anything intimate and also washes his hands before eating, etc. I don't know how to ask him why he does it or to stop. He's been doing it since we moved in together, I'm not sure how long in general he has been doing that. I needed to get it off my chest, he is a great guy and this isn't a relationship ending thing. I'm just unsure what to say or do.",
    "subreddit": "TrueOffMyChest",
    "title": "My partner does something really weird",
    "upvote_ratio": 0.71,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7g2op/my_partner_does_something_really_weird/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 19:48:09 UTC",
    "id": "1j7fwtg",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 0,
    "secure_media": null,
    "selftext": "Hello guys. I really have to get this off my shoulders so i decided to make this post on here. already appreciate you guys for reading it. \n\nSo, i am M/22 and my gf is the same age, we are together since three years now and everything did go well for the most part. The thing is, i am an absolute introvert and probably suffer from social anxiety. I hate to go to places where a lot of people are, i cannot eat when a lot of people are around me and i just get exhausted and overwhelmed so fast. this makes my life really hard tbh, and its even harder because i cant understand why i feel that way. like i was grown up in a great, lovingly household, have a good job, and i am basically just a normal guy, who should not complain about his life. However my gf knows all those things and we talk about it and all, she also tells me shes there for me and just tries to help me out as much as she can. \n\n  \nAnd then there was this situation yesterday, it was the 20th birthday of her brother (who is also a really close friend of mine) and he was throwing a party with approximately 40 people. and what can i say, i felt like absolute shit the whole week, my anxiety hit rock bottom and i felt like i couldnt handle it. the night before the party i had a fucking panic attack while falling asleep. So i was talking to my gf, talking about how i feel and how i am getting the worst anxiety ever and so on.. she then tried to make me feel less anxious, she told me she is there for me the whole evening, she wont let me be alone and stuff and idk just trying to pick me up. (thats also one thing, like i feel giga weak in those situations, why cant i handle such things, shouldnt i be the one protecting her? however i am also really insecure about myself). \n\n  \nThe party was on saturday 19;00, in a bar. my heart was racing all day. i tried to calm myself down with playing some video games, some csgo and some league, but nothing really helped. So at around 18:30 i left home and was driving to the party. you can imagine how i felt. when i arrived, we were in a group of maybe 5 people (i really didnt know many people there, maybe like 3 or 4). then i went to the wc, to calm down a bit and when i cam back my gf was grouping with her friend, the other people i knew where also with their other friends, and suddenly i find myself standing in this bar, alone, trying to talk to some people i didnt even know, just to make it less akward. it was my personal hell. However, i couldnt just go to my gf and her friends, because i would have felt ultra weird, when being the only guy there coming out of nowhere. i would have appreciated it so much, if she would have came up the me and just would be on my site. but she didnt. she didnt the whole evening. like in 8 hours, she wasnt coming up to me once. one time she was looking at me, she wanted to ask me if everything was okay by signaling it, i was shaking my head and telling her no nothing is ok, and then she turned around and did go somewhere else. like why? i dont understand that. i feel like the biggest loser on this earth, my feelings are ultra hurt and i cant stop thinking about it. i could have never done it like this if roles were switched. maybe i am overreacting, but honestly i dont think so. like why do i even tell her how i felt like shit because of this party. should i have just came up to her and her friends? idk. i still think it would have been easier for her to come pick me up, then for me to go to them. especially when she knows how i felt. \n\n  \nidk, this evening made me just feel like absolute shit, i feel hurt as hell, i could literally start to cry right now. Why do i have to be such an insecure and anti social person, i just dont get it. however, now i am here, sitting at my pc, listening to music and writing this down. idk if anybody will even read this, but if so, sorry if my english is not the yellow from the egg, but i tried my best. \n\n  \nhave a nice sunday evening\n\n  \n",
    "subreddit": "TrueOffMyChest",
    "title": "I feel left out by my girlfriend",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7fwtg/i_feel_left_out_by_my_girlfriend/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 19:44:51 UTC",
    "id": "1j7fu08",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 20,
    "score": 0,
    "secure_media": null,
    "selftext": "I keep seeing posts of people complaining about couples just walking by or holding hands, people saying it makes them feel lonely. Will those ppl just stfu? Like no one gives a fuck you’re lonely, I don’t fucking care. It’s sad, sure and sometimes I feel bad but why are you getting upset at someone just enjoying their life. Me and my girlfriend are really happy together and people will get actually violent towards me because they don’t have something like that and when they see us smiling together it makes them angry.\n\nWhy are people so damn lonely? Recently I had someone really jealous of us, an old friend of my girlfriend make death threats towards us because we were happy and he was upset we were happy together. He was saying things like he was gonna come shoot me and do horrible things to my girlfriend I won’t even say. Just because we are happy together.. It’s okay to be sad but to ruin everyone else’s lives. I’m fucking tired of this shit. Why do dudes think women have to date them? Why aren’t people just allowed to enjoy their lives.",
    "subreddit": "TrueOffMyChest",
    "title": "Almost K*lled for being in a loving relationship",
    "upvote_ratio": 0.48,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7fu08/almost_klled_for_being_in_a_loving_relationship/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 19:44:49 UTC",
    "id": "1j7ftyw",
    "link_flair_text": null,
    "media": null,
    "num_comments": 13,
    "score": 0,
    "secure_media": null,
    "selftext": "Throwaway for obvious reasons.\n\nLike the title says, I hate pregnant people that *choose* to become pregnant.\nLet me explain.\n\nI have endometriosis and a family history of ovarian cancer. I have tumors in my uterus and I have undergone surgery multiple times. \n\nAnd whenever I needed my doctors for the reasons mentioned above, things that are out of my control, I'm always met with: \"Oh sorry but if you're not pregnant I can't give you an early appointment. Best I can do is 8 weeks from now.\"\n\nOh I'm sorry, in what world is someone who chooses to breed more important than my tumors? Just make a new baby or ADOPT ffs. They're easily replacable.\n\nIt makes me so bitter. \n\nAnd I can already smell the comments: Hurr durr an antinatalist in the wild, Oh you're evil, kys, you're a bad person. No, I'm none of those. I'm just sad and bitter and always in pain and can't get help because ha ha if you're not pregnant I cant help you :)\n\nDisclaimer:\nI never wanted children, yes I have been in therapy since I was 8 years old and been to multiple specialists about this, no I'm not a sociopath, no I'm not a narcissist, no I'm not evil, no I wouldn't hurt a child if they stood before me. I'm just super frustrated and angry.\n\nThe whole system and its treatment of cell clumps just made me super angry.\nI'm in pain and can't see my doctors as easily as I should because some people choose to breed. \nJust get a dog or a hobby please. \n\nGod I wish all pregnant people would stop clogging the healthcare system. ",
    "subreddit": "TrueOffMyChest",
    "title": "I hate voluntarily pregnant people clogging the healthcare system",
    "upvote_ratio": 0.38,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7ftyw/i_hate_voluntarily_pregnant_people_clogging_the/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 19:39:43 UTC",
    "id": "1j7fpko",
    "link_flair_text": "Positive",
    "media": null,
    "num_comments": 43,
    "score": 21,
    "secure_media": null,
    "selftext": "My boyfriend’s phone broke about a week and a half ago, so we’ve barely been able to talk, and it’s been tough on both of us. A few days ago, I came up with an idea to make things a little easier for him when he finally gets his phone back.\n\nEvery day, I’ve been sending him a message on WhatsApp, telling him about my day—what happened, how I felt, how much I miss him, and anything else that comes to mind. Along with each message, I send a selfie so he can see what I looked like at that moment.\n\nIt’s not the most elaborate surprise, but I think he’ll be really happy when he finally gets his phone back and sees everything. Right now, we can only talk through PlayStation groups, and we can’t even see each other, so I hope this makes him feel a little closer to me.\n\nA part of me is so excited to see his reaction, but another part of me keeps wanting to add more days before he gets his phone back. Either way, I just can’t wait to see and hear him again. Whether he’s tired, pouting, excited, or just being himself, he’s always so cute, and I miss him so much.",
    "subreddit": "TrueOffMyChest",
    "title": "Im preparing a surprise for my bf",
    "upvote_ratio": 0.83,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7fpko/im_preparing_a_surprise_for_my_bf/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 19:38:59 UTC",
    "id": "1j7foz6",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 4,
    "score": 3,
    "secure_media": null,
    "selftext": "I am currently in family therapy and in one of the sessions where we were talking about my SA and how it affected us both and our relationship, we discovered that I needed some closure. This meant that I would have to talk to a family member (from my mom's side) to tell her what happened. My mom ended up confessing that she would much rather keep the family in peace and still have a relationship with them, then be with me and support me when I do talk to that aunt.  Since then, I haven't been able to calm my anxiety, I feel like shit every day (I have been in a state of derealization that is driving me crazy). Since my dad left when I was 3 I have always put my mom's needs and feelings before mine, sadly all I have learned during these sessions is that I am not the daughter she wants, that I am always wrong and that she literally can't name 1 good thing about me. It is super confusing because she hasn't stopped helping me pay for uni, she still helps me buy new clothes for my new job, but yet again she won't hesitate to tall me how mean or inconsiderate I am. I am honestly exhausted, I wanted to better our relationship, I am the one who started with the idea of family therapy, but It has become one of the worst decisions of my life. (I appologize for any mistakes englis is my second lenguage)\n\n  \nI wonder if this has ever happened to anyone, is it normal for single mothers to hate thir childern? Am I actually the worst like she says?",
    "subreddit": "TrueOffMyChest",
    "title": "My mom cares more about public opinión than my wellbeing...",
    "upvote_ratio": 0.72,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7foz6/my_mom_cares_more_about_public_opinión_than_my/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 19:33:58 UTC",
    "id": "1j7fkqc",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 0,
    "secure_media": null,
    "selftext": "As a man although im looking for a relationship but it seems like most women are very vanila or just not really into sex as much, I might be wrong but I feel like I will never be fully sexually satisfied in a relationship. Im also autistic and can be quiet awkward at times",
    "subreddit": "TrueOffMyChest",
    "title": "I feel like i'll never find a woman because im too sexual and horny all the time lol",
    "upvote_ratio": 0.18,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7fkqc/i_feel_like_ill_never_find_a_woman_because_im_too/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 19:26:30 UTC",
    "id": "1j7fegc",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 2,
    "score": 2,
    "secure_media": null,
    "selftext": "I've seriously been trying to find a less nihilist way to look at life, but it's the only thing that makes sense to me. Any form of meaning like a passion/hobby, religion or living for the little moments feels very pointless, because objectively speaking, it is pointless in the long run. Besides, I've always felt very useless. Like I'm not truly good at anything no matter how much time I devote to it. I've been fucking up everything to be honest with you. I even dropped out of college a year ago because I was just doing terribly. I think I'm just really dumb. Even if I passed what the fuck is the point? I'll still work my ass off majority of my life for no reason whatsoever. I've never really shared my views on life with anyone besides my therapists, so I just wanna leave something behind before going through with it. I know it's irrational, but I guess being irrational is just a part of being a human and any living creature now that I think about it. I wish you better luck.",
    "subreddit": "TrueOffMyChest",
    "title": "I guess life isn't really for me",
    "upvote_ratio": 0.76,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7fegc/i_guess_life_isnt_really_for_me/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 19:25:36 UTC",
    "id": "1j7fdqt",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 4,
    "score": 0,
    "secure_media": null,
    "selftext": "My (m24) now ex(f26) girlfriend started dating in March last year. I had just come out of a toxic situationship where I take part blame. I was a bad communicator, I’m sure I still am but I gained some communication skills. I really liked her, found my now ex, 3 weeks later. I knew it would be a rebound but it helped so much. Especially considering this girl had been my crush since 8 years ago when I had first started working with her. We had so much fun early on, trips, going out, eating out. It started to feel less like a rebound and something of a real relationship. Unfortunately, it came to her moving out of her mom’s house. She needed a place to go, and me with my somewhat trust issues, was scared to let her move in with her friends which were one girl and two guys. She had been known to “get around” but I trusted her more than most people did and had hope. She was very kind, had many mental issues, but nothing I couldn’t stand, I had grown up with childhood trauma and this seemed like nothing. So me with my trust issues, and wanting to move out of my mom’s house as well, took her offer of renting a place together. It seemed fun and I had just started a career job, so it seemed like a good time. Found out very quickly, it would not be. See my ex, we’ll call Fiona, had severe insecurities and drinking issues, not to mention drug addiction. I had known to some extent, but not to this severity. The first week we moved in, I wanted to have a get together party for our first place together. Turns out, Fiona hates having people in her space. She was very quiet the whole night, and near the end, she stormed off to the room, where I’d get yelled at when I head to bed. She scream at me in bed, as I had work the next morning I told her sorry and we’d talk about it tomorrow. She got up and stormed out the room. I was just happy for the quiet, until I hear her screaming my name and yelling help! Help! I storm out, seeing her wrist covered in blood, with it spilling all over the floors. I help her best I can, she didn’t hit an artery so it soon stopped, but left a nasty scar. After this night, most nights, especially when we went out, I would get no rest, being accused of cheating, or just not giving her enough love. Over the next few months, one of our mutual friends decided a surprise birthday party for her. I honestly wasn’t thinking to hard about it, I just thought maybe it’d make her happy, forgetting she didn’t like people in her space. Same thing happened. She was upset the whole night, stayed in the bedrooms and never came out. Through out the night you could hear her screams saying “get out of my house!” In the most embarrassing way possible. Her sister was there, and tried to calm her down the whole night, which did not work. I eventually got everyone out, because the music was barely covering it up. I went to bed again. Same thing, yelling at me. She got up, stormed out. I was worried but thought that it was a one time thing. Nope, I instantly hear my name being screamed. This time, much worse. I come out to see the cut is even deeper, attempt to stop the bleeding but it just won’t. I call 911 while making a makeshift tourniquet to try and stop it. The paramedics get her after the police, which was someone I knew. I told them about how she was saying before that she wanted to die. I didn’t think this was an attempt, but a callout. I took her to the hospital after the medics said she didn’t need the ambulance after patching her up. Stayed up all night at the hospital, dropped her off at home, then went to work. I was miserable. I couldn’t stand this anymore. I didn’t want to break the lease, but at the same time I also still cared for this girl. I felt bad. I needed a way out, that night was my chance, but you just couldn’t leave her alone, she cried and begged me. So we continued our relationship. A few months later, same thing, yelling at me and saying I don’t give her enough affirmations and accusing me of deleting snapchats and sneaking people in when she’s off at work. Which led to a night that she destroyed my tv in the living room, put holes in the walls, and screamed at me in my face. I was done, I left to stay at my friends house. Told her to leave, we’d figure out the situation after. The day after, she said she needed time to move, and wanted to talk. I went over, and we talked the whole night. She promised she’d get therapy, and help. And I felt so terrible, I truly loved this girl, but it was such a toxic relationship. I gave her one last chance. We decided to stick together, agreeing to talk things out more. See, I still have my trust issues, and being accused of things makes me curious why it’s that in particular. I memorized her password months ago, but never really felt the need to look through her phone. I had it just in case. But I was working one night, straight shift. She went out with her friends. Acted very strange to me, and I just felt something was off. I come home at 7am, find her dead asleep. Couldn’t even wake her up to give her a kiss. She had left her phone on my side of the bed. I felt the urge to look through it. Went through it for hours. Finding hidden messages in messenger of her taking to her ex saying how she thinks about him everyday, and that she needs him. Other messages to her OTHER ex on Snapchat, came across it by chance because it had been cleared and muted. It was of last night being very flirty and him leaving hearts and her pictures with her hearting back. Her saying I miss you, and then a phone call about 6 minutes lasting. I called this number, I asked him to be straight up if she’s cheating. He sounded dumbfounded but said she wasn’t and that they were just friends that use to date. But I found pictures dating only right before we started dating that they were kissing and all over eachother. I woke her up, absolutely heated. Ngl this was probably the angriest I’ve ever been. I told her what I had seen. She of course denied it. Eventually admitting that it was cheating but they never had sex. Which I absolutely think is a lie. But I said it was over, and she took it so easily. She nodded and called her mom, got her stuff in the car, then laughing about a joke she made saying she’s tired of constantly moving. All while I sit and wait for her to leave. Also if I didn’t mention, this happened ALL ON MY BIRTHDAY. She leaves not answering any of my questions like why? how could you do this? Since then, I’ve been sitting here, she still left a few things and needs a truck to come pick them up. She just texted me that she’s coming today to pick them up. I still feel like shit, but can hold my emotions together. ",
    "subreddit": "TrueOffMyChest",
    "title": "My (ex)girlfriend gaslit me while relationship while cheating on me, found out on my birthday",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7fdqt/my_exgirlfriend_gaslit_me_while_relationship/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 19:22:10 UTC",
    "id": "1j7faye",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 1,
    "secure_media": null,
    "selftext": "So my friend (F17) gave me (M17) a blowjob, it’s my first one, definitely wasn’t her first lol. Now I just feel hella awkward around her. I didn’t know what to do during it, like what to do with my hands or what to say to her, she didn’t seem to mind but still.\n\nWe hung out today with friends and I found myself like avoiding eye contact and conversation with her. I just have no idea what to say to her. None of the friend group knows anything happened (that I know of, I know girls like to talk sometimes)",
    "subreddit": "TrueOffMyChest",
    "title": "Awkward encounter with friend",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7faye/awkward_encounter_with_friend/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 19:14:17 UTC",
    "id": "1j7f4bn",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 13,
    "secure_media": null,
    "selftext": "its 1 in the morning right now and i really need to get something off my chest\n\nBack when my dad was in his 20s, he got married happily and had 1 son and 1 daughter on the way. they used to be financially stable and was able to live pretty comfortably. not rich, but comfortable. but one day, my dad decided to travel to a big city to \"find a better job\" \n\nthis is where the problem starts. he met my mom and fell hard for her. as soon as he met my mom, he filed a divorce letter to his ex wife (who was pregnant at that time). he left his wife just to be with my mom, also abandoning his 2 children. my mom didnt know this at the time and thought he was just a nice person. eventually, she did eventually find out about the family that he left behind when they were engaged, however because the wedding is so close, she didnt wanna cancel the wedding and decided to go through with it. (bad decision imo, but whatever)\n\nmy dad and mom managed to run a very successful business. like upper class stuff. they got married and had me. (20m). ive always thought that i had a very spoiled life. being able to afford things most people would kill for and even going to an expensive private school. \n\nmy dad did not pay a single penny for child support. it was my MOM who sends his ex wife money. keep in mind, i was kept in the dark about this until my parents eventually divorced when i was 13-14 for reasons i dont feel comfortable explaining. i was eventually told that i have half siblings from my dad's previous marriage. and what's worse is learning that they are financially struggling, all because of my dad abandoning his own family just to have me. and now? he did the same with me. i havent seen my dad in months now and we are living with less money than we had.\n\ni feel guilty. the fact that i was born into a family where i was fed with a silver spoon, while not knowing the financial struggles my half siblings are in. if my dad was not an asshole, i wouldn't've existed by now.\n\nto add salt to the wound. my dad remarried and tried conceiving a baby through IVF. i was so fucking pissed hearing that. he abandoned my 2 older half siblings to have me, and now hes abandoning me for an ivf baby? \n\nmy mom says that despite all of this, i should still love my father as \"hes your father afterall\" but i just cant.  i really... really... cant....",
    "subreddit": "TrueOffMyChest",
    "title": "i am the result of my dad's selfishness",
    "upvote_ratio": 0.83,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7f4bn/i_am_the_result_of_my_dads_selfishness/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 19:12:06 UTC",
    "id": "1j7f2kc",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 10,
    "score": 1,
    "secure_media": null,
    "selftext": "So I just made this account because there is something that has been troubling me for a while now. And I obviously didn't wish to use my original account to post it.\nIn my dating years, I had 3 accidental pregnancies and obviously I couldn't keep them so I went ahead with aborting them. I understood that it was not the ideal decision and a lot of people would have opinions on it, but it was the only right decision for me at that time.\nNow it has been some years since this has happened and I’m very happy with my partner today, but there are days when this sadness comes back about those three incidents .\nThis sadness gets triggered by anything randomly. For instance, a friend decides to use birth protection, and I don’t know why I wake up thinking about that time when I had to do what I did.\nAnother time, I could not go through the series, which was depicting in some detail about a couple dealing with the abortion and the decision making around it .\nWhile the abortion itself is a horrible experience to go through, the last one that I had was extremely painful and terrible due to some situations .\nMy partner has been extremely supportive about this throughout the years, but I find it difficult to not feel like a burden when all of a sudden one morning, I am in a bad mood and they don’t understand exactly how and why I am feeling like that. \nSo I guess I’m just dumping my feelings here because I’m not really sure what to do with them. I don’t want to burden my partner who already has a lot of pressure from work in everywhere else, and I can’t seem to make this sadness go away.",
    "subreddit": "TrueOffMyChest",
    "title": "Unsure about my trauma",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7f2kc/unsure_about_my_trauma/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 19:00:33 UTC",
    "id": "1j7esqz",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I (22F) don’t have the best relationship with my mom (47F). I lied to her as a child about grades and chores but what kid doesn’t? And now she doesn’t trust me or anything I say anymore which I can admit is fair and have been doing the work to not lie to her anymore because I was terrified of her as a kid. I’ll most likely delete later and just need some sort of insight from other parents or people that have had people like this in their lives. Me and my mom still live under the same roof but I’m genuinely thinking of getting out of here because I don’t know how much more I can take. \n\nWe had an argument a few days ago because I was trying to explain a situation that happened and she immediately started with saying I always have an answer and an excuse for everything. I tell her that it genuinely hurts she still thinks I’m lying to her and I’m trying to reassure her that I’m not. She resorts to mocking me about how my feelings were hurt. She then accused me of gaslighting her which I literally would never do and I had tears streaming down my face because it was clear she didn’t want to listen to anything I was saying. And she’s been passive aggressive towards me for the past couple days. \nI don’t know if I want to try and talk to her again because I don’t want to be at the brunt of another one of her episodes or if I should just cut my losses and just finding a way to move out. If there’s actually something up with her or me that I’m not seeing then please tell me so.\nAlso I should have prefaced that a lot of our “conversations” end up with her yelling at me and making me apologize when she could just leave me alone.",
    "subreddit": "TrueOffMyChest",
    "title": "There might actually be something wrong with my mom",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7esqz/there_might_actually_be_something_wrong_with_my/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 18:56:18 UTC",
    "id": "1j7ep5g",
    "link_flair_text": null,
    "media": null,
    "num_comments": 260,
    "score": 4353,
    "secure_media": null,
    "selftext": "Few years ago, when OF was gaining popularity, I always wondered, what kind of idiot would spend money on porn which is free on most platforms and basically everywhere online.\n\nSucks to say today I found out. Considering how many OF bots are on reddit it was only matter of time until I stumble across \"good\" one. I said fuck it, I'm finally 18, let me go and see why is it so popular. At first it seemed amazing, you could sub to most people for free... and then I fell into a rathole. I don't want to get too deep into it now, but it goes from automated messages, to spam and paywalls, those people will do anything for you to buy their content.\n\nNow I finally see why the platform has so many whales. People will come daily to get \"human interaction\" and pay. I lost a total of 35 dollars in 2 days which is a lot to me, especially as a student.\n\nI hate myself for ever trying the platform. I feel  terrible right now, and I don't know what can I even do for myself to make up for it. Just wanted to get this off myself, because if I told ANYONE I spent money on OF, they'd make fun of me.",
    "subreddit": "TrueOffMyChest",
    "title": "I M18 finally spent money on OF and regret every minute and dollar of it.",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7ep5g/i_m18_finally_spent_money_on_of_and_regret_every/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 18:54:33 UTC",
    "id": "1j7enot",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 3,
    "score": 0,
    "secure_media": null,
    "selftext": "The title might sound a bit melodramatic. Self-sabotage is something I've been aware of for a long time.\n\nAs soon as things start to get even slightly better, I sabotage myself and fall back into a hole, deeper each time. I complain about it, as if it’s not my own fault. But in the end, I’m doing this to myself. I’m ashamed of this behavior because it’s illogical, and honestly, it just sounds sick.\n\nFor a long time now, I’ve been hurting myself, intentionally sinking deeper and deeper. I don’t see any reason to stop. Of course, things will get difficult with the summer coming, and swimming will be mandatory in the 11th grade. But the scars are already there, and maybe I won’t even make it to 11th grade. I can’t magic away the scars, and I feel pretty neutral about them. And if someone asks me about it, I lie and say that I’m trying to stop. But why should I? I know how this behavior could end up killing me, but maybe that’s okay. If someone asks me if everything is okay, I say that I’m trying (I’d love to say that I’m fine, but I’m terrible at lying). But I’ve already given up. Yes, I’m starting to become riskier, doing dumber things. Things that could kill me. I isolate myself and spend my days doing meaningless stuff. It’s terrifying. In my head, there are different \"voices\"—the analyzing, rational one, and the \"disturbed\" one. It feels like I can’t stop myself anymore. Like I’m just watching as I ruin my life. \nI wish i could drink my problems away , but that'd be cruel as my best friends father died due to his alcohlicism.Peace out or whatever, long story short: I’m sabotaging myself.",
    "subreddit": "TrueOffMyChest",
    "title": "Im actively ruining my life",
    "upvote_ratio": 0.4,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7enot/im_actively_ruining_my_life/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 18:53:07 UTC",
    "id": "1j7emh1",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "to start off, this isn't a girl crush or anything. ive been a lesbian since the womb, so im definitely not confused. i met a girl, \"chloe\", in one of my college classes when the semester started in february. when we met, i thought she was really pretty. we were both in a committed relationship with different ppl when i met her, so i didnt think much of it. we became friends as the semester went on, and she introduced me to her friend group. we've spent a lot of time together this past month, and chloe's a really great person. me and my most recent ex broke up a week ago, and it was hard. we were together for a year, but we had issues, so i broke it off. after telling chloe abt the break up, shes been inviting me out more, and ive hung out w her everyday since then. whenever we're together, i feel like we have a connection. im wondering if this feeling is just a way of coping from the break up or if i have unfortunately developed a crush on a girl that is in a relationship with another girl. if i do conclude that these feelings are real, i would never act on it. I'd never be disrespectful like that, but i just wanted to get it off my chest. ",
    "subreddit": "TrueOffMyChest",
    "title": "i (f19) think i have feelings for my new friend (f19)",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7emh1/i_f19_think_i_have_feelings_for_my_new_friend_f19/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 18:50:05 UTC",
    "id": "1j7ek0v",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "So I am just gonna tag this NSFW just in case.\n\nSo I had my period typically 2/3 days, I believe my period stopped on the 3rd day aka Friday, Sat come I wipe there brown blood, aka meaning ending of a period. Yay! All day no leaks etc, got imitate with my girlfriend, we bought a new toy, so excited. Woke up this morning, in my girlfriend bed, a little wet down there confused, but my groggy sleepy mind didn't think anything of it till I use to the restrooms. \n\nThere blood, oh fuck me I free bleed basically all night in my gf bed without underwear, which is my personal nightmare. I am fine accidentally free bleeding in my own bed, but not someone else. But it must have been a one last hurrah for my period, cause I honestly haven't I guess bled since this morning. ",
    "subreddit": "TrueOffMyChest",
    "title": "My worst embarrassing nightmare happen last night",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7ek0v/my_worst_embarrassing_nightmare_happen_last_night/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 18:48:13 UTC",
    "id": "1j7eii2",
    "link_flair_text": null,
    "media": null,
    "num_comments": 18,
    "score": 72,
    "secure_media": null,
    "selftext": "My husband and I knew it would be hard to have kids. 2 egg retrievals, 3 chances, 2 transfers, and we have our son who is almost 2 years old. I love him so much and live for his laughs and hugs! I want him to have a sibling, but our transfer after him didn't work and we are down to one embryo left. We decided to take a break, even though I am not young, because ivf is fucking hard on your body. \n\nWell, 2 weeks ago I got the shock of a lifetime with a positive test. We just laughed and hugged thinking maybe my body learned what to do with our son and how lucky we were not to have to do another round of ivf. \n\nBut the cramping started last night, and I knew. I begged this baby to please stay. I loved it already, though it was so tiny, and I had let myself dream about what life would be like with 2. Life is cruel though and once a miscarriage starts it doesn't stop because you want it to.\n\nI just want to scream to the void that it's not fair to dangle that hope then have to suffer through it's loss. It's not enough that your heart hurts, your body is in pain as well. It's not fair that we could give a child a good life and people that hate their kids easily get pregnant. I'm just mad, and sad, and I hate my body for not being able to do this, and I have so many emotions about putting my husband on this rollercoaster with me. \n\nI know reddit in general doesn't like kids, but I don't care. You existed, I love you,  and I'm so sorry I couldn't make you stay.",
    "subreddit": "TrueOffMyChest",
    "title": "Tw: Miscarriage. Letting the void have my loss.",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7eii2/tw_miscarriage_letting_the_void_have_my_loss/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 18:42:51 UTC",
    "id": "1j7ee5a",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 0,
    "secure_media": null,
    "selftext": "5 years of content creation now. I guess my most impressive metric is 50000 YouTube subs. I am not massive but I have a community that I could never leave behind.\n\nI also have another job - sometimes people assume once I say I'm a content creator that it's my only source of income. I think people overestimate the money content creators make. Even with 50000 subs, your barely be making enough for rent and maybe food. \n\n I'm known for being the woman of my streaming group, which is predominantly men. I get targeted with a lot of female-oriented questions during streams - sometimes sexist jokes but usually stuff like \"Hey, X, you're a girl so is it true women feel X on their period?\" - just as an example. \n\nI started streaming when I was 19. I'm 24 now. In these last five years, I've learned a lot about myself. Including that I have simply never truly felt like a woman. It's always felt like a costume and a role. I've reached more self awareness and understanding of myself and I know for certain, I am not a woman. Mentally, at least.\n\nI don't know what to do. I know the most important thing is \"to thine own self be true.\"\n\nBut I kinda wish I could transition and continue to play the role I've had in my group. Part of me revels in the thought of just being \"one of the dudes,\" but I know it would never be that easy. I know it will be awkward. I know that I will be misgendered and mocked. I know that there will be people in my community who are supportive but I know there will be many who are not.\n\nI am losing my whole identity, as a person and as a member of my group. I am scared to change the dynamic of our streaming group. I am scared to admit I am trans and find out that there may be people in my streaming group or my community who will not take this reveal kindly. I am scared of all the jokes and commentary that will be made. \n\nI am just scared, uncertain, and shaky. My husband has been a rock at this time, but I'm even afraid of losing him in transitioning. \n\nThanks for listening. ",
    "subreddit": "TrueOffMyChest",
    "title": "I'm a content creator known by many as a woman but I'm starting to realize I'm a trans man.",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7ee5a/im_a_content_creator_known_by_many_as_a_woman_but/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 18:06:44 UTC",
    "id": "1j7djzt",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "i am so fucking pissed off, i fucking hate society, like goddamn it why are people so annoying? like i can get peace for 5 fucking minutes, goddamn it🖤💀⛓️ this is why i am emo, life fucking sucks☠️🥀",
    "subreddit": "TrueOffMyChest",
    "title": "shitty day",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7djzt/shitty_day/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 18:00:12 UTC",
    "id": "1j7dego",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 9,
    "secure_media": null,
    "selftext": "Hated life for a good amount of time. Had baby attempts over the years \n\n\nHad a big one. Was hospitalised for a few days. Ex \"suggested\" to limit contact with my kids. Parents sad. And me, happy it failed\n\n\nNever thought I would be. But when I was puking my guts up in hosp, feeling terrible, I just regretted it \n\n\nI wouldn't see my kids again. They'd hurt because of me. I'd cause them pain\n\n\nFuck, I was selfish. I just thought about me. Kinda wish I was in America, atleast I'd have some forced psyc help. But I'm on a list for therapy now. \n\n\nNeed to see a doc again in 2 weeks and have another blood test for my liver, then we'll look at anti depressants \n\n\nRant into the void. Thanks to the people that replied before\n\n\nI'm not good. But I don't want to die. I want to try, and I want to get better.",
    "subreddit": "TrueOffMyChest",
    "title": "Finally realise I don't wanna die",
    "upvote_ratio": 0.81,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7dego/finally_realise_i_dont_wanna_die/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 17:57:32 UTC",
    "id": "1j7dc8s",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 8,
    "secure_media": null,
    "selftext": "I just can't stand anyone seeing me. I'm embarrassed of my own face. Why can't I see a single ounce of beauty in me. Like genuinely. I have never looked at someone and been unable to see beauty in them. \n\nAlso I did notice everyone avoids looking directly at me. Every single person except people who already know me closely avoids looking at me while talking. I hate it. ",
    "subreddit": "TrueOffMyChest",
    "title": "I feel so ugly that I cant even walk in the street unless I'm looking directly to the ground",
    "upvote_ratio": 0.85,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7dc8s/i_feel_so_ugly_that_i_cant_even_walk_in_the/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 17:44:48 UTC",
    "id": "1j7d1qk",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 1,
    "secure_media": null,
    "selftext": "I came across a guy on apps, I had gone on one date with him a few years ago, but a girl I used to briefly work with has been posting him on her Instagram for his birthday, Valentines, etc. The first time I saw him was on Facebook dating and it doesn’t show anything about being active so I thought it could’ve been an old profile. This was on Valentine’s Day and she posted him on her story. A few weeks later she posted on her story for his birthday. And today I saw him on tinder with his profile showing “active” and that he liked me. Nothing on his profiles says in an open relationship or non-monogamous. I took screenshots but should I tell her or send her these? I don’t really know her well at all but I feel bad knowing this if they’re likely still together 😕 How do I start that conversation? ",
    "subreddit": "TrueOffMyChest",
    "title": "How to tell someone their boyfriend is on dating apps?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7d1qk/how_to_tell_someone_their_boyfriend_is_on_dating/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 17:41:54 UTC",
    "id": "1j7czd9",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "Literally I (19m) yesterday got a msg on insta asking me why I was hanging with teens and that I look 40. Bro its over, I can't, I'm so cooked, my life be like ooohh ahhh.",
    "subreddit": "TrueOffMyChest",
    "title": "I'm so cooked",
    "upvote_ratio": 0.17,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7czd9/im_so_cooked/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 17:40:16 UTC",
    "id": "1j7cxzj",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "I (25F) was in a relationship (25M) for almost 2 years. It started off very very well, very dreamy and romantic where I told my friends that I had found the guy I had been looking for all this while etc etc. 2 months after our first date, i lost my job and i realised how emotionally unavailable he was, because all he cared about was his job and his work stress - he didnt know how to empathise with me or support me or help me out (for context the city we live and work in is his hometown) but i thought probably my expectations are a bit much because we are so early in the relationship. But i have known since aug 2023 that this isnt right for me. I am going to bulletise the problems:\n\n• spending time: despite living in the same city, he only saw me once a week, fri-sat, which i initially found weird but adjusted around it. However, because he is an insane workaholic, we didnt do anything special, just stayed in. There were no date nights. When we went out on date nights, i planned all of them, i initiated them, and i convinced him. I wanted to spend more time with him, see him more, but that he told was not possible because it messes with his routines. A lot of his habits and ideas of how we should be were straight up selfish, inconsiderate and disreputable tbh. \n\n• A twisted definition of ambition, different definitions of meaning of life: He has a well paying, reputable, steady job but he wants to start his own thing so that he is doing something “meaningful “ in life. What that means for us is insane working hours, no downtime, no quality time no matter how much i tried to adjust. When breaking up, he said the kind of relationship i want works for people who have job stability and dont want to do much outside of that - and i disagree so much. All i wanted was someone to spend my weekends with, have that quality time. Isnt that the bare minimum? Also, if he cant do this, how will he ever be in a relationship?\nFor me, i am super ambitious and have built a career in a foreign country from the ground up, but for me ambition means being good at job and liking it enough to login every morning to do a good job. Meaning of life doesnt come from the job as i work for the paycheck, but meaning comes from travel, experiences, relationships and friendships. \n\n• His routine: he was obsessed with his routines. Wake up at 6, sleep at 10, gym at 7am, work 8-9 kinda guy. Which is ok, routines are good, but what that meant was he only saw me fridays, and called me daily 9:30-10 (he didnt call me initially at all and we foughjt a lot to get here). Anything outside of that was not possible. This didnt emotionally sit right with me because i couldnt trust, depend, rely on him. In fact, when we were breaking up, he told me he calculated (????) the amount of time he spends with me or talking to me, and thats about 12h/week, which is not possible for him right now. What this translated in my head was, i am not worth the 12h/week\n\n• his spending habits: he lives at home with his parents, earns a LOT more than me, and saves and invests all that he earns to an obsessive degree. He has enough to retire rn, and i respect that. But what that meant for us was, he was extremely stingy and calculative. We split stuff but he just wasnt happy spending - on date nights, dinners, gifts. Heck, he even calculated the transport cost from his home to mine. He even liked to lecture me about how i should spend money, when i already live below my means because i have a loan. He also said that he is saving enough for the both of us, but that never gave me confidence because i saw that as an attack on my independence - i cant live on the money he has earned or saved because it is not mine, he will always reinforce that, and i will have a lesser of a say in how we spend that money. He definitely wanted a prenup if we were to marry which i dont mind, but his general attitude towards money and being too calculative wasnt reassuring\n\n\nBasically, these were long-standing problems which i identified very early on in the relationship and communicated why i find them problematic. However, after each time i communicated he gave me something new to cling my hope on to, and i hoped things would get better because i genuinely wanted this to work. They never got better, we kept on arguing, until yesterday when he asked the question and i agreed - i felt a bit blindsided tbh because he never told me he is thinking about it too. I guess there are 2 lessons for me:\n\n1. To be in a relationship and live in the present and not with the person’s potential and what it could be\n2. To not be so obsessed with the idea of relationships and building a life and the feeling of home with someone that i keep putting up with shit\n\nHaving said all of this, the feeling of loss is immense and i still miss him and have been bawling my eyes out, when it was me who had been considering breaking up for the past year and i know in my heart he is not the one for me.",
    "subreddit": "TrueOffMyChest",
    "title": "I was dumped yesterday but I had been thinking about the breakup for a year, it hurts so much",
    "upvote_ratio": 0.76,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7cxzj/i_was_dumped_yesterday_but_i_had_been_thinking/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 17:32:17 UTC",
    "id": "1j7crh6",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "I don’t want to die, but I don’t feel motivated to live. \n\nWhen I think about anything that used excite me or make me feel joy, I feel a sense of emptiness, like those feelings weren’t there to begin with. \n\nI’m scared that in this life, there’s nothing worth living for. Why should I aspire to be anything, when life itself feels like a chore? \n\nIt’s like I’m stuck in an endless night, and the sun refuses to rise. \n\nSo if you’re reading this; please tell me, what do you live for? ",
    "subreddit": "TrueOffMyChest",
    "title": "I don’t see the point in life",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7crh6/i_dont_see_the_point_in_life/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 17:30:30 UTC",
    "id": "1j7cpy4",
    "link_flair_text": "Positive",
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I have seen so many post whether it be in the format of text or video; stories are being told about what is going on in the world. If you gather it all together and think about it as a reasonable person, connect the dots... If you actually use your mind…the mind that the Lord has given you, things do not line up.\nI just want to bring attention to you, not in a judgmental way, but I hope that anyone who reads this reflects on themselves, are you living your life on the Internet, or are you out there living your life in reality. Are you having interactions with people? Are your acts of kindness, genuine? How do you feel at the end of the day. These are things that are important to reflect upon. Get off your phone, and live your life.\nBlessings to all, and God’s will be done on earth as it is in heaven   \nSend me personal messages if you have something to say. I will talk, neutrally, without judgement, no argument. I’ve done so many horrible things in my life. You would not believe. \nI have compassion for people, even those who I do not understand. \nThis post is probably going to going to get deleted. By Mods. They’re simple minded and do not take into consideration that we are human, and we are equal. Love is love. ",
    "subreddit": "TrueOffMyChest",
    "title": "What life do you live?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7cpy4/what_life_do_you_live/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 17:21:41 UTC",
    "id": "1j7cir2",
    "link_flair_text": null,
    "media": null,
    "num_comments": 8,
    "score": 1,
    "secure_media": null,
    "selftext": "This is a bit odd, and by intimate, I mean a bit more than just touching. \n\nFor a year, I've felt like I've initiated every kiss, every makeout. We're not sexually active yet, but have been dating for almost 3 years now. And we were fairly physical before, but now the extent of her initiating anything is holding hands or resting her head on my shoulder. \n\nI love even that. Makes me melt. Makes me feel wanted. But then I realize at the end of the day, that I initiated every kiss. We make out once in a couple months when I initiate. \n\nI've asked her about it. Multiple times. Is something bothering her, does she want some support, is this not something she wants in a relationship. \n\nEvery time the answer is that she wants it, and that she'll initiate but then it's like she forgets about it. I remember the time she'd hold me, look me in the eyes and kiss me. I remember the times she'd take the slower, non supervised elevator to kiss me in. I remember when she'd ask me to come over when she was alone to make out. \n\nNothing. For a year, nothing. I don't even ask her anymore, cause at that point it feels like I'm forcing her or making it out to be a major fault. I can't even tell what's wrong. What's changed. Every time I ask her it's a different thing. She's not feeling it, she's lost her sex drive (but then a month later, she said that wasn't the issue), there's shit going on in her family. \n\nAnd it's fucking killing me inside. I've started to cook up an actual fantasy in my head. Fantasies of being intimate with her someday have turned into a fantasy of a girl in the future who actually physically expresses love for me. I have shit in my life too, and a kiss from her makes all that go away. \n\nI just feel broken at this point. For 3 years almost, I've worked with this girl, and I genuinely love every inch of her, but somehow this issue itches at the inside of my head and makes me miserable. And I've tried talking to her, but it makes no difference. We reach an agreement and she changed things for a day and then she just reverts to the way things used to be. ",
    "subreddit": "TrueOffMyChest",
    "title": "18 M &amp; F. For the past year, I've suffered mentally cause my GF wouldn't initiate intimate contact with me.",
    "upvote_ratio": 0.57,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7cir2/18_m_f_for_the_past_year_ive_suffered_mentally/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 17:16:32 UTC",
    "id": "1j7cela",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "My cat loves Christmas trees specifically the fake ones. It doesn’t matter if it’s small or big he will go and try to chew on it any chance he gets, same with my other cat.  Last night I started hearing one of my cats whose name is ace struggle a little bit.  I instantly woke up and turned on my light and it looked like there was something stuck in his mouth. Immediately I put him in my arms and wrapped my blanket around him so he won’t squirm too much and looked in his mouth. At first I didn’t see it then I realized a piece was stuck in his front teeth. It took me a few minutes bc he didn’t like me messing around in his mouth but i eventually got it out and he was fine. We ended up cuddling the rest of the night and I kept a close eye on him. \n\nWhy do cats do this? What is the lore for them to want to do that. I tried getting him a catnip plant but he wasn’t interested at all. \n\n(Also yes I know it’s March and my Christmas tree should already be taken down😭 I want a family picture of my son who I’m currently pregnant with and my family by the tree so that’s why it’s still up he’s due in less then 3 weeks)",
    "subreddit": "TrueOffMyChest",
    "title": "What is the deal with cats and Christmas trees😭",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7cela/what_is_the_deal_with_cats_and_christmas_trees/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 17:15:58 UTC",
    "id": "1j7ce4s",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "For the past 2 years I’ve been smoking weed, almost daily. I recently went through a lot of changes, and in that I quit smoking and started taking supervised urine tests. (Among other things) \nI knew that taking these tests meant I couldn’t take my drivers license for at least a few months, and that was okay with me. What I didn’t know is that it meant I couldn’t drive at all, until these tests were finished - which is 6 months - even tho I am clean. \n\nMy doctor failed to tell me (or I failed to remember) that I can’t use the license for my motorcycle that i already have. \n\nI recently met a guy who made my passion for driving motorcycles light up again. I was so ready to get back on the bike, bring it out of the garage, change out the oil and have it in pristine condition. I was so excited to spent a summer on two wheels while getting my life back on track - and this time with someone to share the joy with. In some ways it was part of my motivation for staying clean, and having it ripped away in the span of a few google searches made it that much harder. \n\nI feel so angry, and stupid. I feel like I should have known, and I feel like it was obvious. Yet I thought in some magical way that I could keep my excisting licence, just not take another drivers test. I was so ready for the freedom of driving to work, and going on road trips. Or just driving to the store without relying on commute or friends, or having to walk for 15 minutes.\n\nI know it really isn’t the end of the world, but the next 5 months is gonna be that much more challenging knowing I could have been on a bike if I hadn’t admitted to my doctor that I smoked weed. Im gonna call the doctors office tomorrow to see if I’m correct in thinking I can’t drive my motorcycle, but I’m scared of getting my hopes up. I’d rather sit with knowing I’ll get told I can’t drive than be let down again tomorrow. \n\nBut on the other side of things, I probably wouldn’t have quit if it wasn’t for having to do this at some point either way. \n\nIt just sucks that I’ll be done with these tests in September, at the very end of the season. ",
    "subreddit": "TrueOffMyChest",
    "title": "Grieving biking season",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7ce4s/grieving_biking_season/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 17:04:43 UTC",
    "id": "1j7c4t1",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 10,
    "secure_media": null,
    "selftext": "I am 21 years old. I am in school. I’m moving forward in life but I have been a terrible person. I’ve lied about jobs, I’ve lied about health, I’ve lied about where I live and my age. I’ve lied about what other people have said and done. I’ve lied about past experiences. I’ve lied about relationships. I’ve lied about going to therapy. Hell I lied about when I got my drivers license. The majority of the time for no reason at all. I haven’t gained anything from any of this. If anything, I’ve lost friends and fumbled opportunities. But it just happens. I’ve almost never admitted to a lie. I’ve barely been caught in one either. I’ve lied to strangers and lied to people I trust. And I’ve gotten good enough at it that sometimes I don’t even realize that I’ve lied.\nI’ve made up entire profiles of fake people I created in my head. I’ve talked to people I know personally in real life as these people. I catfished my ex-girlfriend with one of these fake profiles just to make it easier for me to ghost her. It was during COVID and I didn’t want to keep up with the relationship. I don’t know what’s wrong with me. \nI try to feel bad about these things. But I simply don’t, as much as I pretend to. I can’t even feel bad for people who trust me and who I trust, because I can’t bring myself to even really care about them. I don’t miss people. I don’t feel much towards anyone at all really. Even family. \nI know I am not beyond redemption. But I don’t think redemption is in my path when I’ve done absolutely nothing to attempt to improve myself. I don’t really deserve it either. I’m just having the realization that I really am a terrible person.\nIf I could start life over I would. ",
    "subreddit": "TrueOffMyChest",
    "title": "I’m coming to terms with the fact that I am a terrible person",
    "upvote_ratio": 0.83,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7c4t1/im_coming_to_terms_with_the_fact_that_i_am_a/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 17:02:19 UTC",
    "id": "1j7c2ta",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 2,
    "secure_media": null,
    "selftext": "27M\n\nI was always the top student in everything, perfect GPA in university and great highschool grades that I paid off my university tuition via scholarships alone.\n\nYet I’m struggling to find a job and all my parents do is try to crush my spirit and see me as nothing more than an embarrassment and a failure. \n\nI’ve applied for remote jobs and in person jobs with no luck and I’m continuing to build my portfolio and resume and doing my best to network online. On top of that I always help around the house, cleaning, maintence, etc\n\nAt this point only retail jobs are what I’m going for to help pay the car and knowing them they’ll be happy to see me struggle and live up to their “failure” expectations of me. If I even once am seem visibly upset I’m criticized, belittled and shamed with their friends. I have a brother similar in age who’s doing much better with a job and they only want to talk about him and his accomplishments. Both got similar grades only difference is he has a job related to his degree while I don’t. \n\nTruthfully, I have no friends either and I hate to say that some days what they think of me is soul crushing… especially when I’m living at home with them during this time period.\n\nAm I the only person whose parents curse you when you’re nothing less than “perfect?” Somedays it drives me nuts! And like the title… it gets to me and affects my confidence. Yeah sometimes it makes me want to disappear.",
    "subreddit": "TrueOffMyChest",
    "title": "They get to me… jobs and parents",
    "upvote_ratio": 0.76,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7c2ta/they_get_to_me_jobs_and_parents/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 16:46:45 UTC",
    "id": "1j7bpwd",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 2,
    "secure_media": null,
    "selftext": "So when we were in highschool, my dad made us quit any extracurricular activities to make extra money and help pay bills and save for our college, and just put into saving for us. Thats what he told us. But He would take whatever we made and only give us $20 of spending money every pay period. We gave him thousands that went towards the bills and college funds and even built a house back in our home country for when our parents retire. To add to that, we have gotten many scholarships so the majority of our schools were paid for. My sister in question lost her job and has been having a hard time finding another one. My dad used her funds to pay for the first half of her tuition but refused to pay for the second half. The cost is $4k. He said he has no money but yet he JUST bought a new BMW worth 25 to 30k. Keep in mind, we have 3 EXTRA CARS that need about $500 worth if fixing for him to drive just fine! When my mom was trying to talk to him about helping pay for my sister's college tuition, he told her to ask us (the siblings) to help. Since I have money saved, I was able to help pay for her tuition but before I did, I wanted to confirm with him first that he couldn't pay for it. He said he wouldn't answer that question and brushed me away. When I tried to get more from him, he started yelling at me calling me disrespectful. This is an ongoing thing with him. Whenever we try to talk back, he calls us disrespectful. When he is with his friends, he brags about how smart, educated, and respectful his children are, but then in private, he belittles us, sends money to strangers, and constantly puts others first before his own family. I guess we are all sick of it and I want to write this out because I don't know if somebody can see his side of things and tell me what I am missing here. Yes we can move out but the economy is so bad and he knows that so whenever he gets mad, he tells us that we can just leave, knowing that we can't support ourselves. He gets about $1,500 extra in rent from us every month from 3 of us but not from 2 of us cause my sister lost her job and my other sister just started her college as well (she's 17f). She worked very hard and brought about 60k of yearly tuition down to 7k with scholarships and is staying in the dorms. My dad has now refused to pay that even though my sister has worked throughout highschool to make that money. When we argue about money, he stirs the conversation away from the main point and starts going on longggg rants about this certain bill and that certain bill and whenever we cut him off so he can get to the point, he calls us disrespectful and tells us to get out of his room. We know he purposely does this so he can get out of a conversation. And even when he says he never has the money, he is constantly sending money to random people and we feel like he is flexing it. I remember I had to stay at school while my classmates got to go on a fieldtrip cause he didnt want to oay the $5 fee. And then he bought a $20 hat for a funeral he went ONCE! He likes to be constantly looked at and it's so embarrassing when we have to go out. And my mom is constantly arguing with him on our behalf. It's tiring and I feel for my mom who has to deal with his tantrums most of the time. \n",
    "subreddit": "TrueOffMyChest",
    "title": "My (20f) dad (54m) refuses to pay for my sister (18f) tuition because he has \"no money\"",
    "upvote_ratio": 0.76,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7bpwd/my_20f_dad_54m_refuses_to_pay_for_my_sister_18f/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 16:39:35 UTC",
    "id": "1j7bjzh",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "It ended two years ago when I had a traumatic experience after a party. Since then, I’ve had health issues and mental issues. I used to get panic attacks every night and I lived completely alone abroad with no support system and no one to check on me. I went back home, and the psychiatrists made me take 3 different antidepressants which messed up my brain. \n\nEveryday feels like survival mode to me. I used to be such a social person, now I get anxious of social situations and avoid it. I used to love going out, but now I get scared of being outside. Every small task feels scary to me. My intrusive thoughts are also still there despite me quitting drugs a year ago. I have no hope anymore.\n\nAnd on top of that, I met someone I loved during this shitty year of my life. We ended things because he just couldn’t deal with so much from me anymore. I feel so guilty every single day for not being able to show him the version of who I used to be before drugs and experiences messing me up. \n\nI’m 23 now. It’s been 2 years. I moved back home for a bit, even though I hate it here. \n\nThe past month I’ve been feeling very down and thinking of sometimes ending it, even though I would not act on it. I just feel like I can never become the person I wanted to be again. I keep trying to think there is light at the end of the tunnel, but it never comes. ",
    "subreddit": "TrueOffMyChest",
    "title": "My life ended when I was 21.",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7bjzh/my_life_ended_when_i_was_21/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 16:34:16 UTC",
    "id": "1j7bfnq",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 1,
    "score": 8,
    "secure_media": null,
    "selftext": "I fucking hate driving, I can't explain it, it just fucking terrifies me. Maybe it's because my mom would drive drunk and my dad is an aggressive driver (aka get out and threaten or beat people out for stupid shit). Maybe it's related to Autism or OCD. I don't know. All I know is, that when put behind a wheel, I panic so bad that I just want to hurt myself and usually do end up doing that. Every single time, I have a meltdown. I hate myself so much for it. I feel like such a goddamn coward, but it's so overwhelming, I'm terrified I'll hurt myself and others on the road because I zone out. The only way I can drive is when I'm zoned out, otherwise I just throw up. I wish I wasn't like this. I'm 21 years old, I can't be like this. But the thought of eventually having to drive every day for the rest of my life sends me spiralling, I don't think I can do this. Going to my sister's for driving practice is so inconvenient for everyone, and I spend the two or three days prior to it freaking the fuck out, I can't relax because I know it's coming. I hate this, I hate being such a damn burden.",
    "subreddit": "TrueOffMyChest",
    "title": "I hate driving.",
    "upvote_ratio": 0.73,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7bfnq/i_hate_driving/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 16:33:10 UTC",
    "id": "1j7bepy",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "\nOk so this is advice for how to survive these places. They are helpful, but in a weird way, but it sucks, and it’s traumatizing. But it’s very isolated and weirdly desensitized, so in there you aren’t effecting anyone you have personal attachments to. So first official tip, just make it to your release date, and you will be just fine. \n\nNext, a lot of people coming in to these places may have drug issues, or self harm. When I was in the ones I went to, I was too. And I was put in a terrible place with people on stimulants and benzos; along with a very odd amount of persistence and survival “methods” \nYou will likely turn to snorting cheeked meds, drinking hand sanitizer and god knows what else. So go in with at least a little safety net. bring yourself alcohol wipes, an extra sock, and then a condom, if you are afab and haven’t had any surgeries or anything like that then this can work for “transportation” but the condom has other uses too. Not for sex.\n \nPlease don’t have sex oh my god. Just jerk off or something, everyone there is fighting literal demons. You do not want to end up in bed with them, I know that sounds stupid, but two people going through a mental health mess will have a very weird and toxic dynamic. \n\nI should also say that people are going to be judgmental. They are judging themselves so they are also projecting it. \nSo I just don’t think you should form attachments or like preconceptions. You should talk to them though, it will really help to hear about someone’s life the closest you ever can. It makes you feel less alone. And it’s incredible to know you’ve seen these people be horrible and they the same for you, and you will never see each other again, and they know the most and least about you. \n\n\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "Advice for res or even inpatient",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7bepy/advice_for_res_or_even_inpatient/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 16:29:57 UTC",
    "id": "1j7bc3e",
    "link_flair_text": null,
    "media": null,
    "num_comments": 174,
    "score": 1112,
    "secure_media": null,
    "selftext": "\nI’m a 6’1.5 cis woman . Not only am I tall , but I am big /massive . I have a very long torso , long face , big hands , and big feet  \n\nDue to my height I am masculinized all the time even by own family members . I am misgendered , and sired all the time . I get treated like a dude without the male privilege . People also treat me like there’s something inherently wrong with me for being this tall  . People laugh at me , stare at me , and point at me due to my size . As a victim of abuse /assault people have laughed at the idea that a big women like me could ever be abused /assaulted . I have had people thought I was a man in the women’s restroom , and had security called on me . I’m so traumatized that I don’t even use women’s restrooms despite being born one \n\n\n\nMy height has given me PTSD , anxiety , and has been a psychological burden to me \n\n\nMy sister is 5’3 , and very small . She has never have to dealt with the discrimination, and ostracism that I dealt with . When something happens to her , people comfort her quickly . She can go to any store , and find any clothing /shoe that are her size while I shop at the men’s section \n\n\nI find myself crying at night over my height , and having suicidal thoughts since I cannot do anything  about my height \n\n\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "I cry at night over my height , and desperately wish I was 5’3 like my sister  . I would give away $400,000  of my money sitting in retirement accounts to even be 2 inches shorter",
    "upvote_ratio": 0.9,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7bc3e/i_cry_at_night_over_my_height_and_desperately/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 16:24:53 UTC",
    "id": "1j7b7w4",
    "link_flair_text": null,
    "media": null,
    "num_comments": 77,
    "score": 144,
    "secure_media": null,
    "selftext": "Hi Im 25 years old.. Virgin.. yesterday I find online an escort in the city next where I live. the photo of the girl..too good to be true.. She looks like a model.. I really thought this is a scam I'm going to get robbed. All day long over thinking just for the thought of texting her. So yeah finally my horniness took over I texted her, took rendez-vous. In my car all I was thinking was this is it I'm getting the real thing or get robbed or whatever. End of the story I go to her apartment and this wasn't a scam she looks like exactly like the photos.. Incredible body..clearly too hot for me. Paid for 20 minutes.. didnt know what to do.. Didn't tell her I was a virgin but she probably guess. I was awkward.. And couldn't get hard so I leaved.\n\nNow I'm disgusted in myself, I feel so lonely. I can't do this life on my own I'm lost and can't take this loneliness. And I'm ugly I did everything I can to improve myself grow a beard, gym, tattoo, plastic surgery , still ugly. Anyway that's it.. Don't talk to me about meds I already did go to a psychologist I took some xanax and resperidone to calm down and wasn't feeling like myself felt like a zombie so fuck that\n\nI know I should get over it and wait for the right woman and don't go to escort ever again but the right woman or any woman aren't going my way soon and I don't want to get traumatized so yeah maybe I should try again and find another one until it work\n\n(Sorry for my bad English its not my native language)",
    "subreddit": "TrueOffMyChest",
    "title": "Last night I paid a sex worker and couldn't get hard",
    "upvote_ratio": 0.84,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7b7w4/last_night_i_paid_a_sex_worker_and_couldnt_get/"
  }
]