[
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 20:16:46 UTC",
    "id": "1j5z3x5",
    "link_flair_text": null,
    "media": null,
    "num_comments": 10,
    "score": 65,
    "secure_media": null,
    "selftext": "",
    "subreddit": "TrueOffMyChest",
    "title": "Reddit keeps getting worse by the minute. With their new rules restricting certain words from being commented on or upvoted, some of the best subs are shutting down. Three of my favorites are now locked from posting, and it’s frustrating to see the platform becoming more and more restrictive.",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5z3x5/reddit_keeps_getting_worse_by_the_minute_with/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 19:42:19 UTC",
    "id": "1j5y4y8",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "what about my dreams?\nweren't they big enough?\nwas my love more important?\nwas it worth even to let it all down for the love which i never got respect I was accepting the assurance I asked for\nwas it all worth it?\nwould I still be choosing to let it all down after this love \nwhat is it \nis this even love \nto get love is to leave your dreams behind?\nto get love is to do bad to yourself?\neven that just to be not sure that will I be loved \nwill I be loved?\ni did all i could \ndid i?\nwas it all I would have done if I was loved even the 1perecent i gave\ndamn \nI miss her\nand again i forgot about my dreams\nso this is love ?\n\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "so this is love",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5y4y8/so_this_is_love/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 19:40:23 UTC",
    "id": "1j5y2vu",
    "link_flair_text": null,
    "media": null,
    "num_comments": 13,
    "score": 0,
    "secure_media": null,
    "selftext": "I have decided to make a account to admit to this one thing so none of what I admitted ruins my life this happened around 20 Years ago in the early 2000s I was still a kid around 8 or 10 when I wanted to play in the forest with my friends who were around the same age it was a very hilly forest with even some mountains one of my friends maybe 12 I think the oldest one I had said he wanted to go to the highest point that looks over a river to see the view it was getting dark so my other friends were to scared to go with so they said they were gonna leave so I went with him because I never really went to that area and was curious to see what it looked like looking back I wished I just said we should go there tommorow and left it there but I diddent wanna look like a scaredy cat infront of my older friend so I went with him it took a bit of a while and I thought it would be funny to play a prank telling him I would go pee in the forest but scare him by that time we had already arrived so I jumped out from behind a tree and yelled as loud as I could he flinched and screamed in panic and I saw him trip down the edge I panicked and ran away back home as quick as possible I stayed inside for a few days but my friends asked me one day where was our older friend and I lied and said he decided to go home after we got there and looked and I haven't seen him sense I haven't told anyone about this yet",
    "subreddit": "TrueOffMyChest",
    "title": "I accidentally killed someone as a kid and I regret it every day",
    "upvote_ratio": 0.36,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5y2vu/i_accidentally_killed_someone_as_a_kid_and_i/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 19:35:26 UTC",
    "id": "1j5xxsw",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "Pretty much the title \n\nThey snap at me constantly, for no reason whatsoever. I’m so sick of it. Tuesday I was having a shit day and accidentally snapped at them, only to find out they complained to their friend about it and I got sent an email saying “OP, I dont know your story or what your going through but you shouldnt snap or yell at friend. Friend didnt do anything. so just stop yelling or snapping at people.” \n\nAnd when I told this friend they don’t know what I’m going through and that friend is basically a hypocrite and to not email me again (why are we emailing?? I don’t know.) I got this “hey its friend-of-friend i just wanted to say this is totally unacceptable if you don't appreciate when people snap at you why do it to others or better yet communicate that you don't like it but if you enjoy pushing away everyone who cares go ahead struggle on your own or pull yourself together and reach out communicate or get the help you so clearly need honey“ (im in therapy three times a week but she doesn’t know that bc she doesn’t know me) \n\nAnd today, my friend snapped at me. Again. I asked if they were ok and got “IM FINE!”\n\nOk, you fucking hypocrite. I’m just so done and starting to truly hate them. Sorry for the word soup I just needed to vent \n\nEdit: forgot to say this but the end of the day Tuesday, when I was feeling slightly better: I APOLOGIZED. Something my best friend has never done unless prompted (they blame it on their autism - I’m autistic too… and I apologized without being told to…)",
    "subreddit": "TrueOffMyChest",
    "title": "I’m starting to hate my bestfriend",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5xxsw/im_starting_to_hate_my_bestfriend/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 19:29:49 UTC",
    "id": "1j5xs4l",
    "link_flair_text": null,
    "media": null,
    "num_comments": 10,
    "score": 2,
    "secure_media": null,
    "selftext": "",
    "subreddit": "TrueOffMyChest",
    "title": "I'm tired",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5xs4l/im_tired/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 19:27:03 UTC",
    "id": "1j5xpao",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "There was once a boy who believed in love—not the fairytale kind, but the kind that made the world feel right. And for a while, he had it. A girl who stood by him, who saw the best in him even when he didn’t see it himself. She loved him with a kind of loyalty that was rare, a love that never wavered even when he gave her reasons to walk away.\n\nBut love isn’t just about feelings; it’s about choices. And one day, fear made him choose wrong.\n\nHe let go—not because he didn’t love her, but because he was afraid. Afraid of not being enough. Afraid that one day she would leave, and it would hurt too much. So instead of holding on, he let himself drift away. He convinced himself that if he stopped putting in effort, if he stopped making her a priority, then maybe, just maybe, it wouldn’t hurt when it finally ended.\n\nBut she never left. She stayed. She still believed in them, even when he had already started moving away. And then, he made a mistake he could never take back—he gave his heart to someone else before he had truly let her go.\n\nAt first, he thought he could move on. But something inside him shifted. After some time in his new relationship, he finally understood his mistakes. He realized how deeply he had hurt the one person who had truly loved him. But he never knew how to make it right. How do you fix something after breaking it beyond repair? How do you face the person you betrayed, knowing no apology will ever be enough? He wanted to go back, to do something, anything—but the guilt held him back.\n\nAnd so, he stayed.\n\nNot because he had moved on, but because he was afraid—afraid that if he left his new relationship to make things right, he would once again be the villain in his own story. The guilt consumed him, so instead of looking back, he convinced himself that staying was the only way forward.\n\nAnd in his guilt, he changed.\n\nDetermined not to make the same mistakes, he became kinder. He tried to treat the new girl right, giving her the love and care he had once failed to give. But kindness, when given to the wrong person, is easily taken for granted. And she did exactly that.\n\nShe manipulated him, gaslighted him, twisted his guilt into a weapon against him. She made him believe he was always wrong, always at fault. Every time he questioned her actions, she turned it around, making him doubt his own reality. Whenever he felt she was wrong, she made herself the victim and made him feel like he was the one to blame. Slowly, he lost himself. The person he once was—the person who understood things clearly—began to fade.\n\nAnd as you already know, he never spoke up.\n\nRegret became his shadow. Guilt, his reflection. He had apologized to the one he had hurt, over and over again, but some wounds don’t heal with words. He had hurt someone beyond repair, and now he was paying the price—not just through his own pain, but through the way he was now being treated.\n\nHe wanted to move forward, to leave it all behind, but no matter what he did, the past followed. Every quiet moment became a reminder of what he had lost. Every time he tried to love again, he feared he would be taken for granted, just as he had once done to her.\n\nMaybe this was karma. Maybe this was what he deserved. Or maybe… just maybe… he still had a choice.\n\nAs he stood at the edge of everything he had been and everything he could become, he realized something: he had no idea what came next. Would he ever forgive himself? Would he ever find peace? Or would he always be haunted by what he had done?\n\nHe didn’t know.\n\nBut for the first time in a long time, he was ready to find out.",
    "subreddit": "TrueOffMyChest",
    "title": "The Weight of My Own Mistakes",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5xpao/the_weight_of_my_own_mistakes/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 19:20:41 UTC",
    "id": "1j5xime",
    "link_flair_text": null,
    "media": null,
    "num_comments": 9,
    "score": 5,
    "secure_media": null,
    "selftext": "It made me feel old for the first time in my life. Zesty ah",
    "subreddit": "TrueOffMyChest",
    "title": "I just had to google a slang term. I'm 23...",
    "upvote_ratio": 0.65,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5xime/i_just_had_to_google_a_slang_term_im_23/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 19:16:57 UTC",
    "id": "1j5xemc",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 5,
    "score": 1,
    "secure_media": null,
    "selftext": "Last night around midnight I took a few mg of Xanax n 300+ mg of hydroxyzine thinking that it would kill me in my sleep and no one would realize until I was already dead. But of course with my luck I’m here to tell you it didn’t work. Around 1 pm I woke up with nothing to show for it. I made sure not to have any signs or tell anyone I was trying to die but that doesn’t even matter now. \n\nThe worst part of this is that I’m really dizzy and unbalanced when I’m walking around but that’s literally the only sign anything happened. I’m so disappointed. People overdose on Xanax all the time without even trying— actually trying to just get high and feel better. But when I try all I get it 13 hours of uninterrupted sleep and a bit dizzy. \n\nPeople die every day on accident without any thought or desire or knowledge but everytime I try to die it doesn’t work. I think it’s bc I’m 250 lb and I needed to take more to match my weight but I literally took all of the CNS depressants I had and even then I woke up with minor symptoms. This isn’t fair. \n\nI know so many people die from trying even less and without trying so hard. I also know that some suicidal people are grateful they wake up after their attempt and maybe I wish I could be one of them but I’m not. \n\nI’m angry and sad and confused about why I didn’t die and why I have to keep living this insanely miserable life. I wish I had just died last night but I’m even terrible at killing myself. \n\nETA: I did some research and I didn’t take nearly enough of either drug. ",
    "subreddit": "TrueOffMyChest",
    "title": "I tried to overdose but I failed. Now I’m even more lost.",
    "upvote_ratio": 0.66,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5xemc/i_tried_to_overdose_but_i_failed_now_im_even_more/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 19:16:54 UTC",
    "id": "1j5xekc",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 0,
    "secure_media": null,
    "selftext": "my 11 year old girl sister is so pretty. She met this 13 year old she really likes. The problem is he goes to a different school but they both go to seprate chirstian schools. Its like puppy love yk? They met at a futsual tournament. His in 8th grade and shes in 6th grade, but hes about to turn 14 and shes abt to turn 12.  They met again for 3 days straight at a field trip with all these schools combined. They have been texted back and fourth. But she said that they might start dating. Im telling her that she shouldn’t because she has to think about how when he’s in 10th grade shes gonna be in 8th grade?? its a bit strange i guess. Should they date?? They both like each other alot. PLEASE ANSWER!!\n ",
    "subreddit": "TrueOffMyChest",
    "title": "PLEASE SEE THIS!!",
    "upvote_ratio": 0.4,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5xekc/please_see_this/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 18:53:01 UTC",
    "id": "1j5wpag",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "keeping events and names vague on purpose.\n\ni have a very close friend, A, who i love very dearly, but shes been in bind after bind. her family had disowned her and she has been in like 5 horrible relationships in the past two years and both the places she has worked at in the past two years have gone out of business. none of this stuff is her fault but i think it puts her in a shitty place where she feels justified in her own mind to just not hang out with friends or justified to be rude to friends in a way.  \ni love hanging out with A and i love just sitting around and chatting and watching tv with her while i do art and such like that, but i also love getting out of the house on occasion if im invited.\n\n  \nfor example, As roommate, B, invited Bs GF, me, A, and another friend out to go get food. we got all ready and then A was like 'i actually dont have alot of money so im gonna sit this one out.' and we were all super sad and then we all look in our wallets and agree we could chip in a few bucks each to cover As meal because shes been in hard times so much and we go tell her and shes like 'no... i dont want to...' so we go out to eat without her and have a great time and come back and even bring her food back from the restaurant and shes all angry and depressed and sad she didnt get to go.\n\n  \nTwo weeks ago, B took a bus to stay in her GFs dorm for a few days and when she came back i picked her up from the bus stop, we got some fast food, even got some for A and then came back home and me and B were talking and being silly when A goes 'i hate hearing you talk and have fun like that when you got to go do something fun while i had to work for all those days with no break.' and then A goes back to her room. I went to class and didnt hear anything for a few days but i know that A and B argued. \n\n  \nthen some friends from me and As highschool that we still regularly talk to texted me and said theyre gonna do something fun over this coming weekend and i was like hell yeah i love hanging out with my friends and they told me to ask A if she wants to join in and i call up A and ask her and she goes 'idk... i dont have my work schedule yet...' and i said 'ok could u text ur boss and ask for the day off? we really all want to hang out with you!' and she says 'ill see'. weekends coming around and i just texted A to ask if shes gonna hang out with us and she goes 'no i have work' i say 'oh im sad you couldnt get work off' and she goes 'oh i didnt really try... they (highschool friends) didnt directly ask me so i figured i wasnt invited.'  \nlike girl.... i literally asked you because they wanted you there? and i showed her the texts from our friends asking if A is coming because theyre so excited to see her, both friends live a ways away so we dont see each other often and one of the friends hasnt seen A for about 4 years due to moving states and then coming back. and we were all excited and waiting for her to join us. but i go 'ok... i wish u could have joined us maybe we can pick u up after u finish working and hang out?' and she just goes 'no i think your all going to have fun without me'  \nand i kinda was a bit pissed w her so i said she should have take the day off when i asked a while ago and shes just like 'oh. i could  have. but i didnt.' ??? girl?   \nthis is around when i told her she needs to stop victimizing herself.\n\ni hung out with her roommate later that day and we discussed how shes kinda been and B said she would talk to A about how she needs to stop isolating herself. I also ended up inviting B to hang out with us over the weekend instead as the highschool friends have all met B in passing and like hanging out with her. ik this is gonna piss off A a bit but like A could have also hung out with us.... and then A is gonna be mad and not want to hear about what weve all done for a while.   \nim just so tired of her self deprecating behavior where she always HAS to be the victim who just CANT hang out or CANT do anything fun and all that bull.\n\n\n\nTLDR; exactly what the title says. i told my friend that she needs to stop victimizing herself and i dont really feel that bad about it. thats the end. ",
    "subreddit": "TrueOffMyChest",
    "title": "i told my friend that she needs to stop victimizing herself and i dont really feel that bad about it.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5wpag/i_told_my_friend_that_she_needs_to_stop/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 18:43:46 UTC",
    "id": "1j5wfhm",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 5,
    "secure_media": null,
    "selftext": "Hey everyone,\njust curious what you think. \n\nI (31) have been struggling with OCD for a couple years. I’m scared to stay alone forever. I read in the OCD sub and there’s multiple posts about breakups due to the illness and it destroying people’s relationships. \nI had a similar experience, my only relationship (3 years) with my boyfriend (m, 23 at the time) ended because he couldn’t handle the stress and anxiety I had. I had just gotten my diagnosis 2ish years into the relationship and was severely affected at that time. \nI’m scared to have to stay alone and miss out on the family I’ve always wanted. Who would want to be with me and stay during f.e. relapses or difficult times where I’m panicking a lot. \n\ntl;dr will I have to stay alone because of my difficulties I’m having (due to my mental illness) and would bring into a relationship?",
    "subreddit": "TrueOffMyChest",
    "title": "Scared I’ll never get a long term partner and family due to my mental health illness",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5wfhm/scared_ill_never_get_a_long_term_partner_and/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 18:42:58 UTC",
    "id": "1j5wepk",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 2,
    "secure_media": null,
    "selftext": "\n\nHey everyone, to whoever’s reading this story.\nI’d love to hear your thoughts on it. I guess I should start with a little backstory.  \n\nAround early autumn last year, I was walking through one of the neighborhoods in my city. It was my last day at work, and after finishing up, I decided to take a stroll, grab something to eat, and soak in the last warm, sunny days. I found a nearby bench, sat down, popped in my earphones, and just listened to music as I made my way to a café.  \n\nAt some point, I noticed a girl who looked really upset.  \n\nI hesitated for a moment but then decided to go up to her and see if she was okay. Turns out, she’d had a really rough day. We ended up walking together, exchanging contacts, and chatting later on when we had time.  \n\nOur first few meetups were easygoing and fun. We talked, got to know each other, and with every meeting, we started growing closer. After about a month, I started visiting her place after the gym to unwind a little.  \n\nAnd then, at some point, things between us started feeling like more than just friendship. There was this warmth, this physical closeness that I’d been missing (even though I had plenty of friends, I was single at the time).  \n\nShe’s absolutely gorgeous—like, the kind of girl who turns heads wherever she goes. She’s tall (about 185 cm), has an amazing figure, a beautiful face, and these deep brown eyes that just pull you in. She’s got a great body, though that’s far from the only thing I like about her. She’s also a few years older than me.  \n\nThen, about three weeks later, after lots of time spent together and some really great conversations, I went over to her place again, this time bringing flowers to surprise her.  \n\nI rang the doorbell, and when she opened the door… my jaw literally dropped.  \n\nThere she was, standing in front of me in red silk shorts and a top, looking absolutely breathtaking. I just stood there, speechless, until she pulled me inside, wrapped her arms around me, and kissed me.  \n\nWe headed to the kitchen, where she was cooking some meat for dinner—something she knew I liked, even though I’d never actually told her. That moment just hit differently. It was like she knew me better than I knew myself. That was when I realized—this girl had completely stolen my heart.  \n\nLater, she even got me a pair of shorts and an T-shirt so I’ve have something to wear around her place.  \n\nI changed, sat down with her on the couch, and we put on some YouTube. Before long, we were cuddling, and yeah—that was when we kissed. The whole evening was just perfect.  \n\nAnd now, every day, I catch myself wondering: am I doing the right thing? Because I honestly love spending time with this girl.  \n\nI could really use your advice.  \n\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "Out of nowhere, I met this really gorgeous girl, and now I'm over here second-guessing everything-like, am I even doing this right?",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5wepk/out_of_nowhere_i_met_this_really_gorgeous_girl/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 18:42:03 UTC",
    "id": "1j5wdw2",
    "link_flair_text": "Positive",
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "Hey everyone! 🌟 I’ve been reflecting on my journey, and I wanted to take a moment to thank all of you for supporting me through my vulnerable moments. It’s not always easy to open up, but your encouragement has truly meant the world to me. 💖\n\nLife can throw us off track, and sometimes, it feels like we’re walking in circles. But what I’ve learned is that it’s okay to stumble, as long as we keep rising. It’s the small steps that really count – whether it’s crossing off a goal, taking time for self-care, or just acknowledging how far we’ve come.\n\nSo thank you, from the bottom of my heart, for being there when I needed it the most. You’ve helped me find my strength again. 💪✨\n\nWhat’s one thing you’re doing to get back on track? Let’s keep lifting each other up and moving forward, together! 🌱 Drop your thoughts below – I’d love to hear your stories too! 💕\n\n#RisingBack #ThankYou #VulnerabilityIsStrength #SmallStepsBigWins",
    "subreddit": "TrueOffMyChest",
    "title": "My Journey of Getting Back… One Step at a Time 💫",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5wdw2/my_journey_of_getting_back_one_step_at_a_time/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 18:13:37 UTC",
    "id": "1j5vn09",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 47,
    "score": 115,
    "secure_media": null,
    "selftext": "I was a mess following my mother's death. It messed with my sleep and I was on sleeping pills. My husband used to work in shifts. Our son, 16 at the time, lived with us. He was a very normal kid. We never even treated him any wrong.\n\nFew months ago I stopped taking the pills. My husband was on night shift and son's friend was staying over. I woke up in the middle of the night to his friend with his hands on me. I was scared and screamed. I asked him what he was doing and he couldn't answer. I was expecting my son to come in after I screamed but he didnt.\n\nI went into the living room and called. He came out pretending he didn't hear me or knew what was happening. I just knew he was lying and he eventually confessed that he knew and that his friend pressured him. I was getting raped for almost a year and he said nothing. I didnt tell my husband because I dont know how he will react. I just told him never to contact my son again and threw him out. I havent directly talked to my son since. I dont know if I ever will.",
    "subreddit": "TrueOffMyChest",
    "title": "I was regularly abused and my son knew about it",
    "upvote_ratio": 0.86,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5vn09/i_was_regularly_abused_and_my_son_knew_about_it/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 17:58:36 UTC",
    "id": "1j5v8s2",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 3,
    "score": 4,
    "secure_media": null,
    "selftext": "my father was abusive towards me with my earliest memory being him breaking my arm. it all went to court after he tried to strangle me to death when i was 8 yers old. i cut his whole side of the family off and my decision was consolidated when they sided with him and when i was 9 years old, despite making it clear i didn’t want to see them, my grandmother ran up to me and refused to get go of me while my grandfather watched. i felt betrayed by both my grandparents and had not spoken to either of them since. im 17 currently. december i found out my grandfather had terminal stomach cancer and i sat there wondering if i should make contact before it was too late. he had not done anything to me but he was complicit. i carried on as normal until last night i sat there deciding that i was going to write to him after school. the news came in at 11am, he had died. months of back and forth on whether or not to do it and he died. theres no chance of rekindling because he’s not here anymore. all i can do is sit here and wonder what life would have been like if i didn’t make the decision i did 9 years ago and i feel that will haunt me forever. i feel like such a shitty person. ",
    "subreddit": "TrueOffMyChest",
    "title": "my grandfather passed away and all i feel is guilt",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5v8s2/my_grandfather_passed_away_and_all_i_feel_is_guilt/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 17:53:27 UTC",
    "id": "1j5v3gk",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 2,
    "secure_media": null,
    "selftext": "I've been thinking about this a lot. I haven't told anymore irl, and I'd like to have outside opinions.\n\nI work as a cashier. This new guy has been coming to my store regularly. He’s friendly, a bit flirty, and kind of cute. Issue is, he was my teacher when I was ten-ish years old.\n\nI really don't think he recognizes me. I've obviously changed a lot since then, I only saw him two hours a week for a year, and it's been a decade.\n\nShould I tell him? I think it would make things weird, and it could make him feel grossed out with himself. Objectively, we're just two people, but it's still strange.\n \nAlso, this won't go anywhere, (especially since I'm moving in a few months) but I do enjoy our conversations.",
    "subreddit": "TrueOffMyChest",
    "title": "I'm flirting with my teacher, but he doesn't know",
    "upvote_ratio": 0.55,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5v3gk/im_flirting_with_my_teacher_but_he_doesnt_know/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 17:33:29 UTC",
    "id": "1j5uigi",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "I have been with my partner for over a year. I honestly don't even know how to describe the feeling. I feel invisible. I feel like they don't care to know me or care enough to notice something is wrong until I'm at my breaking point. \n\nI sat here trying to convince myself that if I give it more time they will know me more. I know everything about them, their likes, their hates, what could make them smile and just tiny things about their life. Some of it I write down so I don't forget and other times I just remember.\n\nThe other day, my partner just found out what my favourite animal was, but it wasn't the first time, i told them before. This happened 2 separate times and all they said was that \"my memory is really bad\".\n\nWhen I try to talk about any part of my life they start kissing me as if they want me to stop. Now I'm here sitting across them and realising that I am invisible to them. I've been having a rough time, they haven't noticed. I noticed when it happens to them. \n\nI keep telling myself that this is the healthiest relationship I've been in and that we communicate well and that maybe this is something to just talk out and hope it gets better because whilst I dont feel important to them, they're are important to me and I don't want to lose them. \n\nIt makes me extremely sad that I feel this way and a part of me wants to accept this as my life now because maybe this is the best love that I deserve? Maybe this is karma for the things I did wrong.",
    "subreddit": "TrueOffMyChest",
    "title": "I feel invisible to my partner and it hurts",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5uigi/i_feel_invisible_to_my_partner_and_it_hurts/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 17:28:03 UTC",
    "id": "1j5ucsq",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 2,
    "secure_media": null,
    "selftext": "Me (26F) and my friend (25M) met during university, but we didn’t talk much back then. He had his own friend group, and I had mine. It wasn’t until a few years after graduating, when we ended up working together, that we became inseparable, because our cubicles are right next to each other. \n\nI have pretty bad abandonment issues, but I also get attached to people way too easily (a deadly combination, I know). So when we started hanging out more, I didn’t think much of how close we were. I was just happy to have such a good friend.\n\nI didn’t realize I had feelings for him until my birthday. He was running late to my party, and I caught myself looking at the door constantly, waiting for him to show up. I felt this ridiculous relief when he finally arrived. At the time, I had just gotten out of a really toxic situationship, so I dismissed my feelings. I told myself I was just trying to replace what I had with the other guy.\n\nThen, a few months later, he told me he was interviewing for a job on the other side of the world. I had a full-on breakdown. That was the moment I realized how deep my feelings for him actually were. I can’t even tell you how many nights I cried over the idea of him leaving. In the end, he got the job, but still chose to stay.\n\nSome part of me thinks maybe he likes me back. He’s told me before that he thinks I’m pretty, he cooks for me, listens to me vent, spends whole weekends with me, and just shows up in a way that no one else has. Sometimes he makes comments that imply he does want something with me, but then he also says he wouldn’t date someone outside of his culture (we are from two very different countries). So I don’t know if he’s sending mixed signals on purpose or if I’m just reading too much into things.\n\nTo make things worse, he recently started messaging back and forth with a friend of his from high school, and it seems pretty flirty, he seems excited. It’s killing me. I don’t know what to do or how to deal with it. I want to cry every single day. He is going back home for vacation soon, and I’m terrified that he’ll come back and tell me he has a girlfriend.\n\nI know now that a relationship isn’t possible, and I don’t want to lose him as a friend. But I don’t know how to deal with these feelings.",
    "subreddit": "TrueOffMyChest",
    "title": "I think I am in love with my friend and it is ruining my life",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5ucsq/i_think_i_am_in_love_with_my_friend_and_it_is/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 17:22:18 UTC",
    "id": "1j5u6ov",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 0,
    "secure_media": null,
    "selftext": "I want to start by saying that this is a personal opinion and I understand and also support personal opposing views on this topic regarding individuals who believe the days to be an \"exemplification\" of feelings rather than the notes listed below.\n\n\nIn the past few weeks I've been hounded on a LOT about not celebrating valentines day, mothers day, or International Womens Day by people other than the ones I'd celebrate them for. Ranging from people telling me I'm an awful human being for not appreciating my mom or women in general(despite this being wholly inaccurate) to people threatening to assault me because i didnt do something special for my mom on mothers day. I wanted to hear from random strangers online if my reasoning is sound and makes sense as toward why I don't celebrate them specifically as when I explain it in person, people seem to get quite upset with me regardless.\n\nI would like to note that around the holiday, not on the holiday itself all the time, just around that time period, I still put more effort and care into the relevant individuals, but I just don't like to celebrate the days themselves for the reasons listed below.\n\n\n\n\n\nMy reluctance to celebrate holidays like Father’s Day, Mother’s Day, International Women’s or Men's Day, and others that specifically celebrate a group of individuals stems from a few key personal beliefs and feelings.\n\n1. Forced Social Expectations\n\nI often feel that these holidays create an obligation rather than a genuine expression of appreciation. Society dictates that on this specific day, I must express gratitude or admiration, even if I already do so in my own way throughout the year. It feels performative—like I’m expected to participate just because it’s a designated date, rather than acting on my feelings when they naturally arise.\n\n2. Commercialization Over Meaning\n\nThese holidays have been heavily commercialized, turning what should be a meaningful moment into an opportunity for businesses to sell cards, flowers, gifts, and expensive dinners. It feels less about genuine appreciation and more about fulfilling a marketing-driven expectation. I don’t like the idea of my relationships being tied to consumerism, where love and respect are measured by the money or effort spent on a particular day.\n\n3. Personal Connection to the Honored Group\n\nSometimes, I don’t have a personal connection that makes celebrating these holidays meaningful. For instance, if someone has a complicated relationship with their parents or lacks a strong figure that fits into the holiday’s framework, these days can feel alienating rather than celebratory. It’s a reminder of what someone might not have, rather than an opportunity to appreciate what I do.\n\n4. Selective Recognition Feels Arbitrary\n\nWhy do we elevate specific groups on designated days while overlooking the everyday contributions of others? It feels arbitrary—why celebrate fathers on one day and mothers on another when both play roles throughout the year? Why single out women for one day rather than advocating for equal treatment and appreciation daily? It seems more symbolic than substantive, and I prefer actions that carry meaning every day rather than confining appreciation to a calendar date.\n\n5. Pressure to Conform\n\nThere’s an implicit pressure to participate in these celebrations, whether it’s through social media posts, attending gatherings, or giving gifts. If I choose not to, there’s often an assumption that I don’t care or that I’m being inconsiderate. But in reality, I simply prefer to show my appreciation in my own way, at my own time, without feeling compelled by external expectations.\n\n6. Not Everyone Experiences These Days Positively\n\nFor many people, these holidays can be painful rather than joyous. Someone who has lost a parent might struggle on Mother’s or Father’s Day. Someone who has faced discrimination or hardship might not feel comfortable with the broad generalizations made on International Women’s Day, Mother’s Day, Father’s Day, or International Men's Day. These celebrations assume a universal experience that doesn’t exist, and I’d rather avoid engaging in something that might inadvertently bring discomfort to others.\n\n7. Personal Values and Approach\n\nUltimately, I value sincerity over tradition. If I appreciate someone, I want to show it naturally, in a way that feels right to me, not because a calendar tells me to. I don’t need a designated day to tell my parents I appreciate them, nor do I need a specific date to recognize the struggles and achievements of any group. I’d rather express my respect, gratitude, and admiration in everyday moments, through my actions and words, rather than as part of a structured societal ritual.\nFor these reasons, I tend to avoid participating in these kinds of holidays. It’s not out of defiance or lack of appreciation, but rather a personal preference for authenticity over obligation.",
    "subreddit": "TrueOffMyChest",
    "title": "Why I don't support or celebrate Specific Group Celebration Holidays? (Men/Women/Mother/Father/Pride/Black History/etc)",
    "upvote_ratio": 0.46,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5u6ov/why_i_dont_support_or_celebrate_specific_group/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 17:22:11 UTC",
    "id": "1j5u6k8",
    "link_flair_text": null,
    "media": null,
    "num_comments": 9,
    "score": 10,
    "secure_media": null,
    "selftext": "My (52M) father-in-law (85) moved in with us from another state due to his declining health. There was no way he could live by himself any longer. He’s a solid guy...sharp-minded, well-read, but lately, he just sits, naps, and stares into the void for hours. I work from home, and watching him decline, watching him die...has started to weigh on me in ways I didn’t expect. He says that if he stops eating he won't last as long and things like that. He's on all kinds of meds for cancer to depression of knowing he's dying.\n\nIn the past two months, I’ve had to give him more showers than I can count after accidents. I’ve hosed down clothes, scrubbed poop from the shower, and still not used to the loud burps, the constant farting, the mad dashes to the bathroom, while using a walker, hearing his despair as we walk, listening to him crumble in humility. I haven’t said a word to anyone about it because the first thing I feel isn’t frustration...it’s sadness. He had prostate cancer, and it’s spread to his bones. The doctors haven’t given us much insight into what’s next, but every day, I can see him slipping. My heart is breaking in all kinds of ways.\n\nMy bride works crazy hours and makes about twice what I make. She feels awful that this is upon me, and we even tried bringing in a nurse for a day, but after they left, he begged me not to have them come back. He likes it here, just the two of us most of the time during the day. He moves between the window with a bird feeder, his recliner, and his books. When my teenage boys are home, they watch history documentaries together, and for a little while. And we do small things on the weekends.\n\nI don’t say anything to my wife—she’s losing her dad. I won’t let her see me struggle. I won’t let him see it, either. I’ll be here 100%, without a single complaint. But the truth is, I can feel it getting to me, and my kids can too.\n\nHow do I stay positive? How do I keep from drowning in this? I knew this would be hard, but I didn’t realize just how much. I’m in over my head, and that itself makes me feel selfish. UGH!",
    "subreddit": "TrueOffMyChest",
    "title": "I'm in over my head. How do I stay positive?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5u6k8/im_in_over_my_head_how_do_i_stay_positive/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 17:14:54 UTC",
    "id": "1j5tyun",
    "link_flair_text": null,
    "media": null,
    "num_comments": 34,
    "score": 0,
    "secure_media": null,
    "selftext": "The scammer called me through my phone and said he is a police in my city and read all my personal information like name, age,... he said I was involved in a money laundering scheme and I said I was not.\n\nHe then proceed to pronounce the name of the people that actually got involved in a money laundering scheme, they first asked me if I know this person, I said no and he told me that because of my personal data was leaked, they used my personal information to impersonated me and told me to cooperate with the scammer. they even gave me the online newspaper link and it was real, the actual legit online newspaper website about the actual money laudering scheme.\n\nThe scammer then told me to went on zoom and make a video call, He showed his police uniform, name badge, etc... and I am so foolish that I even believed it was real.\n\nThe scammer then became like a father figure, a friend, talking friendly, etc... the scammer made sure I trust him.\n\nHe then later told me that he will clean my profile on the police database. He also need proof for all my funds, no dirty money, he told me to transfer the money to a strange bank account.\n\nWhen the transfer is completed, another person was in the video chat room and said :\"the money is transfered to the goverment for checking\" \"yes sir\" the scammer said.\n\nThis is the part where the scammer is the biggest asshole in the world, he told me to transfer more, I didn't have enough money, he told me to sell the laptop then transfer the money to make proof that it's also not dirty money.\n\nAfter that I just told him to go fuck yourself and fuck off and give all my money back, but it was too late. I report to the police station after that.\n\nI wish I could kill him right now, punch him in the face, also sell all his organs to make some money.",
    "subreddit": "TrueOffMyChest",
    "title": "I lost $10000 to a scammer today due to my stupidity, and my naivety.",
    "upvote_ratio": 0.48,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5tyun/i_lost_10000_to_a_scammer_today_due_to_my/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 17:00:28 UTC",
    "id": "1j5tjlt",
    "link_flair_text": null,
    "media": null,
    "num_comments": 31,
    "score": 0,
    "secure_media": null,
    "selftext": "For some context, my boyfriend (23m) and I (24f) have been in a relationship. He was after me for 1 year, dated for 1 year, broke up, and have been dating for 6 months now.\nI have an autoimmune disease that is mostly affected by my mental health, and can create severe illnesses and damages to my body. Since I’ve been dating him I´ve been noticing my health getting worse and worse. To add more to the story, I found out he was attracted to his work-colleague and made some sort of move, check my other post to figure out some more about this (if interested, but it will add more to the story and will help you gain a better understanding). Plus, my boyfriend since the start of our relationship has told me how he’s a man who doesn’t watch corn, and has been flexing it to his guy friends and all.\n\nSo, my boyfriend has been recently saying non-stop how he’s open for me to check his phone, he has actually said it so much it was beginning to be suspicious. I had been noticing him becoming more irritated with me by the second without me doing nothing, and I asked him. I told him that I knew there was something he was hiding that was making him so anxious with me all the time, that's when I began suspecting, and he denied all of my comments, saying it was because he’s been so busy with work.\n\nAfter some days, he started saying it again, telling me that I could check his phone whenever I didn’t trust him. He was always used to me saying no, since I was keen on not doing so since I felt like doing that. There must be a lack of trust in a relationship and that’s how they fall apart. So, he didn’t expect me to say yes this time. I did due to all my suspicions at the moment. He watched me, and didn’t dare say a word. I gave him some time to be honest with me before looking through his phone and he reassured me there was nothing. I went to his recently watched in tiktok, and I found gems there. He watched these typical girls with boobs bigger than their heads move their butts and boobs sensually. Then, there were many replays of this girl we both knew he talked to before ever getting with me. He didn’t say anything and denied ever doing anything with her videos, only getting hard and then looking for other stuff to jerk off, which I think is a complete lie, but still.\n\nNot only did he break promises by telling and promising me that he didn’t watch corn or other girls, but also lied to me about it until I figured it out. He was never honest and I believe that he still is hiding things from me just because I didn’t figure them out yet. It was already bad that he did this, but worse when it was his ex situationship.\n\nI need some help and opinions to clear my mind, I don’t know if I’m crazy or being rational. I would appreciate other people’s experiences dealing with wrong people and then finding a good person for you. I need to believe that this is not the love I deserve and that there’s many guys out there that won’t do this to me.\n",
    "subreddit": "TrueOffMyChest",
    "title": "My boyfriend is watching his ex and has the urge to jerk off",
    "upvote_ratio": 0.25,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5tjlt/my_boyfriend_is_watching_his_ex_and_has_the_urge/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 16:54:21 UTC",
    "id": "1j5td4z",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "I swear they’re all the same it doesn’t matter how well you communicate with them these fuckers just ignore your calls and if they do get back to you at all you’re lucky if they even listened to your message at all.\n\nTrying to get a simple fucking medication and it’s somehow a month long endeavor taking hours and hours of my time talking to insurance and calling my doctor over and over trying to get them to send a form\n\nthe blood is about to boil out of my body and take the form of a demon to enact my wrath upon these people and the health insurance companies that make this shit as complicated as possible lol 👺👺👺",
    "subreddit": "TrueOffMyChest",
    "title": "Why are all doctors offices so fucking ass",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5td4z/why_are_all_doctors_offices_so_fucking_ass/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 16:41:19 UTC",
    "id": "1j5szkj",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "So iam (m) shifted another city for education. theirs a girl in my institute she started liking me then at an event an common friend of us introduce me to her and then me our  common friend (m) and the girl whom had a crush on me and her friend (f)we make a plan to go out we really had a great time then every week after classes we used to go outside in between this her friend rented a flat \nIn the same where I live then this girl became my so called best friend and the girl whom had crush on me since the beginning one day she confessed and we are in relationship everything was going amazing.\n\nSo we had the group of 4 people whenever we go mall or restaurant,cafe etc my best friend (f) always stated crying for literally no reason and as the time passes we all used to it it's not like a big deal for us\n\nOne day my best friend (f) call me and say hey please come to my flat i need your help to move some furniture and i was like ok iam coming i helped her then we are Just sitting and enjoying pizza but out of nowhere she kissed i pushed her and shouted on her wtf are you doing she says iam really sorry I think we had a movement and then I and i didn't tell my girlfriend about  this.  For more then a week me and my female friend didn't talk to each other but one day she said sorry I won't happen again promise and i was like ok fine one day we decided to go an club me my  2 friend's(m) and my female friend on that day my girlfriend was out of city.... We all are enjoying drinking and i was the only one who was so drunk then we leave the club as me and my female friend living in the same building we're going in the same cab and she told you're to drunk you can stay at my house I have no control on my self i was ok fine by me then we reached she told you can sleep on the bed I'll sleep on the sofa and i was like ok then she came to my bed and started seducing me she took of my clothes then she took of her own then I don't remember exactly we had sex or not but the worst part she recorded us then in morning I woke up and i was like wtf why am sleeping Naked with my female friend she told me everything what happen in the night and she told me not to share with my girlfriend i did she'll definitely broke up with and then we decided to not to discuss this with anybody AGAIN I DIDN'T TELL MY GIRLFRIEND \n\nOnce in a week my girlfriend used to go his hometown due to family reasons meanwhile I'll became alcohol addict I'll drink every day \nOne day I'm sick my girlfriend was not in the town my female friend came to make some food for me and she randomly started touching me and eventually I can't control my self and we makeout it's became an cycle wherever my girlfriend was not in the Town me and my female friend drink together and do sex but I didn't know one the she always record me more then 10 Times i did this.\n\nBut one day as usual my girlfriend called me at night i don't know why I that day I finally realise what the fuck i did on that day  i cried \nAll night and i don't have the guts to face the reality and told everything thing to my girlfriend i can't just want to run I keep this secret \n\nOne we me and my girlfriend was at my house I was in the kitchen making dinner for us and my female friend called me I told my girlfriend to pick up but I don't know who that random dude called form from my female friends phone and said \"who are you why are you sleeping with my her \" then my girlfriend started crying I told everything to her we both go to my female friends place that random dude was also present their that dude show my girlfriend all those videos that how's i know that my female friend was recording us from the first day that dude and my girlfriend was talking in the balcony and me and my female friend and just sitting in the living room.. then me and my girlfriend back to our house she was crying she told me not show your face and she broke up with me\n\nOne day someone knocked my door and it was my female friends she told me please \"listen I want to confess something she said do you know why I cry when we all are out because I hated to see you too together i love you I can't see you with someone i did so many things to make you guys broke up but I'll always that's why I chose the path i did intentionally tries to kiss you I am the one who offers you more more alcohol just to have sex with you you wanna know why I record us because I know one day you'll realise what are you doing and you will dumped me and as you dumped me I'll make this seen showed your girlfriend what are you doing with me and see iam sucessful i made you guys broke up listen she is gone but iam here for you I love you so much please accept me \" and said no I can't.\n\n\nIt's been 5 months since she broke up with me I know i deserved this,this was all only my fault but from the past 5 months i can't I just can't do anything i was living in regret and it's getting worse day by day.",
    "subreddit": "TrueOffMyChest",
    "title": "I ruined everything then I regret",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5szkj/i_ruined_everything_then_i_regret/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 16:39:01 UTC",
    "id": "1j5sx4t",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 1,
    "secure_media": null,
    "selftext": "Today is my birthday and it feels like the shittiest birthday of my life and felt like my life was meaningless and unable to feel any happiness. I'm trying to sleep and wake up in a dream full of pol Actually celebrating my existence.",
    "subreddit": "TrueOffMyChest",
    "title": "What’s the point of birthdays",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5sx4t/whats_the_point_of_birthdays/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 16:35:26 UTC",
    "id": "1j5sthk",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 4,
    "secure_media": null,
    "selftext": "I always lie, I can recognize that I'm a compulsive liar. I lie about small or big things. I always feel horrible after and I just want to become better person. How do I change?",
    "subreddit": "TrueOffMyChest",
    "title": "Why do I lie all the time?",
    "upvote_ratio": 0.84,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5sthk/why_do_i_lie_all_the_time/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 16:17:15 UTC",
    "id": "1j5saoz",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 1,
    "secure_media": null,
    "selftext": "I(MTF 19) and my girlfriend(F19) have been together for about 4 months now. I know it isn't a lot of time but I really felt something for her. She was the only person with who I could share my deepest secrets without judgement. She knew me, I didn't have to wear a mask around her and that made me comfortable. We lived 8 hours away from each other. We met every month or even more frequently. I helped her with her struggles at the beginning. She was freshly after a breakup with a guy she lived with, she was extremely emotional since they guy seemed not to have cared for her. He promised to visit her, but didn't and only like 2 months after their breakup he started relentlessly calling her. Nudging her to go to therapy etc. He even joined her friend groups discord server and that made her so emotional she quit the internet for a week and only talked to me through phone. I helped her through this period, i was always calling her and wanted to spend every minute of my time with her. First off it was good. We talked, we played games, we watched movies. She had her weird habits but i got used to them. Eventually we started arguing, a lot. I mean I really did all i could for her. She was my priority all of the time. I called off parties to want to spend time with her. I went on a 10 hour train ride just to see her and comfort her in a place she didn't really have a lot to do. But the thing is, she never really cared for me the way I did for her. I reserved time for us during new year's eve just so I could see her and she had a mood swing or something and called it off since she thought I was getting attached to quickly. We were to meet about 2 weeks ago but she called it off too since our conversations wasn't good. I am not going to lie, It was not a pleasant conversation but a honest one, nothing to get offended by. Just us talking about us in a slightly sadder tone. I get really emotional and jealous, like she was talking to her friend that he has to watch something and that she's willing to watch the entirety of it with him. I just thought, well, why doesn't she want to watch things with me? Why does she want to visit him, not me? I was her girlfried at the end of the day and that guy called everything she recommended \"crappy\". It's like I gave her all this attention and she didn't even care enough to visit me. This morning she wrote me an ominious message \"Would you still want to be around me if I had kissed someone else in the past month\", I replied that if she would give someone a kiss on a cheek or something, which is kind of normal in my part of the world, I'd be okay with it but if it was romantic, something that could be classified as cheating I would leave. She then said that it is going to happen and that she would have done it a long time ago if it hadn't been for that that she doesn't go out much and is pretty asocial. I mean that kind of broke me. I never had any meaningful relationship, I was always hiding a part of myself and when a person that accepted me came along they stab me in the back in such a heinous manner. I already got cheated on once. I know how it ends, there is no redemption, no coming back to what once was. I really loved her, gave her everything I could but that still wasn't enough.",
    "subreddit": "TrueOffMyChest",
    "title": "My girlfriend said she'd cheat on me and now I feel worthless",
    "upvote_ratio": 0.56,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5saoz/my_girlfriend_said_shed_cheat_on_me_and_now_i/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 15:58:30 UTC",
    "id": "1j5rrfg",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 7,
    "secure_media": null,
    "selftext": "I'm almost off of work and I just don't want to go home. It's so fucking overwhelmingly noisy there almost daily. I fucking hope that dump burns down one day. I'm so tired.",
    "subreddit": "TrueOffMyChest",
    "title": "I don't want to go home",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5rrfg/i_dont_want_to_go_home/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 15:52:12 UTC",
    "id": "1j5rl29",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 946,
    "score": 6419,
    "secure_media": null,
    "selftext": "My boyfriends of a year is only my 3rd sexual partner. When we met he told me he hated getting oral but loved giving it.\n\nWhen we first started having sex it was really good. I was worried he told me he was a porn addict previously but the sex was very focused on my pleasure and I was pleased.  I did try to give him oral but he would stop it after a couple of minutes and move on to me. During those attempts I could tell what he didn’t like and did so I stopped doing the things he didn’t enjoy when I would go down.\n\nAbout a month into sex he one day pulled my hair and started face fucking me. After he asked me if I liked having him control me when down there or if I preferred being in control. I told him I was really uncomfortable being held down there and I was really uncomfortable being face fucked. He claimed he liked me being in control.\n\nLast 2 months or so sex has completely shifted. He hasn’t gone down on me. I feel like a rag doll he uses. He grabs my legs and moves me where he wants me and grabs my head and pushes me into giving him oral often while holding me down there.\n\nThen last weekend happened.  I said I wanted to try anal but have been scared. We tried it once before but it hurt and I cried out and he stopped. It wasn’t off the table to try again.\n\nHe woke me in the middle of the night while I was asleep on my side by entering me from behind (on his side too). It felt good and he and I have an agreement to “wake up sex” when we spend the night together even middle of the night.\n\nA few minutes in he pulls out and aims at my ass. He pushed in a little I cried out and pulled away (no lube used and he has a big dick).  He put his hand over my mouth and grabbed my waist and pulled me hard back onto his cock. I started crying from the pain but he just held me there while he finished with his hand on my mouth. When he was done I told him it hurt and all he said was I never said no and rolled over and went to sleep. Then he woke me up again a few hours later and repeated the whole thing so I was super sore and have been since.\n\nI love him but I don’t love feeling like his sex toy.\n\nEdit:\n\nI’m sitting here crying. I felt used but never really thought about the fact I was violated. I grew up in an abusive household and sometimes boundaries and normal things don’t feel normal and abuse and bad things do.  I’ve been really emotionally numb to this all and I guess I needed a wake up call to see this isn’t okay behavior.",
    "subreddit": "TrueOffMyChest",
    "title": "I feel like my boyfriend’s sex doll",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5rl29/i_feel_like_my_boyfriends_sex_doll/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 15:50:58 UTC",
    "id": "1j5rjt3",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "I think I may be being emotionally abused by my partner and I’m not sure…on top of that they make false promises, are hypocritical, all of a sudden want to try polyamory and they’re honestly just kind of mean to me all the time unless I’m doing exactly what they say. You’re probably wondering why I’m still with them. I don’t really know, I’m starting to hate them and I’m starting to feel deep resentment towards them. I honestly thought we were going to get married and have kids and idk why I thought that when they have fought me at every step. I’ve realized I wouldn’t want to have kids with them as I wouldn’t want them exposed to my partners bouts of explosive anger. I wouldn’t want them thinking the way I’m treated is acceptable and I wouldn’t want them thinking that not wanting to be a better person is okay. \nI say all that but I am deeply in love with them, I don’t really know what to do because leaving is hard for me and for them but I can tell at this point that’s what’s needed. They are very clear with their actions in showing me they don’t care for me the way I care for them and my self esteem is shot to hell. Sometimes I envy they’re ability to treat me poorly and still feel like they’re a good person, but then I remember there’s a reason every person they’ve ever been with has left, and I need to follow suit because everyday I fall deeper into the cycle of nonsense and bullshit. \nI love them deeply, like I’ve never loved before but maybe that’s bc we’re addicted to each other’s toxicity.\nI want to be with someone who shows me through action they want me and love me and all they’re capable of is pretty words, they lie over and over and promise things they can’t give..\nI want to leave I promise I know I need to for my mental health and for theirs, I just don’t know how…I just wanted to get it off my chest. I’m having a really hard time coming to terms with this relationship failing for some reason and I’d honestly do anything to go back in time and figure out how to make it work but I can’t so this is just how it has to be ig.",
    "subreddit": "TrueOffMyChest",
    "title": "I’m trying to fall out of love with my partner",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5rjt3/im_trying_to_fall_out_of_love_with_my_partner/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 15:39:39 UTC",
    "id": "1j5r88o",
    "link_flair_text": null,
    "media": null,
    "num_comments": 21,
    "score": 294,
    "secure_media": null,
    "selftext": "Last night I went out to do some Instacart deliveries. My wife really wanted me to take her phone and do one on her account as well, so I had both of our phones. After making one delivery on her account and one delivery on my account, I was heading home and was a little munchy. My wife had no way to contact me (unless she borrowed another family member's phone), and no way to trace my location, so I gave in. \n\nI knew Whataburger was open 24 hours a day, and they even keep their lobby open, not just the drivethru. Against my wife's firm directive, I ordered Whataburger online, then went into the building and ATE it. And to top it all off, I didn't even confess to her upon my arrival at home, nor did she detect the distinct burgery smell. That's right, this is now the second day and she still doesn't know of my treachery. In our relationship, this is unheard of. Unprecedented even. ",
    "subreddit": "TrueOffMyChest",
    "title": "Unauthorized Whataburger visit late in the evening",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5r88o/unauthorized_whataburger_visit_late_in_the_evening/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 15:24:05 UTC",
    "id": "1j5qsiz",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "Back in 2019 I had an appointment at a Jewish school in Amsterdam. I was told to look for a schoolbuilding with a large fence around it and camera security. Once I arrived at the location I saw a building that fitted the description. I couldn't find something that seemed like an entrance, but I noticed a gate and door that were open because someone was talking out the trash and walked in trough there. I had taken notice that inside the compound there were two luxury cars parked, one with Russian licence plates and one with diplomatic plates. \n\nOnce inside it took me a while to find a person but after searching a bit I found a man who didn't speak dutch and was looking at me with confusion. I explained I had an appointment at the school and he simply pointed out to me that the Jewish school was the building next door and directed me out of the building.  \n\nAt the school they couldn't tell me what was in that building, there was noting indicated there on google maps. And for years I have wondered about what it was because it had a vibe as if I had just stumbled into a secret Russian base that I wasn't supposed to find. \n\nI was reminded of this incident earlier today and finally decided to do some research into the building located at the Veluwelaan in Amsterdam. And as it turns out; the building was indeed closed a couple of years ago because it was a base for the Russian secret service... Holy cow, I literally walked into a Russian spy base 5 years ago. And more importantly; I got to walk out of a Russian spy base alive! ",
    "subreddit": "TrueOffMyChest",
    "title": "I accidentally walked into a secret Russian spy base",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5qsiz/i_accidentally_walked_into_a_secret_russian_spy/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 15:03:46 UTC",
    "id": "1j5q831",
    "link_flair_text": null,
    "media": null,
    "num_comments": 10,
    "score": 19,
    "secure_media": null,
    "selftext": "I (17M) am a Filipino, and have been living in Canada for about 6 months now. Just last month did I finally land a job at the deli in a supermarket after months of seemingly endless jobhunting. \n\nHowever, my manager at the deli is... lets just say, a not very nice person. Shes very condescending, and pretty much just has something against the students that work in the deli (me included).\n\nHer very obvious and not well hidden hatred towards the students finally came to a full fruition when she scheduled ALL the students for the rest of the month just less than 10 hour shifts a week. In fact, one of us was even getting just 4 HOURS in a week.\n\nIts not like we were being greedy or anything. All of us need the money. One of us needs it to buy insurance for his new car, and another one of us needs it to buy a new car. I need it to pay the internet bills in my house, help my parents with their payments, and maybe soon buy a PC for myself.\n\nWhen I saw my schedule for the rest of the month, as expected, I was pissed. I mean, seriously? We haven't really been slacking off either, all of us even do our jobs arguably well.\n\nWhen we went to ask our manager about it (she was supposed to STILL be at work) another one of the employees at the deli said she already TOOK OFF.\n\nOf course, we are planning to ask her about the schedules tomorrow.\n\nBut when I told my parents about it, they were not happy.\n\nThey thought I was asking for too much.\n\nOf course, I was once again pissed. For someone who works as a STUDENT and earning MINIMUM WAGE helping his OWN PARENTS PAY THEIR BILLS, I think I should atleast have SOME right to extend my hours, no? But no, of course not. When I told them it should be MY RIGHT to ask my manager for those few extra hours, they then went to comparing me to protesters.\n\nNo joke, heres how the conversation went:\n\nDad: \"What if the next time I start seeing you on the streets holding a placard? What if you end up like those pink protesters back home?\" (Referring to what happened back in the Philippine presidential elections)\"\n\nMe: \"I don't think it will go THAT far. Besides, even if it does, I think protesting about our hours should also be a part of our rights, no?\" \n\nMom: \"What are you thinking? The way you're thinking now, you're gonna end up a member of the NPA!\" (A Philippine communist terrorist organization)\n\nNow, this made me even more pissed. But to my parent's credit, they DID try to diffuse the situation.\n\nHow did they do that? Why, by insulting the way I do my chores at home, of course.\n\nThey said I needed to \"Prove myself at home\" first. \"Do the chores well first\". Like huh? I already do my job/s to the best of my ability as far as I know, I don't really know what else I need to prove at home. I mean, I guess fair enough??? I suppose theres still a few things to work on I guess??\n\nJust so yall know, I DID consider telling them that my manager was a not-so-nice person. But considering they already called me a communist for wanting more hours, I don't even wanna KNOW what they would wanna call me if I complained about my manager. \"Just do your job and bow down to your bosses\", thats their motto, after all. (Not even joking).\n\nHonestly, my brainrotted side thinks this is pretty funny, but it kinda made me feel bad at the time. My parents would literally rather compare their own child to a bunch of terrorists rather than siding with them! Amazing!\n\nTLDR: Manager is an asshole, gave me bad hours, and when I told my parents I was gonna ask for more hours, they compared me to communist terrorists\n",
    "subreddit": "TrueOffMyChest",
    "title": "Parents called me a communist for wanting more hours on my job",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5q831/parents_called_me_a_communist_for_wanting_more/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 14:58:31 UTC",
    "id": "1j5q2fl",
    "link_flair_text": null,
    "media": null,
    "num_comments": 168,
    "score": 1475,
    "secure_media": null,
    "selftext": "Things have been rough at home. Im '30M', wife is '27F'. Fighting virtually every day. I take my lumps for escalating in certain situations, but I feel it's primarily my wife that breaks the peace and gets upset and acts over the top angry. Then I'm angry at her for how she acted in her anger, then she's angry at me for being upset by it all.  It's a vicious cycle. Anyways, her dad offered to pay for us to go to therapy. Therapist was a 70 year old guy that's been doing it for 50 years. Seems very wise. Is all about accountability. Doesn't want to hear what the other person did to you, he only wants to know how you contributed to the situation. \n\nMy wife has missed the last two sessions. Which hurt me alot, as things have been so bad I've been desperately wanting the help to break the cycle. The first time she was angry and didn't want to come. The second time she said she forgot the appointment. \n\nI vented out alot of our problems when I was alone this last session, and was grilled for my part of it. I talked about things I've done, she's done, and things that are affecting the children. He said we will plan to get her side of things when we come back together.\n\nWe both showed up yesterday, and he wanted her side of the issues I talked about. Every time she went to talk about something, she prefaced it by saying \"I only did this because he did this first\" etc... even an issue i had with how mean she was to our daughter recently. Our daughter is 6. But the story still started out with \"well she yelled at my sister, so I did this.\" He became irritated and impatient with her. Told her that he wouldn't keep trying to beat the issues out of her and that she needs to stop blaming other people and just admit to what she did. She stammered and couldn't talk without trying to shift some guilt first. It went back and forth between them for a minute, with me sitting silently to the side. She couldn't get any kind of admission out without having someone else to blame first. Eventually she started reading out some horrible texts she had sent me out loud on her phone. It was painful to hear her read it off so robotically, but to me it seemed like a step in the right direction because the things she said were awful and she was technically admitting to it by reading it out loud. She got towards the end, but threw in one more \"then he did this, so I did this.\"\n\nHe said \"Both of you need to get out. This sessions is over.\" As soon as she finished reading. We both left silently. As I went to leave the building, I had the urge to go back. I knocked on his door and asked for a few more seconds of his time, which he obliged. I asked why he ended it at that point, because in my mind she seemed to be cooperating. He said that it's a combination of things. Firstly, her not showing up to appointments. He helps us outside of his normal office hours as a favor to her dad, who he knows from a rehab program. Her not showing up is disrespectful at best. Secondly, it was the combination of the horrible things she said via text, the robotic way she read them, and her inability to take accountability. I said I understood and thanked him for his time. \n\nI don't know where to go from here. Things have been so awful. She's been fighting with me and other people nonstop over the smallest things. After that appointment, she has flipped a switch that's been engaged for weeks now and is acting as sweet as possible. I feel like it's a love bombing facade. I don't know what advice I'm really looking for. I'm just sad and afraid I know what I have to do. Anyone have any advice towards something like this?\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "Wife and I got kicked out of a therapy session",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5q2fl/wife_and_i_got_kicked_out_of_a_therapy_session/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 14:49:34 UTC",
    "id": "1j5ptf4",
    "link_flair_text": null,
    "media": null,
    "num_comments": 36,
    "score": 0,
    "secure_media": null,
    "selftext": "I 18F have been an Opus Dei Catholic for all my life, properly devout, receive Holy Communion on the tongue, read the bible every day, pray the rosary 3 times a day, wear my veil to church, grew up in youth group. You name it, I did it.\n\nI have always told myself I would wait until marriage and never do anything with a man unless we had been married. I am in my senior year of highschool and I am very close with my male friend (also 18) who I study with at his house after school most days. He somehow convinced me to suck him off. This has happened twice now and I feel so incredibly guilty.\n\nI am going to go to hell. I am going to church tomorrow night to repent and I'm not sure when I can go to confession next but I will talk to Father at Mass. I am supposed to be reading the Responsorial Psalm at mass tomorrow too and I feel unworthy to enter under God's roof after knowingly sinning. It was a grave sin and I did it twice, I haven't been able to bring myself to take off my purity ring but I don't feel like I deserve to wear it.\n\nAnyway I am stressing now and do not know what to do !!\n\nSIDE NOTE:  \nI forgot to mention I am also so scared because he took a video without telling me until afterwards and my town is pretty small and I was in my uniform so if it gets out it will spread like wildfire and everyone will hate me !! so thats great ",
    "subreddit": "TrueOffMyChest",
    "title": "I betrayed God for my male friend and I feel terrible",
    "upvote_ratio": 0.31,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5ptf4/i_betrayed_god_for_my_male_friend_and_i_feel/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 14:15:54 UTC",
    "id": "1j5ox11",
    "link_flair_text": null,
    "media": null,
    "num_comments": 9,
    "score": 3,
    "secure_media": null,
    "selftext": "Back story I’m (F28) and my (M30) wants to be married. We were on and off from the years I was 19-20 and when I turned 21 we got together offically and I was convinced by him and his mom to move in since I was living alone and my parents are retired in a different country. \n\nFrom the years 19-22 he was just not nice very rude and he would always choose his friends over me and his friends were always females. In the early stages his friends or family will tell him to leave me and he would do it and then be adamant on staying friends when I would say no. He also kept crying to me about his ex and how much she hurt him and he hid the fact he would talk to her mom like once a week. When I found out he stood his ground and said no to cutting her off. He only agreed to cut her off because I was pregnant with his child. \n\nWhen I turned 23 during Covid we fell pregnant although I took Plan B I didn’t realize I was ovulating so it didn’t work. We kept our son but he was just so rude during my pregnancy he took it upon himself to be there for a female friend all because she was dating a guy and needed “help” and instead of her going to her female friends my bf was always available. He went as far as to stay out all night and get drunk with her and their other friends and the guy she was dating when I didn’t want him to and when he returned home he cursed me and his mother out because I held him back in life. I also had told him for years how important marriage was to me and he was just so whatever about it. I told him while I was pregnant just ask with a ring pop since we didn’t have too much money and I wanted to be married before having a kid and he came home a few days later and as I was lying on the couch he threw the ring pop and said “ you going to say yes right “ I said no because he made it seem like a chore or obligation rather than him wanting to. He also spend all my pregnancy mad at me because I didn’t want to name our son after him. When I’ve told him since I was 19 and even before when we were sort of friends at 16 that I do not want to name my son after their father name. \n\nFast forward our son is born and he is currently 4 and throughout these 4 years he keeps wanting to be married and I told him unless he has a career were he can  care of the home expenses what is the point. Since our son been born I’ve made almost all the money paid our rent our bills he’s has jobs here and there.  He just made one year at his current job and he does pay his part but even before our son and now I’m also paying like 60/70% and he pays the rest and theirs been times I’ve paid 100%. I told him if he becomes a police officer id feel okay and comfortable marrying him since it’s a good paying job and he can support us and he wants to and he’s doing it for him and for us to be married. But I also feel so indifferent like I don’t see the excitement in calling him my husband since we skipped over the step. Sometimes I feel like it’s my fault and I should of ignored that he threw a ring pop at me and other times I feel like if I would of accepted it I would be open to constant disrespect from him in the future. \n\nHim as a father: super good and kind he takes our son to school and picks him up he lets me sleep in and sleep whenever. He tries to pay for dates when we are out our son and him have a strong bond. He gets me flowers offers to cook even it it doesn’t taste the greatest. Overall him as a dad and a partner is nice I do feel spoiled. But because I can’t let go of how he treated me I’m always going to have this fever he’s going to revert back. ",
    "subreddit": "TrueOffMyChest",
    "title": "Boyfriend wants to get married and I’m indifferent towards it",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5ox11/boyfriend_wants_to_get_married_and_im_indifferent/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 14:15:36 UTC",
    "id": "1j5owrb",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 6,
    "secure_media": null,
    "selftext": "title. i'm extremely introverted and my social battery runs out very quickly, but that being said, i'm definitely not antisocial. i have three close friends that i love dearly and i don't usually struggle with making new connections. however, i always make up excuses to not let people come over (especially when it's a one on one hangout) because i feel like at some point i'm just too tired to hang out in contrary to them and i just have to wait for them to decide to leave. it makes me feel horrible to essentially kick my friends out so i don't do it, but after a couple hours i'm pretty much done socialising and switch to survival mode. when it's me who comes over to other people, i can just leave at any given moment when i feel uncomfortable.\n\ndoes anyone else struggle with this? i just treasure the tiny piece of space that i have too much to let people into it even if they're my friends, but never allowing people to come over probably makes me seem like a weirdo. if i were to tell my friends why i always insist on visiting them instead of vice versa, they'd probably get offended that i get tired of their company at all. ",
    "subreddit": "TrueOffMyChest",
    "title": "i can't stand people coming over to my place but i don't mind visiting them at theirs",
    "upvote_ratio": 0.88,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5owrb/i_cant_stand_people_coming_over_to_my_place_but_i/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 14:07:47 UTC",
    "id": "1j5oph1",
    "link_flair_text": null,
    "media": null,
    "num_comments": 106,
    "score": 446,
    "secure_media": null,
    "selftext": "I've been dating this guy for the last four months, and he is genuinely one of the kindest, most wholesome people I’ve ever met. If \"wholesome\" was a person, it would be him. He’s loved and respected at his job and church, and I admire him so much.\n\nLast night, though, something happened that I can’t stop thinking about, and I just need to get this off my chest. We were intimate, and he was a little rougher than usual not in a bad way at all. It was different, but I liked it. Then, completely out of the blue, he leaned in and whispered in my ear, calling me his *little SL-word.*  \n\nI was so caught off guard. I’ve never been called that word before in my life, and I always assumed I’d be offended or upset if I ever was. But instead… I liked it. A lot. So much so that I instantly came. And now I’m just sitting here, confused about why that word, something that should have made me uncomfortable, had the complete opposite effect. It felt wrong, but at the same time, it felt good, and I don’t know what to make of it.  \n\nI guess I just needed to put this into words and get it off my chest it’s just unlike me to like such a word like that. ",
    "subreddit": "TrueOffMyChest",
    "title": "I (F24) thought this word was degrading but why did it turn me on?",
    "upvote_ratio": 0.87,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5oph1/i_f24_thought_this_word_was_degrading_but_why_did/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 14:05:12 UTC",
    "id": "1j5on2i",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 5,
    "score": 5,
    "secure_media": null,
    "selftext": "I don’t know why I’m posting this. Maybe I just want someone to know. Maybe I want to feel like my existence mattered to someone, even if just for a moment. Even if by strangers.\n\nI’ve had a specific date in April marked as my death day. I’ve tried to get help. I reached out for therapy at multiple locations. I’ve contacted help lines and end up feeling like a waste of space on the line. I contacted a couple more places and even I told them they were my last chance. But every single place has waiting lists. No matter how much I say, “I don’t have time to wait,” they just tell me to hold on. I don’t think I can.\n\nI’m drowning, and I can’t breathe. This feels like it.\n\nI don’t know if I actually want to be saved or if I just want people to understand that I fought. That I tried. That I didn’t just give up for no reason.\n\nI feel invisible. Even when I’m here, I don’t feel here. It’s like I’m just moving through the motions, waiting for the date to come.\n\nMy whole conscious life has been abuse. I can’t get everything out of my head. I’m an adult now, I have to move on but I can’t. I’m stuck and I can’t get help. Real help! The last therapist I had was in my late teens and she said one day I would just go and kill myself. I wish I could tell her how right she is! I tried to prove her wrong and failed!\n\nI don’t know what I want from this post. Maybe just to feel like someone sees me before I disappear. Maybe to feel like I wasn’t completely alone in this. April is coming so fast and I tried but I can’t anymore.",
    "subreddit": "TrueOffMyChest",
    "title": "I Don’t Know If I’ll Make It Past April",
    "upvote_ratio": 0.85,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5on2i/i_dont_know_if_ill_make_it_past_april/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 13:50:08 UTC",
    "id": "1j5o8uu",
    "link_flair_text": null,
    "media": null,
    "num_comments": 16,
    "score": 0,
    "secure_media": null,
    "selftext": "It's almost been a year, and I made a mistake.In June I broke up with my girlfriend of almost four years because we were going away for college and we were both going out of state on opposite  sides of the country. I thought it would be the best thing for us, but it's been the opposite.\n\nI really hurt her when we broke up. The first few days I thought this was going to be the best thing for me, and I just tried to push her out of my mind as much as I could, but I just kept feeling like an asshole. She loved me so much, and I took it for granted. She would do things for me all the time just because and never expect anything in return. She would constantly put me ahead of her and also just loved me no matter what I was going through.\n\nI couldn't stop thinking about her, and during my first week of college, I was so excited about what was going on in my life, and I wanted nothing more than to just text her and let her know what was going on.\n\nIt bothered me that in the almost 3 months we had been broken up at that point, she never once reached out to me. I wanted to know how college was going for her; I wanted to know how she was doing. How could the girl who I once had this amazing love with not try to reach out to me once? I texted her, letting her know that I had been thinking about her and that I hoped she was doing well. She kept things super brief and said she hoped I was doing well, but I wanted to talk to her so much more, so I poked about what she had been doing, and in two months she had done so much, and she was going to this great huge school and was doing all of this without me.\n\nI know I should've been happy for her, but it just made me sad and angry. We didn't talk for a month after that until she sent me a picture of a tattoo she had gotten. I was so excited that she finally reached out to me. This was the first time since we had broken up that she initiated the conversation.\n\nWe talked for a little bit, and it felt so great. We fell back into conversation like back when we were dating. It felt so good to talk to her again, but at the same time, it made me feel sick that I knew so little about what was going on in her life now, and I was only hearing so little about it. I sent her a text telling her how happy I was for her and how what she's doing seems like such a great experience for her, and she never responded. That hurt a lot.\n\nI looked at her TikTok and Instagram for the first time in months, and I just wanted to throw up. She is living this whole life without me. She looks happy and, most of all, beautiful. Like, how dare she be so beautiful and smile at people with smiles that were once mine?  I would go to her Spotify, and I would be so paranoid that one of those playlists was dedicated to someone that wasn't me.\n\nI felt so selfish and angry and mad at the world and at myself. I had to push her out of my mind, so I started seeing someone. I wasn't even really interested in them. Looks-wise, they were nothing compared to my ex-girlfriend. Their personality was so dull and boring compared to my ex, and in the end, I ended up just feeling like this huge dick for stringing someone along for months just to get over my ex-girlfriend.\n\nI went home for my Christmas break from my college, and it got even worse. Knowing that we were in the same town and just a drive away from each other's houses made me feel insane. I got so nervous that I was going to run into her any time I left the house. I thought about going Christmas shopping in the mall she worked at so I could \"accidentally run into her\" and then would just get sad because I was becoming this huge creep. I wanted to text her every day asking if she wanted to get coffee, and I never did because nothing would hurt more than knowing she didn't want to see me. I texted her Merry Christmas, and she was nice about it, but she didn't want to talk to me anymore after that.\n\nAnd then I saw she went back to her college before me, and it was painful seeing her with all her friends having so much fun and having so much fun without me. Seeing her cozied up with a girl on her Instagram makes me feel like I'm going to throw up. I see them post together all the time, and I just want to know if they're dating. How could she date someone so soon after 3, almost 4 years? How could she be so brazen and post her and that girl getting coffee and going on dates together? Does she not think I'll see it? I think I would feel worse if it was a man. The thought of some man looking at her the way I used to and touching her and being intimate with her makes me angry and sad and violent all at the same time.\n\nI would stalk her pages all day while I was still in our hometown, waiting for her to post something and getting nervous when she would. How could she be having so much fun and be so happy all without me?  We were each other's first love, first kiss, first everything. And now I don't know if she's doing that with other people.\n\nThings got a little bit better when I went back for my second semester of college, but I still just can't get her out of my mind. I'm starting to see another girl now to try and get over my ex, and she's, again, nothing like my ex-girlfriend, and I don't think there will ever be anyone like her.When I first broke up with her, I didn't think it would hurt this much. I guess in the back of my mind I thought she would've fought for us. I thought she would've texted me more when we were broken up; I thought she and I honestly would've gotten back together at this point. I'm so insanely in love with her still, and I brought this on myself, but I thought I was doing what's best for the both of us. I guess I didn't appreciate or realize the things that she did for me while we were together.",
    "subreddit": "TrueOffMyChest",
    "title": "I broke up with my girlfriend of almost four years and I regret it",
    "upvote_ratio": 0.41,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5o8uu/i_broke_up_with_my_girlfriend_of_almost_four/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 13:46:44 UTC",
    "id": "1j5o5qn",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 4,
    "secure_media": null,
    "selftext": "A year ago I was stressed and scared that being a software engineer would ruin my plans to try and be creative.. I was dead set on it, but I watched the creative industry crumble and I see how corporatized it really is.. it makes sense why people go indie.\n\nSo I shifted focus because of the news and I’m just questioning what I want to do and how. Now I just don’t care or stress about being creative.. I don’t mind doing it on my downtime even if I suck at it. Ever since I traveled across the country, I feel myself wanting to find a new place to live.. a place that vibes with me (especially outside the US).\n\nBut I’ll likely need to advance my education, become a genius to be considered a hire for an overseas business. I’m just not fit with my associates degree. So, I feel stuck. I may bite the bullet and get a software engineering degree, but only so I can live somewhere cool and feel at home..\n\nEdit: I moved from one interest to another and I’m feeling overwhelmed because of the news and I just want to find what’s right for me, but it will take a lot of work.",
    "subreddit": "TrueOffMyChest",
    "title": "Is it ok to be confused and overwhelmed when figuring out what you want?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5o5qn/is_it_ok_to_be_confused_and_overwhelmed_when/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 13:44:50 UTC",
    "id": "1j5o3ze",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "I hate that I do this, I am so delusional and believe that everyone I meet ends up interested which ruins a lot of relationships and changes my behaviour. I try hard to stay grounded and remind myself you are only a 5 and that’s pushing it. People don’t line up for you. But I am so delusional that I actually believe I have 4 people chasing me at the moment. \n\n",
    "subreddit": "TrueOffMyChest",
    "title": "I believe everyone falls in love with me after meeting me.",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5o3ze/i_believe_everyone_falls_in_love_with_me_after/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 12:55:47 UTC",
    "id": "1j5mwpv",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 1,
    "secure_media": null,
    "selftext": "I’m frustrated with how ASD dominates the majority of neurodivergent discourse. I get it. I really do. ASD is very misunderstood and it very often coexists with other ND types. \n\nBuuuuuut… it feels like everyone only talks about or thinks about ASD. Heck, even terminology seems ASD specific.\n\nSometimes I just want to find something about ADHD, and I get told it’s an ASD symptom that can be present in others. Erm, no. It’s an ADHD struggle too, based on self reports from those with a diagnosis. \n\nWhy are most ND struggles seen through the lens of ASD so much?\n\nI’m struggling to verbalise my thoughts and I’m hoping someone gets what I’m saying.\n\nWe need space for just ADHD, just dyslexia, just OCD. Co-morbidities are co-morbidities. Not the core of disorders.\n\nI’m sick of being told that something I deal with is “ actually an autism thing,” and I just happen to experience that just by chance. No. I’m not autistic. My struggles are not autistic traits. They are ADHD traits. We’d know that if we stopped calling every trait in an ND person an autistic trait.\n\nI’m sick of my symptoms being seen as an afterthought -  a fringe case of ASD symptoms.\n\nAcknowledge my disorder for what it is. I’m tired of being an “oh, by the way” addition haphazardly tacked onto an ASD discussion.\n\nYes, it is ok to acknowledge that some things are ASD specific that I happen to do by chance. No, not every ND trait is autism specific. My sensory issues are not ASD traits, they are ADHD traits. Stop telling me “it’s okay to acknowledge that some things are ASD traits that others experience.” What are you implying? \n\nAnd I’m definitely not arguing “everyone is a little ASD.” That’s stupid, and if you manage to get that out of my rant, I can’t help you.\n\nI’m saying, validate my struggles as they are. Not because they overlap with ASD.\n\nWhat’s funny is my friend who says this doesn’t pick up on the fact that it hurts me when they say these things. ",
    "subreddit": "TrueOffMyChest",
    "title": "Potentially ableist rant about ASD and Neurodivergence",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5mwpv/potentially_ableist_rant_about_asd_and/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 02:19:50 UTC",
    "id": "1j5cw2b",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "Some things that has caused me to think this. He used to touch my butt when I was younger and my upper thighs. When I told him to stop all he did was laugh at me and tell me I was sensitive.\n\nA couple weeks ago he touched one of my friend’s feet. My friend, about 5 of us, were sitting on top of a table during a competition. That’s when my dad came over and touched one of my friend’s feet. My friend didn’t really seem to notice, he doesn’t know my dad very well but since he used to touch my butt I got a little freaked out.\n\nThis next thing might just be a weird thing but I found a letter in my dad’s car. It was written by a young girl and she described her family. My dad teaches high school so why would he have a random letter from a young girl? When I asked him about it he got really mad/nervous and looked in the trash for it.\n\nI’m not completely sure honestly, if he is a pedophile. But every time I’m around him I get this awful feeling. ",
    "subreddit": "TrueOffMyChest",
    "title": "I think my dad is a pedophile.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5cw2b/i_think_my_dad_is_a_pedophile/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 12:50:40 UTC",
    "id": "1j5mrzi",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 0,
    "secure_media": null,
    "selftext": "I was supposed to return a shein order by 1PM today but I missed the deadline and now I am left with clothes that can’t fit me and a $500 bill in my credit card. $500 is a lot for me and now I am so stressed over the rest of the month(a). ",
    "subreddit": "TrueOffMyChest",
    "title": "My forgetfulness costed me $500",
    "upvote_ratio": 0.25,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5mrzi/my_forgetfulness_costed_me_500/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 02:49:07 UTC",
    "id": "1j5dg6w",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "Sorry about the calous title I need to get the worst out of me. My friend is a wonderful person. He's so funny and kind and smart.  His laugh could light up a room with minimal effort. That is, when he's not in a depressive episode. He grew up in an extremely abusive home and has since been diagnosed with eating disorders, anxiety and severe depression and bpd. Ive been friends with him around 2 years ago and holy fish paste has it been a ride. I dont even know how we got to this point in the friendship but he just vents to me. No warning no nothing. I'll ask him where he is after ditching classes for weeks on end and he'll go \"oh im at home\"___\" im kind of losing it right now. I'm smashing my head on the wall\". Or something like that and it makes my stomach turn. Because I know he's gonna tell me some gut wrenching reason as to why he's not there and its like. So draining. He has so many problems that could be simply fixed by putting in effort and making active choices to better his situation but he refuses to. I twll him he needs to move in with family that offered to house him? He stalls until the offer is no longer available. I tell him his teachers aren't praying on his downfall, that he's just a serial truant? He continues skipping class and let's his grade slip. I tell him his equally mentally ill boyfriend is making his mental worse with endless lies and manipulation? He'll skip classes and then post with his boyfriend later on. Its just like. Im so tired of being scared to check his messages because im gonna have to talk him off of the ledge for the third time this week. Im scared to answer unknown numbers because he has me down as his emergency contact if he ever gets put in the ward again. I'm scared to talk to him about the things he does that genuinely pisses me off because I think he'll kill himself. I'm so scared that he's just consistently on the verge of ending it all that I never go against him. Even on the little things because if he ends it and that note comes out noting things I did wrong I won't be able to live with myself. So I dont do anything. I just let him vent despite it making me feel so hopeless. I let him do shit that pisses me off because im scared. Im a huge fucking pussy and a horrible friend and my worst fear is that he'll do it anyway and I'll have to apologize to everyone he loved because I didn't do enough. And before you try to tell me to tell him to get help he already has a therapist and is medicated so there's not much else I can do except be there even if I don't want to even if I don't want to babysit him and then shit my pants when he takes too long to respond to a text.. And I never ever vent to him about anything because im scared ill be the straw to break the camels back. I dont really need any help because I wouldn't kms but Jesus christ I feel crazy and dirty and so evil. I shouldn't hate him for things he can't control but a part of me,that grows every time he impromptu texts me asking if I hate him, beleives that he's in full control, he's just comfortable being where he is. \n\nSorry for the run on sentences and bad grammar and general doodoowater backgrounds and explanations Im just typing my thoughts at this point I don't know.",
    "subreddit": "TrueOffMyChest",
    "title": "My friend is suicidal and I think im starting to hate them because of it.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5dg6w/my_friend_is_suicidal_and_i_think_im_starting_to/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 12:47:35 UTC",
    "id": "1j5mosy",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 2,
    "score": 0,
    "secure_media": null,
    "selftext": "Ok, I know the tag is bad but let me clear stuff up right off the bat.\nI didn't try to kill myself, nobody in my family did, and nobody in this story succeeds in doing so. With that said, it's still disturbing.\n\nI go to a high school that is located right next to a PreK-8 school. My mom works there and teaches PreK4, while my brother attends as a 7th grader. Yesterday, my mom and brother told me of something that happened. Basically, a kid in my brother's grade tried to kill himself in the bathroom using his belt (part of the uniform) and was at it for several minutes before a friend of the kid went looking for him. To make a long story short, it was a whole 2 hours afterward that the police were called and something was done about it.\n\nNow this alone is devastating and disturbed my mom, but what made me call my post this was this detail of the story.\n\nThe kid tried this around 11 am. The administration was only made aware at 1 pm. The kids knew this and said nothing. Now you may think that it's because he's a bully or disliked, but he was a smart kid who played football at his school and was generally well-liked. The chilling part was that most kids were just indifferent to the whole thing. They felt bad, but nobody was particularly emotional. My brother said that everybody was silent but only a few who he knew feared death. The kid who went to check on the victim got texts from the victim with suicidal thoughts, and he said nothing at first. And that's why I named this post what I did.\n\nMy mom is one of those people who believes that suicide is cowardly and that there are always options for those who feel that way, but hearing how a group of kids witnessed one of their try that and then everyone not go talk to grown-ups was shocking for her. Even worse, since they have, the school has not made anything public yet about this incident and probably is just going to sweep it under the rug.\nNow I might have exaggerated the title a bit, my mom is a very resilient woman. But I fear that the way this story played out will affect her for a long time.\n\nAlso normally I would talk to friends and people in school about this, but the victim's older sister attends and probably doesn't want anybody to know, so I ranted here.",
    "subreddit": "TrueOffMyChest",
    "title": "My mom might never be the same",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5mosy/my_mom_might_never_be_the_same/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 12:45:06 UTC",
    "id": "1j5mn26",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "Life starts today…as I drink my coffee and ponder upon the tasks ahead, at 4:22 in the morning. I think to myself, this, that and the other. The heater hum puts my mind at still. “Wouldn’t it be great if I did an alternative activity, took an alternative route today” — a fleeting thought that the logic in me disposes of. “No I have goals, I have purpose, I am dedicated to being one of the bests in my field,” why? “Because I was given a certain ‘earth placed perfectly equidistant from the sun to form life’ opportunity; my upbringing, my born skill, my interest, and my personality all align with this one thing in life that I can be the best at. \n\nWhile the journey cumbersome, and less than financially rewarding, comparatively, to the work— it is me, it is what I have, and it is my calling. Through the whole journey of my success I can share knowledge of my experience. In doing so, those in the present can take advantage and those that come after can pick up where I left off. To become even better, learn more, and make their own pathways into unchartered territory in the field. \n\nLove is nice. It’s necessary. Friendships even more so. They will come as you pursue your purpose. For some, love and friendships are their life’s work, and those people become Psycologist’s. For others they are a human bond necessary to achieve balance. My life’s work is bodybuilding and I vow to become the greatest who still maintains his shape, and give the world new discoveries in kinesiology, will-power, and grit/determination. ",
    "subreddit": "TrueOffMyChest",
    "title": "Life starts today",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5mn26/life_starts_today/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 12:33:30 UTC",
    "id": "1j5mfrg",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 0,
    "secure_media": null,
    "selftext": "I was involved with a married female for about 10 years. I was abut 25 in a new city and needed some support. I was staying at my relatives house and she was my sister in law. She was in a bad marriage and wanted to emotional support. This was my first relationship and the last. I provided here the emotional support and was like a father to her kids. One of her kid had adhd so needed the extra care. I was the emotional kind so thought this would last forever. She fed me thoughts of they being my own kids and i simply believed it. i imagined my entire life with here. even planing to shift to Canada to be able to be with her. I had to move to a different city before covid and thats when things started changing. She messaged less and called less. didn want to speak to me stating she couldnt get a chance. I Kept begging her to give me time to speak to me. Then she said something to the kids so even tey started speaking less to me. In the meanwhile my marriage got fixed and she just stopped talking me me altogether. I still wanted to be in touch with her, moreso with the kids but she took everythibg away from me. She conviniently said that she dosent thinks its right. for 10 years she felt it was ok. Its been 4 years and i still feel the anger. I feel she used me and i want to take revenge. Ohh yes my wife knows about it. Today is her 25th wedding anniversary and I want to send our old chats and some pictures to her and the family. I feel she made the kids hate me as she didnt want to answer their questions about the affair and wanted to protect her image. so I want everone to know about our realtionship and break her image of a good human.",
    "subreddit": "TrueOffMyChest",
    "title": "Revenge",
    "upvote_ratio": 0.4,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5mfrg/revenge/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 11:15:23 UTC",
    "id": "1j5l6h6",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "I don't really have anyone to talk to about this and it might be the wrong place but...\n\nI (40m) woke up this morning and thought my nose was runny, wiped and saw a dark smear. I turned on my bedside light and it was blood. By the time I made it to the bathroom I was pouring blood everywhere. After about 45 secs of pressure and some TP it seemed to stop. Than I hocked out a blood clot. Than I blew a blood clot out of my nose. And than hocked another. I haven't had a nose bleed since I was a kid.\n\nI spent my morning cleaning up the blood I got everywhere and now I'm at work, but everything feels a little off. I can't tell if it's anxiety or something worse. I know I should go to a dr, but I'm American so I'm not going to go unless I'm pretty sure I'm dying since the bill will financially kill me. \n\nSo I'm going to hope for the best and see what the day brings",
    "subreddit": "TrueOffMyChest",
    "title": "Woke up to blood pouring out of right nostril",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5l6h6/woke_up_to_blood_pouring_out_of_right_nostril/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 11:14:08 UTC",
    "id": "1j5l5t1",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "Sorry for the bad writing, i attempted to post it in an german subreddit first but they ave a limit of 3k letters max and also don't allow blocktext wich is what this would have turned into if i tried to stay within said margin (plus deleting a paragraph)\nSo i had to use Google translate! Sorry!\n\n\nI (25f) always have disputes with my (59f) mother.\n\nWhenever I don't do something the same as she wants, she gets pretty acidic and even if I do it the same way as she wants, she somehow always has something to complain about.\n\n\nExample of today:\n\nBecause of the beautiful weather, I should hang my duvet out of my window, but the problem is that the winter garden roof is right in front of my window and I can't hang it out because it is a more or less flat level. So I decided to hang the blanket over the edge of the winter garden roof, mind you at one point that was quite clean (in my opinion) at least)\n\nAnd if I had hung the blanket directly out of the window, she would have been dirty or even dirty anyway.\n\nI also had planned (and also discussed with my mother) that I would wash the blanket this weekend anyway.\n\n\nNevertheless, she then sniffed me about half an hour later and she also found it very shit that I sucked at the same time as I was sucking.\n\nWe have a solar system that produces a very nice amount of electricity in very sunny weather and I thought that it would already be finished with sucking because I hadn't heard her vacuum cleaner anymore and then started sucking my room.\n\n\nHowever, she still has a problem with it because she apparently continued to suck again after a moment (which I couldn't hear because of my loud sucker) and also ran the washing machine (which I didn't know anything about because I couldn't see or hear her from my room on the first floor and that I was not explicitly told that it would be hired)\n\n\nIn addition, she also complained because I took a break when sucking (I have a cold and don't have enough endurance to create everything at once)\n\n(My room consists of two adjacent rooms of which I usually only do one because I am more in this, but this time I wanted to do both and only took a break in between)\n\n\nAfter I had explained Mama that, she told me that I always had an excuse.\n\n\nI then started crying (no idea why, sometimes happens during such confrontations) and Mama asked in a rather aggressive tone why I would cry now even though there is no reason for it and that we would only have a reasonable discussion.\n\n\n(Incidentally, the howling is nothing that I have an influence, I don't because it is to cry afterwards or something, I have zero control about whether or when this happens)\n\n\nIn the surplus, she also titled such moments as \"psycho shit\" and attempted manipulation.\n\n(Not today, but in other similar situation)\n\n\nIncidentally, she mostly teemers my attempts to explain and or counter arguments or ignores them entirely.\n\n\nI often have the feeling of being shouted at in these moments, even though she only \"talks to me very quietly\" (her words)\n\n\nI don't even want to do something in the household anymore because it is almost always wrong or not right.\n\nAnd almost every interaction with her consists that she tells me something what to do, or indicate that something is wrong/dirty or somehow not correct.\n\n\nThat would be okay, but everything is just too much, I don't want to come down to her or talk to her.\n\nWhen I come home and your car is not there, I'm already relieved.\n\nIs probably not your fault, I'm probably just over -sensitive or overreact or something.\n\n\nAlso, i haven't stopped crying the whole time while writing/translating this and my mom came in and asked me in a really passive aggressive tone what was up and why i am still crying.\nI told her to leave and she left.\n\nIdk what to do..\n\nI feel like she truly hates me and idk why she does all of this like that.\nMaybe it makes her happy?\nWhen asked she always says that she doesn't, but Idk if i can believe that ",
    "subreddit": "TrueOffMyChest",
    "title": "My Mom hates me",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5l5t1/my_mom_hates_me/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 11:12:13 UTC",
    "id": "1j5l4s1",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 27,
    "secure_media": null,
    "selftext": " I (19F) work with this girl, Genly (25F).  At work, she plays the sweet, quiet girl, and everyone thinks she’s so nice and understanding. But behind the scenes? She’s a two-faced gossip who talks shit about everyone, including the people she claims to be close to.\n\nAt first, we were pretty close, but the more I got to know her, the more I noticed how fake she was. She’d backstab people she said she liked, and I realized she was probably doing the same to me. So, I decided I was done. No warning, no explanation  I just blocked her on everything and moved on.\n\nThe second she found out, she ran to Facebook and posted some weird, fake-intellectual quote about people being “obsessed with psychology and personality traits,” my coworker told me clearly trying to make it seem like she’s above the drama. She even told people I blocked her, which is just petty. Like, just admit you’re mad and move on.\n\nBefore all this, Genly used to be super close with another coworker, Joanna (24F). I asked Joanna about something that made her realized that Genly was saying behind her back, and that opened Joanna’s eyes. Their friendship ended after that. So now, Genly has no one left except two other coworkers, Maribeth (22F) and Kenneth (20M), who are just as fake as she is.\n\nThe crazy thing? The day after I blocked her, Maribeth and Kenneth almost got attacked by a dog on their way to work. I passed the same dog later, and it didn’t even look at me. Then, Genly didn’t show up to work that day, claiming she had a “stomach ache.” The timing is insane, like the moment I cut her off, her whole vibe got thrown off.\n\nI know some people are saying I should’ve talked to her before blocking her, but I honestly don’t owe her an explanation. She was fake, I removed her from my space, and that’s it. I’m done with her.\n\n\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "Just had to block my fake coworker with no explanation and I feel good about it.",
    "upvote_ratio": 0.81,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5l4s1/just_had_to_block_my_fake_coworker_with_no/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 11:05:37 UTC",
    "id": "1j5l1e7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 8,
    "score": 3,
    "secure_media": null,
    "selftext": "Just couple months ago I(23F) and my husband (24M) decided to move in with my husbands family till we’re able to afford to buy a house. It’s just his parents, his sister and her son. Recently his sister (19F) has been using my clothes and shoes without asking. If I leave it in the living room or anywhere else that’s not our room she’ll use it. I left my jacket and a bunch of clutter from the car in the garage cause we were cleaning the cars out and I kept putting off when I’d put everything away. Next thing I know my jacket is upstairs and it’s clear she wore it cause it reeked of her perfume and her bag was on top of it, whatever not a big deal I take it to our room. But this continues to happen with a bunch of other shirts, jackets, whatever. \n\nNext instance, she broke her one pair of sandals and started using mines which I honestly didn’t mind cause I have at least 5 pairs and it was peak summer time. Next thing you know I don’t see my one pair I usually wear and I just start wearing a different one, eventually I find it in MIL car with the strap broken. My MIL doesn’t wear my stuff and his sister uses her car constantly. Clearly SIL broke it and never mentioned it to me but okay cool whatever. Then another pair go missing, okay cool she probably got hungry or something idk but whatever I can get new ones so I let it slide.\n\nIt’s now colder out now so I go out and buy some ugg tasman slippers and she starts wearing that. This is where I start to get a little annoyed cause I’d get dressed according to what shoes I’m gonna wear and when we’d head out to the garage my shoes aren’t there and she’s gone. Okay moving on. My husband bought me a pair of pandas that I rarely wear, I wore it out one time and switched to sandals so I kept the shoes in the garage next thing I know they’re upstairs and SIL had just came from somewhere. Okay now I’m definitely annoyed cause literally sandals are fine but sharing shoes is gross. \n\nAnd that brings us to today. I’ve been looking everywhere for my black leather ankle boots I last wore on Christmas and haven’t seen since. For some reason I decide to stalk her Facebook and I see a picture that she posted from 2 months ago from a trip she took to Vegas and I could see the top of her shoes and it literally looks like my boots. Same dent, same scratch. She doesn’t own any shoes like that either. I’m not confrontational so I ask my husband to ask her if she has my boots and she says she doesn’t know and that she “doesn’t wear boots”. So now I look like the crazy person and my husband thinks maybe I misplaced it. It’s literally no where else in the house or the car. He’s been aware of her taking my stuff and never says anything to her and the one time I ask him to ask her, he gives in and sides with her like she hasn’t been taking my stuff for months now. This seems so stupid and petty to get mad over cause she’s younger than me but literally just ask. She’s the youngest and grew up with all brothers so I understand the entitlement but I grew up with all sisters and it’s not hard to just ask. ",
    "subreddit": "TrueOffMyChest",
    "title": "Sister in law keeps taking my stuff",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5l1e7/sister_in_law_keeps_taking_my_stuff/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 11:03:23 UTC",
    "id": "1j5l09y",
    "link_flair_text": null,
    "media": null,
    "num_comments": 50,
    "score": 10,
    "secure_media": null,
    "selftext": "**After spending 15 years building a life here, I never imagined I would end up with nothing, forced to start over from zero again. I have updated this post to clarify a few things based on feedback.**  \n  \nI take full responsibility for my situation. I made many mistakes along the way, whether it was not staying on top of deadlines, assuming I had more time than I did, or not making the best choices. I have struggled with severe ADHD my entire life, and since I choose to manage it without medication, I often leave things until the last minute. That habit has hurt me in more ways than I can count, and this situation is no exception.  \n  \nAt the same time, the immigration system has changed significantly over the years, making it much harder for someone in my position to qualify. In the end, it was a mix of bad timing, personal missteps, and an immigration system that has only grown tougher for people like me.  \n  \nI moved to Canada as an international student a little over 15 years ago. I started from nothing, learning English from scratch, completing my academic English education, and then going to university and college. I worked multiple jobs as a developer while paying my taxes and contributing to the country I wanted to call home.  \n  \nDespite all that, I lost everything when my work permit expired a few months ago. I did not qualify for enough points under the ever-changing immigration system, so as soon as my permit expired, my job was gone. Because my work permit expired, I was not eligible for unemployment benefits, had no options, just the expectation to pack up and leave like I never existed.  \n  \nThe worst part is that this is not just about money or survival. I genuinely loved my job. I had amazing coworkers, a great team, and what I believed to be the perfect job in the perfect country. I was lucky enough to have made meaningful contributions and had so much more to offer as a 32-year-old with a bright future ahead of me. That is why I have so many regrets about how things turned out, and I know they will stay with me for a lifetime. I would give anything to go back and keep doing what I love. But because I wanted to do things the right way, legally and honorably, there just do not seem to be any options left.  \n  \nLosing my job did not just mean losing income. It meant losing my ability to stay afloat in the country I call home. Even when I had a good income, I was living paycheck to paycheck, covering expenses for two people. A large portion of my money went toward taxes, rent, and paying off debts that piled up after I lost my previous job during the pandemic. Now, with no work permit, not even under-the-table cash jobs would be enough to cover my expenses, and those would not be legal for me anyway.  \n  \nOver the years, Canada’s immigration system has become increasingly strict. The requirements kept changing, the point thresholds kept rising, and options like employer-specific work permits, which could have been a lifeline for people like me, were removed in Ontario. By the time I finally became eligible or was just about to, things had already shifted again. I know people who moved to other provinces because obtaining permanent residency was easier there, but even that became riskier when some pathways suddenly disappeared.  \n  \nGoing back to Turkey is not just about starting over. It is a nightmare waiting to happen. My brother and I are both considered army escapees, which means we would be forced into mandatory military service soon after arriving. The Turkish army is notorious for its brutal conditions. As ethical vegans and atheists, we would be in an impossible position. The army does not accommodate veganism, and being openly atheist is frowned upon both socially and institutionally. I know our time there would be unbearable in every way.  \n  \nThe system does not account for people like me, those who have given everything to this country, only to be left with no way to stay.  \n  \nIs this how the system treats people who dedicate their youth, education, and labor to this country?  \n  \nI do not want to sound ungrateful. I have always loved this country, and I still do. I love its people, and I consider Toronto my real home. Leaving would feel like losing a part of myself forever. But after all these years, not having a viable pathway to stay just does not feel fair to me.  \n  \nAfter more than two days without sleep, with stress piling up and rent due while I have no income, my mind is all over the place while writing this.  \n  \nI also recorded myself talking about all of this for about half an hour right before writing this, crying the whole time. It felt like therapy in a way, just letting it all out. Now, writing this feels like another form of that release.  \n  \nI do not know what comes next, but I needed to get this off my chest. If nothing else, I hope sharing my story highlights how the system fails people who follow all the rules and still end up with nothing. I truly hope it will somehow help future people like me.  \n  \nThank you for reading. I truly appreciate anyone who takes the time to respond with feedback, suggestions, or criticism.",
    "subreddit": "TrueOffMyChest",
    "title": "15 Years in Canada—Now I'm Jobless, Broke &amp; Out of Options",
    "upvote_ratio": 0.55,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5l09y/15_years_in_canadanow_im_jobless_broke_out_of/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 11:03:13 UTC",
    "id": "1j5l06a",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 0,
    "secure_media": null,
    "selftext": "I hate roller coasters after this horrible experience. \n\n\nMy brother (17) and I (13)  were in line waiting for the Jurassic park ride(can’t remember where), the line was long and then the person in charge started asking for 2 people and no one moved. We were so tired of waiting and I told (lets call him Mateo) mateo to volunteer us. \n\n\nHe was reluctant cause no one had spoken up and we couldn’t see the cart, but I told him to please accept cause I was tired. \nWhen he raised his hand I saw a lot of people turn to us with a mocking expression, I started to get scared. \n\n\nIn our cart there were two morbidly obese people who shouldn’t have been allowed. The security lady came to secure us (it was a long bar that gets pulled from up and secures all the people in the cart from the hip idk how to explain) and she started pulling down the bar when she reached the gigantic stomach of the man. She tried going lower but his belly wouldn’t let her. \n\nI was scared cause i wasnt secured at all. Mind you i was a fucking lanky teenager and the ride started and i felt myself slipping down. I started crying saying to mateo that i was gonna die and he realized what was happening. He tried to grab me as best as he could cause he also wasn’t really secured but he was way bigger than me. I was crying so hard trying to hold on with all my strength (it wasnt much lmao) my brother trying to help me, when suddenly i felt myself go up and almost over the security bar. \n\nI don’t know how but mateo found the strength to pull me back down and I was panicking so hard. The ride ended and i couldn’t calm down, mateo picked me up and carried me all the way back to our parents, only then did we both realize i peed myself at 13 years old. \n\nIt was so scared, so embarrassed, top 5 worse  experiences of my life would not recommend. Being in a park with roller coasters rn made me remember that horrible feeling. \n\nEdit: my bad at the title i meant peed, english is not first language \n\n",
    "subreddit": "TrueOffMyChest",
    "title": "I pissed myself in a ride thanks to an obese couple at a park",
    "upvote_ratio": 0.4,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5l06a/i_pissed_myself_in_a_ride_thanks_to_an_obese/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 10:52:34 UTC",
    "id": "1j5kuga",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "Hi everyone, does anyone resonate or seems familiar to this? ( It's and italian text, so sorry in advance)\n\nUna quercia centenaria, che persiste passivamente al tempo, sostenuta dal gentil suolo che l'accoglie, offre sempre il suo supporto ad un uomo mediocre che sempre ha cercato la pace all'interno di una vita in cui è facile entrare e pressoché impossibile uscire, cullato dal gentil dire delle moire, senza mostrare obiezione. La quercia offre segretamente conforto ai suoi numerosi coinquilini che la abitano ed ignora coloro che le crescono affianco e che cercano di non interferire con la sua quiete.\n\nLe radici che prima estraevano solo preoccupazioni dai propri simili ora ricavano solo nettare puro e paradisiaco, ricco dei più naturali ed immediati piaceri: la pace del canto degli uccelli, la tranquillità di un bosco che come unica imposizione segue le stagioni con le bellezze che ognuna di essa gli porta, il rintocco lontano di una campana di qualche paese vicino. Le preoccupazioni inutili lasciano spazio solo a presa di coscienza ed accettazione.\n\nGuardare al bosco e avere nostalgia di paesaggi passati che solo la quercia ha avuto capacità di comprendere. Voltare le spalle alla città che invece di nutrirsi di ricordi campagnoli e pensieri ciclici, senza neccessità di crearne frettolosamente di nuovi, si alimenta con la scomodità ed il rumore del futuro obbligo non naturale, non favorendo una vita vissuta unicamente sul filare dei pensieri e l'evoluzione dell'umore.\n\nVivere senza un'obbiettivo od un peso sulle spalle, vivere essendo nessuno, vivere solo di artifici umani e fenomeni naturali, solo la salute conta, null'altro, tutto ciò di cui ho sempre vissuto e tutto ciò che ho conosciuto: natura, relax, ricordi, solitudine ed isolamento. Così come fa la stessa quercia che ho sempre ammirato, vivrò questa vita spoglia e silenziosa, senza più incappare in tumulti di pianto ed ansia paralizzante, accettando il vento che tra gli spazzi vuoti ed isolati soffia e che ricorda all'animo la dimenticata arte dell'accettare ciò che razionalmente odiamo ma che inconsciamente amiamo, la pigrizia. L'esistenza terrena è di per sé mortale, quindi perchè rincorrere la fatica e l'ansia quando si può semplicemente accettare l'inerzia?",
    "subreddit": "TrueOffMyChest",
    "title": "Feeling of solitude",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5kuga/feeling_of_solitude/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 10:43:48 UTC",
    "id": "1j5kpxw",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "When I was 17(F), I met someone. A woman. Online. I never met her in real life, even years later. We only spoke on the phone once for an hour (years later). It was basically a purely texting relationship. \n\nIt was a blogging site, one of those where you just wrote an online diary, basically. We hit it off as conversation partners, but it wasn’t more than that for around a year. We didn’t even talk that often, but when we did it was magical. She was much older than me, and I knew it from the beginning. She was 31 when we met. It was weird for me to talk to someone older, but it just worked, and I didn’t think about it much, so I rolled with it. We talked almost exclusively about a shared hobby. \n\nA year later I was having a complete breakdown. It was my first major mental health breakdown. I think I was just lost in transitioning from school life to college life. I suffered alone for a year (I didn’t really have a support system), and after that, I decided to open up about it in my online diary. I didn’t know what I expected, if I expected anyone to care. But she suddenly supported me. She talked to me a lot. She said she had been through the same things, so she understood what I was feeling. And that’s how it started: she explained to me A LOT about how mental health works. When I was a teenager, I didn’t “believe in mental health”. Till it bit me in the ass: I mean, I had this major breakdown, and suddenly, my “nonexistent” mental health incapacitated me. I had severe fatigue, panic attacks, even diarrhea. So, the woman basically taught me some basic concepts, explained some basic things to me. I started to read up on therapy, psychology, we’d discuss issues. \n\nIt was also magical: she just got me. I’d never had the privilege of having anyone in my life who understood me, gave me a manual to myself. I internalized my family’s approach of ‘you’re just a lost cause hysterical little shit, and there’s nothing left to do with you but ignore you when you get difficult’. And with her, I suddenly understood that I wasn’t hysterical. That my feelings had a cause. That I could actually fulfill my needs, and there would be no breakdown. So, she taught me how to relate to myself in a healthier way, how to be on my side, always. And the best part? She never actually lectured me on anything, never made me do anything, never got mad at me for not trying anything. And she was always respectful to me despite the age difference. She never played the ‘I’m older and I know better’ card, even though she was definitely older and knew better. She just explained how things work (for her, and how she thought it worked for me, too because we’re so similar), and I could take it or leave it. She just treated me the way that I understood how to treat myself. Like, she’d do or tell me things that’d calm me down, or help me get out of despair, or a panic attack, and I made a mental note ‘oh, that’s what I need when I’m having a panic attack. Yes, this works for me when I’m overwhelmed. Ok, that’s what I’ll ask for when I need support next time’. \n\nI think I was going through this very major and life-changing breakdown for about a year. My health was never the same after that (still isn’t, 13 years later), but I was slowly learning to live with this new version of myself. I felt more stable, but I still needed a lot of support. And she was there. I don’t think I’d be alive or (relatively) sane right now if it wasn’t for her during that first year, if it wasn’t for her guidance and gentleness. I really had no one, especially no one who understood me like she did. She’s the one who made me try therapy. Not by talking about it (she never went to therapy herself), but a couple of months after we started talking about my mental health, I was reading some posts about therapy, and understood that what I felt with her, I could find in therapy. And I got really interested in it: with her, I couldn’t ask for more or for a more stable presence. With a therapist, I could get that presence for an hour a week on a regular basis. Well, I never found that therapist with whom I had this magic. Never found anyone even remotely not hurtful, actually (I have a bad trauma from therapy by now, tried 20 therapists). The woman was really the only person in the world who got me to relax and listen to her without fighting and rejecting right away. Others would just trigger me hard, trigger a defensive response and then hurt me when I couldn’t accept what they were saying, even though I was fighting myself hard not to push them away. With her, it felt like she was going through the minefield of my psyche, knowing exactly where to go and where not to go and how to neutralize at least some of the mines without setting an explosion off. And the most awesome effect was that the neutralization usually had ripple effect: she’d make one small thing feel slightly better, and I could feel the chain reaction of things correcting themselves months later, things that were unrelated to the first conversation.  \n\nIt went on for years. I mean, she wasn’t my therapist, but… We talked about our lives, hobbies, mental health. It was always the older-younger dynamics, but not in a bad patronizing way: she’d just explain things, but she never pushed. She never said that because I’m younger I don’t get to have a different opinion. Never laughed at me. Never tried to make me respect her. She didn’t need to: I’ve never respected anyone like this in my life. She doesn’t have a conventional successful life: never married, never moved out of her family’s apartment, she didn’t even work most of her thirties (for reasons I didn’t fully understand but never pushed her to share). But I respected her more than anyone who had all those. She was very smart, driven, understood things deeply, always treated people with respect, everyone, she had this quality of attracting people to her, like, she didn’t wait for anyone to start talking to her (like I did), if she saw someone she found interesting, she’d just initiate. And she treated vulnerability with care. Doesn’t matter what happened between us, doesn’t matter if I hurt her (unintentionally. I’d never do anything bad to her intentionally), doesn’t matter what was happening — she never used any one of my open wounds, never chose to set any of the mines just to hurt me back. And she could do it at any moment. She spoke my language, she knew how to put things exactly in a way that her words would have the most effect, so she could destroy me. She never ever even tried in all those years. Not even when the relationship went sour and she was annoyed with me for years. She’d snap at the small things (once she started aggressively attacking me in a discussion about Harry Potter… Not me—my thought process. That’s when I knew it wasn’t just a rough patch but truly over), but she never went for my traumas. Not even when she didn’t enjoy me anymore. \n\nAs I said, the way she treated me had a ripple effect, fixing things without her even trying. Through the years, the way she treated me, talked to me, I developed that inner compass as I call it: basically, this feeling that in my life, I’m the one who always knows best. Even if I make mistakes, I’m still the one who knows best, and I’ll course correct if I make a mistake. I don’t mean that I feel that I’m always right about everything — just in my life, in things that concern me. It was very different from what my family told me: you’re incapable of anything, you should listen to us, you don’t have a brain. That inner compass made me finally start living my life. Not what my family thought was best — what I felt like doing. And the most beautiful part of it was that these things were not what the woman wanted either. They were truly mine. I moved to another country — something I always wanted. She clearly couldn’t understand my decision, but that didn’t matter. It was mine. I started speaking another language (English) more because that’s what I always wanted, and she couldn’t understand it either. And it didn’t matter. I knew what I wanted. And a thousand choices like that that she watched me make and kept her mouth shut enough. Because of this inner compass, I feel like there will always be a part of her in me, wherever I go. \n\nAs I’ve said, the relationship went sour. With years, I understood that this dynamics of her keeping me at arm’s length (I never knew much about her, her struggles, she never let me support her) doesn’t work for me anymore. And I wanted to actually talk on the phone, actually meet her. All I could get out of her was one phone call, and after that she was always “not in a good place” for a call. I finally was brave enough to admit to myself that I wanted more of her (and that I’m an equal in this relationship and an adult, too, so I have the right to pursue it), and wanted to have a relationship. She was vague about it. And then her reaction made me not sure about it, too. At some point she did try to rely on me more, and I didn’t get it, I guess, and it hurt her immensely (and when I understood that I hurt her, it was hard to forgive myself: she was someone I NEVER wanted to hurt. Not for any reason). And then we talked about everything — the dynamics, my feelings, our wants and desires — and just like that it was over, slowly, quietly, not really too painfully (and immensely painfully for me at the same time, but, I mean, she didn’t really hurt my feelings. I was just hurting because it ended). It was 7 years after we started talking. \n\nBut I could never forget her. I’d text her sometimes, just to know how she is. Nothing too personal — just to know if she was ok. She’d get annoyed at me for that. I couldn’t really understand why… She’d say something about me “trying to be a people-pleaser and showing that I still care when I don’t”. At some point, I asked her if I should stop texting her because I clearly annoy her. She said yes. I tried. I tried for two years. And then I texted her again and said that I’m not a child anymore (I was 28 at the time), and I don’t want to live in a world where we don’t talk. We didn’t have to be best friends, but I was certain we had to talk. Sometimes. About anything. At some point. And she agreed. It was weird, and I was the one texting her mostly. And then it fizzled out. \n\nI never talked to her about it. There was nothing left to talk about, nothing left to say. But I still think about her when something good happens in my life. When something bad happens, and I handle it like a capable adult without falling apart. When I manage to choose myself instead of caving in. \n\nYesterday was one of those days I couldn’t keep it in (the last one was a year ago, and she did acknowledge it, even if briefly). I texted: “Hey, it’s one of those days when I can’t help it but want to wish you the best. So, here I am, wishing you the best. You’re incredible, and I feel so lucky to happen to live on this Earth when you exist”. She read it immediately, and… left me on read. I’m not sure why. She used to tell me that she doesn’t know what to say when people tell her good things, and she used to do it with me, too. But she usually acknowledged it. Now she didn’t. Did she think I was weird for texting it? Did I make it awkward? Was it too much? I guess I’ll never know. But ChatGPT told me to try and write it in a journal, so, here I am, on this sub, trying not to bother the most magical connection of my life with my gratitude. \n\nI’ve been in love; I have parents; siblings (well, cousins); I’ve had best friends. And this connection was everything in one: an older sibling who’s almost like a parent who’s also my best friend and with whom I’m absolutely in love. She was my first adult love: the love when you don’t just fall for someone because you think they’re perfect, but the love when the more you see the imperfections, the more you respect and love the person. You understand how difficult their life is, and respect how beautifully they’re fighting and what a strong and capable person they are despite all their limitations. \n\nMy life (and mental health) are in no way perfect. I’ve made a lot of mistakes, some of which I won’t ever be able to fully correct. But the peaceful moments that I have, the good things, the authentic parts of my life, the parts where I feel like I’m living my life and not someone else’s, I owe to her. ",
    "subreddit": "TrueOffMyChest",
    "title": "I feel such deep gratitude towards someone and can’t share it",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5kpxw/i_feel_such_deep_gratitude_towards_someone_and/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 10:22:49 UTC",
    "id": "1j5kfc0",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 2,
    "secure_media": null,
    "selftext": "I lost my best friend to suicide in November. I feel so alone. I have my partner and sure he's also my best friend, but I need my best friend that I can fuck around and be immature with, the person I can talk to about my partner and confide in. 12 years by my side gone in a second and I never saw it coming. Now I'm 30, I don't know how to make friends like that anymore, I don't think I ever can, definitely not one that was like him.\n\nIf you're suicidal reach out, you have no idea how badly it fucks those of us left behind.",
    "subreddit": "TrueOffMyChest",
    "title": "Officially lost",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5kfc0/officially_lost/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 09:59:10 UTC",
    "id": "1j5k39v",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 1,
    "secure_media": null,
    "selftext": "Hi Reddit,\n\nI’ve been struggling with something and I’m feeling really self conscious about it. I (19 M) have always been aware that my penis is very small (well below average) and It’s something I’ve been insecure about, but I’ve tried not to let it define me. Recently something happened that made me feel way more insecure than I’ve ever felt. \n\nI was with a girl I’ve been talking to recently and we decided to have sex but during she said “I don’t know how to say this but I can barely feel anything. I was expecting something else” The way they said it wasn’t outright mean, but it felt so dismissive and made me feel like I wasn’t enough. It really got to me and now I’m stuck thinking about it all the time.\n\nI’ve always known I’m smaller than most guys but hearing a comment like that from someone I was intimate with really knocked my confidence. I’ve only been with 1 other girl and I was self conscious about it with her but we both had a good time for the most part. But after that comment I’m constantly worrying that I’ll never be enough for a future partner and that my size will always be a problem.\n\nI really don’t want to let this comment affect me, but it’s hard to move on from. Thanks for reading my post and I’d love to hear from anyone with advice to help move forward and feel better about not being well endowed. ",
    "subreddit": "TrueOffMyChest",
    "title": "Feeling self conscious about my body after a comment made while intimate",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5k39v/feeling_self_conscious_about_my_body_after_a/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 09:30:08 UTC",
    "id": "1j5jo2t",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 0,
    "secure_media": null,
    "selftext": "I’m so tired of life, my entire life I have been abused and struggling, I was finally doing better and got hit by a car causing me to lose my job. I’m stuck with a man who sexually and mentally abuses me because I can’t get a job to get away from him, I don’t have family anymore either.. I’m just so tired.. ",
    "subreddit": "TrueOffMyChest",
    "title": "I just want to give up…",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5jo2t/i_just_want_to_give_up/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 09:08:46 UTC",
    "id": "1j5jdja",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "The one person who was always there for me was a girl i had fallen for. She was the first one in years that made me actually feel this way about someone. She was loving caring and amazing and she would drop everything for me. If texted her she was there but today she was distant. And i know why. She told me she didn't have the same feelings and i know that and i have to be okay with that and I'm trying to. But it's really difficult to. She started talking to this new guy and I'm pretty sure they went out today because she looked so nice in the one snap i got from her. It was her going out look. And the only time she doesn't instantly respond to me is when she's out with someone like that. If it's one of her girlfriends she's normally really quick and talkitive with me still. And it sucks. It really hurts and she called today to say she had a birthday gift for me which is nice because i don't really celebrate my birthday i don't like making a day about me but it's such a kind gesture. And i could tell she was really happy in her voice. And she said she had a good day and wouldn't tell me why which means it's probably the guy. And it's not like she's hiding that fact i asked her not to tell me about him and those experiences because it made me feel bad and insecure but honestly i don't know if hurts worse not being told but it still feels bad. Anyways I'm really lonely feeling right now and just wanted a connection from someone and nobody is there to answer me it seems. All the people who i used to be able to pick up and talk to whenever whenever don't respond to me anymore and when i reach out in a time like this just to feel a small connection nobody is there. And i feel so alone and I've never felt this way. I've always been happy alone but it's so different this time and i don't like it. It's been a couple nights I've felt like this but this just feels so bad in an empty way. ",
    "subreddit": "TrueOffMyChest",
    "title": "The time i feel like i need it the most i don't have anyone there for me.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5jdja/the_time_i_feel_like_i_need_it_the_most_i_dont/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 09:05:42 UTC",
    "id": "1j5jc5t",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 2,
    "secure_media": null,
    "selftext": "Like the title says, I’ve never been on a date. Women have expressed interest in me + I’ve had past relationships but they were all long distance. Which means I’ve never gotten to take a woman out for dinner or coffee. Here’s the kicker tho, every time I tell someone that I’ve never been on a date, I get a variation of “no way” or “you’re lying” or “how?”. \n\n\nGetting these types of reactions means that I am good looking to an extent I guess, but it hasn’t translated to any dates. I will admit tho, I am a late bloomer, I was bullied mercilessly as a child, was fat then skinny and now I’m in the middle which is nice.\n\n\nI know I need to put myself out there more but every time I do so I get burned rather quickly, in spectacular fashion I may add. I’m also afraid of rejection which doesn’t help. My luck isn’t the best either, and considering how unavailable people in my city are, I guess it makes sense. I just feel so far behind my peers, I feel weird.\n\n\nI get everyone has their own timeline but at the same time, when most people your age are in committed relationships or going out on dates, it’s hard not to feel unloved/unwanted in addition to feeling like you’re behind.\n\n\nI also wonder if I should ever tell a woman this when (not if) the day comes? Will she be turned off? Will she be weirded out and think to herself “what’s wrong with this guy? How has he never been on a date?” \n\n\nThank you for reading and take care.",
    "subreddit": "TrueOffMyChest",
    "title": "I’m almost 22 and I’ve never been on a date",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5jc5t/im_almost_22_and_ive_never_been_on_a_date/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 09:04:41 UTC",
    "id": "1j5jbok",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I (22F) recently found this out and honestly have no one i can tell that won’t look at my dad in a weird way. I’ve always had my suspicions but i wasn’t sure what i was suspicious about. I knew he had done some pretty tame things like drink and smoke but whose dad hasn’t? In a way this more just confirmed that he has cheated. I’ve also always been a sneaky person, when i was younger i would always listen through the doors and behind walls whenever my parents would fight, just so i can know everything and see how transparent they’d actually be with me. I’ve just always been nosy. A while back I was maybe 13 or 14, me and my family decided to upgrade all of our phones. When each of us transferred all of our information to our new devices some of the applications pop up. And at 13 i was the most chronically online emo loser who grew up in the 2000-2010s era so i recognize a grindr logo when i see one. That day my dad did look a bit like he knew that i saw but he probably thought i didn’t know what it was he had on his phone. I just told myself maybe i thought i had seen that logo, and left it alone, until now. Tonight after my nightly routine i forgot my hair ties in my parents room so i decided to sneak in there while my dad was asleep, and his phone was unlocked with a chat opened. Like i said….im nosy. I didn’t see anything but i 100% knew it was grinder because i saw the logo. I did take a photo while his phone was open too , i dont know why but something was telling me to! I also wasn’t sure if this was something my mother knew of and just never said anything. Just because i feel like it’s her natural response to something like that. I love my dad, he’s still a father to me and my siblings, and he works hard. This doesn’t make me hate him but it does slightly piss me off because all i can think about is my mom and how much she doesn’t deserve her husband doing something like this.\n\nAs of right now i’m not sure what i’ll do. I just wanted to get this off my chest because i know it’ll weigh heavy on me if i don’t tell some one. I feel like if i tell my friends they might pity me just because this situation is just so weird and honestly i feel like freaky stuff like this doesn’t happen in anyone else’s family LOL.",
    "subreddit": "TrueOffMyChest",
    "title": "found out my dad had a grindr account",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5jbok/found_out_my_dad_had_a_grindr_account/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 09:02:28 UTC",
    "id": "1j5janh",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 5,
    "secure_media": null,
    "selftext": "Three years ago, I experienced strong health issues regarding my digestive systems. Basically, I was unable to eat, and had diarrheas (all evenings from 6pm, which is very weird, your digestive system ain't supposed to work that way)\nI had tests running, and nothing worked. Nor they found what I had (I had like deep tests, including bloods and cameras in my stomach).\nIt caused a depression (or the depression caused it? Who knows?). I was belittled by my GP who was like \"you've got nothing dude you're fine, in fact you're overreacting\". (I was willing to kill myself at the time because I had no hope I'd able to have a normal life)\nThen, I changed my GP, she gave my antidepressants, and it went slowly better. I finally recovered after like 8 months in hell. I was able later to enjoy my life.\n\nNow, as I am about to do something thrilling in my life for a few months, symptoms are back. It's been one month. I'm unable to eat, and I want to puke like a lot (like I have no appetite at all, I have dark thoughts, eructations...) Don't know why, might be after a COVID infection I had (but like I've had 6 of them till 2020 so I don't know). Or a changing environment. I left my city.\nIt's bad, but that time I got antidepressants quick, whereby I hope my symptoms will get better. I searched on the Internet, might be dyspexia. \n\nSi if anyone is experiencing something similar (or generally troubles with their intestines yk), you're not alone. We are a lot struggling with a society that does not understand us. I always had the feeling that, for people, when you don't have something killing you like cancer, it's no big deal you are overreacting and complaining for nothing.\nCancer is terrible, worse for most of them, but our troubles count. Especially when you can't enjoy a meal, a party, or just hanging out with friends because of that.\n\nGotta wait one week for the effects of my antidepressants, we'll see. The only good thing is that it disappeared one time, so it can disappear again.\n\nBless you guys, ",
    "subreddit": "TrueOffMyChest",
    "title": "People with digestive malfunctions, I understand you. Lots of people do.",
    "upvote_ratio": 0.78,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5janh/people_with_digestive_malfunctions_i_understand/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 08:46:40 UTC",
    "id": "1j5j3ag",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 5,
    "secure_media": null,
    "selftext": "Just here to vent. \n\nI (29m) have never had any real friends. I've always just had people that I know. Now, I'm at the point where I realize that I don't have anyone at all. I thought that I had friends at various points in my life, but they never stuck around for one reason or another. They were only \"friends\" with me out of convenience, meaning that they didn't have any of their actual friends around and buddied up to me to pass the time. Then there were those who were only \"friends\" with me to get what they wanted out of me before ghosting me or flipping out when I stopped providing what they wanted and ditched me. Those \"friends\" who wanted rides or money or favors that monopolized my time and resources to the point where trying to tell them that they were asking too much of me made them lash out. Those \"friends\" who wanted everything from me, from a listening ear to a walking atm, but who wouldn't do nearly the same thing for me. Those \"friends\" were some of the worst, but, honestly, the worst ones were those who tried to buddy up to me because they \"felt bad that I was all by myself\" because friendships built out of pity have the least amount of respect for the one being pitied. \n\nHonestly, I'm tired of it. I'm tired of feeling and being alone in crowded rooms. I'm tired of not having anyone around who cares about me and actually wants me around. I'm tired of being made to feel like it's a chore for others to talk to me. I'm tired of caring more about others than they do for me. I'm tired of being so lonely. \n\nI haven't had any real social connections in years and it's, obviously, starting to get to me. I just want to have people to talk to about random, every day crap. Or, better yet, I want to have people to have serious conversations with about the universe and life or whatever over a bonfire or in a random spot in the middle of the desert on a clear, star filled night. I want to have people who don't look at me funny when I say we should go on a random adventure to a museum that I think looks cool or some gimmicky attraction that I found that looks like it would be fun. I like gimmicks and museums and want people around who aren't going to call me weird for liking them and wanting to go experience them. I want someone to go fishing with who isn't going to say they're bored every five minutes or tell me we should just go to a bar because \"it's the same thing.\" It's not the same thing and I don't drink. I just want to have people around who take as much interest in me as I do in them without calling me or my interests weird or creepy or boring or lame. \n\nI want to go to museums and attractions with people. I want to go on random adventures to random places; maybe go randonauting or urban exploring- there's plenty of places to see. I want to go fishing with people. I want to watch football and baseball with people; maybe even go to a local game together. I want to have people who'll play basketball or badminton or Pokémon Go with me. I want to go bowling and to the arcade and to the put-put spot with people. I want to play billiards with someone who isn't going to call me creepy for loving to play it. I want to drive around aimlessly listening to true crime podcasts or creepypastas (Creepsmcpasta specifically) or just with people who'll share music with me and not call my taste in music weird or old-fashioned. I want to go have lunch in my car in the Sonic stalls with someone (don't know why, it just sounds like it'd be fun). And on that note, I want to have someone who's willing to go try new food places with me. I want to have someone to talk to about anything and everything. I want to be able to talk to someone about who's the best Robin or how Anissa is the worst character in Invincible (even worse than Immortal). I want to have someone to talk to about some random occult things that I read about or saw on the internet. I think it'd be kinda fun to pull out the Ouija board or some tarot cards or something. I want someone to share random fun facts with me as much as I like to share with them. I want to be tagged in random posts on social media or actually have someone acknowledge that we did something together or, better yet, have people who'll want to take pictures with me without telling me that I ruined the picture by smiling weird or just telling me that they don't like taking pictures with me. I want to have a barbeque by the pool in the summer; maybe throw a football around in the street. Or maybe have some random potluck and I'll make some Currywurst for people to try. I want people to teach me some of the languages that they speak or maybe want to learn one with me or I'll teach them some German. \n\nHonestly, as long as I had someone around who would share with me what I share with them, then that would be enough. Looking back on what I've already written, none of that would actually matter in comparison to just knowing that I had a friend. But, writing this all out and venting just makes me feel pathetic. It makes me feel even worse than having my family question me when I go out because I don't have friends so why am I out. That hurts on it's own, but the vibe of desperation that this seems like feels worse than that. I don't know. I've gotten this far, but it feels like none of it even matters and there's no point regardless. I'm just that person who doesn't have friends and it's just one of those things that needs to be accepted even though it hurts. It is what it is. It's really not like it matters anyway because if the rest of this year plays out how I'm expecting it to, I won't be here by this time next year anyway, so that just makes it easier, I guess. So, why not vent and ruminate for a while and see how I feel later on? Maybe things will be different and I'll feel differently. Plus, thinking about everything makes me think that I'm just better off alone regardless, but, even then, it doesn't make the pain of that loneliness go away, so at least having some type of outlet helps in it's own way. It's better than nothing and just keeping all of this bottled up at least. ",
    "subreddit": "TrueOffMyChest",
    "title": "I'm Tired of Not Having Friends",
    "upvote_ratio": 0.86,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5j3ag/im_tired_of_not_having_friends/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 08:42:54 UTC",
    "id": "1j5j1hh",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 2,
    "secure_media": null,
    "selftext": "I don't feel better, i don't see any positive thing in life. I didn't made any progress and I still feel the same. I believe staying alive was a mistake.",
    "subreddit": "TrueOffMyChest",
    "title": "One year ago I wanted to kill myself, I didn't do it and I belive it was a mistake",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5j1hh/one_year_ago_i_wanted_to_kill_myself_i_didnt_do/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 08:38:15 UTC",
    "id": "1j5izbf",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "Why do I not panic when most do or when I \"should? In fact, I thrive. \nI've been put in and witnessed some of the most extreme situations(because of my career and childhood)\nI witnessed one of my closest friends get shot recently. \nMy reaction is what is now bothering me. \nI was calm. Remember every single detail. Never panicked. \n",
    "subreddit": "TrueOffMyChest",
    "title": "What is wrong with me?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5izbf/what_is_wrong_with_me/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 08:32:49 UTC",
    "id": "1j5iwrt",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 1,
    "secure_media": null,
    "selftext": "We've been together for 10 months and living together since November, splitting bills. My bf is autistic and I pretty much brush off many things to that, but I'm starting to think he has no idea what love is.\n\nI'm 100% sure he thinks he loves me, I'm helping him a lot and we're basically the only people for each other in the whole country. It's pretty comfortable for us to live together.\n\nBut nothing besides his own thoughts and life is interesting to him. He speaks 99% of the time. He never shuts up, ever. When I talk, he interrupts me and when being called out, says he can't understand when it's the time for him to talk and when not. Sometimes he'll also tell me what I said was boring. Can you truly love a person if you don't give a shit about anything else apart from yourself and your thoughts?  ",
    "subreddit": "TrueOffMyChest",
    "title": "Is my bf incapable to love?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5iwrt/is_my_bf_incapable_to_love/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 08:27:47 UTC",
    "id": "1j5iuc7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "Hello everyone,\n\nI am a Sudanese civil engineer currently residing in the UAE. I am actively seeking scholarships, assistantships, or any financial aid. I've been admitted to ASU for an MS in Civil Engineering (water quality &amp; scarcity). Studying in the USA has been my dream, but securing funding has been extremely challenging, especially given the current situation.\n\nI have contacted over 60 professors and applied to multiple universities, but funding remains uncertain. With the ongoing conflict in Sudan and limited opportunities, I am struggling to find a way forward.\n\nI am afraid that even if I secure funding, I may not be granted a visa due to the war in my country.\n\nIs it possible to study there given these circumstances, or should I give up?\n\nIf anyone has insights or advice, I would truly appreciate it.\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "Feeling hopeless - seeking guidance on funding for graduate studies",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5iuc7/feeling_hopeless_seeking_guidance_on_funding_for/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 08:26:24 UTC",
    "id": "1j5itoh",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I just wanted to put this out there and hopefully someone can read it or relate, or share any advice, or whatever. i spent a very long time getting out there and getting a big group of friends, just for them all to leave, i’m okay with finding new friends, and have been looking for a long time, but the truth is, \n\nit wouldn’t usually bother me, but I can’t help but feel so bitter and mad about it, like I can’t really shake it. I’ve been looking everywhere around me, but same for jobs, I literally can’t find any social groups near me. (Multiple websites, social media groups etc.) Like i said, I just wanted to put it out there, at the very least someone will be able to see this.",
    "subreddit": "TrueOffMyChest",
    "title": "All my friends left.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5itoh/all_my_friends_left/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 08:25:57 UTC",
    "id": "1j5itfh",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 1,
    "secure_media": null,
    "selftext": "\nThrowaway cos yeah personal stuff.\n\nI (26m) plan to break up with my girlfriend (26f) next weekend.\nWe have been together for around two and a half years and we just dont really have anything in common, our conversations are frankly boring, she is a lovely girl which is why this has been the hardest decision ive ever had to make but i think its for the best.\nI spoke to her a couple weeks ago about a few things that were bothering me and sex was one of them and it made me realise that it was a different level of priority for us, for me its quite high and im very much experimental in that department and would love to try things but she just doesnt. And im not going to get her to do something shes not comfortable with or doesnt want to do. We also spoke about how id like to see more effort and enthusiasm during sex from her as i felt a bit like my pleasure wasnt that important which isnt a great feeling let me tell you, and she hasnt really put any more effort into it minus the absolute bare minimum.\n\nIf im completely honest, im terrified. Im scared of what the future will be, scared that I wont find someone else, scared about hurting her which is the last thing I want to do is hurt her but I also need to take care of my own happiness. This is my first proper relationship and girlfriend, I've never had to break up with someone and im so scared.\n\nMy minds still a bit mad trying to process my decision so sorry if this doesnt read very well.\n\nEdit: more things to get off my chest jesus sorry. \nI do still love her, and this yoyo effect I'm feeling of wanting to break up then doubting has made me feel so numb scared and empty I feel so lost. Each time my girlfriend messages me today it hurts so much i really do care for her but, i just don't know if I'm doing what I did early on and ignoring things that obviously do bother me because I've got complacent. ",
    "subreddit": "TrueOffMyChest",
    "title": "Im breaking up next weekend with my girlfriend of 2.5 years",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5itfh/im_breaking_up_next_weekend_with_my_girlfriend_of/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 08:03:59 UTC",
    "id": "1j5ij2t",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 36,
    "score": 560,
    "secure_media": null,
    "selftext": "TLDR; I am a sex worker and I let a client get too obsessed. He threatened suicide when I ended things with him and I went to the police on the off chance he was serious. It turned out to just be another ploy to try and get me to talk to him. \n\nLet's preface this with I am an independent sex worker. I do in person sex work by the hour and it's my job because I enjoy it and it gives me a lot of financial security.\n\nMy best friend, \"Celia\", also does sex work and we share notes about the job, and even have the same clients on occasion. \n\nShe met \"John\" first. John is an obese 300lb man, early 30s, and a high maintenance client. He was very recently divorced because he cheated on his high school sweetheart wife with another friend from high school. He left his wife, only to have his new girlfriend leave him about a month later for another man. Why did he cheat on his wife? Because she had \"gained so much weight that he no longer found her attractive\" (I saw photos of her, she was barely overweight. He on the other hand nearly doubled his weight since they got married). \n\nJohn is a home inspector for an insurance company. He makes good money by inspecting a high volume of homes, but part of the job is using all the data collected to write personalized reports on each home inspection. When John was married, his wife did the reports for him (this was illegal because the information is supposed to be confidential, but he was able to get away with it because they lived together and she used his work PC to help him out).\n\nSo he left his wife, then his girlfriend of two months left him. He was desperate to get her back any which way, and knew she needed money, so he offered to pay her to do the reports for him (which worked out because his wife was no longer willing to do them). He figured out a way to log into his work from her PC, trained her up, and used his position as her boss to make her spend as much time with him as possible so he could potentially win her back (he would only ever pay her in person, for example, and coerce her into spending hours with him before he paid her the money). This isn't important to the story, it just gives background information on his history of inappropriate relationships and manipulating women. \n\nIn the meantime, he started seeing escorts to fill the sexual void. Eventually he met Celia and very quickly fell into limerance. For the first time since his ex girlfriend left him, John had a new woman to obsess over. He shared his whole life story with Celia, texted her all the time, and visited her more often than he could afford. She found him exhausting to see (he had strangled dick syndrome from a porn addiction, and struggled to get off, but would urge her to keep trying). He talked constantly about himself, overshared about his childhood trauma, and would stay longer than he paid for, forcing her to have to kick him out each time. She set boundaries about him texting her so much and taking so much of her emotional energy, but he kept breaking them. \n\nSo she enlisted my help. I have a few more years experience under my belt, and felt confident that I could handle his neediness. After she talked me up, he agreed to meet me. \n\nThe appointment was a success. I was able to work around his strangled dick problem and he began to see us both regularly. But it became obvious that he was obsessive and inappropriate. He talked about Celia non-stop and shared personal details about their time together with me. He also shared private details about his ex-wife and ex-girlfriend. \n\nWhen he saw Celia, he talked about me and overshared in a similar way.  It made her very uncomfortable and she set boundaries around it. He didn't abide by the boundaries, so she fired him. \n\nHe was devastated... But I was able to distract him and help him process the heartbreak. He felt betrayed by her, because she treated him as a client and he felt like he deserved better treatment. I gently defended her actions, but not so much that it would offend him.\n\nBy this point I was earning steady money seeing him, so I didn't want to risk jeopardizing that cash flow. \n\nI could see that he needed the full girlfriend experience, so I gave it to him. He was very insecure so I often needed to reassure him that he could count on me, that I would be a stable person in his life, so long as he kept paying my rates for time together. I allowed him to take me to dinner off the clock occasionally, and texted him back on occasion (I didn't get triggered by his incessant texting in the same way as Celia).\n\nIt worked out pretty decently for a few months. I felt like I was meeting his needs, and he seemed happier and more stable. Unfortunately, my carefully set boundaries started to erode. He didn't see me as an escort anymore, he saw me as a sugar baby... Then as a girlfriend. He told me he loved me. Often. He started celebrating \"anniversaries\" for us and booking me for holidays.\n\nI, too, found his company exhausting. The whining, the complaining, the bad decisions, the love bombing, the delusional thinking.... It started to be too much. I felt like I was wearing a thick mask while I was with him, forcing myself not to show my disgust. I hated the way he bragged about how much money he made, while breaking the rules to do it. I hated his \"nice guy\" syndrome and how entitled he felt to attention from women. I hated the way he would eat dairy despite being lactose intolerant. I hated the way he binged on McDonald's after eating a large dinner with bottomless cokes. I hated the way he touched me and kissed me. I hated the self obsession, and the victim mentality he had. \n\nI couldn't stand his inability to take any personal accountability in his life. I eventually learned that despite making over 300k a year he was completely maxed out in debt because he had a gambling addiction in addition to his sex addiction. He learned to count cards at the casino and managed to con a younger card counter (I think he was only 21) into lending him tens of thousands of dollars to \"invest\" into being an advantage player at the casino. Unfortunately John lacked discipline and lost everything on slot machines. To his credit, he is planning to pay the kid back, but learning about this made me incredibly nervous and I started to get the sense that I was in over my head. \n\n I hated the way that he would talk about being sexually abused as a child without warning in excruciating and disgusting detail. I hated that he would rather spend money he didn't have on escorts and gambling than see a therapist. \n\nI felt gross and drained for hours or even days after seeing him, and would sometimes have to turn down other work because I didn't feel up to it. \n\nThe last straw for me happened Feb 16. We were supposed to see each other on Valentine's day, but I fell ill with the flu a few days earlier. He complained every day while I was sick and pestered me, dangling the money for my overnight fee over my head. He wasn't able to schedule another overnight until March, so if I didn't see him by Sunday, I would lose out on the $2000. Also he just really really really needed to get laid, and if I didn't see him, he'd go see another escort. \n\nSo, still feverish and really fucking ill, I let him come see me. \n\nIt's important to note that the first time he booked me for an overnight, he touched me in my sleep. This is a hard NO for me, and I let him know. Subsequent overnights, he did not cross that boundary. But this night, I woke up again to him assaulting my body in my sleep. My heart was racing and I felt so violated that I wanted to cry. I didn't want major confrontation, so I just pushed his hands away and told him I was still trying to sleep. But I spent the rest of the night on high alert, only able to doze for short periods of time. \n\nAfter that, I knew it was time to stop seeing him. Because we planned our appointments for each month up to two months in advance, it did not seem appropriate to simply ghost him. I struggled to find the right way to end it. I knew he was obsessively attached to me and it would be chaotic no matter how gently I tried to let him go. \n\nThen an opportunity presented itself. He saw another escort and fell asleep in his car in her parking lot. He woke up to the police questioning him and searching his car and phone. He cracked under pressure and admitted to paying for sexual services. He told them about me and about her. They chose not to arrest him or press charges, but when he related all the information to me, I decided to seize this excuse to stop seeing him. I told him that for my safety I did not want him to ever contact me again. \n\nAt first he said he understood and said goodbye. And then for the next five days, he bombarded me with texts and emails. He also sent YouTube videos of him crying and begging, snot dripping. Or drunk and begging and crying. Then sober and matter of factly laying out the reasons why my fears about his interaction with the cops was unfounded. More texts, more emails from different accounts. \n\nI responded to none of it. It made me feel even more disgusted by him, honestly. I hoped that he would eventually tire and just go the fuck away. \n\nThen he emailed me a suicide note. I didn't receive it until nearly four hours after he sent it because I was busy working. It stated that by the time I received it, it was already too late to stop him. But then three hours after the email, he sent me a YouTube video suicide note, which seemed fishy. \n\nIt has my already frazzled nerves in shambles. I worried that I could somehow be found responsible if he was found dead and they traced the cause back to me. \n\nI eventually gave in and called the police. I posed as a girlfriend and I hoped it would be a one and done call, but they kept calling me back for more information (I knew his address and full name and vehicle) and they wanted copies of his suicide letters. \n\nThey tracked him down and it turned out he was absolutely fine. He just wanted me to talk to him, and was willing to do anything to make it happen.\n\nI guess the cop successfully conveyed to him that he needed to stop harassing me, because the emails, texts and videos stopped. He did message my friend, but she told him the same thing the cop did - that he had to stop harassing me through her or else we'd go to the police. \n\nI wish I had ignored his suicide note. I feel tricked and I'm still angry about it. ",
    "subreddit": "TrueOffMyChest",
    "title": "I wish I had ignored his suicide note",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5ij2t/i_wish_i_had_ignored_his_suicide_note/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 07:31:30 UTC",
    "id": "1j5i389",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 5,
    "secure_media": null,
    "selftext": "Why the fuck does it. How am I supposed to gain the fucking karma if I can’t fucking comment. Do you really expect me to comment on some fuckass subreddit I have no interest in just to gain karma? What the fuck1?\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "Why does not enough karma to comment exist",
    "upvote_ratio": 0.63,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5i389/why_does_not_enough_karma_to_comment_exist/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 07:28:13 UTC",
    "id": "1j5i1na",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 18,
    "score": 93,
    "secure_media": null,
    "selftext": "My sister (f 30), has been with her baby daddy(m 30) for about 15 years now. He’s very much an abusive, manipulative, disgusting person that feeds off of people’s weaknesses. They’ve been together quite literally half her life, since she was in high school and at the time I was about 12 years old. At first he was an amazing brother in law and did all the cool stuff that comes with the brother territory. Then once I reached 14 all hell broke loose. I won’t go into too much detail but my sister’s baby daddy sexually assaulted me from from the ages of 14 until I was almost 17. Her and I had a huge falling out after the fact due to her denying it ever happened even though she was there for a few of the occurrences. He’s a very violent man and has even attempted to murder a misbehaving dog by strangulation that he had owned. I always had a sneaking suspicion that he had been laying his hands on my sister but after two days ago, my suspicions have been confirmed. A few days ago I got a call from my nana(f 71) stating that the baby daddy had beaten my sister pretty badly. He blackened her eye, busted her lip, attempted to strangle her(he left hand prints on her neck), and beat her in the stomach with a broom handle. In a panic, she managed to get away, escaping to a neighbor woman’s house a few blocks away. After he tried searching for her in his pickup truck, he then called my father and stated she was missing. He even tried filing a missing person report for her. Unfortunately for him, my sister had already contacted the authorities and notified them of the attempted murder. The cops escorted her the next day to get her two children from him and she’s currently in a women’s shelter until my nana can get to her. \n\nI don’t wish what she went through on anyone and I hate that she even had to endure any of that. I can only imagine the turmoil and sorrow she feels. Especially having been with someone for so very long. The problem I’m struggling with is setting aside my pride and being there for her in her time of need. We haven’t spoken in 5 years. At this point we’re two very different people.  I think back to me being that scared 14 year old that no one believed or cared to stand up for. I had messages and physical marks on me at the time and the adults failed me. I know she was a victim too, but it’s hard for me to forget her part as well. Any advice would be much appreciated, but please be kind. Thanks Reddit. ",
    "subreddit": "TrueOffMyChest",
    "title": "My sister’s now ex-boyfriend/baby daddy was my abuser.",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5i1na/my_sisters_now_exboyfriendbaby_daddy_was_my_abuser/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 07:25:40 UTC",
    "id": "1j5i0en",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "Life is so expensive nowadays, and it feels like no matter how hard I try, I will never be able to afford the kind of life I want. Moving out seems like an impossible goal, and even if I manage to get my own place, I worry that I will still be struggling just to make ends meet. When I think about the future, all I can picture is an endless cycle of stress, waking up, going to work, barely making enough to feed myself, coming home exhausted, and then doing it all over again the next day. It feels like I will be stuck in survival mode with no time or money to actually live.\n\nI want more than that. I want to travel, to see the world, to experience things beyond the daily grind, but I cannot afford to. I am happy right now, but I know childhood does not last forever, and that terrifies me. What happens when it is gone? What happens when I am on my own, facing a future that feels like nothing but work and struggle? I do not want to live just to survive. I want to spend the one life I have being truly happy right up until the moment it ends, but right now I cannot see a future where that is possible.\n\nI think I might just join the military so I can feel something, and if that goes well, I could get free college. But I don’t know, everything about the future seems so unappealing.\n\nWhy am I a rainbow Child and why did the condom have to break, I don’t want to be here.",
    "subreddit": "TrueOffMyChest",
    "title": "I really don’t see any point in living past eighteen",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5i0en/i_really_dont_see_any_point_in_living_past/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 07:08:27 UTC",
    "id": "1j5hrwp",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 21,
    "secure_media": null,
    "selftext": "Preface, this happened around the holidays, which is the only time I’m ever around my mom. We have little to no contact outside of when I visit my siblings.\n\nI (26F) told my mom that I think my boyfriend (28M) is going to propose to me.\n\nShe responded with “Can you wait so I can recoup some money after your sister’s wedding?” Not a “congratulations” “i’m happy for you” nothing positive at all. I immediately shut down and stopped talking about it. It’s been on my mind a lot recently because my sister is no longer in that relationship (he was an abusive alcoholic) and my mom doesn’t understand why it’s still bothering me.\n\nI would never allow her to even attempt to pay for it because she would hold it over my head forever. She doesn’t attempt to speak to me or have a relationship with me, she doesn’t speak to him at all, she would try to control everything about it. She honestly probably won’t even be invited at this point, but it deeply bothered me that it was somehow made about my sister.\n\nThis is the same woman that didn’t tell me that my cat had passed after having him for 10 years and refused to even talk about it or acknowledge it when I was upset about it. She has been unkind my entire life, but like.. what?????",
    "subreddit": "TrueOffMyChest",
    "title": "My mom always prioritizes my sister in the weirdest ways",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5hrwp/my_mom_always_prioritizes_my_sister_in_the/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 06:59:44 UTC",
    "id": "1j5hng3",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "Ok! I’ve just gotta get this off my chest…I am still pretty good friends with my ex as we have know each other since 8th grade and we are on good standing. See the problem is that when we broke up it was because he was making some choices that were really not great for our relationship. So, I have gone on several dates as a now single woman after 4 years of dating him and I feel guilty. Like I feel like even though I am single and I have broken up with him it feels like I’m cheating or lying by omission because I have gone on dates and made out with other guys. Like I still care for my ex but unless he can work out his problems I just can’t see a future with him romantically which sucks. I feel like me trying to sort out my feelings and date for fun would crush him if he found out I’ve kissed other men as I had only had one other partner before him. Ugh it’s been eating me alive anyways I just had to get that out to the world and not keep it inside anymore.",
    "subreddit": "TrueOffMyChest",
    "title": "Weird dynamic with my Ex",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5hng3/weird_dynamic_with_my_ex/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 06:56:19 UTC",
    "id": "1j5hlsy",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 3,
    "secure_media": null,
    "selftext": "\nI’m a 23-year-old guy (turning 24 in August), and I feel like a complete failure. Depression has been a constant in my life, and I’m pretty sure there’s something seriously wrong with me mentally. I’ve never sought professional help never in my life. Instead, I’ve coped by abusing drugs like MDMA, LSD, and and ket, weed every single day since I was 14. It’s been my crutch, but it’s not working anymore.\nI’ve never had a real girlfriend, though that’s not even my main issue. The real problem is I can’t stay consistent with anything working out, holding a job, nothing. Today, I was supposed to get up and go to work, but I just couldn’t be bothered. I bailed. It feels like my brain is fighting against me. I’m suicidal 24/7. When I hit these lows, they last about three months, then I get a month of “normal” before it crashes again. Right now, I’m in one of those dark phases, and it’s so bad I’m genuinely debating whether to end my life today. I don’t know what to do anymore.\nMy body’s a mess too I go from fat to skinny and fat to skinny again, stuck in this weird in between because of how depression screws with me. I’ve felt like this my whole life, and I’m terrified it’ll never change. I’m getting older, life’s getting more harder and serious, and everything’s so damn expensive. I have no ambitions, no goals. I never went to school. I blow all my money, I’m in debt, and I live alone. I feel like a corrupt soul. I say I believe in God, but I don’t really. I’m a fake religious person, a fake human.\nMy friends are starting to ditch me because of how I am, and I don’t blame them. I’ve had enough. I feel like death is the only way out of this hell because I can’t imagine dragging this on until I’m 28, 35, or older. It’s already unbearable. My mom’s tried to help me so many times, but she’s given up too. I always end up back at square one, no matter what. I hate myself so much.\nI guess I’m posting this because I’m desperate. Has anyone been here and gotten out? I don’t even know where to start.\n",
    "subreddit": "TrueOffMyChest",
    "title": "I hate myself and feels like I’ve given up without trying",
    "upvote_ratio": 0.81,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5hlsy/i_hate_myself_and_feels_like_ive_given_up_without/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 06:18:51 UTC",
    "id": "1j5h23j",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 3,
    "secure_media": null,
    "selftext": "Its the middle of the night and I've just woken up. I feel guilty. \n\nYesterday I traded my car in for a new truck. The heat wasn't working in my car but the dealership never noticed. I actually went to a few dealerships and none of them noticed the issue,   which seems weird because its winter and I'm in Canada. \n\nSitting down with the salesman, he never asked me if there were any issues with the car and when he asked if they could check out the car I let them. I don't feel like I tried to hide the issue but I really hoped they wouldn't notice. Now that I got my wish I don't feel real great about it. \n\n",
    "subreddit": "TrueOffMyChest",
    "title": "I traded in a car. The heat wasn't working.",
    "upvote_ratio": 0.8,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5h23j/i_traded_in_a_car_the_heat_wasnt_working/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 05:52:45 UTC",
    "id": "1j5gnd5",
    "link_flair_text": null,
    "media": null,
    "num_comments": 58,
    "score": 103,
    "secure_media": null,
    "selftext": "Not to sound whiny or anything. I'm in my early 20s and it wasn't a \"you have 6 months to live\" situation. Super high rate of surviving and all that. I finished my treatment last Fall and now I'm just here, stuck at home, recovering.\n\nI'm alright, physically. And I don't expect people to put their lives on pause just because I got cancer. But it's like I beat it and the moment just passed. I know it's not that important to other people and in the grand scheme of things, it's just a blip in a whole lifetime.\n\nFor me, though, I'm missing out on a whole year of college and it was going to be my last one. I'm at home and depressed, feeling mentally worse than I have in a while. I'm covered in scars on my torso that will never go away. I'm happy I'm alive and all that, but I guess I didn't realize that cancer just isn't a big deal if you live or it's not one of the more well known ones.\n\nI've just got no one to talk to about it, I guess. In a literal sense I do- my friends and my family. But not really. They don't care that much and then I feel like I'm dragging it out. So, I just finished some late night cleaning and now I'm feeling a bit sorry for myself. A little pathetic and I'm not quite sure what to do now. \n\nAnyways, congrats to me for beating cancer! 🎉",
    "subreddit": "TrueOffMyChest",
    "title": "I survived cancer and no one around me really cares",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5gnd5/i_survived_cancer_and_no_one_around_me_really/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 05:47:00 UTC",
    "id": "1j5gk86",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 43,
    "score": 426,
    "secure_media": null,
    "selftext": "I don’t understand, i told you he sexually abused me and all you could say to him was “it’s old, she forgives you. Don’t tell your dad”. \n\nWe all still stay in this house together because you won’t leave him EVEN after i told you what he did to me. \n\nI can’t even leave my room because of him. I’m a prisoner in my own home. 22, with no ID or job. You’re either too “broke” or “busy” to help me get my life in order so i can leave this shithole, but yet you have money and time to buy him beers and weed? \n\nIt’s taking everything in me not to end my own life, my cat is keeping me sane. ",
    "subreddit": "TrueOffMyChest",
    "title": "My mom’s boyfriend raped me from the ages 8-12 and her decision to stay with even after i told her fucks me up so bad.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5gk86/my_moms_boyfriend_raped_me_from_the_ages_812_and/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 05:06:36 UTC",
    "id": "1j5fwwv",
    "link_flair_text": null,
    "media": null,
    "num_comments": 285,
    "score": 6105,
    "secure_media": null,
    "selftext": "Ok. When I first met my girlfriend I noticed she sometimes made misjudgements but I didn’t think much of it. Now that we been together 2 years I realize how stupid she is. That might sound harsh but that’s the only word I can think of. We will go downtown to some place she wants to go and she will walk down a street and be like “oh wait wrong way” then walk down another street and be like “oh no wrong way” then walk down another street and be like “oops wrong way again”. It’s horrible, she has no sense of direction and I feel so stupid following her around.\n\nShe also talks in circles which makes me so angry. Like for an example yesterday she asked me, “do you want a burrito for dinner?” Then I replied we don’t have the ingredients for a burrito so I’m going to eat the food we have in the house. She then asks, “oh so you don’t want a burrito?” So I thought maybe she bought ingredients for a burrito so I said sure I’ll have a burrito. She then says, “ok but we don’t have the ingredients for a burrito”. Like YES I KNOW THAT.\n\nHer stupidity makes me treat her worse which I hate because I don’t want to be rude to people but sometimes the way she talks and acts just infuriates me. I also feel more slow and held down when I’m with her. Like when she makes a dumb decision I’m usually around her so I have to help her correct her mistake. \n\nAnytime I do something alone I feel a huge wave of happiness go through my body because I don’t feel held back from her behaviour. Overall she’s a good person but I honestly don’t think I can continue a relationship with her. Her misjudgments cause me so much financial loss and general stress. ",
    "subreddit": "TrueOffMyChest",
    "title": "My girlfriend is beyond stupid and I feel like I might have to end the relationship",
    "upvote_ratio": 0.9,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5fwwv/my_girlfriend_is_beyond_stupid_and_i_feel_like_i/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 05:04:42 UTC",
    "id": "1j5fvs8",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 2,
    "secure_media": null,
    "selftext": "I’m 15(f) and I live with my “parents”. I have this wonderful dog named Richy, he’s the best thing that ever happened to be but my parents have a rule where he can’t go inside the house, he’s an outside dog. It’s been raining a lot where I live- I’m talking like crazy winds and rain. I asked multiple times if my parents can let Richy in because he can get cold and lonely out side and the response I get every time is “no, don’t ask again” or they say I’m being dramatic about him and that he’ll be fine. To mention Richy has a little space under the balcony and in the laundry room which is right underneath the balcony but it’s still very cold there . I think the way my parents treat Richy is unfair there have been multiple occasions where Richy has gotten hurt and has been neglected, for example when he was a puppy a brick fell on his paw and he was limping for weeks and my dad refused to take him to the vet. As I’m typing this the rain is getting far worse and the wind is howling.To all the dog owners out there do you guys leave your dog out in the rain? ",
    "subreddit": "TrueOffMyChest",
    "title": "Am I being over dramatic about my dog?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5fvs8/am_i_being_over_dramatic_about_my_dog/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 05:01:13 UTC",
    "id": "1j5fth6",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 26,
    "secure_media": null,
    "selftext": "First of all, I want to apologize for my poor English since I’m doing this through a translator. I’m a 19-year-old guy who has had pectus carinatum his whole life. It has brought me a lot of teasing and stares, and even though I have the mildest case, I have a small banana-shaped protrusion on my sternum. I’ve wanted surgery since I was 14.\n\nAs a first option, they wanted me to wear a compression brace for a year, which is complete nonsense. I knew it wouldn’t fix what I have, and even the doctor said so. I fought for years to get surgery until one day they took me to the sub-capital to see a doctor. The doctor told me it was a very mild case and that the surgery was very simple: they would cut two cartilages, push the sternum inward, and that was it. This happened in June 2024. I was very excited about the idea of having a normal chest.\n\nMy experience with this condition has been horrible and has caused me a lot of insecurity. Every time I wear a t-shirt, the lump is noticeable, making me look much fatter than I actually am. I’ve been training for five years, and it’s horrible to see how I can’t make progress in my chest because this damn protrusion sticks out—it’s all I’ve seen in the mirror for five years.\n\nGoing back to what I was saying, my parents postponed the surgery until 2025. I got angry with them and gave them an ultimatum: “Either I get the surgery, or I leave the house.” I want to clarify that this was the only thing I was asking for, the only thing I wanted. I’m the youngest child, and I have a 29-year-old sister who is studying her second degree because she realized that the first one wouldn’t get her a job. My father has always helped her with her apartment and university expenses. I’ve always known she was the favorite, and I wasn’t asking for much—just this surgery.\n\nToday we went to see a doctor in our city, and instead of agreeing with the previous doctor, he said they would have to break my abdomen, cut all the cartilage, and insert a prosthesis. I suspect this was all planned because my father is a doctor, and I have a feeling he talked to this doctor to make me change my mind or to have an excuse to say no. I walked home because I was so angry at them. I’ve been fighting for this surgery for about five years, and they found the perfect excuse to deny it.\n\nTonight at dinner, I ate in my room. I’m so tired of them—they are the most vile, cruel, and arbitrary people I know. I hate them for making me go through my entire adolescence and now my adulthood with this lump in my chest just because they don’t want me to have surgery. They have no idea how much I’ve suffered or how much I wish with all my heart to die. I wish I could just wake up one day and no longer exist in this horrible world. I hate the parents I got, and I hate my sister for being the favorite. If I could, I’d take a gun and blow my brains out so I wouldn’t have to endure this anymore—but I will make them pay. As soon as I get a job, I’ll leave this place and never speak to them again. When they’re old, I’ll put them in a nursing home—and I’m being generous. I should let them rot in their own filth.\n\nI’ll update if there’s any news.",
    "subreddit": "TrueOffMyChest",
    "title": "I hate my parents for not letting me have surgery for pectus carinatum.",
    "upvote_ratio": 0.86,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5fth6/i_hate_my_parents_for_not_letting_me_have_surgery/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 04:56:11 UTC",
    "id": "1j5fqf1",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 6,
    "score": 3,
    "secure_media": null,
    "selftext": "I don’t have anything going for me. Nothing at all. I no longer have any dreams or ambitious.  People who say “you aren’t damaged” are lying; but I only see that in movies. No one actually cares in my life.\n\nI am so tired of waking up. My self esteem is shot so I don’t go out. Bullying from my dad, family, school, people I just care about and shit. Its so engrained in my bones. My friends never told me I was mean to them, I was teased at home. I thought it was normal.  But its just kinda settling in just how abused I was. I am broken. Theres no way out for me. The life I want to have is impossible. Nonexistent. And everyday I blame myself for it.\n\nI find myself thinking of death more often. Realizing the few friends I have shouldn’t have to deal with my messiness. I am suppose to be an adult, but Im so childish. Im a failure just like all my nothing ass brothers and sisters. I just  hope when I have the nerve to finally end it they are worse off than me.\nIm evil and Im bitter. They destroyed it. We could’ve been a family. But it was easier to hate and abuse instead of just getting rid of me and I just ended up hurting people I cared about most.\n\nIm sorry my friends whom have forgotten me. I didnt know I was being abused. I didnt realize I was hurting you so badly; but I wish you could’ve told me, but its also my fault for nor providing you a safe space . I hope when or if you see my missing posters; or obituary(tho I doubt I’ll have either) my demise makes you smile and alleviates and hatred you have for me.\nI never forget your faces or your voices. ",
    "subreddit": "TrueOffMyChest",
    "title": "Im a loser and honestly I feel I deserve it",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5fqf1/im_a_loser_and_honestly_i_feel_i_deserve_it/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 04:46:16 UTC",
    "id": "1j5fkiv",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 0,
    "secure_media": null,
    "selftext": "My partner (20NB) wants to get my (19F) name tattooed. We’ve been together almost 3 years at this point. My opinion is that they should wait, if even getting it at all. I have every intention of staying with them but I couldn’t in good conscience let them get my name tattooed this young. They’re upset coz they’ve been wanting to do it for like a year now and I keep saying wait. I’d prefer if they did it for us to at least be married but they don’t want to wait that long. I suggested maybe a few years nd they got upset. Idk I don’t think I’m wrong for this. I wouldn’t feel good about letting them do something I myself wouldn’t even do right now, although they’ve said they don’t care if I get theirs tatted or not",
    "subreddit": "TrueOffMyChest",
    "title": "My partner wants to get my name tattooed",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5fkiv/my_partner_wants_to_get_my_name_tattooed/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 04:44:45 UTC",
    "id": "1j5fjlk",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 3,
    "secure_media": null,
    "selftext": "Every time I get close to someone, my mind starts obsessing over them, and I absolutely hate it. This is the third time it’s happened, and I feel like it’s destroying me because, with the first two, I ended up pushing them away, and we eventually became strangers again.\n\nRight now, I’m obsessing over a really close friend in our small friend group of three. We’ve known each other for almost three years, give or take, and we’re so close we even refer to each other as “siblings.” But recently, something changed ad I've started obsessing once again. I can’t stop thinking about them. I always want to talk, hang out, or just spend time with them. And when they spend that time with someone else, I get jealous to the point where it physically hurts and I even feel betrayed in a way.\n\nBefore you think I’m completely nuts, I know this isn’t okay. I don’t start arguments, and I never tell them how I feel because I know I don’t have the right to control who they spend time with or talk to. I would never want to make them uncomfortable or make them feel like they owe me anything. But that doesn’t stop the thoughts from eating me alive. I cannot help but wish I had them all to myself.\n\nSometimes, instead of hanging out, I’ll say, “I’m tired” or “I don’t feel like going out,” when in reality, I do want to spend time with them—but I just can’t handle it mentally. So instead, I drive alone late at night, trying to escape the overwhelming thoughts.\nI don’t want to lose yet another person because of my own obsession. I am trying my best to stop, but so far, I’ve made little to no progress.",
    "subreddit": "TrueOffMyChest",
    "title": "I hate how I obsess over people I care about, and it’s ruining me.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5fjlk/i_hate_how_i_obsess_over_people_i_care_about_and/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 04:43:06 UTC",
    "id": "1j5fikp",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 5,
    "secure_media": null,
    "selftext": "I didn't care how much sleep I lost each night. I never got tired of hearing her voice, or seeing how pretty she looked each time she smiled or laughed. I wonder if she knew just how beautiful she looked when she talked about something she loved. Everything with her felt new and exciting as if I was experiencing love for the first time all over again. \n\nThe nights are too quiet now. I still check my phone, knowing her name won't appear. I scroll through old messages, replaying our conversations, and wonder if she thinks of me. If she does, I hope it brings her a smile, the way those memories always do for me. And if not, that's alright too. Because I know, in that time, we shared something truly special, a spark of pure joy that I'll always cherish. \n\nI don't know when or if I'll ever see her again, but I know this for sure: she was one of the best moments of my life. I hope she knows that she is still deeply loved and profoundly missed.",
    "subreddit": "TrueOffMyChest",
    "title": "The nights are too quiet now",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5fikp/the_nights_are_too_quiet_now/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 04:37:17 UTC",
    "id": "1j5ff3g",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 15,
    "secure_media": null,
    "selftext": "my family has fallen on rocky times. my dad lost his job a number of years ago and picked up a job in a new field that he also recently lost. \n\nmy mom is the only one with a stable income and i try to help as much as i can but she confided in me that unless my dad goes back to work before his government assistances runs out that we’re probably going to have to sell the house i’ve grown up in and lived in my whole life \n\ni’m very scared that we’re going to have to sell and move.\n\ni also have pets which is scaring me that we might have to rehome them if we have to move. \n\ni’m terrified my whole life is going to change and im not ready for it. i’m hardly an adult, this is all so much and im genuinely terrified and worried about what could happen",
    "subreddit": "TrueOffMyChest",
    "title": "my mom just confided in me that we might have to sell my house",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5ff3g/my_mom_just_confided_in_me_that_we_might_have_to/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 04:34:14 UTC",
    "id": "1j5fd9g",
    "link_flair_text": null,
    "media": null,
    "num_comments": 21,
    "score": 0,
    "secure_media": null,
    "selftext": "From now on I will force myself to think of lesbian stuff as disgusting. I will no longer engage with any of that sinning behaviour and I will find my way back to Christ. I will remind myself that it is gross, it is sinful, and it is dirty. This behaviour is mutant-like and abnormal. As of now I still feel no attraction for men but I will get there through Christ for heterosexuality is natural and normal.\n\nI was lucky to be born Catholic. I was lucky to have been taught what sins are from early on to avoid the consequences that include eternal suffering. This is nothing but another trial. This is the only way to be accepted by Christ and my family. I will choose to keep the peace in my family. I beg for forgiveness from the lord for I have strayed. I was wrong for being tempted by the devil. Although I will not harm anyone else, gay is gross.",
    "subreddit": "TrueOffMyChest",
    "title": "From now on I am no longer into girls as a girl. I am going back to Christ and I strive to be homophobic to myself.",
    "upvote_ratio": 0.26,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5fd9g/from_now_on_i_am_no_longer_into_girls_as_a_girl_i/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 04:31:05 UTC",
    "id": "1j5fbdy",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 5,
    "secure_media": null,
    "selftext": "You weren’t happy with me. It felt like whatever I did would never make you happy. I hadn’t felt loved by you in a long time. You say you love me, but why didn’t you act like it? I tried to show you love and you didn’t want it. There’s only so much I can do before I can’t anymore. \n\nYou say you miss me. But you never talked to me. You hid all your feelings from me. We’d go to therapy and it felt like an attack on everything I did. It felt like anything and everything I did was wrong. \n\nI was always the one in the wrong. \n\nBut what about the things you did that hurt me?\n\nYeah I’m good at compartmentalizing. I’m good at bottling up my feelings to make others comfortable. It didn’t feel like you cared that I was doing it since it gave more room for you to talk about how you were feeling. \n\nI gave so much of myself to you. \n\nDid you really love me?\n\nOr did you just love the idea of me?\n\nSomeone to listen to you and ask how your days were and what? Why didn’t you do that for me? I wore myself out trying to make you happy. Happy with me. Happy with you. Happy with literally anything. I couldn’t do it. \n\nI miss the days that we could sit and talk for hours. I miss the days that you would smile when you saw me. I miss the days that felt like you truly loved me. I miss the days that we were actually friends. \n\nBut maybe it wasn’t real. Maybe it was the attention I gave you? Or the gifts? Or maybe I was a distraction? Something shiny and new. Uncharted territory. I don’t know. \n\nI don’t know what you’re telling people. That I broke it off? That I did this and that and whatnot? You blocked me so it’s not like I can try to support you. Not that you were accepting of my support over the last year plus. I really tried. And it felt like you just didn’t care. \n\nI shouldn’t have looked you up on here. I noticed you blocked me days ago. You didn’t tell me where you were moving-not that it’s my business, but it really sucks being completely blocked out by someone who is saying they love me. \n\nLoved me. \n\nMy heart hurts. And I can’t even talk to my best friend about it. \n\nYou wanna know why I’ve been talking to her? Because my world revolved around you. I stopped talking to my friends. All of my friends. Because you were my world. But I was just a bother to you. An annoyance. A burden. \n\nI needed someone to talk to and she messaged me. She wasn’t a bad person so I don’t know where you got that from. If anything, I was the bad person in that situation. I let you be mean to her. I let you do what you wanted because I thought you were my forever. But you didn’t think I was your forever. You don’t treat your forever the way you treated me. How are you so okay with just disappearing on me?    \n\nI truly hope you can find happiness. I wasn’t the one for you and that’s okay. I hope you can show love to the next person you find. Not as a rarity, but strong and unwavering. Love them with everything you have, because you deserve love and to love. \n\nI just wasn’t enough. \n\nI wasn’t ever going to be enough. \n\nI just wish you’d have told me sooner. ",
    "subreddit": "TrueOffMyChest",
    "title": "Hurt",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5fbdy/hurt/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 04:21:46 UTC",
    "id": "1j5f5h7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 8,
    "score": 0,
    "secure_media": null,
    "selftext": "Basically as the title says. I(29f) have always had a smaller butt. I’m curvy and I look like I should have a big butt from the front, but I just don’t. I have big boobs and nice curves, but this one thing just keeps me honestly hating myself, especially with how worshipped big butts are in today’s world. Sucks for us little butts due to genetics. Sometimes it’s honestly made me not want to live because the love of big butts is all over the media, and is the beauty standard. My husband tells me he loves my butt, but I know deep down he probably wishes I had more. ",
    "subreddit": "TrueOffMyChest",
    "title": "I’m so insecure about my small butt in a world of bootylicious peaches",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5f5h7/im_so_insecure_about_my_small_butt_in_a_world_of/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 04:14:46 UTC",
    "id": "1j5f159",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 7,
    "secure_media": null,
    "selftext": "Basically the title, I 22F am going to visit the city I’ve always wanted to move to. I want to visit not in a tourist way but staying in the areas where it would make sense for me to live in. I will decide if it is a fit for me and if it is I will start going around and looking for jobs. I have an idea how to get a place there (finding a sublet for a few months and eventually trying to lease). I have lived in a similar city so I have an idea of how to go about it. I currently live with my dad and I have come up with a complete lie to tell to him I am visiting my college town to see friends for a birthday. I am going 1000 miles away from there 😭 I have lived with my dad for the last year and I’ve enjoyed it but I need to be alone, I feel like an adult and I want to act independently and be able to be myself. I just feel like he will be angry that I am going to this city when I live with him because if I can afford to do this then I should be helping out more. I will be honest I partially took a term off so I could focus on moving out because I find this more important at this point in my life. I do not think I can be open about it since the city seems “unrealistic” in his eyes. The last time I moved when I went to college he said “you’ll be back in a year” and when I had to move back due to tuition issues he said “I told you so.” I didn’t stay with him for long that time but I bounced back. This time when I move I wouldn’t have to worry about tuition, I would be focused on making sure I make 3x or more on rent (which is why IF I like it I will be looking at jobs) and be able to figure my life out as woman in my 20s. I am so excited, I guess I wanted to share my excitement to go with someone so I’m doing it with the internet. I know this sounds like I’m more anxious which I am but I know I’m doing the right thing. ",
    "subreddit": "TrueOffMyChest",
    "title": "I’m going to visit the place I’ve always wanted to move to and I’m not telling anyone",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5f159/im_going_to_visit_the_place_ive_always_wanted_to/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 04:11:27 UTC",
    "id": "1j5ez5s",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "i honestly really should probably talk abt this bc it honestly was actually pretty tramuatizing, enough that i feel like i may have locked away some memories of what happened bc of just how awful some of the experience was\n\nmy memory is somewhat spotty bc of how scary it all was but ill try my best to explain\n\nmy friend had a Halloween party at her house\n\nwe decided to play something that involved running, which was a rather stupid decision as everything was slippery and dark outside\n\ni was running near/on ground that was steeply raised up a bit for a buliding to be bulit flat on\n\ni slipped and fell, despite the mud, when i instinctively reached out to brace myself by putting my hand out towards the top of the small slope i got hurt, really really badly, i had never been in such pain before, i dont remember how quickly it arrived exactly but it was pretty quick to show up\n\ni started crying a soon as the pain hit and the girl i had been running behind took notice and from what i can remember asked if i was ok, the other girls i was playing with eventually noticed and the escorted me to the house and to my friend's mother who is a vet/vet tech\n\nshe wrapped it in blue vet wrap in the kitchen and asked if i wanted to go to the doctor, and child me refused out if fear of possibly having to get surgery and probably bc i didn't want to inconvenience anyone, the vet wrap was uncomfortable and irritating but honestly the splint i got for a broken foot abt 2 years ago was worse, and it was by an er doc too, and while child me had to experience that awful splint, the vet wrap did make my hand feel better, i felt like i could pick it up and move it safely\n\nso i ended up staying inside sitting on one of their couches in the living room and resting my arm on the arm supports, watching tv with my friend's mom, i wasnt rly interested in the show but that was the least of my worries then, i think at one point she brought me food, like a hotdog or smth, which had ketchup bc my autistic ass wouldn't eat meat unless ot had ketchup on it\n\nthe other girls went outside after everything calmed down somewhat, tho my friend stayed a bit longer from what remember to make sure i was ok\n\neventually they came back inside for an event i forget if it was planned or started bc it was dark and I was stuck inside\n\nbasically it was a game where someone would get wrapped on toilet paper to become a mummy, they included me in it by loosely wrapping parts of my arm/hand that i was willing to move\n\nand then we eventually all went home, i dunno when any of this next stuff happens exactly but ill try to explain it in order\n\ni was cyberschooled then and at first i was fine... until i needed to write something, im right handed and my right hand was the one that was injured\n\ni remember my mom yelling at me because i refused to use my right hand and i think i asked if she could write for me, she told me to use it and i remember crying and saying \"I cant! I cant!\" i tried to move it even slightly in order to try obeying what she said but the pain was terrible, horrendous, unbearable, i cant think of words that can extensively describe how much pain i was in\n\ni dont quite remember it all but i think when i tried to use my left hand to write i was yelled at too, and my mom minimized my pain by saying smth along the lines of \"it isnt that bad\" and i was also condescendingly asked if i wanted to go the doctor which i again refused fearing surgery and also bc having my parents yell at me made me upset\n\nall this time i remember i still had that blue vet wrap on, my hand was shaking and in so much pain, i forget if my mom did the usual \"let me feel it\" thing but if she did i most definitely refused and probably yanked it away, based on the fact I still had that vet wrap on i think it was probably the next day\n\ni was allowed to write with my left hand but not without being scolded, i remember writing down things in notebooks for fun with my left hand, and i even decided that a character id made had my left hand's handwriting, i eventually got better writing with my left hand and honestly really had fun with it\n\nwhile i wrote and did things with my left hand i also did not use my right hand or bend my wrist, at least i did as little as possible, i kept on using the vet wrap to stablize it until it wouldn't stick no more, then i found some wrap i has gotten from when i sprained my leg and so i it instead, and remembered how i treated my sprained leg, used that was refrence for resting my hand and also didn't move it bc it was painful\n\ni dont remember much else abt the recovery, i think i stopped wrapping it and started using my right hand again as soon as the pain lessoned, which probably was after like a month or two perhaps? ik it takes longer for a broken bone to recover but the pain does go away pretty quickly honestly, i remember my mom expecting me to recover from my \"sprain\" in about a week and was upset i still refused to use it and instead write with my left hand\n\ni did keep on writing with my left hand sometimes for awhile after that just for fun, which ironically probably helped my right hand recover lol\n\ni dont quite know how long after it was but i think it was a decent chunk after but within the same year, i once again slipped and fell and i forget which handi landed on but based on the pain and how caught myself (the same way again) i think it was my right, which i once again assumed was a sprain, but only a minor one, so i again pulled out the wrap i had and i think for abt a day or 3 days wrapped my hand, i remember not having much pain and wondering if it still needed wrapped the next day, but i still ended up keeping it on i think\n\nand until i was a teen it never hit me that the pain i feltin my bones was not a normal sprain thing but probably a broken bone, and it really hit me after a horse broke my foot 2 years ago that yea, that probably wasnt a sprain... bc like it was while less pain, that pain i got from my broken foot felt literally like a lesser version of the pain i felt in my hand when i was a kid\n\ntbh im not completely sure if i did break my hand as ive never rly had it inspected for past breaks, unlike my foot it doesn't rly act up when the weather changes or from overuse etc, at least i think so? i never rly took notice of anything like thay as a kid because i was never aware or looking for anybpain related to broken bones, so im open to anyone suggesting its something else, not for legitimate medical advice as well, ik i shouldnt get it from here and its already healed, just out of curiosity, i wonder if it was like a pinched nerve maybe, but it didnt feel like one at all (ive unfortunately had and continue of have pinched nerves in my neck 🙃)",
    "subreddit": "TrueOffMyChest",
    "title": "I treated my for a broken hand/wrist as a kid and didnt know/realize it until i was older (very long read oof)",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5ez5s/i_treated_my_for_a_broken_handwrist_as_a_kid_and/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 04:02:45 UTC",
    "id": "1j5etqw",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "Strange title, I know, but I dated this guy in high school, and at the time I didn't think I was in love with him. The thing is that every guy I've been with since him hasn't measured up. He's the guy I compare every other man to. He's the only person in my 31 years of life that actually made an effort. He always respected me and my boundaries. He accepted everything about me. He's the only guy to actually plan a date with me rather than putting in the minimum effort of asking me which restaurant I want to go to. I broke up with him because I didn't feel like I was good enough for him. He was on the football team and I was an awkward emo kid. I blew him off at first because I had been asked out by another football player as a joke a couple weeks prior. So for our entire relationship I just kept waiting for him to reveal that it had all been a joke too. My first real kiss was an uncomfortable situation that felt pressured and forced, and I know that had it been with him it would have been so natural. I lost my virginity to someone who had zero respect for me who broke up with me because his dad said he should play the field. Itbshould have been him. I married someone abusive and ended up divorced by the time I was 27, and now I have a child with someone who I live with and still only see on weekends most of the time because he would rather play videogames all night and sleep all day than actually put in effort with me and our child. Hs bf and I hooked up years ago when we were between relationships and I psyched myself out again thinking I wasn't good enough and ended up blowing up on him over something that could have been easily talked through. I know that we are both adults and therefore totally different people now, but I find myself thinking quite often weather the new him would like who I've become. I'm so badly damaged by a string of toxic men when I had the perfect guy for me and screwed it up multiple times. He's my one that got away, and it's my fault because I pushed him away.",
    "subreddit": "TrueOffMyChest",
    "title": "I realize now I loved my first bf",
    "upvote_ratio": 0.4,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5etqw/i_realize_now_i_loved_my_first_bf/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 04:00:17 UTC",
    "id": "1j5es1z",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "Autistic af &amp; feeling ...emotions? \"Happy\" has always felt fake. I feel very happy &amp; can't process it.\n\nDude fixed one thing I hated about myself &amp; now I'm GOING CRAZY trying to ... like... idk, accept the exception of contentment &amp; warmth?",
    "subreddit": "TrueOffMyChest",
    "title": "I got my tat fixed &amp; feel.... REALLY feel things",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5es1z/i_got_my_tat_fixed_feel_really_feel_things/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 03:30:15 UTC",
    "id": "1j5e89y",
    "link_flair_text": null,
    "media": null,
    "num_comments": 29,
    "score": 0,
    "secure_media": null,
    "selftext": "Please pause the pitchforks. We listen and we don’t judge. \n\nI (25F) accidentally hooked up with my cousin (38M) a decade ago. We didn’t grow up close, we barely even knew each other. One summer, I was visiting extended family, and he invited me out. Things got wild, we blacked out, and when we blacked back in… well, let’s just say we were already mid-hookup.\n\nMorning-after panic set in. He was married, so we never spoke about it, and I went back to my city. End of story. Or so I thought.\n\nFast forward 10 years. Out of nowhere, I get a call from him. Turns out, his life imploded spectacularly—divorce, addiction, hitting rock bottom. I had no clue, since we live in different countries now. He needed a fresh start and asked if he could crash with me for a couple of months.\n\nAnd, well… we fell in love. Not drunk, not an accident this time—real, actual, “I-want-to-build-a-life-with-you” love. We’ve been together for two years now, still long distance, but talking about marriage.\n\nI want to come out to our friends and family but he thinks it’s not a good idea. We are not going to reproduce so I don’t see any logical problem with it.\n\nWhat even makes a relationship “normal”? We didn’t grow up as family and if we had matched on Hinge instead of a DNA test, nobody would care.\n\nAm I wrong?",
    "subreddit": "TrueOffMyChest",
    "title": "I’ve been in a long distance relationship with my cousin for 2 years and I don’t think it’s weird",
    "upvote_ratio": 0.24,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5e89y/ive_been_in_a_long_distance_relationship_with_my/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 03:16:29 UTC",
    "id": "1j5dysx",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "At school a kid was pushing me and messing with me. I honestly didn’t care that much, but for some reason, I just reacted and slapped him without really thinking about it. I wasn’t even mad, so I don’t know why I did it. Now I feel bad and kind of confused about why I reacted that way. Has anyone else ever done something like this without meaning to? Why does this happen",
    "subreddit": "TrueOffMyChest",
    "title": "I reacted without thinking and slapped someone. Has this happened to anyone else?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5dysx/i_reacted_without_thinking_and_slapped_someone/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 03:15:31 UTC",
    "id": "1j5dy51",
    "link_flair_text": null,
    "media": null,
    "num_comments": 815,
    "score": 14353,
    "secure_media": null,
    "selftext": "I (32m at the time) am a big dude of 2m and 120 kg (6'6\", 250 lbs in drunk pirate units) and had to have surgery on my calves because of varicose veins. So the day of, I was told to get completely undressed and put on the generic open back gown, which due to my frame made me look like Donald Duck, if you know what I mean. I was led to the or by a nurse and placed on a cold metal table. They administered some local anesthesia to my legs and after about 10 minutes laying naked in a cold, brightly lit room waiting to be sliced up, the 2 doctors strolled in. I was very anxious, cold, and self conscious, so I just stayed still.\nNurse: Anesthesia was given, patient ready.\nDoc1: (walks to the table) wow, big fucker and such a small dick.\nDoc2: Haha.\nMe: WHAT???\nNurse: (panic) oh no, you have the wrong patient file, this one isn't the fully sedated one. He is awake.\nDoc1: ...\nDoc2: ...\nMe: WHAT???\nSo yeah, nobody said another word to me for the rest of the operation, just 200 decibels of awkward silence while they ripped veins out of me. It felt like Ricky Gervais wrote this scene. I should have walked out, but I was too shocked to even think. When they were done they exchanged quiet words with the nurse and quickly walked out. It was a bit shocking, but I quickly laughed it off.\nI mean, they weren't WRONG, but man... Some people.\nEdit: this was 10 years ago, I am fine. ",
    "subreddit": "TrueOffMyChest",
    "title": "Surgeon made fun of my penis",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5dy51/surgeon_made_fun_of_my_penis/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 02:57:43 UTC",
    "id": "1j5dlzv",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I've just come out of a 3 and a half year relationship that has resulted in two beautiful children. My ex fell out of love with me and decided to call it quits. I don't blame her, I've struggled with my mental health and been more than a little complacent with my management of it.\n\nWhile I'm not ready for a new relationship any time soon, I struggle to see how anyone would want to be with me in the future. A single dad of two. I feel like they'll assume something is wrong with me. Like, \"Oh he has two kids and they still left him, what would I be getting into? Red flag.\" or \"Why is he single? Why didn't they want a family with him in the end?\"\n\nI honestly just feel like my dream of a stable relationship or a full, happy family is just dead and buried and don't know how to feel about it. I don't feel desirable or attractive and I feel like my situation puts me at a disadvantage.",
    "subreddit": "TrueOffMyChest",
    "title": "I don't feel like anyone will ever want me again",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5dlzv/i_dont_feel_like_anyone_will_ever_want_me_again/"
  }
]