[
  {
    "postId": "t3_1j5etqw",
    "title": "I realize now I loved my first bf",
    "content": "Strange title, I know, but I dated this guy in high school, and at the time I didn't think I was in love with him. The thing is that every guy I've been with since him hasn't measured up. He's the guy I compare every other man to. He's the only person in my 31 years of life that actually made an effort. He always respected me and my boundaries. He accepted everything about me. He's the only guy to actually plan a date with me rather than putting in the minimum effort of asking me which restaurant I want to go to. I broke up with him because I didn't feel like I was good enough for him. He was on the football team and I was an awkward emo kid. I blew him off at first because I had been asked out by another football player as a joke a couple weeks prior. So for our entire relationship I just kept waiting for him to reveal that it had all been a joke too. My first real kiss was an uncomfortable situation that felt pressured and forced, and I know that had it been with him it would have been so natural. I lost my virginity to someone who had zero respect for me who broke up with me because his dad said he should play the field. Itbshould have been him. I married someone abusive and ended up divorced by the time I was 27, and now I have a child with someone who I live with and still only see on weekends most of the time because he would rather play videogames all night and sleep all day than actually put in effort with me and our child. Hs bf and I hooked up years ago when we were between relationships and I psyched myself out again thinking I wasn't good enough and ended up blowing up on him over something that could have been easily talked through. I know that we are both adults and therefore totally different people now, but I find myself thinking quite often weather the new him would like who I've become. I'm so badly damaged by a string of toxic men when I had the perfect guy for me and screwed it up multiple times. He's my one that got away, and it's my fault because I pushed him away.",
    "score": "0",
    "comments": "0"
  },
  {
    "postId": "t3_1j5es1z",
    "title": "I got my tat fixed & feel.... REALLY feel things",
    "content": "Autistic af & feeling ...emotions? \"Happy\" has always felt fake. I feel very happy & can't process it.\n\nDude fixed one thing I hated about myself & now I'm GOING CRAZY trying to ... like... idk, accept the exception of contentment & warmth?",
    "score": "1",
    "comments": "0"
  },
  {
    "postId": "t3_1j577p6",
    "title": "I waited for more than 20 years for this result and I am not happy",
    "content": "English is not my first language Format from mobile All my life I felt like I was weird, I felt like I forgot things, that I couldn't empathize with people, my imagination was strong when I was a child and that's why I felt like no one could understand me, I'm currently 30 and after so much time I received the test that finally removed my doubts about what condition I had, I would believe that I had some kind of autism because of my behavior, but what I discovered left me devastated and I don't feel like I can talk to my family about it. I have mild cognitive impairment and although there are guarantees that I can continue with my life, the truth is that with the pace of life I lead it feels very difficult, I don't have the family support that I would like and at this moment if I tell them my condition they will use it to criticize me instead of supporting me, I feel like a failure for not being able to do what others could, what I expected was some guidance and now the only thing I hope is that I don't develop Alzheimer's or Dementia and lose the memories or what I once was I simply feel that I lost something and although for many it is insignificant, for me it was  One of the hardest news I have ever received in my life.",
    "score": "3",
    "comments": "0"
  },
  {
    "postId": "t3_1j44jhj",
    "title": "Today is the day that I drop the charges against my rapist",
    "content": "20 years ago, I was a stupid teenager in love. My boyfriend was 23 and I was 16. Things started out great, but they progressively worsened as he introduced me to drugs. By the end of it all, I was working for an escort agency, giving the boyfriend my money. I was bullied and forced into fucking old men and I was scared to leave my relationship. My parents finally found me (I had run away) and managed to get me help. I turned things around and ended up doing well in life. I never told anyone what had happened and I had planned to take it to my grave.\n\nFast forward 15 years (5 years ago), a detective knocks on my door. He wanted to know about my ex and the sex trafficking. I reluctantly spoke with him and agreed to do some recorded phone calls at the police station in order to get a confession. I also turned over my high school journals that detailed the abuse and rapes. We recorded a two-hour confession that detailed everything. It felt like a slam dunk. That was 2 years ago.\n\nGuys, it's been 5 years and I am tired. I am tired of waiting 3-6 months to hear back from the detective. I'm tired of having to tell and retell my story to different detectives. The further I get away from it, the less I remember, and the less credible I sound. I'm tired of worrying about my safety, and if people will even believe me. And I'm tired of getting my hopes up, only to hear back from the DA that they're working on more pressing matters. I get that my case is \"old news\" and not a priority. I don't begrudge the detectives for prioritizing more current, relevant cases. But I'm tired of advocating for a win that I don't think I'll ever see.\n\nSo today, I will be emailing the detective and asking them to drop the case. I wanted to hang on because I wanted to get this dude on the sex offender registry, so that other girls wouldn't have to go through what I did. But I can't be a martyr and sacrifice myself any longer for this cause.\n\nI have no one to talk to about this. And I just need to say that I'm sorry, and I tried :(",
    "score": "922",
    "comments": "95"
  },
  {
    "postId": "t3_1j5ecgo",
    "title": "Am I a horrible person",
    "content": "I agonize over my life. I am officially married but basically no relationship or sex in about 5 years.  My husband is bipolar and treats me like crap even though I am the sole supporter in a tropical country.  I have a business and work my ass off to support my legal husband and 23 year old daughter. She works now so not so much support. While in my home country I stay with a friend of the opposite sex and pay rent albeit not anywhere near market rent. When I am in my home country I pay my way.  But my “friend” definitely likes me. He made advances on me and because he did so much for me I almost felt to secure my life I needed to reciprocate or I would be on the street. My “husband” has never shown me he really cares. He is bipolar and I was emotionally and physically abused for years. I met my friend and moved in.  I run a business in my home country and travel back a lot to tend to biz.  I never wanted a relationship with anyone but felt guilted into it or I would be on the street. I could not afford an airbnb and needed to stay with my friend. Well he made advances and me feeling pressured went along with it to secure my and my family’s well being. I care about this person a lot but am not willing to give up my life in my tropical country.  I have 5 dogs that I cannot take to my home country and could not afford to live there. So I let the relationship continue. I feel major guilt every single day of my life. I do not want to lead this other relationship on but know I will be homeless when i go back.  I broke it off because the guilt was too much but he still is hanging on hoping I come back. I want to live in my home in my tropical country with little to no stress with my dogs. My husband and I have separate rooms and do not have any intimacy for at least 5 years. My issue is my husband has worked really hard to improve. He is an asshole but less and less. My “friend” in my home country is a good guy but very insecure. I do not want to hurt anyone but it is inevitable. He does things for me without me asking and then holds it over my head. I am so torn. He lives in a dog free building so no way to take my babies there. I don’t know what to do. I never wanted this chaos. My life is upside down. I want to just do myself in and end it but my two kids 23 and 30 are my best friends and their lives would be destroyed so thats just not an option. I hate my life so much. I want my kids and my dogs. I wish my life was easy.",
    "score": "0",
    "comments": "0"
  },
  {
    "postId": "t3_1j52ns5",
    "title": "My best friend told my biggest secret",
    "content": "I (19M) am bisexual. About two years ago, I fell in love with my best friend, T (now 19M). I knew he wasn’t into men, so I tried—and succeeded—in getting over it. However, one night while I was drunk, he was taking me home, and I confessed. I told him that I had been in love with him but that I wasn’t anymore. I apologized sincerely and explained that I just felt he had a right to know.\n\nNaturally, he was uncomfortable, but we agreed to try and maintain our friendship. Things were never quite the same, but we remained close. I made every effort to respect his boundaries and avoid making him uncomfortable. I also felt guilty, as if I had hurt him and ruined our friendship. Though he never explicitly said so, that was the impression I got. Whenever I asked, he insisted that everything was fine.\n\nAbout a year and a half after that, due to circumstances beyond our control, we had to sleep in the same bed. I asked if he was okay with it or if we should switch rooms, and he said it was fine. Still, I did my best to stay on my side of the bed so he wouldn’t feel uncomfortable. Unfortunately, at some point during the night, I rolled over onto his arm in my sleep. He woke me up and asked me to move. The next night, he decided to sleep in a different room, saying it was because of the bed. I thought that was an excuse, but I didn’t press him—he had every right to make that choice. Instead, he slept in a room with two of our female friends, A (19F) and K (18F).\n\nAfter that, things mostly returned to normal, except I noticed that A and K became more aggressive toward T.\n\nFast forward to about a month ago: I was out for coffee with A, and we were discussing T. He had made an awful joke toward K, and I was defending him when A suddenly said she had to tell me something. She revealed that on the night he changed rooms, he had told them about what happened. He told them I had feelings for him, that he constantly felt uncomfortable around me, and even outed me as bisexual (I am closeted because I live in a very homophobic country). He also told them that he couldn’t wait to work abroad for the summer so he could get a break from me.\n\nAt first, I didn’t want to believe her, but she knew details only he and I had discussed, and I was sure I hadn’t told her. A said they hadn’t told me sooner because they thought I wouldn’t believe them.\n\nI was crushed. I confronted T over the phone, but he claimed he didn’t remember anything from that night and insisted A and K were just trying to ruin our friendship.\n\nWe’re meeting for drinks in a few days to talk face-to-face and hopefully resolve things. I don’t know what to think. Everything points to him betraying me, and his excuse isn’t convincing—but I don’t want to believe it. Any advice would be welcome.",
    "score": "5",
    "comments": "6"
  },
  {
    "postId": "t3_1j5dysx",
    "title": "I reacted without thinking and slapped someone. Has this happened to anyone else?",
    "content": "At school a kid was pushing me and messing with me. I honestly didn’t care that much, but for some reason, I just reacted and slapped him without really thinking about it. I wasn’t even mad, so I don’t know why I did it. Now I feel bad and kind of confused about why I reacted that way. Has anyone else ever done something like this without meaning to? Why does this happen",
    "score": "1",
    "comments": "2"
  },
  {
    "postId": "t3_1j59b23",
    "title": "I'm tired of people who don't even make decisions in their own life trying to make mine.",
    "content": "Throw away account so no one sees this.\n\nI have been working really hard the last 5 years or so to improve my life.\n\nA little background about me- I come from a low-income, below poverty line house hold. Grew up in housing during my childhood. Majority of my family including cousins are either on social assistance, housing, drug addicts, alcoholic, ect.\n\n6 or 7 years ago, I was on social assistance myself. I didn't finish high-school. I was drinking daily. Ended up in an abusive relationship. Managed to get a cleaning job.\n\nSince then I've gotten my GED, partially went through college, ended up building a career before I completed college, am now a program manager on my way to making 90k a year in a field i love that feels like I'm making a difference in people's lives, in a happy loving fulfilling relationship where I live with my partner, we plan to buy a house soon and are thinking about marriage and kids. I have a car. I've essentially hit all of the life goal milestones I wanted to hit by the time I was 30 and more (I just turned 30 a few weeks ago). I've been to therapy, ive been on a good medication for my mental health, I've done the work.\n\nI feel like my life is finally on the right track. Because of this, I've finally been able to shift my focus to more \"shallow\" or less important things that have been kinda low on my radar.\n\nFirst let me say, I love myself - not in a self centered kind of way, but I appreciate that I'm resilient, goal oriented, determined, am empathetic to peoples experiences, and I have a lot of love to give. And I have a lot of respect and compassion for myself- just as I do for others.\n\nWith that being said, my appearance has always been something that's bothered me. I've always had bad skin, I gained quite a bit of weight over the last 4 years- and I'm just not in a place where I feel good about how I look. So I've decided, this year, that's what I'm going to work on. I've bought more professional clothes, started my skin journey to help with my skin texture and acne scars and redness. And planning on getting my teeth fixed. Getting a good hair regime. And controversial- i decided id try ozempic. My insurance is covering it so essentially it's like why not? Why wouldn't I give this thing a try to support me in losing weight and feeling better about my appearance. It's not that I think I'm UGLY I know I'm not- i just feel like I haven't really taken care of myself and I'm working on it.\n\nAnyway long story short- I feel like I'm getting some much push back randomly now. And the more I think of it the more I realize how much push back I've gotten generally on decisions I've made.\n\nMy dad once said how will you live on your own your on welfare (this was 7 years ago before I met my boyfriend and 3 months before I got a fulltime job as a cleaner and my own apartment)\n\nMany times as I've changed jobs to move up and learn more I've gotten aren't you scared? Are you sure you want to do this?\n\nAnd now from some family members and old friends its - wow that treatment is a lot of money, I've heard so many negatives about ozempic etc. My own mother has issues with me improving the way I look for some reason.\n\nI just don't understand it. I would never try to put someone down for bettering themselves in anyway. It's actually almost hurtful.\n\nOf course I realize I don't have to and won't listen to others on my life choices, because my choices have gotten me to where I am today. I guess I'm just venting because it feels like the people who don't even make decisions try to influence yours.\n\nAnyway thats all haha.",
    "score": "2",
    "comments": "6"
  },
  {
    "postId": "t3_1j44reh",
    "title": "What the actual fuck is the job market in the US",
    "content": "I’ve gotten to the point where I am applying for jobs I’m overqualified for and still getting rejected before interviews.\n\nI used an AI service to help with resume and cover letters with the buzz words that everyone loves in my industry. I’m at a complete loss. My workplace filed for chapter 11, our pay was cut in half and I’ve been looking for the last 6 months. The only time I make it all the way through the funnel is if the job is garbage or commission only (SLAVERY). So obviously I’ve wasted a ton of resources running around to interviews.\n\nMarch is now the first month I haven’t been able to pay my rent. My credit is maxed out from my bills last month and I plotted a week long vacation next week because I simply can’t afford the commute due to being paid bi-weekly. I’d love to use that little time I have for pleasure but it’s going toward crisis.\n\nWhat the fuck?\n\nEdit: I am in sales and I’m applying for any work at all, full time included.",
    "score": "803",
    "comments": "154"
  },
  {
    "postId": "t3_1j50qkp",
    "title": "I don’t know what to do with my life, if anything",
    "content": "I feel insecure about living an average or normal life. And I hate myself for being doomed to be so normal that I can’t even build up enough courage to abandon seeking comfort in society and living unconventionally. of course I’m so pathetic that I’m scared of the uncertainty of living on the streets and The people that have been shunned by society like drug addicts, and killers. It seems like recently uniqueness and alternative life has become so much more popular or valued rather than conformity. I don’t know. I really don’t know.",
    "score": "6",
    "comments": "4"
  },
  {
    "postId": "t3_1j4io7c",
    "title": "Oh my daughter.....",
    "content": "Her car needs to be fixed so I asked her what engine does she have so I can get the appropriate parts and her response was the most wholesome response ever. A normal one. That's the engine she has. A normal one lol.",
    "score": "135",
    "comments": "6"
  },
  {
    "postId": "t3_1j5dlzv",
    "title": "I don't feel like anyone will ever want me again",
    "content": "I've just come out of a 3 and a half year relationship that has resulted in two beautiful children. My ex fell out of love with me and decided to call it quits. I don't blame her, I've struggled with my mental health and been more than a little complacent with my management of it.\n\nWhile I'm not ready for a new relationship any time soon, I struggle to see how anyone would want to be with me in the future. A single dad of two. I feel like they'll assume something is wrong with me. Like, \"Oh he has two kids and they still left him, what would I be getting into? Red flag.\" or \"Why is he single? Why didn't they want a family with him in the end?\"\n\nI honestly just feel like my dream of a stable relationship or a full, happy family is just dead and buried and don't know how to feel about it. I don't feel desirable or attractive and I feel like my situation puts me at a disadvantage.",
    "score": "1",
    "comments": "0"
  },
  {
    "postId": "t3_1j4qjov",
    "title": "My brother cheated on his wife, and I’m the only one who knows.",
    "content": "He told me in confidence, but I feel horrible keeping this secret. His wife is an amazing person, and I can’t look her in the eyes knowing what he did. Do I tell her or keep my mouth shut?",
    "score": "33",
    "comments": "36"
  },
  {
    "postId": "t3_1j53puu",
    "title": "Boyfriend seems to be choosing our mutual friend over me",
    "content": "Hi everyone, I just need to vent out.\n\nI am 26 F, and my boyfriend is 24 M. We met through this girl who is our mutual friend. They are roommates. But since last year, it has been a bit up and down between all the three of us. It all started when my ex suddenly showed up at my door wanting to talk. But this girl friend of mine got angry at me because I asked back the money I am owed back, and went and told my boyfriend that my ex showed up, we “talked” and some other stuff. This caused a major break in between our relationship, and I only knew about this recently that she was the one who ratted me out when it wasn’t her place. I would have told him, but she went ahead and told him adding unnecessary untrue details to it.\n\nWe had some misunderstandings, and we moved past that. But as of now, she seems to be becoming more possessive of him, though she has her own boyfriend. She expects him to take her out everywhere, doesn’t include me, and he seems to be doing it. But when I ask him, it’s always reasons and excuses.\n\nShe still owes me a little around $600, and I am honestly scared to ask her about it. They have been doing a lot of video calls, texting constantly and I know it may be nothing but I just cannot digest the fact. I know I need to be more trusting but I feel like a third wheel in my own relationship. He expects me to adjust to this, but why should I be adjusting in MY relationship.\n\nYesterday night, I questioned him about it and he came to hit me. I got shocked that he raised his hand on me when I asked why did he video call her. He keeps saying I am more important to him and I am his first priority but I just cannot understand why he would get so angry when I questioned about it. This was the third time in a row he raised his hand on me. But later consoled me. I asked him to choose between me or her, he said he is in a situation where she is his roommate and he cannot do anything. I hate the fact that she is so touchy around him, I just hate it.\n\nI trust him that he wouldn’t do anything behind my back like sleep with her, but I just cannot let it go. I am still in shock from yesterday night. I feel like I lost all my friends because of him, I don’t feel like I belong with anyone and I don’t even have anyone to talk about this that I have to vent it out on Reddit.\n\nTL;DR my boyfriend seems to be involving our mutual friend a lot into our relationship and seems to be choosing her over me.",
    "score": "4",
    "comments": "20"
  },
  {
    "postId": "t3_1j5dh76",
    "title": "I can’t stand my high paying job anymore, I also feel bad for not having the guts to quit",
    "content": "Simple as that. I am waiting to have enough to retire, the closer I get to my goal, the harder it is to tolerate the job.\n\nI simply can’t stand it anymore. The sound of notifications, performance reviews, corporate language, team activities all is just torture for me.\n\nThe work takes the joy of my day to day life but gives me very good money….",
    "score": "1",
    "comments": "12"
  },
  {
    "postId": "t3_1j5dba8",
    "title": "My boyfriend said I wasn’t allowed to have friends and now I’m alone",
    "content": "I love my boyfriend so much. I wanted to make friends but he always got upset and said it wasn’t needed, and eventually I stopped talking about it. Eventually I stopped wanting friends at all, and I figured I could be happy with just the two of us.\n\nNow he’s joined an organization and is always busy, and he’s making a lot of new friends. I am alone. Now he wants me to make friends so I can stop crying to him about how lonely I am but it’s his fault I’m this way. I can’t just turn a switch and be like him. He’s given me so much anxiety around the idea.\n\nI’m so angry. It’s so unfair. I don’t understand why I put up with it all, and why I keep putting up with it now.",
    "score": "1",
    "comments": "7"
  },
  {
    "postId": "t3_1j5d4ph",
    "title": "I am not a people person.i am an introvert.",
    "content": "I have a problem.i am not a people person.\n\nI am introverted.\n\nI can’t stand people.\n\nWhat can I do?",
    "score": "0",
    "comments": "6"
  },
  {
    "postId": "t3_1j48nfz",
    "title": "My boss keeps a camera feed of me going for a week.",
    "content": "My, f29, boss, m late 40s, kept the camera feed of me on his computer screen at all times. Obligatory throw away account cause the details in this might be easy for some of my coworkers to find this and I don't want to give up my main account. Also I was posting this on am I over reacting but my update actually came as I was typing this on that sub so now I'm switching it to here that everything seems to be wrapped up.\n\nSo I work in a mostly male dominated field in a CNC machine shop as a brake operator. I am the only woman at my company that works on the shop floor. About a year ago there was a fist fight between 2 other operators and there were no cameras inside to show who started the fight so both operators had to be let go. To prevent this from happening again the cameras went up all over the shop. Absolutely no blind spots, crystal clear HD camers, we know this because our boss has a TV screen above his desk now where he can watch all the cameras. He can have up to 8 of the camera feeds on his screen at one time and it has the ability to cycle though all of the feeds, switching feeds every few minutes.\n\nThe problem came about a week ago when a coworker of mine came up to me and told me there was only one feed on the screen. Me at my machine. I have never been written up or even talked to about problems with my work so I was very thrown off by this. When I had the opportunity where I could think of a reason to go into his office to see for myself when I walked in his office sure enough I saw my empty station on the screen. I pretended not to notice and just asked a question about a part I was working on that could be a reasonable question and went back to my work like nothing was wrong. Over the next week or so I tried to put it out of my mind but I couldn't get past it and more coworkers approached me and said they saw me on the screen.\n\nSo late last week I went to HR and asked if I was in trouble for anything. The HR guy looked surprised and asked me what I was referring to and I told him how closely I'm being watched and it seems to be just me singled out. He said he would look into it and get back to me but as far as he knew there was nothing wrong. About an hour later I get called into the managers office with HR, screens are back to normal showing 8 different work areas. I'm happy for a second until I am asked why I'm spreading misinformation. I ask what they're talking about and I proceed to be gaslighted for the next 5 or so minutes about how the cameras have always been this way and I'm seeking attention. I say multiple coworkers have mentioned to me about seeing it and we can bring them in to ask. They threaten to write me up if I keep bringing up this \"blatant lie\" and that I'm slandering the manager to my fellow coworkers.\n\nI contact a lawyer cause at this point I'm like fuck it I'm going to quit this job anyway might as well raise a little hell but then part of me decides it's just not worth it and with everything I've been through lately its just not worth it. I decided to contact my ex who I've been broken up with for a year and fill him in. We we're together for 5 years and he's the love of my life, about a year ago he was offered his dream job across the country and asked me to go with him. My mother was dying of cancer at the time and I was the only one she had left to take care of her. He planned on turning down the job to stay with ne but I told him I'd never forgive myself if he passed on his dream job for me. About 6 months ago my mother passed and idk why I didn't contact him but it kinda felt like my whole world fell apart so I just accepted this was my life now.\n\nWhen I told him what was going on he said \"why don't you come move in with me?\" I didn't know it but he hadn't dated anyone since we broke up (and neither had i) because he had always planned on us reuniting after my mother passed and when she did he didn't want to rush me cause he wanted to wait until I was ready. I wasn't ready at all until he asked me that question but without hesitation I said yes. I put in an application that day at a CNC shop near where he lives and that was yesterday. So that's where this post was going to end on am I over reacting for picking up and moving across the country. And then the phone rang.\n\nApparently the place I was hiring was impressed with my years of experience and they're a newer shop so I actually have more experience running a brake then most of their employees. They offered my about a 25% raise of what I'm currently making and I accepted on the spot. They asked when I could start and I said next week. Immediately called my boss and told him he's a fucking creep and that I quit. HR has been calling me nonstop begging for me to reconsider but that ship has sailed. Ex bf or possibly just bf again said he's excited for me to move in but will be setting me up in a separate bedroom at first just so we can take things slow and figure things out which I think is very smart of him and I'm glad cause I think we need that time too.\n\nMy current landlady is an absolute sweetheart and knows how rough this year has been for me so she's letting me break my lease with no penalties and she already has someone lined up to take my apartment. I asked if they wanted to buy some of my furniture since I'm only taking what I can fit in my truck and they offered me a thousand buck for my living room set and all my drawers and dressers. Not having to worry about all that I can fir the rest of my stuff in my truck easily and I'm starting my cross country trek tonight. Fuck creeps and if you're thinking about putting up with that bullshit, don't. There's always another option, maybe even one youd.never thought possible.",
    "score": "394",
    "comments": "23"
  },
  {
    "postId": "t3_1j5cdlf",
    "title": "I get attached to people to quickly",
    "content": "theres this dude in my class i thought was really pretty (I am AroAce and experience aesthetic attraction) and I thought was really cool and i really wanted to be his friend, but im super awkward so idk how to go about it. i tried talking to him more, showing him my stuffed animals, and tried to get him to actually care abt what i was saying, but he just doesn’t. like he’s not mean, but he doesn’t really respond much, and when he does it's always \"nice\" \"cool\" \"fire\" and i don’t even think he realizes i wanna be his friend. for some reason i got way too attached to him and i started overthinking everything, like what i was doing wrong, and why he didn’t care. i was just embarrassing myself. i was zoning out at the end of class, (my friends said I was disassociating) and they told the counselor. (They didn't know why i was so unresponsive) anyway i got pulled into the office with a sheriff officer and two counselors and they were asking me all these serious questions abt my mental health and my home life and asked to check my arms, and i felt so stupid. like i wasn’t even upset over anything actually serious, it was literally just bc some classmate doesn’t care about me. and now i just feel even dumber bc i don’t even know why i got so attached in the first place. I feel like I'm wasting so much of my energy on him. I just want him to like me but I'm pretty sure he finds me weird/annoying. has anyone else experienced this? how do i stop getting so emotionally attached to people who dont even notice me?",
    "score": "1",
    "comments": "0"
  },
  {
    "postId": "t3_1j4judy",
    "title": "I was the daughter they finally learned how to control.",
    "content": "Everyone talks about the eldest daughter trauma — the one who raised her siblings like a second mother, the one who carried the whole house on her back while nobody even asked if she was tired. But no one ever talks about the last daughter , the one everyone thinks had it easy. The one who was loved a little more, spoiled a little more, protected a little more… but never really seen.\n\nThey say I was the lucky one, the child who walked on a path already cleared by others. I always knew when to be careful and when to stay silent because my sisters had already made the mistakes I wasn’t allowed to make. Every fight had already been fought before I even reached that age. Every heartbreak came with a warning before I could fall too deep. They think I had it easy because I never had to struggle for my freedom. What they don’t know is — I never got the chance to fight for it either.\n\nI was the daughter who grew up watching the cracks in the house… but I was never allowed to acknowledge them. I was the one who learned how to laugh off the fights, how to pretend I didn’t hear the shouting behind closed doors. I was the daughter who learned how to act dumb — because if I smiled enough, if I played the little girl they wanted me to be, they’d believe they protected me from the ugliness of this house. What they never realized is… I saw everything. I just stayed silent because youngest daughters aren’t supposed to know what pain looks like.\n\nNobody ever asked how I felt. Nobody ever wondered if I was okay — because the youngest ones are always supposed to be happy by default. I became the light of the house not because I wanted to… but because someone had to be. The clown who made everyone laugh at the dinner table so they could forget how broken everything really was. The one who took up responsibilities without being asked — peeling garlic in the kitchen, making tea for guests, finishing the little chores nobody wanted to do. Not because anyone told me to  but because the guilt of letting my mother do it alone would eat me alive.\n\nI was the obedient one , the daughter who never crossed the line. The one who said yes to everything, who stayed quiet when she wanted to scream, who shrunk herself down to fit into the version of me they wanted to see. My sisters got to rebel, got to be wild, got to disappoint the family but by the time it was my turn, my mother was already too tired. There was no space left for me to be difficult. I had to be the perfect daughter. The easy one. The one who never asked for too much.\n\nMaybe that’s why I feel so distant from my own mother. She had nothing left to give by the time I came along. I watched her have those long, deep conversations with my sisters… conversations I never got to have. The only thing she gave me was rules. Maybe she thought if she was harder on me, she could save at least one daughter from turning out like the rest.\n\nI was always loved. I was always taken care of. But not because of who I was because that’s just what you’re supposed to do with the youngest child. Love them, spoil them, protect them but never really see them.\n\nNobody ever wonders what happens when the child who made everyone laugh starts crying behind closed doors. Nobody wonders if the girl who had it easiest was silently drowning in the weight of trying to be perfect.\n\nThey called me lazy when I took two gap years  not knowing I spent more time peeling vegetables with my mother than studying for my own future. They called me spoiled when I got everything I wanted not knowing I gave up dreams before I could even name them just to make life easier for everyone else. They called me the lucky one… but how lucky can you be when your whole life is built around making sure nobody in the house feels like they failed you?\n\nI was never the rebel… but I don’t think I ever wanted to be the perfect daughter either.",
    "score": "88",
    "comments": "34"
  },
  {
    "postId": "t3_1j503q8",
    "title": "I broke up with my girlfriend last night and it’s killing me on the inside.",
    "content": "First post here and from phone so apologies if there’s poor formatting. Also not sure if this is the right platform but turning to here as I need to get this out of my system.\n\nAs the title says, I (21M) ended things off with my girlfriend (21F) last night and I feel awful. I had initially thought that I would feel relieved but it’s tearing me apart. She was my first. We were together for 2 years and all of 5 mins it was just gone. Took everything in me to not lose it on the train ride home. Even though I initiated it, I hate myself for what hurt it has caused her and I haven’t been able to sleep or eat well. It’s really harder than I had imagined.\n\nOf course with any relationship, there were low moments but there were also some of the highest highs and I was so blessed to be with her. I broke things off because I haven’t been in a good place recently and I didn’t want to “bleed” on her due to whatever circumstances I may have. In hindsight, this was immature thinking as I chose the easy way out and I’m now dealing with immeasurable amounts of pain as a consequence.\n\nToday at work the events from the previous night replayed in my head over and over. I said what I had wanted to say but something still didn’t feel right. Thing is, I do not think this is a “take time to heal” situation. Part of me feels like it was poor judgement to not fight off my thoughts of leaving.\n\nI really miss her terribly.\n\nNot looking for any sympathy here. Just wanted to pen down my thoughts that clearly aren’t very cohesive with no fear of judgement.\n\nIf you’re reading this, thank you for everything. I’m sorry for the small things we bickered about that escalated unnecessarily. Thank you for our fun dates that brought me so much joy. I’m sorry for all the tears you shed because of me and my actions. Thank you for the past two years.",
    "score": "5",
    "comments": "4"
  },
  {
    "postId": "t3_1j53y93",
    "title": "Can You Ever Heal from What Happened as a Child?",
    "content": "I was just a kid. Just a fucking kid. And yet, somehow, I still feel the weight of it like it happened yesterday. Like it’s still happening.\n\nI didn’t understand it back then—I only knew that something felt wrong. That I wanted to run but couldn’t. That I froze. That my body didn’t feel like mine. That someone I should have been safe with took something from me that I didn’t even know could be taken.\n\nAnd now, years later, I still carry it. In the way I shrink when someone gets too close. In the way certain touches make my skin crawl. In the way my heart races at memories I never asked for. In the fucking guilt—as if I should have done something different, as if I should have known, as if it was ever my fault.\n\nI want to know—does it ever go away? Do you ever stop feeling like something is wrong with you? Do you ever stop feeling like your own body is some kind of graveyard for what happened?\n\nIf you’ve ever felt this—if childhood left you with scars that no one can see—talk to me. Tell me I’m not the only one.",
    "score": "3",
    "comments": "25"
  },
  {
    "postId": "t3_1j51i1d",
    "title": "I hate being womam",
    "content": "I am a woman, but I hate being one, and the reason is my family. I don’t want to write details, but I have come to hate being a woman.\n\nI don’t want to become a mother, and I don’t want a relationship with a man.\n\nI’m not even a lesbian.\n\nI just want to live in peace.\n\nI wish I could transition and appear as a man just so I could live peacefully.",
    "score": "4",
    "comments": "32"
  },
  {
    "postId": "t3_1j4cyxv",
    "title": "A guy I knew died thinking his wife was faithful to him",
    "content": "I knew this girl in high school (let’s call her Hailey), and she got engaged/married very early. One of my best friends ( we’ll call her Samantha) is very close with her. Samantha told me once years ago that Hailey had cheated on him once before, maybe more. I was really shocked, my gut instinct was to tell him, but I didn’t know him well and he seemed kind of mean. Samantha told me not to say anything because she was using it as ammunition in case Hailey ever wanted to tell one of her big secrets (great friendship, right?). Anyway, I listened to Samantha and never said anything despite feeling some guilt. She assured me that he’s probably cheated on her as well. I didn’t think much of it for a while. Recently, he died of an overdose. The guilt of not telling him weighed on me pretty heavy after I found out. I keep telling myself that he probably would’ve ended up overdosing anyway, but I don’t feel like it was fair to him that he spent his short life with someone who was unfaithful. Regardless, there’s nothing I can do about it now except hope he’s in a better place.",
    "score": "202",
    "comments": "38"
  },
  {
    "postId": "t3_1j5bgq2",
    "title": "TW sa",
    "content": "He touched me as a child.\n\nIm so happy hes dead.",
    "score": "1",
    "comments": "0"
  },
  {
    "postId": "t3_1j4e234",
    "title": "I (30M) have the biggest crush on my coworker (35F) and I can’t stand it",
    "content": "I’ve worked with this woman for about 4 years. We’ve traveled together on business several times. I’ve always been a pretty shy guy, but am especially cautious when socializing with women I work with. I try to be myself but not act in a manner such that they could feel uncomfortable (basically I’m afraid of flirting because I want to be a good human being and also keep my job).\n\nWhen I’m with this woman it’s pretty chill. We chat about our travels and places we want to go. She occasionally tells me very personal things, one time she randomly told me she had an IUD after we were just sitting in silence for a few seconds.\n\nAnyway I think she’s great. She’s very smart and successful. We both make 140k+ at basically the same job. She owns her own house but I’m not quite there yet. She’s funny, cute, and very fashionable. The little things like the way she paints her nails (neat like a professional does them for her on the daily) and wears her hair are so unique and attractive.\n\nSometimes things feel fantasy like when we’re traveling together. We might both reach for the temperature controls in the car at the same time because the AC is too cold and touch hands. We say the same things at the same time and have the same thoughts when a random event happens in front of us.\n\nSometimes she would say interesting things like “if it was appropriate I’d invite you to stay at my house” because the office is far for me and close to her. Or if I talked about moving she’d get excited and joke that I could be her neighbor. I always wondered if she was attracted to me, but she shows mixed signals. She’s a very smart woman so it’s possible she thinks the same way I do and doesn’t want to jeopardize her career. She’s had boyfriends on and off and I’m not even sure what her current status is.\n\nI feel like in an alternate reality we would be the perfect couple. But in this reality we’ll just be coworkers who live a couple hours apart. It’s frustrating. I’ve never been sexually active before because I’m waiting for someone who electrifies me as much as she does to truly desire me, and to be in the right situation for it. That’s hard to find.\n\nTLDR; just a dumb man crushing on a coworker\n\nUpdate: I don’t think I can ask her out. Messaged her at work today to ask how things have been and the conversation felt one sided. I can’t deal with the humiliation, embarrassment, and fear of her getting freaked out by me doing so",
    "score": "171",
    "comments": "159"
  },
  {
    "postId": "t3_1j5b24x",
    "title": "I desperately want to hook up with my coworker again.",
    "content": "So, towards the end of summer last year, my coworker (26m) and I (24f) went on a date and ended up fooling around a few times after that. I had had a huge crush on him for a while and was so excited to finally go out with him. The date was super nice, but the hookups were unexpectedly really good. I don’t have a lot of experience whereas he does, and he knew that, and he let me take control of the pace and the things we did which made me feel comfortable enough to try stuff with him I hadn’t done before. Unfortunately, life stuff happened all at once, and he ended things like two weeks after the first date. I was crushed. I was hurt, disappointed, confused, and quite honestly, very sexually frustrated. I really, really liked him, and we had gotten very intimate very quickly with the expectation that there would be a lot more to come, and then all of a sudden, it was over. I felt like I was left high and dry.\n\nThe thing is, a couple of months ago, we basically ended up confessing over text that we both still wanted each other in that way and almost made plans to meet up again, but more life stuff got in the way, and we both agreed that it would still be a bad idea to do anyway. But now every time I see him at work, I can’t help but think about the things we said and did, and how much I want to do it again. The fact that I know that a part of him still desires me in that way is kind of driving me crazy. I could torture myself overanalyzing every normal conversation, every glance, every little interaction.\n\nIt would very likely be a terrible idea to do it again, and it would probably end worse than it did the first time, but the feelings just won’t go away no matter how much I remind myself of these things. I am down so, so bad for this guy.",
    "score": "0",
    "comments": "15"
  },
  {
    "postId": "t3_1j5f5h7",
    "title": "I’m so insecure about my small butt in a world of bootylicious peaches",
    "content": "Basically as the title says. I(29f) have always had a smaller butt. I’m curvy and I look like I should have a big butt from the front, but I just don’t. I have big boobs and nice curves, but this one thing just keeps me honestly hating myself, especially with how worshipped big butts are in today’s world. Sucks for us little butts due to genetics. Sometimes it’s honestly made me not want to live because the love of big butts is all over the media, and is the beauty standard. My husband tells me he loves my butt, but I know deep down he probably wishes I had more.",
    "score": "0",
    "comments": "8"
  },
  {
    "postId": "t3_1j5ati4",
    "title": "exposing a narcissist",
    "content": "So I recently exposed a narcissist but my situation is very different and I can’t find anything online about this situation. So I came here for potential outcomes.\n\nSo back in 2023 of March I started talking to this guy and he knew me from my childhood (we were not best friends we just saw each other in passing during our middle school years) and it went well at first. (It only lasted two weeks) While we were getting to know each other I got on his IG and saw this girl constantly posting on his page but he never paid her any mind and of course I asked and he denies it. But he must have sensed that I was hot on his tail so he decided to end things but still wanted to be friends even though we were never friends but I just said ok. What he didn’t know is that I knew I was blocked after I questioned him about the girl on IG so I made a fake page to see what was up. And even though he said he wanted to end things he was still keeping in touch with me. Even though I’m blocked on his IG so in April 2023 I saw him with that girl and he she got him to move down there with her. He is originally from my city and this girl lives in the DMV area. And with me investigating I realized that it’s a money thing so basically this guy is a prostitute she buys him stuff and he agrees to be her bf. So of course I wanted revenge but I wanted to wait until it was unexpected so for a whole year I gathered information on this girl and realized she may be a narcissist. With my digging on this girl I got her phone number driver license address email you name it I got it. And I tucked it away. So in March of 2024 I made a fake number and pretended that I knew her from one of the colleges she went to but I told her that I wanted to stay anonymous. And she went for it and all I did was expose her bf for being with me. I also wanted to add that had I not been hot on his tail he would have continued to date me. And when I found out about the girl I cut all communication with him and he found a way to contact me and wanted me back and I told him no. He even told me he never wanted us to stop talking but he needed help from this girl and I had all that in the screenshots. And you best believe I sent them screenshots to her when I was hiding behind the fake number. This girl really wanted to know who I was so I decided to give her a call and actually reveal myself and we were on the phone for 27 mins. Mind you I recorded our conversation as well because I don’t trust this bitch. But while we were on the phone she talked bad about her bf and her bf family and I did defend the family because I actually know them. Because the city we are from is small. And at one point in time I was close with the guys cousin. She said really bad things about the bf mom too. And I didn’t like that so I spoke up and I think she could tell I wasn’t going for any of her lies because I knew she was lying. And I’m sure she didn’t like that. I actually got off the phone with her because she wouldn’t let me go. So the day after I spoke to the girl her bf called me screaming at me and accusing me of all these things I didn’t even say. I couldn’t even get a word in but I knew she was going to lie so I wasn’t tripping because in my head I was going to get my lick back. Fuck this hoe. The guy wasn’t even mad that I hurt gf feelings he was mad that I lied on his family and said bad things about him. Which I didn’t say anything bad about him or his family. So after I took a verbal beating from this guy I just said cool. But I wasn’t done yet. So I waited for about six months so now we are in September 2024 and from March of 2024 to September 2024 I kept my eye on them and I watched her crumble because she is very transparent on the internet and the bf broke up with her while she begged for him back because he realized that she lied on me and she must have found me on social media because she changed everything about herself to mimic me. Mind you when I spoke to her in March of 2024 she claims that he begs her but social media says otherwise. And between March of 2024 to September of 2024 this girl and her friends and her momma started to bother me because apparently I’m the reason why her bf won’t speak to her and I still keep calling her bf and pulling him away from her but I haven’t seen that man since March of 2023 nor have I spoke to him the only time I spoke to him was in March of 2024 and that’s because he yelled at me. So in September of 2024 I reached out to him I unblocked him on IG (in case you are wondering he did block me first on IG but unblocked me on IG to get in contact with me because I had him block on everything else then when he asked for a second chance and I told him no I blocked him on IG and he been on that list since September of 2024 and then I blocked him again because he is a dick) and sent him all the details of the conversation I had with the gf. I even revealed to him that I was behind the fake number but he told me to leave him alone so I said ok bet and changed my number and reblocked him on IG. But what I banked on was how much he liked me so I knew he was going to read and listen to all the things I sent and within three days he started calling my fake number (because he couldn’t get in contact with me because I changed my real number) so I deleted my fake number and got rid of my social media account because he had his family look for me too. He also offered to send me money to talk to him but I declined. And of course I’m still watching this all play out on my fake pages and again because she is so transparent on social media she is having a breakdown because he now knows the truth and she can no longer lie on me to him at least. But he is stupid anyway because why would you believe a liar with no proof but I guess because she is a narcissist and the guy isn’t good at setting boundaries. I never been involved with a narcissist well I don’t think I have been and I think it’s because I’m too outspoken and I have no problem getting into a fights. I promise you this is not what the fuck you want but overall I’m a pretty peaceful young lady if I do say so myself. Anywho, this girl is upset that not only is he furious with her but also his family is happy that someone was able to finally expose her for the liar and manipulator that she is (I didn’t know that his family didn’t like her) but apparently she plays victim and uses this guys insecurities and her money so she can get her way and this relationship was going on for years. I’m basically the hero. But I wasn’t done with this bitch yet so I got my black ass on Twitter and put her on blast so much so she lost a lot of followers on social media and her momma is off of social media completely because her momma was bothering me too. And I did this a few weeks ago me exposing this girl on Twitter. So now I’m satisfied. But I wanted to know what happens when you expose a narcissist? I wasn’t the one being manipulated but it was like I was the defender of someone who was being manipulated. And I came here to see if I could get any info because I couldn’t find anything.",
    "score": "1",
    "comments": "0"
  },
  {
    "postId": "t3_1j5a80n",
    "title": "I have a big thing for men’s feet, and I'm ashamed of it",
    "content": "This is a throwaway account because no one in my life knows about this, and honestly, I feel really ashamed about it. But here it goes... I’m a girl, and I’m really, really into men’s feet. Not just in an “I find them attractive” way.. this is one of my biggest turn-ons, and it plays a huge role in my sexuality.\n\nEvery time I’ve mentioned this to someone (mostly online), they’ve been shocked, or they straight-up didn’t believe me. Apparently, it’s weird for a woman to have this preference? Is it? It makes me feel even weirder about it, like I’m some kind of freak. But the thing is, I’ve had this for as long as I can remember.\n\nI think one of my earliest memories of realizing it was in high school during sports. I was sitting on a bench barefoot with some friends, and a guy next to me accidentally touched my foot with his. He did that a bunch of times. I think he wasn’t even paying attention. He was just watching the game. I remember feeling something I didn’t fully understand at the time. It felt so good in a way that was different from anything else.\n\nOver the years, I’ve tried asking guys for pictures of their feet, but most of them refuse. They’ll say, “No way, my feet are gross\" or something like that. But the thing is.. I like that. I’m not just into clean feet. I love the dirty, sweaty ones too. Sometimes even more. Socks, shoes, sneakers, slippers, flip-flops... all of it is insanely attractive to me.\n\nI know fetishes aren’t something we choose, but I really wish I didn’t have this one. I feel so embarrassed about it. I just want to be normal and have typical attractions like everyone else. I guess I just needed to get this off my chest.\n\nIf anyone out there can relate, please let me know I’m not the only one.",
    "score": "0",
    "comments": "5"
  },
  {
    "postId": "t3_1j5a42p",
    "title": "I hate that i get insecure over my bfs likes!",
    "content": "I know some people are gonna be like “well then why are you with him?” But truthfully I never really ever cared up until now. I think it’s embarrassing that he likes girls stuff with their butts all out and clearly looking for attention. Not only that but it definitely makes me insecure because in my head I think that he likes that, and even if he tells me he doesn’t and that I’m overreacting over a “like” … it just still makes me feel that way. My advice is if yall have a girlfriend don’t like other girls stuff because it can definitely create some type of insecurity within the relationship. And I know not all girls care, but I just think it’s important to respect no matter what. That being said. I am now single :)",
    "score": "0",
    "comments": "2"
  },
  {
    "postId": "t3_1j59rp2",
    "title": "Why are guys in their 30’s attracted to me?",
    "content": "Hello everyone, i 22f seem to get overwhelming amount of attention from guys in their 30s and i just dont know how to feel about it. I live in a small ish community where everyone pretty much knows everyone or has heard of them at least. In addition to that, theres not many people my own age to pick from around here unfortunately.\n\nAnyways, i think i could count at least 5 guys in their 30s who have approached me or expressed interest/flirted with me. Mind you, im newly 22 and already get told i look like im 17. Im not completely opposed to dating out of my age range, but are there things i need to worry about with this? Is it a predatory thing? Is it guys lusting over a younger girl to fulfill some kind of fantasy?\n\nHas anyone else gone through this? I kind of like the idea of an older guy but it is also a bit weird to think about especially from the outside. Any input is appreciated!",
    "score": "0",
    "comments": "13"
  },
  {
    "postId": "t3_1j54haw",
    "title": "waited 6 hours for a 5 min with human services",
    "content": "Last year, I think I was sent an email in December saying that I \"needed to send proof of income\" effectively tomorrow. It was also a \"2nd notice.\" assuming the 1st one was lost in the mail. I was already gathering that for a different service, so I just made copies of the pay stubs, waited an hour, and turned in everything asked. That is when I was told that I had been Flagged for something involving income and needed to see a medicare insurance adjuster. I wondered if any were available and was told no and that I needed to come back tomorrow or call in.\n\nI asked if I could make an appointment but was told none were available, as \"due to holiday training and staff shortages, we are unable to fill requests for appointments at the moment.\" However, I would \"put a note in my file that it was a late notice.\"\n\nI asked if I could get an extraction as I never received proper notice. I was then told, \"Also, due to staffing shortages and holiday training, we cannot do extractions, nor can we, as we are not responsible for lost or delayed mail.\"\n\nShe then told me that the best option was to come in at 7 in the morning to be the first in line. I told them that I work tomorrow and can't come in. I was told I didn't have to, but it would be at the \"small penalty\" of losing my medical and dental through California. So I did that and was one of the first 15 people waiting in line for the doors to open in cold, rainy weather. I got a ticket and waited for about an hour, thinking I could make it to work on time at 1030am. I sat and told them I was there for a medical adjustment with a medicare insurance adjuster.\n\nI was told they were not one and that the hour's wait was to set an appointment. I was told I could have called or come in earlier to have a specialist set it up. I told them I tried yesterday, and there were none available. I was hit with, \"Well, it's not my fault you poorly planned this. Seeing as you had 2 weeks.\" I told them about the late notice and a note in the file. The man eye-rolled me and just scribed out the latter on my ticket. Telling me to expect my number to be called again in 2 hours and that in the future to be \"more mindful of prep and time management.\"\n\nI called my boss; he was surprised but was cool with me coming in later as long as I kept him updated. And so I waited as eight became 9 and 9 became 10. I checked in as it should be around time for the meeting and was told due to a lack of adjusters today, there will likely be unseen delays. So I had just to wait, and I skipped breakfast to get there, messing with my phone and eating some of the fruit offered there. I messaged my boss every half hour as he was skeptical that any department could wait this long.\n\nby the 11 or 12th hour of the day, they started giving out parking passes as the parking lot had a two-hour limit and needed one. There was a small argument between one of the managers and staff members about whether they should ask the ones here over the limit just to move their cars as they technically violate the parking code, and we shouldn't be encouraging that behavior. a 3rd staff member had to step in just to hand out the passes.\n\nSo, by the 13th hour and a half, when I was falling asleep and wondering how much of my shift I would have left, someone poked me in the face and told me to look up. A new number had popped up. It was mine.\n\nI go through the door with paperwork in hand to see the Ajestor about what the problem was. It turns out they wanted to know if I had SSI payments and asked why I didn't have any from SSI. I told her that I wasn't on SSI, and she told me that was the problem. When applying for Calcover, I marked down that I had a federally recognized disability, autism. So they wanted to see if I was making too much for the program; when I didn't show any SSI payouts, i was flagged for possible fraud and they tried to ask me in person if I had any other forms of assisted living payouts or financial aid. I told them i was disqualified due to being able to work.\n\nSo the adjustor told me that next time, I needed to uncheck that box as legally, for health care, I didn't have a federally recognized disability as it implies I'm getting federal aid. So I waited nearly 6 hours for a 15-minute meeting asking me not to say I have autism on a federal level.\n\nMy god, why do we put people through this?",
    "score": "2",
    "comments": "2"
  },
  {
    "postId": "t3_1j59il8",
    "title": "Invisible/alone in my relationship?",
    "content": "How to cope with a boyfriend who has phone/computer addiction? Or more accurately help him out of this? It's feels like he's not here in real life except when I open my mouth repeatedly. If i don't say anything at all, we wouldn't barely spend time or talk with each other. Every fucking minute when we not interact he's on phone or go straight to his computer. He can't literally live or do things without his phone. Like cooking food, cleaning, walking the dog and more things.\n\nAt this point I don't feel seen, good enough or loved. Sometimes I feel like he only wants me to be there on his terms when he's bored of the technology",
    "score": "1",
    "comments": "1"
  },
  {
    "postId": "t3_1j4u4pq",
    "title": "I lost my 20s to depression",
    "content": "I lost my 20s to depression and struggling to put my life together. Everyday I wonder what did I do wrong. In my 20s, while fighting depression, I have always tried my best to put my life together.\n\nI never went on YOLO stuff like going on trips or oversea travels.\n\nI rarely if ever waste money on socialization.\n\nI very rarely eat out, watch movies, etc.\n\nThe only fun I truly had was dedicating my effort to training jiujitsu (2-4 hours a day, 4-5 days a week), which I maintained for 3 years until COVID.\n\nI keep track of my finance.\n\nI always have some sort of active learning hobby to keep my mind away from depressive thoughts. Such as learning basic excel, learning basic personal finance, routine music practice, routine certificates studies.\n\nI keep missing out on opportunities due to my location (Sarawak Malaysia) and my lack of skills that can make potential employers overlook my location.\n\nWhen I received a good job offer of a career I worked for, COVID happened. After that the job market was screwed. When I had my 1st job, I was underpaid and rewarded with performance punishment. My incomr was MYR1500 per month (USD340), and I learned waterfasting so that I could save 10% every month. After work, from 5.45 to 8pm I would study to get UI/UX Coursera.\n\nAfter 9 months of this everyday, I had a mental breakdown and forgot everything I learned. I quit my job to join an apprenticeship program, but eventually it didn't pan out... due to my location.\n\nI turned 30 late last year. Currently I'm developing a game (something I have been working on on the side for 2 years now). But the future is bleak. I'm still stuck in this third world town where opportunities don't really exist.\n\nAnd I'm barely hanging on, still fighting my clinical depression, hanging on to keep it together.",
    "score": "8",
    "comments": "1"
  },
  {
    "postId": "t3_1j50h3w",
    "title": "Ugly",
    "content": "I don't want anybody to see me. I'm embarrassed to go out in public when there are people around. My friends keep asking to hang out, and it makes me sick. I don't want them to look at me, I don't want them to have to put up with me. I'm fat, I'm hideous, I can't believe I'm supposed to even be human.\n\nI'm working on losing weight, I'm learning how to be pretty. If I'm strict I can be thin by the end of the year. Then I can re-join the rest of society. I'll learn how to be a doll, quiet, pleasant, nice to hold, cute to look at. Finally, I might be able to excuse the space I take up.",
    "score": "3",
    "comments": "3"
  },
  {
    "postId": "t3_1j58nr5",
    "title": "I’ve been in a secret relationship for the past 9 months and I’m afraid to tell my family",
    "content": "Hi everyone,\n\nLast summer I 22F met a man on this app who is 45M. The day after we met online we had a phone call and ended up spending nine hours on the phone! The following month he flew out to see me and I spent that whole weekend with him. We had an instant connection and even nine months later things still feel really great.\n\nHim and I live only a few states apart so for the past nine months we have been traveling a lot just to see eachother. We have been traveling back and forth so much that this weekend is our 20th visit with eachother and we have spent roughly 100 days together in person!\n\nWhen we first started seeing each other I didn’t tell anyone because I was too afraid of the judgment people would say. I have no clue how people in my family or community might feel about our age gap. Overtime it just got more and more involved but I still did my best to hide my relationship from everyone.\n\nThis upcoming May I need to find a new place to live and I don’t really have many options. The best case scenario is for my partner to move to my state and for us to live together. That is a realistic plan for us but the only issue is that I don’t think I can hide that from my friends/family. I am also starting to think about just telling them since there are times where it is hard to have to hide my relationship, especially when it’s such a big part of my life.\n\nI am really worried about what my family might say. I am worried they will look at me in a negative light. I know that it’s just their opinions but it isn’t easy to feel judgment. I am really stressed and confused on what the right decision is.\n\nAny advice would be greatly appreciated 🤍",
    "score": "0",
    "comments": "8"
  },
  {
    "postId": "t3_1j4irfk",
    "title": "No one subs to a YouTube channel because the video asks them to",
    "content": "I can't think of any channel I subbed because the creator constantly reminded me to or complains that only 5% of their views come from subscribers. I think it does more harm than good and you can hear it coming from a mile away in every video.",
    "score": "61",
    "comments": "40"
  },
  {
    "postId": "t3_1j52yjk",
    "title": "The obsession with control with Muslim arab parents",
    "content": "I’ve always wanted to live life on my own terms, but my Muslim Arab parents make it feel impossible. Even though I’m an adult, they still try to control every aspect of my life my career, my choices, even how I spend my time. The moment I push back, I’m met with guilt-tripping and emotional manipulation: \"You’re disobedient.\" \"You’ve dishonored us.\" \"I will never forgive you until the Day of Judgment.\"\n\nAnd many of the things they react this way to aren’t even that big of a deal. For example, I’ve always wanted to cut my hair short, but my mother made it clear that if I ever did, she wouldn’t forgive me and that it would be a a sin hanging over my neck until Judgment Day. Even something as small as asking them to knock before walking into my bedroom turns into an argument, as if having basic privacy is an act of rebellion.\n\nAnd if not through words, they use threats. They tell me they’ll force me into marrying someone against my will or that they’d lock me in a room if I disobey them. Even if they don’t act on these threats, just hearing them is enough to make me feel powerless, like my life isn’t really mine to control.\n\nIt feels like their love is tied to control as if I can only be a \"good\" son or daughter if I follow everything they say without question. Their obsession with obedience and authority makes it impossible for them to see me as an independent person. It’s as if my life belongs to them, and any choice I make for myself is seen as betrayal.\n\nI know they believe they’re acting out of love, but it doesn’t feel like love. It feels like a cage. It’s exhausting to constantly be torn between my own happiness and their expectations. I’m tired of feeling like my worth is tied to how obedient I am. I just want to be allowed to make my own decisions without fear, guilt, or the weight of their disappointment crushing me.\n\nWhat hurts even more is that when I try to talk about this, I’m always met with the same dismissive responses: \"They’re your parents, you must obey them no matter what\" Society expects the owns who go through this to just accept it, as if their love should come with conditions and control. But I don’t want to spend my life suffocating under obligations I never agreed to.",
    "score": "2",
    "comments": "1"
  },
  {
    "postId": "t3_1j5805v",
    "title": "Im so dense, she was flirting with me (I think)",
    "content": "I really don’t have anyone to talk about this to so I’m just gonna share this here.\n\nA year ago I (20M) was at a party with some of my friends. At the party there was this really pretty girl, I’m talking people’s heads were turning when she was walking by. We were alone at the snack table and started talking (I don’t remember much details), the conversation went really smoothly and at the end she invited me to go to a rap concert with her. I politely declined as it’s not my genre of music.\n\nThe party went on, everyone got slightly drunk and the girl invited me to dance with her. At some point the dance became kind of intimate (to the point she wanted me to „grab her ass” jokingly)… so  ofcourse I excused myself and went to get a drink.\n\nAt some point me and my friends went upstairs to chill on the couch, later in the evening the girl joined us and squeezed in right next to me. Some time passed and it was getting late so people began to fall asleep. I wanted to go find a bed for myself but it turned out the prettiest girl I’ve ever laid my eyes on fell asleep holding onto me, snug on the hoodie over my left ribcage. Being the awkward fuck that I am I just spent the night with one arm parallel to my body and the other on top of the couch as to not hug her without consent.\n\nMy memory has never been the greatest so I probably left out some details, but generally our chemistry when talking was great.\n\nIn hindsight it seems pretty obvious she could have been kinda into me (or she was jus being nice, guess we’ll never know)",
    "score": "1",
    "comments": "4"
  },
  {
    "postId": "t3_1j52dmb",
    "title": "PSA to archive stuff you like.",
    "content": "Internet stuff, anyway. Pictures, videos, files, steam mods, whatever. Save it, archive it, back it up. You don’t know if the creator is going to nuke it, the platform goes down or you lose track of it. Better safe than sorry. Only knaves don’t save!",
    "score": "2",
    "comments": "0"
  },
  {
    "postId": "t3_1j51wpu",
    "title": "No matter what i do,i dont matter.",
    "content": "It doesnt matter wheter i allow them to copy my homework or make presentations so that we can waste time in class\n\nIt doesnt matter if i put in the most amount of effort out of everyone\n\nIt doesnt matter if im the only reason some people pass their classes\n\nIm just too boring\n\nIm too dull\n\nIm nothing.",
    "score": "2",
    "comments": "0"
  },
  {
    "postId": "t3_1j4v23r",
    "title": "Sometimes I go into toilets to be alone",
    "content": "I feel so self conscious in public. As a Uni student, I stayed home almost the entire semester last year because I just hate to be in crowded lectures halls.\n\nI feel so uncomfortable walking to the campus from the uni accommodations cause there’s so many people walking the same way.\n\nI haven’t made many friends cause I can’t talk to people, the only ones I have are through a group project and one that I knew earlier online.\n\nI sometimes really wanna study somewhere not in my room, but I can’t stand going to the libraries or cafes cause they’re always so crowded. It feels horrible\n\nThe main point is this. Sometimes when I’m at uni, I will feel so vulnerable, so self conscious, that I’ll go into a bathroom stall just to be alone for a moment. Not just bathrooms either. I’ll hide anywhere I can. I was once waiting to take an exam, there were so many people in line and the invigilators were late setting up, so I walked through this door in the hall where j was waiting, into this random break room where I probably wasn’t allowed to be, but I just couldn’t stand there.\n\nI spend a lot of time on how I look, how I dress, because I don’t want to stand out. If I look sharp and nondescript, I’m that much closer to invisible. Or at least that’s the rationale I’ve come up with, it’s sort of a subconscious behaviour.\n\nI can also barely leave my house without headphones. Maybe it’s some sort of protection, some defense mechanism that disconnects me from the world around me.\n\nI know my fears and anxieties are extremely exaggerated, logically there’s no reason for me to be nervous. Maybe there’s some underlying psychological disorder that’s causing it, I do have ADHD and autism, but I can’t afford therapy or any sort of treatment so I really just have to deal with it for now, until I graduate. But it mostly hurts because I know that it won’t just get better with time, I need to do something about it, the future won’t be brighter just because the present is so dark. But I’m trapped like this for now.",
    "score": "5",
    "comments": "0"
  },
  {
    "postId": "t3_1j4drdt",
    "title": "I sent nudes to feel loved, but it only left me with regret and shame",
    "content": "Over the past few months, I've had talking stages and situationships with six guys. After a while, they all asked for nudes, and some even threatened to leave me if I didn’t send them. I knew it wasn’t right, but I kept sending them anyway, without really thinking about the consequences. I kept convincing myself that maybe it would be different this time, that maybe they would care about me, but deep down I knew I was making a mistake. Once I sent them, I immediately felt disgusted with myself. The shame hit me hard, and I couldn’t stop thinking about what I’d done. I felt like I had given away something of myself, something I couldn’t get back, and it made me feel empty and worthless. I just wanted to feel wanted and loved, but now it feels like I’ve only been used. Long story short, they all left me—some blocked me, others ghosted me without a word. I know I should have stopped after the first guy, but I was so desperate for affection that I ignored my own worth and let myself get caught up in it. I feel so small and discarded now. Looking back, I’m filled with regret, and I can't shake the feeling that I was taken advantage of. The shame eats me alive, and I’m constantly terrified that my pictures are out there somewhere, being shared without my consent. It haunts me. I sent nudes to all six guys, and each time, I convinced myself it would lead to something real, but in the end, they all left, and I feel like I've only given pieces of myself away for nothing. Am I the only one who’s gone through this? I feel like I’ll never be able to undo the damage I've done to myself. Also, I’m still a virgin—can I still be considered a virgin if I’ve sent nudes? It feels like I’ve been used and thrown away, and that’s hard to live with.",
    "score": "96",
    "comments": "44"
  },
  {
    "postId": "t3_1j56y05",
    "title": "I’m a failure..",
    "content": "I fuck up everything good in my life. I had the most amazing guy and I fucked it up.\n\nI’m a miserable, depressed piece of shit. With no self esteem and severe social anxiety.\n\nMy life sucks. I ruin everything for everyone including myself. I drain the happiness and fun out of everything. I don’t know how to laugh, be myself or make jokes anymore.\n\nI take several medications. Nothing helps anymore.\n\nI had multiple shots at my dream job and I fucked every last one of them up.\n\nI’m 25 with no future and no friends. All of my college friends moved away and forgot about me. I don’t have any friends. The only time I get a text message is when my medications are ready.\n\nI’m stuck at home being a caregiver for my sick mother. Who sometimes still controls me like a child. I have too much guilt to leave her behind and go else where.\n\nI have no money, no license (bc I’m too much of a pussy to get behind the wheel), no car. Nothing.\n\nI’m not a normal girl. I hate dress clothes, don’t want children, no make up. Only video games, superheros and having a potty mouth worse than a sailor. I’m clingy, rude, no social skills, and can be loud. Who would like that? Even my own fucking dog hates my guts.\n\nMy boyfriend dumped me, my soul cat of 17+ years just died, I knocked my front tooth out which won’t be fixed for another 2 months, I live in a shitty apartment with insanely loud neighbors to where I can’t sleep at night. Shall I go on?\n\nIt’s been 25 years of miserable years and bad luck. If I didn’t have bad luck, I wouldn’t have any at all!\n\nMy life is gonna end at a ripe old age with no one that cares about me or would even come to my funeral. I’ll be alone and miserable forever.\n\nIn the end, it’ll always just be me, myself and I.\n\nI feel at least a bit better getting that all out..",
    "score": "0",
    "comments": "0"
  },
  {
    "postId": "t3_1j56m70",
    "title": "how long do yall use ur phone",
    "content": "cause i just had a massive argument with my dad about phone limit times and we were talking 3 HOURS HERE. ngl i dont think its that long at all and i only used it to call w my friend even though i had to end it mid call cause he bursted into my room and started yelling at me for being on my phone for too long like it was after dinner time and i even did the dishes today and i was just having my free time. i rarely have my own times since im only allowed to use my phone for an hour and a half everyday but today was an exception cause it was my long distance friends birthday and i just wanted to celebrate it with her.",
    "score": "1",
    "comments": "1"
  },
  {
    "postId": "t3_1j561yb",
    "title": "I cant stop hitting my wall",
    "content": "I dont know if it technically counts as self harm, but everything makes me mad. Games, my family, loneliness, etc etc etc. I've hit my wall so much that I have to change how I hit it. I think a part on my wrist might be broken, so now I have to use my knuckles. I reached out to 988 and they suggested taking it out on a plushie. I only had one and it's in pieces now, so back to the wall. I wish I could go to therapy so fucking bad, but we cant afford anything. I wish I was raised by people who made me feel comfortable enough to talk about my problems, but the most they would tell me is that im stupid for hitting myself and the walls.",
    "score": "1",
    "comments": "1"
  },
  {
    "postId": "t3_1j560mr",
    "title": "I think i believe in fate because my first love came back into my life",
    "content": "I, (21 f)am dating my high school sweetheart again after years of not seeing or speaking to each other.\n\nWe met working a shitty fast food job in high school, and I fell in love with her almost immediately. She’s smart, so fun to be around, made me laugh and made me feel genuinely loved and appreciated for the first time in my life. I felt more confident, more comfortable around her. Not to mention she’s also the most gorgeous person i’ve ever seen.\n\nWe dated for a bit, and then she broke up with me towards the end of our senior year. I was heartbroken, and went off to college still processing and dealing with the breakup. As silly as it sounds and I know most people think this with their first love, but I really thought i was going to marry this girl. We chatted on and off throughout my freshman year, just normal shit like “hey how are you doing” and “we should catch up” before I finally decided it was finally time to fully move on and forget about her, so I blocked her on everything that summer, and deleted her number.\n\nWhile i still thought of her from time to time, I wasn’t angry or hurt about the breakup anymore, I had accepted that 17-year-olds know nothing about love, and all I can do with heartbreak is learn from it.\n\nFast forward to the beginning of my junior year of college, and I’ve dated on and off for years now and was in the process of trying to end a terrible long term relationship. I drove from college to my hometown, around 3 hours, to be with my friends after ending things while my new ex blew up my phone with calls and messages telling me what a horrible person i was for breaking up with her (I was not, she treated me terrible and refused to listen to me when I had an issue).\n\nMy friends and I decided to grab food and hangout in my car in one of the parking lots in our hometown. We pulled in, and I saw my first Ex’s car. It had a very distinctive bumper sticker, so I knew it was her. I didn’t get out or try to say anything, but my heart skipped a beat. I really truly believed I would never see this girl again. I debated reaching out, but in the end I unblocked her on snapchat and reached out with a simple “hey! were you at x lot the other night?” and we spent a few weeks catching up and then hung out for the first time in years.\n\nShe told me she missed me, and had always regretted the way things ended between us. I had no intention of trying to date again when I reached out, but I admit I did miss her too. That was about 9 months ago, and one thing led to another and now we are fully back together and it’s been amazing.\n\nI know it’s only been three years since we broke up originally, and I will say that I still don’t know anything about love. I’m a different person than I was in high school, and so is she. She makes me feel like the most beautiful person in the world, and i’ve never come close to feeling this way for anyone but her. All I do know is that as long as I’m able, I will do my best to love her the way she deserves, because as far as i’m concerned she does the same for me. I can’t help but wonder how my life would be different now if we hadn’t gone to that one parking lot that night.\n\nThank you for reading, xoxo",
    "score": "0",
    "comments": "0"
  },
  {
    "postId": "t3_1j55cg2",
    "title": "This boy that I like…",
    "content": "Not much to describe honestly… Just wanted to get it out. But I’m in love with a boy since the 4th grade… Btw I’m a college student now… He’s in a different country now and I’m in a different one… And I kinda just wanted to let it out, and maybe see if anyone else has gone through the same… It’s been 11-12 years, but I’ve never been able to tell him… And you know the worst part is that I know that I love him, because he’s respectful, smart, caring, kind and just an overall amazing guy… But idk why, I’ve just never told him… Not asking for advice or anything… I’m just putting it out there. Maybe someone might relate?",
    "score": "1",
    "comments": "0"
  },
  {
    "postId": "t3_1j55c34",
    "title": "I sometimes wish I had an eating disorder.",
    "content": "I'm a 21-year-old trans woman. I realized I was transgender some four or five years ago, and I have been on Hormone Replacement Therapy (HRT) for almost a year. I suffer from anxiety and depression and was diagnosed with Cyclothymic Disorder. So yes, I deal with body dysmorphia and gender dysphoria. I won't deny that it likely fuels a lot of my feelings.\n\nBut despite that, I am extremely self-conscious of my weight. And you'd think I'd be fine with it. I support body positivity heavily and would not ever judge others about their weight. Weight is not a proper scale of health, nor should it be tied to your self-worth; weight is weight. It only ever seems to be myself that I judge for my stomach.\n\nI have a potbelly. When I look in the mirror, all I see is my too-large stomach. And how it doesn't match the body that I'm SUPPOSED to have. And I do everything in my power to hide it because it causes me so much embarrassment. I wear high waisted skirts and pants, I'll tighten my belt just a little too much to tie it in, and I'll wear shape wear all so I don't have to acknowledge it. It makes me feel like less of a woman. Which I know is stupid. Women come in all shapes and sizes. Hell, my girlfriend is plus-sized and she's the most attractive woman I've ever laid eyes on. And yet, I still can't help but compare myself to other women, who have flat stomachs and small shoulders.\n\nI can never stick with exercise long enough to see any results. I like eating unhealthy, sugary foods. I eat a lot, in part to help my chest grow bigger, as HRT affects new fat distribution. I like to eat. And I live in the south, so you KNOW the food here is good. I'm terrible at forming habits. It feels like no matter what I do, I'll never have the body that I actually want.\n\nSo, sometimes, I wish I had an eating disorder. I've TRIED to give myself an eating disorder. I wish that I could go days without food and let my stomach shrink, just so I can finally look the way I want. I wish I could live on scraps of food. But I can't. Food is always there, mocking me until I finally give in.\n\nAnd the worst part is that I feel like I can't tell anybody. I can't talk to my girlfriend about it because it's a trigger for her own weight dysphoria. I have no friends I can talk to about it, and I'm terrified to talk to my parents about it. I hate the way my body looks and I wish I could just force it to look the way I want.",
    "score": "0",
    "comments": "0"
  }
]