[
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 02:53:54 UTC",
    "id": "1j67irz",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "I (M21) am in my last semester of undergrad. So far in college career I’ve been on 0 dates, had 0 sex, and I also haven’t had my first kiss yet. Anytime a friend would ask how I was doing with girls I would say that I didn’t have time because I was taking 18 hours every semester. Partially, that was true. Depending on classes, it could be a particularly time-intensive thing. Though, I would try to get involved on campus whenever I could.\n\nI guess, long story short, all my friends have had this stuff fall into their laps. I don’t know why I haven’t been so lucky. I’m worried that I’m past the point where having no experience is fine, and now it’s leaning into “sad” territory. I think I’m decently attractive and funny, so I don’t know what my issue is.\n\nI am going to grad school VERY far from my whole support system and where I’m in undergrad. Im afraid the work load there will put me in a similar position to not be able to do anything. \n\nI don’t know, I guess I’m just throwing this out there. ",
    "subreddit": "TrueOffMyChest",
    "title": "I feel like I can’t find love.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j67irz/i_feel_like_i_cant_find_love/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 21:57:32 UTC",
    "id": "1j61gx2",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "To start off, I’m 27(f) with a 22(m) boyfriend. We’ve been together for almost 3 years, and we met due to working together. I still cringe at our 5 year age gap. I have a friend that is 30(f) and I don’t know if I am a complete a**hole for wanting to cut ties with her, or maybe I already accidentally did.\n\nThe last time I saw her, I ended up staying for a weekend which was fun at first, and we tried to drink, but we both fell asleep too fast, which her boyfriend got mad about. I did not like this boyfriend (36m) due to him constantly sleeping with his ex and being so obvious about it but she’d be in this denial or whatever and cry to me constantly about it. He was also somewhat a neglectful parent to his daughter from what my friend would tell me. So anyways, the next day came and I agreed to stay an extra day to watch her two daughters, and figured I’d be getting paid because we discussed it prior. Well I didn’t and during this, I ended up getting bed bug bites on my neck, hands, and ankle area. Pretty much where my skin was exposed. Since leaving there I still feel like I have bugs on my skin and I’m honestly afraid to ever go back. I don’t know why I pick and choose when to be confrontational because I just let left and didn’t say anything. I don’t know whether to say anything at all. We’ve talked about bedbugs before and she’s said she’s gotten rid of them so I don’t know what to say. Fast forward a few days and she tells me her and her boyfriend (36)m broke up and she’s back together with an ex (32)m. This ex (32)m was sleeping with a 17 year old girl and my friend (30f) let both of them move into her home with her two children, before they both just dipped and apparently had left the place trashed and that’s when the bedbugs originally came about around this time too. Oh, and that man(32m) knew her children for a few months and was having them call him daddy. I felt so uncomfortable witnessing all of this, and then seeing what she allows herself and her children to be put through willingly. For months I was telling her xyz was not right and she’d be defending herself and him (36)m until they broke up. At that point is when she is like oh I could never be with someone who does xyz and completely shitting on this man talking about everything she defended and excused, when she put up with it for months and would have continued to put up with it if he (36m) didn’t have his baby momma over again to stay the night after she had been begging him to stop for months doing that for months. So I’m just over it? I’m like why are you actively choosing to put yourself through these things? I don’t like to sugar coat things, because why the hell should I act like neglecting a child is okay just to be a girls girl? Their relationship wasn’t abusive or anything like that, a lot of accusations of cheating coming from both &amp; issues starting a few days after they began dating which is never a good sign but neither were afraid of each other it wasn’t like that, and she will put up with almost anything to keep a guy around and that’s my issue. I used to think she was a good mom, but I don’t think she’s that great anymore. I used to praise her when she would say she wouldn’t let strangers around her kids and doesn’t let anyone else watch her kids until I realized she’s letting men she just met meet her kids inside her home, and be around them unsupervised. I used to think she was a good mom until I realized she raises her daughters through sugar and electronics, and doesn’t really “watch” even though around her children. All of these realizations have come to me now after she broke up with her long term boyfriend of 2 years(34m) and have gone through 4-5 relationships in a year and I don’t think she’s the person I thought she was, and I feel awful but I don’t want to be around someone like that. So she has her new boyfriend ex boyfriend (32m) currently living with her again, and I sent her a message a couple days ago saying I think that he’s a pedophile and I don’t want to be around him to which she’s never responded, but has sent other things. I know that once her and her current boyfriend (32m) break up or start having issues, she will be wanting my pity party but I can’t do it anymore. I feel like I have no empathy for her anymore. If we had more to talk about than her and her relationships I feel like it wouldn’t be such an issue but she has no subsidence to her at all if it is not about a man. Any advice on what you would do in my situation? It’s not my life so I don’t know why I’m so bothered. ",
    "subreddit": "TrueOffMyChest",
    "title": "I need advice",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j61gx2/i_need_advice/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 02:32:47 UTC",
    "id": "1j674ys",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 0,
    "secure_media": null,
    "selftext": "Specifically, that my animals will be OK. One dog will go to my parents'. One will go to my friends who are obsessed with her breed (and if they find her another home, awesome). My bird will either go to the local zoo or the house down the street. My cat can literally go anywhere. I am not needed. \n\nI promised my therapist I would reach out if I was planning anything. I lied. The gun in the house is gone but I still have the ability to purchase one amy day I'd like. \n\nWork doesn't need me. We all know we are expendable at our jobs, but it's been hard for me to accept. But there's no other way to reconcile the fact that I've been at my job longer than two employees who have become managers and yet I'm nothing. \n\nI'm useless. I'm dispensable. I'm nothing. \n\nI'm about done. ",
    "subreddit": "TrueOffMyChest",
    "title": "The past few weeks have shown me that life will continue without me.",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j674ys/the_past_few_weeks_have_shown_me_that_life_will/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 02:14:59 UTC",
    "id": "1j66syz",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 4,
    "secure_media": null,
    "selftext": "I hate to say that I am that guy who has been single for a really long time despite my best efforts, but I am. I (27M) haven't even been lucky enough to go on a date in like 5 or 6 years, but I have not given up hope even though things do look a bit bleak for me at the moment. I am a really busy graduate student, I try to fit in workouts and other activities too but it is pretty hard. I do not have a lot of extra energy left to put in substantial effort to find the right person for me on most weeks. So the thing I kinda wanted to get off my chest is I have been working on concepts/writing for a (fantasy) novel for a while when I get some time alone. With my life being romantically unfulfilled, I have fit in a relationship between two characters (the MC and another) to fulfill all the things that I have dreamed about. It was not really part of my original ideas for the story but it kinda just happened. Its pretty much all wholesome relationship stuff that I have never really got to have; the hand holding, the closeness, sharing feelings, tender moments, having each other's back, etc. As lame as it sounds, it has been decently fulfilling for me. There are still days that I really could use a hug even from a friend, but there is something about getting all the stuff I have always wanted on paper that has been pretty nice and comforting. Even though adding this stuff in has been satisfying for me, I am a little afraid it makes the writing worse lol, and when its all finished it makes me that much more afraid to show it to anyone. Some of my friends know I have been working on this but have no idea there's romance involved in it. I just really wanted to get off my chest I have been vicariously living out my romantic dreams through my fictional characters because I do not really have a better outlet. I think its been a healthy way to express what I am missing out on?",
    "subreddit": "TrueOffMyChest",
    "title": "Honestly, this is how I am learning to cope with being single/lonely for a long time",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j66syz/honestly_this_is_how_i_am_learning_to_cope_with/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 02:11:54 UTC",
    "id": "1j66qwr",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 6,
    "secure_media": null,
    "selftext": "The gist tho are the relationship posts how you're just not compatible with someone nothing less nothing more \n\nAnd that the wrongs of others are so shit it's intolerable and I hate it \n\nI know pretty basic realisations but by god we are blind to our own mess til we see it in others hey?\n\n \n\nCheers to us all just trying to live our best lives here's more for the future !!! ",
    "subreddit": "TrueOffMyChest",
    "title": "Damn I ain't naming names but a lot of posts here recently made me realise a lot of things in my subconscious that wasn't coming out to my conscious mind",
    "upvote_ratio": 0.8,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j66qwr/damn_i_aint_naming_names_but_a_lot_of_posts_here/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 02:05:57 UTC",
    "id": "1j66ms7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 0,
    "secure_media": null,
    "selftext": "I know it probably sounds like I’m in love with this friend but I’m not. I’m married and happy. But this boyfriend is an ex friend and ex boyfriend of mine and I was really close to them. They were my first friend in my new highschool where I didn’t know anyone. One day a couple years ago they texted me saying all this mean stuff and telling me that we weren’t friends anymore. They also didn’t tell me what I did. \n\nIt hurt so bad for years, and I’m just now getting over it and I was doing good until I saw my friend posting about their new boyfriend and seeing my ex’s face just hit me. \n\nEven after we had broken up we were great friends and hung out almost every day until that text. \n\nA really big part of me wants to stop being friends with the current friend, or at least keep my distance until I feel like I’m ready. I don’t know what I’m going to do. Honestly I might just block them after sending an explanation. I’m a bad person after all so they probably shouldn’t be friends with me. \n\nSomeone please help",
    "subreddit": "TrueOffMyChest",
    "title": "My friend has a new boyfriend and I hate it",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j66ms7/my_friend_has_a_new_boyfriend_and_i_hate_it/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 01:32:06 UTC",
    "id": "1j65zll",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 5,
    "secure_media": null,
    "selftext": "So we made the plans and I asked if it was a date or not, to my surprise she said it was which is just awesome to me. \n\nWe met on the train heading to the neatest city to us, I had zero idea where I was being taken but it was a small café not too far from a park and museum. We sat in there for around an hour before walking around the park and just talking, the weather did start to turn a little dreary so we went to the museum and listened to an organ for a bit before just walking around to see what had changed since we'd last been there (they removed all the old armour/swords and replaced them with old chairs?) \n\nTowards the end we walked back through the city and got on the train. I got off two stops later than I should have just so I could walk her to her car and then we headed our separate ways. \n\nAll in it was a pretty fun day and we're thinking of going out for dinner next time. ",
    "subreddit": "TrueOffMyChest",
    "title": "Update: I (23m) still love my ex (24f) and I don't know if she feels the same",
    "upvote_ratio": 0.73,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j65zll/update_i_23m_still_love_my_ex_24f_and_i_dont_know/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 01:08:41 UTC",
    "id": "1j65j6m",
    "link_flair_text": null,
    "media": null,
    "num_comments": 42,
    "score": 252,
    "secure_media": null,
    "selftext": "I wake up 4:30am on weekdays to go to work so I have dinner at 7, go to bed at 8, so I can decompress and relax to then sleep at 9:30-10.\n\nMy family has been having dinner at 8:30 for about a month now because one of my sisters gets off work at 8 and they've been expecting me to wait for them but if I do so, I would be going to bed at 9-9:30 giving me little to no time to decompress and relax to finally sleep at a decent hour.\n\nPretty much 2-3 days they ask me if I want take out for dinner and everytime I say no because I can't wait for them because it gets late pretty quickly and everytime they get annoyed at my answer. Today a spin off of a show that we watch all together premiere and now my mom is complaining we won't get to watch it because \"I don't wanna eat dinner with them anymore\".\n\nIs it so hard to empathize a little and understand I have to wake up very early to go to work? Like, why are they like this?",
    "subreddit": "TrueOffMyChest",
    "title": "My family hate that I go to bed earlier than them and I hate that they expect me to not do it",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j65j6m/my_family_hate_that_i_go_to_bed_earlier_than_them/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 01:08:02 UTC",
    "id": "1j65iqy",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 4,
    "secure_media": null,
    "selftext": "So I (18f) just finished volunteering for the day at my workplace (animal sanctuary) yesterday, when I got a message from my boss to see he sent me a termination letter, nothing in the message either just the letter itself, and they have ignored me since. \n\nAlso sorry this is a long one, I just have a lot of things in my head I need to sort out. \n\nSo a bit of backstory, since I was around 14 I’ve been dealing with the struggles of depression, anxiety and adhd and ended up leaving school in yr10 because of it. Took a while to figure out but I ended up going to tafe to complete my cert ii and iii to become a qualified zookeeper as I’ve always loved animals and can’t see myself doing anything else. Because of tafe I had to start volunteering to complete the practical component of my course and ended finding this amazing sanctuary to work at. \n\nSo I ended up starting there in early February 2024 and fell in love with the place and the people. I was originally going once a week but started going twice a week in around November bc I loved it so much and wanted to be there more. They always told me they loved how I would be there consistently every week and I would pride myself on it as it was a big commitment for me as I lived an hour away. \n\nThe environment there was great, honestly I couldn’t have asked for it to be any better. The owners always quite involved and prided themselves on this and wanted us to feel more like family rather than a workplace. Because of this I became quite close with the people who were on my days and considered them my second family. \n\nThe owners also lived on site and their kids were always around, because of this I became quite close with them as well, even buying them small presents for their birthdays and helping them with their homework. \n\nI suppose I’m telling you this so you understand how close I was with them, their family and the other volunteers, so you can understand how hurt I am by the way they’ve handled this situation. \n\nEven on my bad days, they were half the reason I’d get up in the morning, even when I didn’t want to drive, or talk to people, I’d still show up bc I didn’t want to let them down, as again I seen them as my second family and greatly valued their opinion. \n\nSo fast forward back to yesterday, it was completely normal. Nothing out of the ordinary, we were still talking like normal, doing all our tasks as normal, having lunch together like normal, I even got a last minute tour and stayed back to finish it up, which brought in a fair bit of money for them. \n\nAlso just a note, it’s a non-profit, all the money from tours goes right back into the sanctuary to care for the animals, food and water, vet bills, etc. \n\nSo just my little routine afterwards, I stop on the way home to go to the bathroom, get food, etc. So I was checking my phone like normal, and seen he sent me an attachment, funny thing is I thought he was sending me a dumb reel or something. Boy did I have a rude awakening when I read termination letter. So naturally I read through it and start crying because again, that day was normal, there was not even a hint that something like this was coming. Luckily I had one of my friends with me so I didn’t do something dumb like driving with so many tears in my eyes I could barely see and probably getting into an accident. \n\nIn the letter he basically highlighted the fact that he wants to maintain a positive workplace and while he values my input, he needs to put the sanctuary first, blah blah blah, the typical things in a letter that would put the blame on me so he doesn’t seem like the bad guy. \n\nSo one important thing to mention, they say this to everyone but from the start they said that they’re the kind of workplace to make sure everyone’s included and don’t like people to form cliques. However, I became really close to two people in particular, specifically because they’re great friends and have done so much for me. \n\nNow while I was really close with these two, I feel we included everyone when we could. Especially since some days at the sanctuary we’d be so busy we’d barely see each other that day. So we’d always go out for lunch, however we’d always ask everyone if they wanted anything and never ate out, always came back to be a part of the whole team. (We’d all have a break at the same time.) \n\nNow obviously being friends, we’d hang out after work, (but again we’d ask some people if they’d wanna come if we weren’t going too far away.) And we would call and stuff, but I feel it’s normal for friends to do that. \n\nSo one thing I could see where they wouldn’t have been to happy with this, is that we were doing an animal course about 5 hours away. You have to finish the online part first before you go do the practical bit. So one of my friends told the boss that we were going to be doing it (he already done it prior and was just driving us), and unlike the last time it was done, they didn’t put it on the group chat or anything for people to say they’re interested. I think they assumed we’d tell people that we were doing it and ask if they’d want to come. Mind you this was about a month in advance, so plenty of time for people to do the online section. I will say this course ends up being quite expensive so some people weren’t able to do it due to financial reasons anyway. \n\nAnyways long story short, one other person from the sanctuary ended up doing the course (btw the course only has 4 spots for the Prac part). We had a great time and included him in nearly everything we did (he traveled separately to us so was only left out of stuff we did on the way). We even had a game night and everything and really the only people who were left out were the people who couldn’t come but wanted to, which I don’t blame them for. \n\nI can only assume that this is the reason they fired us (my friend that drove was quitting, next week was going to be his last, however they messaged him yesterday basically telling him to not come back, and my other friend also got a letter similar to mine.) \n\nAgain, I was completely blindsided by this, as yesterday and even the last few weeks were completely normal. No they didn’t even try to chat with us, saying something like, ‘hey this is what we can see is happening and we don’t like it, can you just try to include the other people more’. Something like that and I wouldn’t have been as devastated. \n\nThe only other thing it might be is that I would make some pretty crude jokes, although I wasnt the only one that would say them, and me and my boss would say them to each other and everything (we’re Aussie btw, it’s part of our culture I suppose, if we don’t know you or don’t like you, we’ll be quite civil/polite to you, but if we do like you then you’ll probably cop it.) although I don’t think this was the problem bc again it wasn’t just me making these jokes. \n\nI guess what hurts the most, is that I really respected my boss and viewed both of them quite highly. Like they’re great people (at least I use to think so), they’re great parents, really community oriented and from what I’ve heard, quite highly regarded in our field. So basically for him to not even have the decency to even send me a message along with the letter it is what hurt the most. So naturally I sent them both a message, asking them to give me a call bc for my own peace of mind, I really need an explanation. Both of them (I assume accidentally) opened the message and I can see they read it, however they both ignored it. So I sent them an email this morning, however still waiting on a reply. \n\nI’ve never been through a breakup but I imagine it’d be like this, except instead of breaking up with one person, I’ve just lost my second family. With no warning, no explanation. \n\nAnyways thanks for listening to me ramble, sorry it was so long, I’m just kind of at a loss for now. Hopefully I’ll stop crying and get out of bed soon. Thank youse 🫶\n\nTLDR - I was volunteering at an animal sanctuary when I got a termination letter from my boss, with no warning, no explanation. I feel like I’ve lost my second family. \n\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "I got terminated from my volunteer position with no explanation",
    "upvote_ratio": 0.83,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j65iqy/i_got_terminated_from_my_volunteer_position_with/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 00:57:33 UTC",
    "id": "1j65b2d",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "Hi I’m 24F &amp; back in July 2024 I was at a stop light when a guy got out of his car &amp; started yelling at me because I was too close to his car so I rolled my window up and that’s when he got even more mad and tried to get his hands in the window before it closed but luckily it closed on time so he just banged my window. I didn’t say a word to him and just kept on driving but that’s when he reversed into my car and hit me. I called the cops and they said it was my fault because based on the damages it looks like I hit him and it was a he said she said situation. Fast forward I just found out I’m being sued today by him. Idk what to do. I’m also in nursing school &amp; im scared I’m gonna get kicked out. ",
    "subreddit": "TrueOffMyChest",
    "title": "I’m being sued for something I didn’t do",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j65b2d/im_being_sued_for_something_i_didnt_do/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 00:54:50 UTC",
    "id": "1j6595g",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "So basically she’s just been up my ass for the past couple months and I’m getting sick of it. She’s lied to my mom about me, completely ignores me and clearly favors my brother over me. I literally can not handle it anymore. I don’t even like being in the same room as her because she brings down my mood. All her and my mom do is fight and it’s too much, all my mom does is complain and say she’s gonna kick her out but she never freaking does. I’ve had a rocky relationship with my mom but it’s getting better but my step mom makes me literally want to move out. She complains when I do literally anything or if I go anywhere. Like a couple hours ago I used some nail clippers and a nail file to do my nails and I used hers (mind you she uses my shit all the freaking time) and me and my family used to Sharing stuff If someone needs it and she texted me while I’m at work bitching at me telling me not to use her shit and she’s sick of me. I told her sorry and she just kept going demanding that the minute I get home I gotta give them to her (which I already planned to before but I had to leave for work) I’m literally a minor and I work two jobs and she’s always on my back calling me lazy and spoiled. She loves to compare her childhood to mine (she didn’t have the best childhood) she told me I’d never make it if I went through what she went through, mind you I’ve been through abuse and assault ontop of that depression and anxiety. I literally just want her to get off my back, any advice or help? (Sorry if there’s spelling or anything I’m at work writing this)",
    "subreddit": "TrueOffMyChest",
    "title": "How my step moms been treating me",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6595g/how_my_step_moms_been_treating_me/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 00:52:22 UTC",
    "id": "1j657gu",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 2,
    "secure_media": null,
    "selftext": "Am I being used?\n\nDo I (26F) need a reality check? I’ve been friends with my friend, Blake (26M), for over a year now. We have been pretty close since the beginning. When we first met, we bonded over our shared love for playing soccer together and music. I would say we have many similarities. We both enjoy adult animation, like Studio Ghibli, raves, and playing board games. Since we shared many similarities, we kept in touch daily through text messages, phone calls, and FaceTime. We had a mutual friend named Jennifer. Jennifer and I were very close until I noticed that whenever we spent time together, she spoke negatively about everyone around her. As a result, I gradually distanced myself from her. Around the same time, Jennifer and Blake started dating. Although I wasn’t close to Jennifer and didn’t personally like her, I wanted Blake to be happy. Blake and I maintained a consistent relationship and communication. We talked every day, even during our lunch breaks, via FaceTime. However, things took a turn when Jennifer informed Blake that I had feelings for him and wanted to pursue a romantic relationship with him. That was not the case, and I was even in a relationship at the time. As a result, Blake ended our communication to preserve his relationship with Jennifer. We did not talk for eight months. However, in January he reached out to me. He told me that Jennifer suddenly broke up with him in December. Since then, we’ve been hanging out again. In February, we attended a rave and ended up having sex that night. A week later, we confessed to each other that we had both harbored feelings for one another since we’ve first met. At this point, I informed him that I didn’t want to be a rebound, and he responded by stating that he wasn’t ready for a relationship and wanted to focus on healing. I accepted his decision. We continued spending time together and continued having sex. However, I later told him that I no longer wanted to have sex with him because I was struggling to separate our friendship and romantic feelings. Around the same time his ex-girlfriend, Jennifer, filed a protective order against Blake.\n\nSidebar: Personally, I have had past experiences with abusive men, which may have influenced my perspective. However, I must admit that I am not entirely aware of the details of Jennifer and Blake’s relationship. Given Jennifer’s personality, I can’t help but wonder if this situation is a attention-seeking ploy. On the other hand, I have only heard Blake’s side of the story.\n\nHowever, I suggested that we establish boundaries. We agreed to refrain from having sex and I told him I need a break from constant communication. I also told him to fine another trusted friend to confide in about the Jennifer situation because I haven’t healed from my own trauma from the abusive I had endured. Blake expressed his agreement to the physical boundaries and expressed he didn’t want to lose me again and our friendship.\n\nSince implementing these boundaries, our relationship has undergone a significant change. We don’t talk that much anymore and when we do the protective order case seems to be the main topic of discussion. Although, last night, I visited Blake’s place to watch Star Wars. During the movie, he asked me to engage in a platonic cuddle. We did, and he said Thank you. I inquired about the reason behind his gratitude. He mentioned that my presence was naturing and made him feel less lonely. Am I only in his life  because he feels lonely?",
    "subreddit": "TrueOffMyChest",
    "title": "Am I being used?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j657gu/am_i_being_used/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 00:45:17 UTC",
    "id": "1j652ed",
    "link_flair_text": null,
    "media": null,
    "num_comments": 425,
    "score": 2640,
    "secure_media": null,
    "selftext": "\nThree weeks ago me (28f) and my husband (29m) went out to a bar. When we got there, we happened to run into a middle school friend of his. We got to talking and his friend was sharing stories about when they were in middle school together. Like the time his friend walked into the wrong restroom by mistake and was made fun or for a year and when my husband got hard asking out a girl, after a few more embarrassing and funny stories his friend who we'll call Jeff says \"hey remember that dog\". I think you can see where this is going. My husband started breaking down laughing and I was totally confused. So I asked \"what dog\" Jeff explained in sixth grade was/is/whatever the terminology is a \"zoophilia\" he was sexually interested in a dog named \"champion\" he didn't do anything but got a boner after he was playing with this dog. He and his friend shocked about it for a while but he kept taking pictures of this dog. It started to move from joking territory to creepy. Three months later, he attempted to kidnap the dog. Thankfully, Jeff's father (the owner of the dog) caught him.\n\nIs it weird that I'm reconsidering my marriage even though this hasn't been a problem in decades. My whole view of my husband has changed, so am I over reacting to my husband's middle school issues?",
    "subreddit": "TrueOffMyChest",
    "title": "My husband had a thing for a dog and now I’m rethinking him as a person",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j652ed/my_husband_had_a_thing_for_a_dog_and_now_im/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 00:34:13 UTC",
    "id": "1j64ucy",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "Hello. I’m posting this on here because anywhere else I could be found out. \n\nI’m a recent graduate who studied animation. I want to be a character animator working with studios or even just contract/ freelance work. \n\nBut nobody is hiring juniors or graduates. I aced my grades. I’ve been given compliments on my reel. I have connections. I did some experience only to be ghosted. \n\nLinkedIn and indeed are only posting Senior, Lead, or Principal positions, even if it’s a mid position they won’t hear back from you. Even when I reached out to people they said they liked my work but weren’t hiring. \nIn 2023-24 I reached out to over 115 places. From 2023 to now I have a spreadsheet and I’m on application 724. \n\nAxis Studios shut down, Technicolor and its subsidiaries shut down so now there’s an even bigger pool.\n\nI feel hopeless. I feel empty. People telling me that AI will take over me too, there’s nothing anymore. All I’ve ever seen myself as is an animator and if I can’t be that I don’t see myself doing anything else and I can’t fathom doing anything else that it’s making me think horrible things. That if I can’t get a job or if I’m stuck and the industry fails and I have to switch I’ll be at square one and I just can’t. \n\nWhat can I do. I’m so scared and hopeless. ",
    "subreddit": "TrueOffMyChest",
    "title": "The Animation industry is making me think dark thoughts.",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j64ucy/the_animation_industry_is_making_me_think_dark/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 00:27:03 UTC",
    "id": "1j64p36",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 3,
    "secure_media": null,
    "selftext": "Due to trauma I have an extreme flight feeling so that even though things are going good with my current partner I keep thinking about just packing my things and leaving. I keep thinking about a FWB I was with prior that if we had tried a relationship probably we probably would've been great together. I love my current partner and don't want to actually leave him and I can't say anything to either of them because I won't let my trauma response ruin a relationship and friendship. I am working on it with my therapist. I know that if I do pack up and leave and have something with the friend that the same feeling will happen with him because I need to work through the trauma rather than giving into it. I don't really have any friends I can talk to about it because none of them will understand.",
    "subreddit": "TrueOffMyChest",
    "title": "I think about the one that got away even though we were never together.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j64p36/i_think_about_the_one_that_got_away_even_though/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 00:14:59 UTC",
    "id": "1j64g7u",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 6,
    "secure_media": null,
    "selftext": "It has been almost 15 years since it's slowly started to dawn on me that my sister never really loved me: she just thought I was so much lamer than her, that she didn't see me as a competiton.\n\nFor the context: she is 10 years older than me and for as long as I can remember, I loved her more than anyone alive. I loved her more than our parents, brothers, friends etc. She was my absolute role model and everything she did was perfect.\n\nIt is fucked up to compare kids ever, but when parents and relatives are comparing two people who are so different and not even in the same age group, that is especially fucked up.\nShe was always labeled the beautiful one, me as the smart one. She was the caring child, I was the mean one. Her life was hard, mine was easy.\nEverything that was happening to her was always celebrated if it was good, or we were all devastated together with her if it was bad - and it was never her fault when it was bad.\nEverything I ever did was considered as luck, or as normal if it was good and my fault if it was bad. \n\nShe loved me back and always worked on building my self confidence - but never to the extent of me succeeding in being better than her in any way. This was particularly obvious in her relationship with our parents, where she told me multiple times that our father wanted mom to have the abortion when she was pregnant with me. Any sign of me not liking that thought was being met with the comment along the lines of \"me being too sensitive\" or \"oh, come on, he loves you now\". I reacted explosivelly about that only once, when I told her openely to go fuck herself with those fucked up pieces of info, which, of course, ended with her being in tears, appologizing, and making me promise THAT I WILL NEVER REMIND HER ABOUT THAT EVENT. She made it about her and her feelings and I was told by the involved parties that I shouldn't have been so hard on her.\n\nThese were occasional outbursts, when I would always make a conclusion that I over reacted and I would end up crying, begging her to forgive me and promising never to do it again. Bear in mind - we are talking about my teenage yeara here, not adult me.\n\nFF to my 20s: while she had one relationship with her then long-time bf, who became almost like a family member, I mostly fucked around and either didn't really meet reciprocated feelings in guys, or I didn't even want anything serious. She eventually broke up with him - it was a family tragedy, ofc, like anything bad that happens to her - and she somehow put us both together to \"we are never getting married\" file. I mean, she never said it, but it was obvious that she is not supportive of my potential relationships. I kind of knew it, but I became sure about it when I started to date my now husband, when I was 25, and as I became more self-assured because I felt loved, she started to become more and more openely toxic, and she was doing it often. She would use every opportunity to let me know she thinks he is lazy and irresponsible, while I didn't think any of that.\nShe started to hate my hobbies, style, habits (which didn't change much - I just wasn't as miserable as before) and she was suuuuper pissed when she broke with her second bf and I got engaged.\nShe called me and raged about how it is inconsiderate that everyone is saying \"congrats\" on social media, while they are aware of her recent break up. I felt bad because during the last year of her relationship she lost one pregnancy, but I still didn't think that I should hid posts my boyfriend put on social media when he proposed.\n\nAfter that, it all went downhill.\nShe was good to me either when something super good would happen to her, or when something really bad would happen to me.\nShe hated my wedding day and pregnancy, but she was full of understanding when I had PPD. She did nothing to help, but she was good to me then.\nAs soon as I got better, she was hating me again. In the meantime - all good that was going on in her life was still celebrated and all bad was mourned, while my life was kind of unimportant to our mutual loved ones (mostly).\n\nI started to fight back, but I was rarely talking shit about her to our family, while she wasn't really private about her opinion on me. Every time when she would show her good side again, I would come back to life because I would regain the hope that the most loved person from my childhood is still there.\n\nRecently, I lost all hope that I will ever want her back in my life. Our father died and in his final months, while I was crying my guts out and doing EVERYTHING to help him - as we all did - she told me that I was selfish as always and not showing any empathy towards him.\nThat was the straw that broke the camel's back for me and I screamed at her and told her to get the fuck away from me forever.\n\nWe did communicate after that, because there were many things that had to be done with our dad, and I was there for her to be her shoulder to cry on when she needed me, but it was just because I felt I had to, for the rest of our family.\n\nAs our dad passed, my feelings of disgust came back and I am back to feeling hurt by our last fight. She mentioned it briefly and said that it was just a dumb fight, as she always does after moments like that, but to me - it wasn't. To me now, none of the fights we had were dumb and they were all about one thing: her wanting me to be the obedient, loser sister that she had when I was from 0 to 20-ish and her from 10 to 30-ish.\n\nI can't stand the thought of her hanging out with my kid anymore. My kid loves her and I was so happy when my sister and I patched our fight from a few years ago and she had good relationship with her niece, but honestly - I have two fears:\n\n1. She would fuck her up the way she fucked me up,\n2. She would be telling my kid mean things to show me as a bad person, for whatever reason.\n\nOne thing I found out later, after my PPD was gone, is that she was planning to take the kid away from me \"because it seems like I am not fit to do it\", but she never considered talking to my husband about it. Like, he didn't have PPD, he was fine - why didn't she talk to him? Why was she planning to adopt the kid who was not out for adoption?\n\nAnyway... I am done with her, but I think I will need a lot of time to process this. Maybe therapy would be beneficial.",
    "subreddit": "TrueOffMyChest",
    "title": "Coming to terms with the thought that my sister is not a good person after all",
    "upvote_ratio": 0.81,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j64g7u/coming_to_terms_with_the_thought_that_my_sister/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 00:12:09 UTC",
    "id": "1j64e6n",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 1,
    "secure_media": null,
    "selftext": "I moved back home recently after graduating from college and living with my parents again has made me cry more than I did during my four years at college. I found out today that my mom opened an enveloped addressed to me and read mail intended for me that included a lot of personal information. She left the letter in her room for at least three days without even telling me I had any mail, and only mentioned it today. She's also been using the personal info in that letter to make fun of me.\n\nYeah, I'm lucky to have parents that will welcome me home and that feed me. They're not bad parents. But living with them genuinely makes me want to die.",
    "subreddit": "TrueOffMyChest",
    "title": "I hate living with my parents so much",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j64e6n/i_hate_living_with_my_parents_so_much/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 00:09:37 UTC",
    "id": "1j64ccx",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 12,
    "secure_media": null,
    "selftext": "You know how we always talk about how great someone is once they’ve passed? This friend was truly one of the best people I’ve ever known, hands down. I truly, honest to god, do not have a single negative thing to say about him. We’ve been friends for 20 years. We grew up together. He was the most himself person with a huge heart. He followed his passions in a way I rarely see, taught children who adored him, and was just such a damn good friend and person. \n\nDuring the last conversation I had with him over Christmas, he told me he was the happiest he’d ever been. Doing what he loves every day. Pursuing his passions. I was so so happy for him. That day he also met the man I’m going to marry for the first time and told me how much he liked him. It’s hard to imagine he won’t be at my wedding now. \n\nI know there’s no rhyme or reason to death, and I won’t waste my time on arguing with it, but man, if anyone deserved a long, happy life, it was him. I feel extremely sad and just needed to get it off my chest. ",
    "subreddit": "TrueOffMyChest",
    "title": "Close friend passed today at 28",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j64ccx/close_friend_passed_today_at_28/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 00:04:59 UTC",
    "id": "1j648yo",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "Can someone explain my situation?\n\nI don’t know who I am. Am I from this country? I don’t feel like I belong.\n\nI don’t feel like a woman or a man. Sometimes I feel like a child, sometimes a man, sometimes a teenage girl, sometimes a mother, sometimes a woman.\n\nI don’t know, but I feel frighteningly different from my family and the traditions of my country.\n\nEven the religion of my country—I’m not fully convinced by it.\n\nAm I religious or not?\n\nWhy do I always drift off and listen to songs in different languages but never in my native tongue?\n\nWhy do I always feel like I’m living in a parallel world? Why don’t I feel like I belong to this earth?\n\nWhy am I always alone, and why do I love escaping reality?\n\nAs I write this, I remember my childhood. At first, I pity that little girl, but in the end, I don’t want to sympathize with this woman—not because I’m not proud of myself, but because… why am I not brave enough to discover who I am?\n\nWhy do I feel like my personality isn’t real?\n\nIs it because of my environment, society, or because I don’t belong to this country and this religion?\n\nWho am I?",
    "subreddit": "TrueOffMyChest",
    "title": "Who am I?",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j648yo/who_am_i/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 23:52:38 UTC",
    "id": "1j63zlg",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 3,
    "secure_media": null,
    "selftext": "Sometimes I wish I could literally die in an accident so that the calls from collections and bills piling up on my mailbox stopped. Sure, I make $80K, but it means jack shit when I live in a somewhat expensive city and a huge chunk of my income goes towards these bills.\n\nRecently I started to have health problems, which are making me attend therapies to manage said problems twice a week. I'm spending an average of $600-$700 a month. I ended up in the emergency department last month too, which means I have to pay $4,000 to them.\n\nEverywhere I go for assistance turns me away because I don't make less than $60K, yet these braindead morons working there don't understand the concept of my income going towards these bills, leaving me with less money to even feed myself. I'm down to 1 meal a day and honestly I can manage it because I have an eating disorder, but I just feel bad for others that genuinely can't do it.",
    "subreddit": "TrueOffMyChest",
    "title": "Too rich to qualify for assistance. Too poor to pay the medical debt I need assistance for.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j63zlg/too_rich_to_qualify_for_assistance_too_poor_to/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 23:35:55 UTC",
    "id": "1j63n2g",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "I had melanoma cancer in 2023 and I'm starting to notice some of the same symptoms. I'm making a doctors appointment to get it checked out but if it's positive again I'm not telling my family or friends. I've always been the rock so when I couldn't be everything fell apart, I've had to put so much energy in time in repairing my life because I tried to depend on my village and they let me down on every account. I would rather go through the worst experience of my life again alone then go through the disappointment they put me through again. ",
    "subreddit": "TrueOffMyChest",
    "title": "I might have cancer again, and I'm not telling anyone but my doctor.",
    "upvote_ratio": 0.57,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j63n2g/i_might_have_cancer_again_and_im_not_telling/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 23:30:31 UTC",
    "id": "1j63j0w",
    "link_flair_text": null,
    "media": null,
    "num_comments": 62,
    "score": 2524,
    "secure_media": null,
    "selftext": "I don’t know if anyone remembers me but a while ago my girlfriend and I had a home invasion incident that culminated in her beating the shit out of the intruder. I’m tired of saying my gf so I’m going to call her Diana. \n\nTurns out the guy was a drug addict from the next town over. He was in his 60s and he had an extensive history in jail and mental hospitals. Unfortunately about two months after my post, he passed away. We didn’t know anything about why until we got a chance to talk to his sister, who insisted she didn’t blame Diana and that the doctors even said that he probably didn’t have much longer anyway. (Diana was visibly distressed during this conversation so I’m not sure whether or not the sister just said that to comfort her)\n\nAfter that Diana went on a trip to a national park during a week she knew I couldn’t take off and forgot her meds. She has seizures that look like mild psychosis/magical thinking and ended up refusing to come home at the end of the trip. She kept saying that she felt like she couldn’t leave the woods because she was certain there was something she needed to learn there that she hadn’t yet, and when I asked her how long that might take, she said “some people take a lifetime.” I asked if she was breaking up with me, and she said something about feeling like she was “too attached” to me, her house, her pets, etc and that she needed to meditate on that for a while. \n\nI ended up going to her temple to see if anyone was willing to give me some perspective on the situation since she was seeing things through a Buddhist lens. It was the right choice. A monk actually drove the six hours out to her with me to talk to her in person since she wasn’t picking up calls. I am so, so unbelievably grateful for that monk because Diana started taking her meds again and came home soon after. I’ve never been religious but I started to read the Pali canon afterwards and that shit slaps. Diana was already volunteering her time at the temple so now we both go together when we can. \n\nAll things considered, since then, things are back to normal and going well. We’re both children of divorce so even before all this we were doing prophylactic couples counseling every few months, and for a while after we were going once a week. Diana has started seeing a therapist on her own as well which I am so proud of her for since she’s always hated the idea of individual therapy. \n\nWe also stepped up our home security game. Diana already had plenty of cameras, but now we have door/window alarms and motion sensors. I also convinced Diana to get another dog, so now we have a 75lb puppy… \n\nI know a lot of people were rooting for us to get married, but that’s not going to happen. Legal marriage isn’t something that interests us and it never has. But we did buy each other rings, and it’s been a great comfort to have something physical to remind me of her on my person all the time. We’re also considering having a small commitment ceremony next fall &lt;3\n\nThanks again for all the feedback on my previous post. I got a lot of great advice, and some good criticism. I showed it to Diana and she got a kick out of the comments, and we had a little mutual cry over how kind a lot of you guys were. I asked her if she was okay with me posting this update, and she clucked at me and told me to do whatever I want online as long as I’m being nice (and anonymous lol). So… hope this qualifies! ",
    "subreddit": "TrueOffMyChest",
    "title": "UPDATE: My gf beat the shit out of someone who broke into her house",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j63j0w/update_my_gf_beat_the_shit_out_of_someone_who/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 23:24:33 UTC",
    "id": "1j63eh6",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "damn i will definitely be embarassed about this in the future but anyways  \ni've always been a sensitive person, i always cared about others and made sure to make them feel good and happy. My middle school years weren't the best: i had to move out of my old house and i completely changed life by moving to a town 50 minutes far from my previous residence. You can imagine that I, an introverted and nerdy kid, wasn't able to make many friends, and so i got lonely. In fact i was known as the lonely kid, no one ever wanted to talk to me and sometimes even made fun of me (i discovered some years later that everyone talked behind my back during those years, and that was the reason no one even wanted to approach me). And so i spent three years of my life by myself: i spent my days alone, definitely years that i wouldn't want to live again. Once middle school ended, i was full of hope: that same summer i made some friends and had a lot of fun with them, and so i was positive about starting high school. And so, once my first year of school started i tried to me more extroverted and social (the outcome was awkard, i'm not good at being extroverted). Even tho i tried, the outcome wasn't positive. This time no one talked behind my back, but i had trouble making friends and so i became the lonely kid once again. I was depressed, spent my days listening to music and sleeping all day just to escape that feeling of void that was suffocating, swallowing me whole. I was ready to end it all, but i wasn't brave enough to even try, so i kept living my life and eventually things got better. I made new friends, i became more social and felt truly happy after years of suffering. I am happy about how i lived the rest of my teenage years, but that feeling never got away. I am now left with an overthinking mindset (idk if i can call it like that), which leads me to anxiety about all the friendships that i currently live: i can't be calm, because i sometimes think that everyone will sooner or later go against me and make me live the hell i went through one more time. I can't trust anyone, and this thing is making me mad, because come on, why am i so defensive? why can't i just live my life like the others, and not worry about this? i don't truly know why i wrote this, probably to feel better or to relate to someone here who perhaps lived my same experience. Anyways, i feel costantly feel this overwhelming sense of entrapment in my own life, i feel like my past will always follow me, no matter what i do. No matter how many new people i will meet, i will always have this anxiety that they will disappoint me, and life is so hard this way. I don't even know if someone will read this, i will probably only get some upvotes and my post will be forgotten in this sub",
    "subreddit": "TrueOffMyChest",
    "title": "I feel stuck in this life of disappointment",
    "upvote_ratio": 0.63,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j63eh6/i_feel_stuck_in_this_life_of_disappointment/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 23:18:42 UTC",
    "id": "1j639z5",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "\n\n\n\n\n\nOkay it's weird but just hear me out.... I'm not boasting or flexing or anything I need to figure myself out.      \n\n\nYou know how sharks can feel it when there's bl**d in the water? Like physically feel it- I can feel it when someone has insecurities...like not even talking about them- falling back onto their insecurities, thinking about them while saying something else, drawing from them, the way they phrase certain things, the way they keep repeating certain phrases- it's the small things. And it's not even just insecurities it's the psychological weakness. I can physically feel it-that's the best way to describe the rush- it's like being pulled towards them like sharks everytime they psychologically bleed(that's the best way I can put it).     \n\n\nNow I know every human is empathetic and we can all feel to certain extents but I'm pretty sure most people don't go around feeling it like I do. I'm pretty sure most people wouldn't be able to tell how deep someone's insecurities run after one text conversation and immediately go 'yes I want this one'. And yes I understand it's f*cked up but help me understand it \n      \n      \n      \n ",
    "subreddit": "TrueOffMyChest",
    "title": "Drawn to insecurities and psychological weakness like sharks?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j639z5/drawn_to_insecurities_and_psychological_weakness/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 23:17:01 UTC",
    "id": "1j638ou",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 10,
    "secure_media": null,
    "selftext": "This happened in mid January. For context, I am 32F and my boyfriend is 34m, we’ve been together for 3 years and we live together in a house that I own. Now for the story- my dad has been unwell for over a month and my siblings and I (mom died from cancer when I was young) have been taking care of him while we waited for test results and some answers. Last week his condition took a turn for the worst and he ended up being taken to the hospital by ambulance and has been in the icu for a week. He was diagnosed with cancer. We still don’t have all the answers and I don’t know what the future holds for my family. On the third day that my dad was in the icu, my boyfriend was at work and texted me about his plans for the following day that consisted of him meeting up with friends to “plan their trip.” I knew they had been talking loosely talking about potentially going on a trip at the end of the month, but I thought it was common sense that since my dad is in the hospital, the trip would be off…. Well apparently not. Needless to say, we had an argument. I told him it’s extremely hurtful that he would abandon me at a time like this. \nAfter a lot of back and forth throughout the day he let me know the trip was cancelled (nothing had been paid for or even booked yet), but at this point I just feel like the damage is done. Who would prioritize a “boys trip” when their partners only parent is extremely sick in the hospital. The obvious answer is to break up, but I don’t know if I have it in me to go through a breakup right now. It’s been a few days now, my dad is doing much better, he’s out of the icu and I’ve been there everyday helping him with his recovery so he can come home. I’ve been off work for the past week and a half during all this and went back yesterday and have been going to the hospital between shifts. My boyfriend has been moping around the house the last few days and every time I ask him what’s wrong he says “nothing” or “I don’t know, I’m just sad.” I said if this is about the trip, then just go. He says that’s not what it’s about. I suggested he goes to talk to someone , a therapist or a friend.. or me. He declined all of this. I asked what I can do to help, he said nothing and “I’m not his therapist” I said nothing and just collected my stuff and went to work. I have a lot on my plate already, and I’m feeling angry that he’s putting this on me now as well. We spent the next few days avoiding eachother around the house which was making my mental health seriously depleted. We finally had a conversation, I told him he should go on the trip because there’s no sense of him staying here if he’s not even going to acknowledge me or be supportive to me and my family anyways. The next day, he booked his flight. I tried to convince myself I was okay with it, but his 5 day trip suddenly turned into 10 days, and I just knew I was done. We had a few conversations while he was away, mostly me crying and telling him how angry I am with him. He came home, and I ended it as soon as he walked in the door. He begged and pleaded, said he “never would have left” if he knew I would end it because of the trip. There was a lot of back and forth and I asked him if he could just leave for a few days to give me some space, which he did. He ended up taking me on a date for Valentine’s Day later that week and things seemed to be getting a little bit better. We planned a night away the following week to try to connect again. During our “romantic night away” he decided it was a good idea to invite his friend and friends girlfriend to join us for dinner (the girlfriend ended up not coming so it was just me, my bf and his friend) ….. and then “surprisingly” a bunch of his other work friends just happened to be at the same restaurant. What was supposed to be a romantic evening to try to repair our relationship ended up being a table of 8 of us, talking about my boyfriends job. We went back to the hotel, got into an argument and went to bed angry. The next day we woke up and he got in the shower and left his Apple Watch on the night stand. I had that gut instinct to check his messages, and there it was. He was been messaging with another girl the entire time my dad was in the hospital and was meeting up with her for “coffee dates “ …. Which I highly doubt is all that happened. So ya, that’s it. He moved his stuff out last week , and the person I thought I knew for the last almost 4 years has become the person whose hurt me more than anyone ever has in my life. I’m on my own again, going to be 33 next month, and starting from scratch. I don’t know what the future holds but it has to be better than this, right? ",
    "subreddit": "TrueOffMyChest",
    "title": "My dads in the icu, my boyfriends planning a trip",
    "upvote_ratio": 0.78,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j638ou/my_dads_in_the_icu_my_boyfriends_planning_a_trip/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 23:01:38 UTC",
    "id": "1j62wut",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 4,
    "secure_media": null,
    "selftext": "just saw a post about their narc maybe being DL and i’m realizing mine definitely was, and after everything he did and blaming me for it he said that’s why he did it and couldn’t have let us every happen or get married bc of his hidden desires. (exact quote at the bottom) in the beginning, he said he had a deep fetish, he said it was humiliation at first. then the real truth was later revealed to me. and then it wasn’t until after the break up he said there was sissy and cross dressing and that he might be gay. which is so bizarre bc one he only ever told me about the real kink way later and never told me the full details of it and he loves women sexually and is very sexual and addicted to porn. but he was interested in trans women and anal sex i guess.\n\nit’s wild bc he always said he could never be in a relationship with a man bc he needed a woman who was submissive and he had control over basically. he wanted a woman in her feminine energy but wasn’t safe enough to let me stay there. after our break up also, he went on a power kick after i was trying to say goodbye like i guess trying to regain power and he was being agressive and telling me to submit and basically confirm that he was right and i was wrong and legit got hard from it. the next day i said “i will only submit to a man who protects and takes care of me and does not abuse me” and he said he would still abuse me and i should stop “whinning” about it.\n\nthere were times he wanted to have sex with me while watching porn and wouldn’t show what the porn was, or giving him bjs and hjs while he watched porn.\n\ni’ve posted my story lots but have left out this major detail bc it felt wrong to discuss but for reference, we got engaged, i uprooted my life to go move in with him in another state. 6 days after the proposal and me thousands of dollars deep into the move, he called it off unprovoked (bc by this time i had been “perfect” according to his unreasonable standards) but he still blamed me. this is all after months of emotional  and verbal abuse. i lost my home, a job, a baby, mental health, love, my best friend, my safety\n\nthe realization is: \n- he legit told me he loved his fetish and addictions more than me. and he also said after he broke off our engagement and putting me through absolute hell and destroying my life and financially abusing me and me loosing my home to go move with him after our engagement, AFTER blaming me for the reason why he did it and a couple weeks after i came back to my state and was recovering from the move. \n\nhe said “So we get married have kids And I say by the way I love wearing diapers. Dressing as a girl and letting dudes or someone fuck my ass? I wasn’t gonna let that happen” and that he wasn’t sure if he was bi or gay.\n\ni couldn’t tell if he was saying all of that as a ploy to make it “easier” to be friends with him, bc he was actively saying he wanted me in his life and he said would it be easier if i were gay and then told me all those things. idk if it was more manipulation or if it’s true. i know his kink is a major thing and it wasn’t something i was into and he wants to be with someone romantically who isn’t into in but still have sexual encounters with people who are into his kink. i can never tell when he was being honest or just saying something to get a certain reaction out of me. there were several times he’d say “im going to go fuck this girl tonight bc you stress me out” and then i’d find out he was home along and not with her. his mom would tell me or he later would tell me he never did. there were plenty of cases like this too. he would just say things to make me believe it. so i couldn’t tell if he was saying he might be gay for that instance too. idk. \n\nin no way am i being insensitive to sexuality or kinks. i was very supportive to him through it all but this is just making me realize he was never going to follow through and legit used me. \n\n— he basically admitted to putting me through hell, abusing me very thoroughly, blaming it allllll on me and my character flaws, made me lose my home to move states with him, tell me entire family we got engaged, lose my job, and spend thousands on moving, lose a child, all to cancel our engagement and move during a mania spike he had and BLAMES IT ON ME, all while he was literally never going to be capable of following through.\n\nthere were so many signs too im realizing now that i’ve missed. he used to straight up tell me that he was mirroring me and i thought that was weird bc women typically mirror the man. he used to also say he’d just find someone to marry him out of convenience bc he wasn’t capable of love. he was always so selfish in every aspect of our lives. he always made it known to everyone and called me his wife and loved the image that it gave him but treated me like dirt. this man was straight up telling me he was a narcissist and i missed the signs in a haze. \n\nhe emotionally, verbally, mentally and financially abused me for literally nothing. bc i was kind and sweet and supportive and empathetic and showed him love he couldn’t even fathom. he literally watched me as i bent over backwards for him and took care of him and lost the stability in my life to create one with him while he was just belittling me and destroying my worth and esteem. he needed control over me bc he lacked it in his own life and addictions and self. and was never going to marry me or create the life together we planned bc his demons and desires would have never allowed it even when i was accommodating and understanding. but the blame is all on me for loving him and having needs.\n\nthere’s so many factors to this and so many versions of him, it’s hard to wrap my head around it all ",
    "subreddit": "TrueOffMyChest",
    "title": "nex fiancé ruined my life, blamed me for it, and then admitted he was never capable of it",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j62wut/nex_fiancé_ruined_my_life_blamed_me_for_it_and/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 22:56:09 UTC",
    "id": "1j62s93",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 3,
    "secure_media": null,
    "selftext": "I've never found myself being mad when a show/movie is spoiled. If I've wanted to watch it, I'll still enjoy watching it even though I know what will happen. ",
    "subreddit": "TrueOffMyChest",
    "title": "Spoilers don't make me mad.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j62s93/spoilers_dont_make_me_mad/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 22:55:35 UTC",
    "id": "1j62rt3",
    "link_flair_text": null,
    "media": null,
    "num_comments": 25,
    "score": 7,
    "secure_media": null,
    "selftext": "They’re so fucking stupid and annoying. They bitch at me(16F) and complain every 2 seconds over something small. Every time I’ve tried to tolerate their shit I end up crashing the fuck out.\n\nquite literally ive tried to be nice and help a lot with stuff, I’ve done a bunch of chores around the house, even some chores they have to do, ive even babysat my younger siblings, just to keep them happy and their mouth shut.\n\nbut nah, I’m still walking on eggshells with them.  \nThere’s been a couple times I’ve been clumsy and accidentally knocked someone over, like my little brother when I was trying to sweep and he snuck behind me and i turned around then he fell over. And when that happens it’s like absolute hell on earth because they yell at me and act like I’m some demon over it.\n\nso, I dress one of my younger siblings for them because he’s disabled and can’t do that for himself, so I pick an outfit out for him for school and all.  \nwhen I came home today, I got berated over it because the outfits I choose “ArEnT fAsIoNaBlE” or whatever, like wtf?  \nAnd quite literally if I do anything wrong I’m berated called useless and other insults. I’ve literally went to the psych ward  cuz I was suicidal and my parents decided to snoop through my room and my stuff, and basically When I got back they didn’t even care if they were triggering me or not. They just used it as fucking fuel.  \nI just can’t wait to get revenge on them, I don’t give a fuck about how cruel I plan on getting revenge, but goddamnit I’m gonna make them wish they were never born.",
    "subreddit": "TrueOffMyChest",
    "title": "I seriously hate my parents",
    "upvote_ratio": 0.64,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j62rt3/i_seriously_hate_my_parents/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 22:32:58 UTC",
    "id": "1j629ya",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "I don't know where to start with it all. This is going to be long, and if any of you get to the end, I appreciate you taking the time to read my story. I would say that this feels like a common place story that happens to a lot of people in different ways. I just need to get my story told. almost feels like I am just asking for pity, maybe I am, and that is an issue with myself because seeking pity is not good for one's mental health, but what I've been holding in also isn't good for my mental health. I'll start the story at 4 years ago when my relationship started. It started 7 years ago. I start there. I was a lonely type of fella and I did not have much relationship experience from my time growing up and being in high school total of 2 relationships before this current one I find myself in one 8 months with it ending with me getting cheated on and the other 1.5 years with me proposing and then getting cheated on. Both in-person and then transitioning to long-distance, you'd think I'd learned my lesson the first time. Anyways, I go about a year of being single and searching for love as all young people do, and nothing worked for me: dating apps, social events, or just finding people in places that you'd want to be able to share interest with. Until one day, I posted a nice thirst trap online to get the self-seeking validation that I felt I needed at the time, and someone slid into my DM's someone that I had known from HS but never truly talked to. I began talking with this person, and then we grew closer every day, despite being long distance with a 3-hour time difference. We Facetimed each other every once in a while and then twice a week and then every day. The problem at the time in that relationship was two things: I was not emotionally intelligent, and I had a group of guy friends that were semi-toxic. My significant other was not fond of my friends as they wanted to go out and party all the time, which I didn't mind doing, but it wasn't my cup of tea. So I spent more time talking with her, and then one day I tried to introduce her to my group of friends on Facetime, and she talked to everyone a little bit and just found them all disgusting and asked to talk to me again. She said something along the lines of Wow, can't believe you did that and hung up on me. Now for me, I was confused because my buddies did the same thing with their signifcant others and no one was upset and it was nice getting to know the person they loved back home(for a little context me and my SO had not met up yet we were still having facetime and what not). It was also a surprise for her because when she called, I was hanging out with my buddies, and one of them picked up. So after she hung up I called her back in private and I asked her what was wrong and she told me that she felt disrespected by what happened and that was our first big fight with each other, and it ended with me texting her updates of when and where I am so she knows if she can call with me. I agreed with it all, not thinking that it was a big deal. We continued the relationship with one another with basically a gradual turn of all my free time being spent with her. I neglected friends and became somewhat isolated from my world. As an inexperienced youngling, I didn't see that issue. I kept the good friends and started distancing myself from my friends we'd hang out with, but it started to be less and less as the month went by. I would say that we are about 8 months into this relationship with each other when we first decided to meet up with each other and have about a week together. Now before we met with each other she alluded that there were things that she wasn't going to give me or ask of me unless we were dating because I hadn't asked her to be my girlfriend and I don't know why but that enticed me to figure out what she was alluding to and that brought me to the point of when meeting up with her I asked her to be my gf and she said yes but I was so nervous asking her it felt like she was a bit hesistant on that matter when replying yes. That happened the first day, and then we started dating with our first week in a relationship of hanging out with each other. I stayed at her place the whole week, and we did various things and hung out with each other. It felt like things went well for the week that we spent together; it felt like we connected, and everyone had a good time before we had to say goodbye and continue our long-distance relationship. After I got back to my home things started to change with our relationship she wanted more from me in ways of being more emotionally aware of my day and tell her my feelings and how things made me feel and as the emotinally unintellegnet person I was it was hard for me to change that in my everyday life, I was just going with the flow of life and never realy discussed my emotions with others becasue it never really came up in conversation. We argued about how I was still just discussing my day with her and not sharing my emotions with her, so I worked on it and slowly got better with being in touch with my emotions, yet I feel like it was never really enough for the relationship. As the months went by, she continuously felt like I wasn't telling her enough about my life and felt left out the more I told her about my day, so I committed to telling her everything that happened in my day as she was doing to me. Now, my struggle was that there was a lot that happened in my day, so I would sometimes do it when it happened in my day. Still, I would eventually tell her about it when we called each other every day. Still, she would then get upset that she missed out on knowing when it happened and what I felt in that period. Once again, being the emotionally unavailable guy I was, I tried my best to do what I could to satisfy that need for her. At this point, you're probably wondering why we just didn't break up. I have no clue; it's probably just me being weak-willed. At this point, I spent just about every waking moment texting and talking to this girl, and we got into arguments just about every single day, either about me missing information I was telling her or me not being emotional. Being young, I thought this was healthy because the arguments led to deeper conversations with each other and figuring out what made us who we are. I would say about 4 or 5 months after our initial meetup, I had pretty much completely distanced myself from my friedns with rarely ever hanging out with them but maybe once in a blue moon, but it made it harder in my relationship to hangout with them becausea of her wanting to know everything and me jsut wanting to spend time with friedns so there was communication delay from waht was happening in the conversation and what I was doing vs what was acutally happening in my life. This all led to arguments down the line, and then our next meet up, this time I was meeting her parents and she was coming to me. I set things up so that I could stay with her and got a friend that I was closer with that she seemed to like because he was married and approved more of our relationship. We spent the time together for about 2 weeks; this time, one week just me and her at my \"place\" and then a week with her parents. It seemed like another good meet up with both of enjoying ourselves but, a little bit of tension between us from the arguments and the fact I was moving from a 3 hour time difference to a 13 hour time difference, which we both imagined would put more of a strain on our relationship, her parents liked me on a side note. We parted ways, and I began my new path in life with her being in college and me being abroad for work. We had both been right tensions did increase with each other as I was abroad it became even hadrder for me to comunicate with her with everything that was going on in my day to day life as it was for the most part always unpredictable and hard to keep up with myself and she would sleep half way through my day as the time differnece so if she didn't wake up to a butt load of text about my day she felt upset and always had this feeling of misisng out on my life, so I continued to distance myself from others and not participating in group events and when I did I tried to keep to myself to minimize the updating I had to do. At this point, she just felt like I didn't love her because I wasn't involving her in my life the same way she was involving me in her life. She told me everything about her day, so this wasn't a double standard, and she was also busy, but I would say that I was definitely busier than she was. I continued to apoligize about the communication issues with keeping in mind I still was telling her about everything that happened in my day whenever we talked on the phone especially all the things I forgot to tell her and she felt that I conviently kept forgetting to tell her about the interations that I had with Females throughout my day beacuse as you can imagine she was jealous that other females got to interact with me throught out the day more and she didn't. I was better about telling her about female interaction through my day, but I still missed a few here and there. Sometimes, I got rides from females, and she'd get upset that I didn't tell them when it happened. She always felt she never got the full story the first time and she had to ask multiple questions to get the whole story and that was tiring for her and it got to the point where, I thought I was doing a good job but was not and I just gave up on updating her one day because life just got overwhelmed and I couldn't handle life and my relationship at the same time and she ended it after that day. I was devastated as we had been going through this struggle for almost 3 years, and it just felt like it was all for nothing. We met a third time before breaking up and were going to meet up a 4th before COVID-19 occurred and travel bans happened, which didn't improve our relationship. We broke up, I got friends, and started to move on with my life, slowly finding myself and what makes me happy. For about a year, I was single. I decided to move back to the same timezone as her and go to the college that she went to. Not expecting her to be in the area, not ever really knowing why I did it either. I wanted to complete college not being in a relationship, but that was not what occured. As you can expect, we ran into each other again and started dating because she felt like I was a changed man and was able to prioritize things in my life a little better. I can say that I did grow in the time after we broke up and explored my inner workings a little more. The thing is, she thought I started dating her again because she was a different person, but she hasn't really changed all that much, still wanting the same things, and I was more able to provide those things she wanted, and it felt like things were going in the right direction. We moved in with each other and where \"dating\" for a year until she said that she wanted more and didn't feel we were growing and she said it was because I had not asked her to be my gf so about 3 months of me trying to find the right time to ask and it not working out we get into an argument about it and I asak her and she says no ask another time. So I don't plan for it and just start asking her once a week until she just says yes about 2 months later while we are living and sleeping in the same bed with each other. Anyway, things started getting a little tenser between us. I don't have many friends as I learned not to make friends in this relationship, and I don't talk to my old friends much because it just causes conflict, and I'd rather avoid than lie. We continued dating, and for about 2 years, we lived in the same place. We have had our ups and downs through the two years. I changed my job twice and have a female supervisor; as you know, she is upset about that, but she ignores it better. She says she just, at this point in the relationship, buries her emotions and hides her concerns because she doesn't want conflict in the relationship, and she only ever feels that she has problems with what is going on in the relationship. We still argue a lot and have those arguments turn into deep conversations, and I become more and more emotionally drained as these arguments happen, and I can barely keep up with my studies, work, and relationship, yet I push on. We are starting to get to the real point of this story and why I am just done is that we were initially very active sexually in the beginning of our relationship like once a week and then it moved to once a month which you know I didn't think to much of it because I figure sex drive just went down as the relationship got more secured, but we just moved to a new place and signed a 15 month lease that niether of us can afford to break and I tried to be sexual with her this morning and she told me that it felt nice but shed been thinking of her ex when we've been doing stuff and that its kinda always been that way becasue she used to be very sexually active with her ex but he was fine with not having sex and she puts herself in his position and wouldn't want that pushed uponed her and makes her feel sad and turns her off from anything that we are doing and I tried to help her get to the root of it this morning before leaving to work and I just felt that I disrepected myself by doing that and not being more upset about her thinking of her ex and it just hurts because it means just about everytime we do sexual stuff its about how she feels about her ex and makes sense why she has to sometime watch things when I go down on her. Honestly I know that this is a super toxic relationship but, I love her so much and have tried so hard in this relationship with the time and effort I put in everyday it just sucks all of it \n\nTLDR; GF thinks of ex during intimate time after 7 years of relationship and gets turned off just about every time because she pushed herself on her ex, and her ex didn't care about having sex and she didn't like the idea of being in his position. So it has tanked our relationship, and everything feels distant and We moved to new place with 15 month lease no one can afford to break. I feel stuck",
    "subreddit": "TrueOffMyChest",
    "title": "I am having problems with my relationship and I feel trapped",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j629ya/i_am_having_problems_with_my_relationship_and_i/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 22:28:51 UTC",
    "id": "1j626pw",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 1,
    "score": 5,
    "secure_media": null,
    "selftext": "I (22 F) have had a chronic condition for more than 10 years now. \n\nThe thing is, it's something I haven't seen mentioned before or other people experiencing it. I feel so alone and I've seriously considered an \"escape route\" in the sense that I genuinely do not have a will to live.\n\nI have a chronic sore throat and it's ruining my life. I cannot drink or eat anything cold without getting ill after. Absolutely anything. **I cannot just eat ice cream and enjoy cold drinks.**  I always have a lump in my throat no matter what I do. After I eat/drink something cold or when I'm sick, this lump gets thicker and inflammation follows.\n\nBut the worst of all is second hand ciggarette smoke and other dense smokes. Just feeling it makes this lump get thicker and I start coughing.\n\nI cannot walk normally on the street and always have to avoid smokers that are everywhere. I cannot go out to bars, hang with people my age because they're all smoking. I am the insane one.\n\nThe doctors do not care since there is no concerning inflammation and I've been told to just deal with the smoke and \"avoid\" it as if that's possible. (I live in Eastern Europe) I've also had my tonsils removed, because the inflammation affected my bones and heart, but even after that, there's been no improvement.\n\nThe thing that's causing it is a bacteria called staphylococcus aureus and this chronic state most likely developed when I failed to do a treatment properly. I've been desperate to find an explanation for my pain on my own and was able to find just one scientific paper studying the sensitivity of this bacteria to second hand ciggarette smoke.\n\nI wish I could live somewhere isolated without pollution from smoke, but it's not likely since I'm just an average woman. No skills to survive on my own, nor the resilience for that. I am so tired. \n\nI do not see a future for myself. I've never had a relationship due to some other reasons in the past, and I don't see myself having one because of this.\n\nAlso sorry if this isn't the appropriate sub for this. I mostly posted this as a cry for help and maybe to attempt at finding people who relate. I'll remove my post if needed. Thanks for reading.",
    "subreddit": "TrueOffMyChest",
    "title": "My chronic illness has taken my will to live",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j626pw/my_chronic_illness_has_taken_my_will_to_live/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 22:25:00 UTC",
    "id": "1j623o7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 110,
    "score": 2953,
    "secure_media": null,
    "selftext": "Life is feeling real batshit today.\n\nCame across my partner’s alt account on social media. Open to public viewing. They described it as an ‘orgasm journal’ where they seemed to be exploring self pleasure. Cool, love that. Very data-driven. Cut to a post about ‘collective’ episode with another online user. They had been exploring what sounds to be a lot like mutual masturbation where you’re turned on by the idea of someone watching, viewing things through a data-driven lens in the name of ‘research’. Naturally I lost my shit and messaged them.\n\nWe called and I told them all of the assumptions I’d made. They didn’t say I was wrong, just said ‘it’s research’. I feel like I’m getting pulled into insanity and delusion here. It feels like kink gone wrong. What do you mean it’s research?? Research is ethical? Having sexual conversations around topics that arouse you with another person for the purpose of sexual pleasure sounds like… infidelity to me? \n\nI can’t believe I had to tell this person who most of the time has their head on square &amp; thinks intelligently and rationally that this constitutes as cheating. It’s not research or data what are you talking about!! \n\nThey’ve just posted after our break up (yes I’m going to stop looking but it’s been 12 hours please let me wallow) that they’re open, not poly. Fast fucking turnaround when we were in a monogamous relationship literally 8 hours ago. \n\nWe were in a long term relationship and I cannot for the life of me process that this is the way it ends. Can someone please tell me I’m not going insane?\n\nEdit: just to clarify - we’ve had in depth conversations around our expectations of a monogamous relationship. I didn’t specifically set a boundary of ‘I am not comfortable with mutual masturbation online in the name of research’ because.. that’s very specific and not at all a normal conversation to have, lol. but I did explain what would be uncomfortable or deal-breaking for me and I would fully put the onus on them to have needed to clarify in this situation instead of going in blind because I think it’s very clearly something I would take issue with based on every other conversation we’ve had on the subject. ",
    "subreddit": "TrueOffMyChest",
    "title": "I just broke up with my partner because they didn’t even realise they’d cheated on me",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j623o7/i_just_broke_up_with_my_partner_because_they/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 22:06:17 UTC",
    "id": "1j61ohl",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "TW: drug abuse \n\nSo, I don’t know how to start. My sister has/had a long-term relationship and I even considered him my brother because he was like that with me. They even have a child together. It all started last year when my bil asked my father for 400€  but not to tell my sister and he would pay it back as soon as he got paid. To this day he never payed back and he lost my father’s respect because of this. We suspected that he may be doing drugs but we kinda hoped he wouldn’t do something like this because he loves his child to the moon. There were few incidents where he acted off… we never interpreted much into this and just hoped everything would be okay. He works in a field where the future is the secured and a few weeks back he told us that he and his other colleagues were laid off but they would all receive loan payments till the contract ends. Idk it came with a surprise and I had a thought that maybe he was the only person that got laid off. I asked my bf about it because his father works in the same company but in a different department. He said he didn’t know anything about this. Well, wednesday was the incident that ruined my sister’s life. We don’t know what happened exactly but my sister has ended the relationship for good and threw him out because she found drugs. She told our mom that he had a history with drugs a long time ago but he swore it would never happen again. Since yesterday he is supposedly in rehab. I don’t how to talk to my sister about this and I don’t know what to think myself. He was like a brother and I always defended him to everyone. I am scared what will happen in the future, I mean what if he collapses again? Right now my sister is a single mom who works full time with only a half day daycare. I don’t know whether my bil was under influence when he was watching my nibling. There were times where he was alone with my nibling for two weeks. Was he driving under influence? And was my nibling with him? For how long was the abuse? Will my sister recover from all this? Was he thinking about what his abuse will do to my sister and nibling? Was he even thinking? \n\nThere is only so much hurt that a person can endure and my sister had enough in her life. My mind all over the place and I have so much questions I would like to ask but I know that I can’t get an answer. I would like to tell my bil how disappointed I am but I know that this would not help his rehab. My mind is all over the place and my heart is hurting and I can’t talk to anyone expect my mother but she feels the same way expect that her heart hurts more because this is her daughter. I don’t know what to do right now. I don’t know what to think. I don’t know what to feel. I don’t know how to help my sister. \n\nI had to get this off my chest, thanks for reading",
    "subreddit": "TrueOffMyChest",
    "title": "My sister’s life is ruined ig?",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j61ohl/my_sisters_life_is_ruined_ig/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 21:58:26 UTC",
    "id": "1j61hol",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 3,
    "secure_media": null,
    "selftext": "Me and my husband have been married for 3 years and we had a rough start to marriage, we were both very toxic to each other and ended up putting hands on each other, but over time we go the help we needed and we are trying to rebuild but it’s been difficult very difficult. He was a virgin when I met him, and he was my second partner Ive been with. Lately I’ve been feeling very lonely and discouraged from trying to be “sexy” around him, before we got married and were dating he was very horny all the time and wanted it almost 3 or 4 times a day but now I’m lucky to even get with him once every week or 2 weeks and I’ve noticed that it’s always me initiating it, also he doesn’t really touch me he straight just only goes to fumble my boobs and nipples then goes down on me then we only do missionary and doggy that’s it and it takes about 30 min. \nOnce I didn’t initiate at all and wanted to see how far he will go to not having sex, it was a month and that’s because I couldn’t handle it anymore. Recently I’ve been trying to talk to him about it but he says that he wants to build up emotionally because of our past and doesn’t want to focus on the sexual stuff which I feel is important too. I’ve bought lingerie to maybe inspire him but all he does is say I look beautiful and that’s it he doesn’t go feral he doesn’t dirty talk, he doesn’t admire me, he doesn’t role play, he doesn’t grab my ass nothing, we don’t even make out. \n\nI’m starting to feel more like a roommate, I stopped putting in the effort of being a “woman” I stopped shaving I stopped plucking my eyebrows , I stopped waxing or trimming, I shower only once a week, because I thinks what’s the point? And yes I’ve brought this up to him multiple times and he says I still look beautiful and that’s he still loves me. I just don’t feel wanted or desired, I don’t know how else to explain it to him. I’ve said to get home and throw me on the bed and fuck the shit out of me but he says that no because he comes tired from work and dirty, which I don’t give a fuck, I’ve told him to look for more positions to try but he always says well you research and I’ll do it. Which I dont want I want it to come out of him to want me to desire me. Ive put lingerie on and once i really out did myself i got my hair done and shaved trimmed everything but then he said that he doesn’t get turned on by lingerie, but he also doesn’t know what turns him on. Also one time we were getting into it and he pointed out I missed a spot when I shaved down there which made me feel really embarrassed and we ended up not doing it. I don’t know what else to do really I’ve brought this up to him a hundred times but he never gets the point and leaves it to me. What do I do? I feel so frustrated with the situation ",
    "subreddit": "TrueOffMyChest",
    "title": "I stopped focusing on myself because of my husbands actions",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j61hol/i_stopped_focusing_on_myself_because_of_my/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 21:57:20 UTC",
    "id": "1j61gr1",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 0,
    "secure_media": null,
    "selftext": "We were in an open relationship and I have several other regular sex partners of 10 years and five years. I also have hookups with others. There were some differences that caused me to end the relationship. However I am a size queen and know I need it packed to feel fuflilled.  Needless to say, it afected my satisfaction a lot! I'm really sad that I settled for someone who didn't satisfy me. I tried to approach sex life as something for us to build on. As this was a newer relationship. But I never craved him when we were apart and I would not miss him physically. This signaled an end to me! I guess size really does matter and I just needed to find out. ",
    "subreddit": "TrueOffMyChest",
    "title": "Broke Up With Partner But The Real Reason Is His Penis Didn't Satisfy Me.",
    "upvote_ratio": 0.24,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j61gr1/broke_up_with_partner_but_the_real_reason_is_his/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 21:56:46 UTC",
    "id": "1j61gar",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "\nHi, this is my first time writing here, so I hope it makes sense. I am a 21 year old female, living in a generational Christian family. Being told your entire that married and have kids is something I have to do, and that if I don’t now I will someday. So when I found at the age of 14 that I am Asexual and just a couple years after Bisexual. I kinda felt relived but also terrified. I have only told my cousin and she was very accepting of me and we tell each our problems all the time. I have been debating on telling my brother about my sexuality for a couple years. Just the two of us are going on trip, this can either going to ruin our whole trip or strengthen our bond. The biggest problem is that I am worried he will think I am too young to talk about these topics and he’ll say I can change, either when I am older, or when I find the “right” person. All that to say that I love my brother, but knowing his biblical stance on sexuality has made this very difficult for me to say anything. Anyways thanks for reading my rambling, I haven’t 100% decided to tell my brother but I hope to soon. ",
    "subreddit": "TrueOffMyChest",
    "title": "Is there a right way to tell my Christian brother about my sexuality?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j61gar/is_there_a_right_way_to_tell_my_christian_brother/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 21:53:32 UTC",
    "id": "1j61dns",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 11,
    "score": 152,
    "secure_media": null,
    "selftext": "Today I learned that my Mother was most likely the catalyst for my Uncle's suicide and I'm devastated.   \n  \nWednesday night, she kicked me out of her car and left me on the side of the road because we were arguing and she was caught in one of her many lies/gaslights. I spoke to my grandma today about it and she came clean about the reason behind my Uncle's suicide.   \n  \nI never met my uncle, he committed suicide at a young age while being held in jail. The note mentioned specifically because he felt like a failure (He was deep into alcoholism at the time.) My grandma sat me down and told me the events that led up to his death. Mom and my Uncle were both *extremely* drunk, with mom driving and my uncle being the passenger. They got into a nasty fight and mom kicked him to the side of a highway and told him to walk home. So, he did. He mistook another house as his own and woke up to the police ripping him off the couch. He was arrested for breaking and entering and Disorderly Intoxication. He was sent to sit in jail for 60 days. He committed Suicide on the 2nd day. If mom didn't leave him on the side of the road, he would most likely still be here.  \n  \n There's a part of me that's extremely vindictive of her for doing so, but another part that knows that she didn't intend for it to end that way. It pisses me off that I'm so understanding about it and it devastates me.",
    "subreddit": "TrueOffMyChest",
    "title": "My Mother is Most Likely The Cause Of My Uncle's Suicide.",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j61dns/my_mother_is_most_likely_the_cause_of_my_uncles/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 21:49:53 UTC",
    "id": "1j61aoy",
    "link_flair_text": null,
    "media": null,
    "num_comments": 13,
    "score": 11,
    "secure_media": null,
    "selftext": "Today is my 18th birthday a milestone that’s supposed to feel like the gateway to adulthood, independence, and new beginnings. But instead of feeling celebrated, I feel overlooked. Instead of joy, there’s this heavy weight in my chest, pressing down on me, making it hard to swallow the disappointment.  \n\nFor almost two months now, my father hasn’t been able to work due to a job-related injury. Money is tight so tight that even something as simple as a cake, a small token of acknowledgment, is out of reach. I understand. I really do. I know it’s not their fault, and I know they love me, but that doesn’t make it hurt any less.  \n\nBirthdays are supposed to be special, a day when you feel seen. But mine never really have been. I’ve had birthdays forgotten, birthdays I had to share like they weren’t fully mine, birthdays that felt more like an afterthought than a celebration. And now, here I am, reaching a turning point in my life, and it feels like just another ordinary day except worse, because deep down, I wanted it to be different.  \n\nWhat makes it harder is the facade I feel forced to maintain. Everyone around me assumes I’m fine, that I’m well off, that things in my life are smooth. My friends ask me what my plans are, and I don’t even know how to answer. Do I pretend I have something lined up? Do I admit the truth? How do you explain to people that your birthday this huge, symbolic moment feels hollow because even the simplest things are out of reach?  \n\nI keep telling myself to be grateful, to focus on what I do have, but I’d be lying if I said I wasn’t struggling. It’s not about material things it’s about feeling valued, feeling like this day matters, feeling like I matter. And right now, I just feel invisible.  \n\nI know life isn’t about birthdays, that one day in the grand scheme of things shouldn’t define anything. But when you spend every other day just pushing through, birthdays are supposed to be different. They’re supposed to be a pause, a moment where you feel like the world sees you. But today, I feel like I’m standing in the middle of a crowded room, screaming for someone to notice me, and no one even looks up.\n",
    "subreddit": "TrueOffMyChest",
    "title": "I'm turning 18 today and i cant even afford a cake.",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j61aoy/im_turning_18_today_and_i_cant_even_afford_a_cake/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 21:34:56 UTC",
    "id": "1j60x34",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "A while ago, I had a friend who I think might have liked me, but I never acted on it. Back then, I wasn’t sure how I felt, so I didn’t say anything. Later, he got into a relationship, and we stopped talking. Now, they’ve broken up, and we’ve reconnected—but in the process, I’ve realized I have feelings for him.\n\nThe problem is, he’s still completely in love with his ex and desperately wants her back. Recently, she reached out to him, and I’m scared they’ll get back together. It hurts because I can’t stop thinking that if I had spoken up back then, things might have been different.\n\nNow I don’t know what to do. Should I tell him how I feel or just accept that I missed my chance? Has anyone else been in this situation? How did you move on?",
    "subreddit": "TrueOffMyChest",
    "title": "I have a crush on my friend, but he’s still in love with his ex",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j60x34/i_have_a_crush_on_my_friend_but_hes_still_in_love/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 21:32:19 UTC",
    "id": "1j60ub5",
    "link_flair_text": "Positive",
    "media": null,
    "num_comments": 1,
    "score": 3,
    "secure_media": null,
    "selftext": "I’ve spent so much time on social media, but I’m starting to feel like it’s taking away from real-life connections. I’ve been wondering if anyone else feels this way. Does anyone else feel like social media makes us more isolated, even though we’re constantly ‘connected’? And if you’ve felt this way, how have you managed it? I just feel like I’m constantly comparing myself to others and losing track of who I am. It’s exhausting. I needed to get this off my chest.",
    "subreddit": "TrueOffMyChest",
    "title": "I’ve been questioning everything about social media and how it impacts our lives lately.",
    "upvote_ratio": 0.81,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j60ub5/ive_been_questioning_everything_about_social/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 20:57:08 UTC",
    "id": "1j604wh",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 2,
    "score": 3,
    "secure_media": null,
    "selftext": "Over the past seven years, three of my friends have committed suicide and two have attempted.\n\nNow I am doing better but my partner is suicidal again and he says he can't just take a break from college and work to get some time off because he'll lose his student visa. I can't afford to put him through college, he can't live with us because my abusive brother wouldn't tolerate a man living with his little sister. His life is full of regrets. He had a fullride scholarship back in New York but due to a misdiagnosed SLAP lesion, they fucked up his shoulder during a surgery and his American degree is basically worthless here. All that work for nothing. I don't know how to cheer him up. I don't want to lose my best friend and first love.",
    "subreddit": "TrueOffMyChest",
    "title": "Everyone's dying on me",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j604wh/everyones_dying_on_me/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 20:47:53 UTC",
    "id": "1j5zzni",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I don't know where to begin, but it's been eating at me for a while and for the sake of myself, I gotta get it off my chest.\n\nI (f19) met this guy in 2023, he randomly blocked me a little less than a year ago, and we lost contact. It's been 9 months, and although I don't \"think\" about him anymore (in the sense where I'll openly think \"oh I miss him\" out of the blue), I still feel like I see him in everyone. I've moved on, I don't think about him randomly, hearing his name doesn't upset me anymore, nothing about him hurts me anymore.\n\nThe problem is just that certain gestures that he'd do, certain things he'd say, every time someone does the same or does something that reminds me of him, he comes to mind immediately. Mostly it's the way he'd word stuff, and for some reason whenever someone says the same thing or acts similarly, it's like I have to tell myself it's not him. Nobody had ever made me feel the way he did, which I find weird cause we never dated. Kinda feels like I found my soulmate but lost him, if that makes sense.\n\nIt sucks, because I'm in a relationship, and I love my boyfriend to bits. We've been dating for around a month now, but despite that he's my favourite person. Being with him and being able to know him is the highlight of my life, so why does that one guy still haunt me? I feel so incredibly guilty writing this, because although it's not something I can help, I feel like shit about it. I feel like the guilt is eating me alive, and I'd bring it up with my boyfriend, but I know what he's like. If I do he'll start telling me to break up with him, even though he could say the same exact thing to me, and has actually admitted to feeling this way about someone before, and I'm not mad about it because I understand. \n",
    "subreddit": "TrueOffMyChest",
    "title": "I want to get him out of my brain",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5zzni/i_want_to_get_him_out_of_my_brain/"
  }
]