[
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 02:50:33 UTC",
    "id": "1j5dh76",
    "link_flair_text": null,
    "media": null,
    "num_comments": 12,
    "score": 0,
    "secure_media": null,
    "selftext": "Simple as that. I am waiting to have enough to retire, the closer I get to my goal, the harder it is to tolerate the job.\n\nI simply can’t stand it anymore. The sound of notifications, performance reviews, corporate language, team activities all is just torture for me.\n\nThe work takes the joy of my day to day life but gives me very good money….\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "I can’t stand my high paying job anymore, I also feel bad for not having the guts to quit",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5dh76/i_cant_stand_my_high_paying_job_anymore_i_also/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 02:41:54 UTC",
    "id": "1j5dba8",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 1,
    "secure_media": null,
    "selftext": "I love my boyfriend so much. I wanted to make friends but he always got upset and said it wasn’t needed, and eventually I stopped talking about it. Eventually I stopped wanting friends at all, and I figured I could be happy with just the two of us.\n\nNow he’s joined an organization and is always busy, and he’s making a lot of new friends. I am alone. Now he wants me to make friends so I can stop crying to him about how lonely I am but it’s his fault I’m this way. I can’t just turn a switch and be like him. He’s given me so much anxiety around the idea.\n\nI’m so angry. It’s so unfair. I don’t understand why I put up with it all, and why I keep putting up with it now. ",
    "subreddit": "TrueOffMyChest",
    "title": "My boyfriend said I wasn’t allowed to have friends and now I’m alone",
    "upvote_ratio": 0.66,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5dba8/my_boyfriend_said_i_wasnt_allowed_to_have_friends/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 02:33:32 UTC",
    "id": "1j5d5iw",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 3,
    "secure_media": null,
    "selftext": "The past almost two weeks, I’ve felt my depression coming back. There isn’t always a reason it happens, just comes over me when it feels like it I guess. I don’t know what I like to do anymore and my energy has really been lacking also. Along with my self esteem. I am feeling really bad for my boyfriend now because of my depression and how I may be coming off. I’ve been more anxious and also not knowing what to say or not having the energy to talk as much. This is the first time my depression has started “coming out” since we’ve been together and even though I know I can talk to him and he would be 100% supportive. I don’t really know how to explain how I’m feeling so I’ve started pretending I’m okay when really I feel like I’m being held under water. I also feel like my low energy, not talking as much is making our relationship boring for him maybe? I want to see him and be with him. Even if we’re just laying together, especially if we’re just laying together cause that’s almost all the energy I feel like I have right now but I keep thinking, he didn’t sign up for this and shouldn’t have to go through me feeling and being this way. I think this is more of venting than asking for advice. I don’t want to scare him off with how much/bad my depression can get. ",
    "subreddit": "TrueOffMyChest",
    "title": "What should I do?",
    "upvote_ratio": 0.81,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5d5iw/what_should_i_do/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 02:32:19 UTC",
    "id": "1j5d4ph",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 0,
    "secure_media": null,
    "selftext": "I have a problem.i am not a people person.\n\nI am introverted.\n\nI can’t stand people.\n\nWhat can I do?",
    "subreddit": "TrueOffMyChest",
    "title": "I am not a people person.i am an introvert.",
    "upvote_ratio": 0.4,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5d4ph/i_am_not_a_people_personi_am_an_introvert/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 02:20:21 UTC",
    "id": "1j5cwfj",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 2,
    "score": 0,
    "secure_media": null,
    "selftext": "I actually vomited because of this.\n\nShe got drunk today and we were discussing my transition (I'm FtM) and she commented in *detail* about how my crotch looks and how much she likes it.\n\nShe hasn't seen me be willingly naked in front of her since I was a toddler, let alone since I started my meds.\n\nI asked how did she know about it and she admitted she \"took a peak\" when I was asleep.\n\nSeveral months ago I had a vivid dream where she was on top of me, touching me and herself. All this time I thought it was just some fucked up dream.\n\nI can't believe she violated me like this, but I can't say I'm surprised. \n\nIt's not the first time she's done such things to me. ",
    "subreddit": "TrueOffMyChest",
    "title": "My mom just admitted that she raped me when I was asleep when for months I thought it was just a dream.",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5cwfj/my_mom_just_admitted_that_she_raped_me_when_i_was/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 01:53:19 UTC",
    "id": "1j5cdlf",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "theres this dude in my class i thought was really pretty (I am AroAce and experience aesthetic attraction) and I thought was really cool and i really wanted to be his friend, but im super awkward so idk how to go about it. i tried talking to him more, showing him my stuffed animals, and tried to get him to actually care abt what i was saying, but he just doesn’t. like he’s not mean, but he doesn’t really respond much, and when he does it's always \"nice\" \"cool\" \"fire\" and i don’t even think he realizes i wanna be his friend. for some reason i got way too attached to him and i started overthinking everything, like what i was doing wrong, and why he didn’t care. i was just embarrassing myself. i was zoning out at the end of class, (my friends said I was disassociating) and they told the counselor. (They didn't know why i was so unresponsive) anyway i got pulled into the office with a sheriff officer and two counselors and they were asking me all these serious questions abt my mental health and my home life and asked to check my arms, and i felt so stupid. like i wasn’t even upset over anything actually serious, it was literally just bc some classmate doesn’t care about me. and now i just feel even dumber bc i don’t even know why i got so attached in the first place. I feel like I'm wasting so much of my energy on him. I just want him to like me but I'm pretty sure he finds me weird/annoying. has anyone else experienced this? how do i stop getting so emotionally attached to people who dont even notice me?",
    "subreddit": "TrueOffMyChest",
    "title": "I get attached to people to quickly",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5cdlf/i_get_attached_to_people_to_quickly/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 01:31:50 UTC",
    "id": "1j5byqh",
    "link_flair_text": "Positive",
    "media": null,
    "num_comments": 10,
    "score": 118,
    "secure_media": null,
    "selftext": "im just laying here in bed on my day off work listening to my girlfriend playing emo music from the early 2000s and singing extremely off key in the living room. i love her so much. ive never loved another person like this before. i have such terrible body dysmorphia/an eating disorder and she never fails to make me feel like such a stud too. we met on instagram in 2023 and have been together for around 2 years now. we were long distance until november 2024. we live together now and its so nice being able to go on errands with her and we had a nap today with our cat and rewatched Jurassic World. when i get off of work shes just there. after 20 years of being constantly traumatized its just a breath of fresh air. im so lucky to have her",
    "subreddit": "TrueOffMyChest",
    "title": "i love my girlfriend",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5byqh/i_love_my_girlfriend/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 01:29:42 UTC",
    "id": "1j5bx5n",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 6,
    "secure_media": null,
    "selftext": "This is the first post I've ever made of reddit, so please be patient. \n\nI (19) have been diagnosed with severe depression and really struggle being clean. My depression stems from trauma from my mother, being verbally, emotionally, and physically (rarely, but still) by my mother (39). My room is frankly disgusting. My bed is littered by trash, clothes, and stuffed animals, I haven't seen my floor in over a year, and every surface (nightstand, TV stand, dresser, ect) are messy and filled to the brim. I lose everything and my closet is overflowing with junk I've never used. I don't enjoy doing much except listening to music and watching cartoons. \n\nIt sucks because I want to be better. I am very clean, I shower daily and wear deodorant/cologne, but my room is a mess. I hate it, and it makes me hate myself even more than I already do. I have a therapist, but I rarely see her, and I'm scared to tell her this about me. I have a full time job and people love me, I'm very organized and happy at work. No one would ever suspect I have a terrible room. The only thing I keep clean is my pets' cage (rats). I feel so embarrassed and ashamed, I never have friends over. I want to be better so badly but I don't even know where to start. \n\nSorry it's long, I just am really struggling and any advice would be helpful. ",
    "subreddit": "TrueOffMyChest",
    "title": "I have a depression room and the guilt is killing me",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5bx5n/i_have_a_depression_room_and_the_guilt_is_killing/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 01:15:51 UTC",
    "id": "1j5bn88",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 3,
    "secure_media": null,
    "selftext": "So, I'm from a very close-init family, we love each other a lot and have always been together. My grandma had three children, uncle A, uncle B, and my dad, and then grandpa had a child with another woman, uncle C. This is about uncle B.\n\nI don't like his current gf. She immediately trauma dumped on my grandma to gain sympathy, then proceeded to imply she was old and getting forgetful and clumsy (grandma's perfectly fine, she's as healthy as they come), then she brought along her son she had with another man, who I have no trouble with. She herself isn't bad, but the way she and her son behave is weird, because it's like they're not a part of our family, they just kinda live there, and I have the feeling that she wants to kick my grandma out and have the house to herself, which isn't possible because it's decided 50/50 between uncle A and uncle B, but she's tried to buy the other half to uncle A, who firmly refused, because once they both pass away, the house is mine.\n\nThe worst part about all this is my uncle's behavior since she arrived. He works with my mom at a local restaurant, nothing fancy, its main target are the broke college students nearby, but they get paid well. My mom had a cousin of hers working as a waiter there, and he wasn't the best, but hey, acceptable,  but uncle B decided to start saying that he was more trouble that its worth, and that his girlfriend's son should work there, my mom firmly refused. My grandma has anxiety of going out on her own for years now and since she only lives with uncle B and his girlfriend, she constantly relies on him to get medicine or to just go out, and he's been getting extremely rude with her for no reason whenever she asks to go out, yelling and saying \"he needs his own time too\". We threw a party for grandma's birthday a while ago, and you'd expect him to sit with his mother, but no, he went and sat with his gf's family, completely ignoring grandma. I fell and got hurt pretty badly a while ago, and everyone called me and asked of I was okay, but him? Not a peep. \n\nMy last straw came a few days ago, my mom suffers really bad anxiety/panic attacks sometimes and he caused her one. Long story short, he missed work without calling in advance and my mom had to cover his shift and then tried to reprehend him because she's the manager of the restaurant. He completely flipped out and said something along the lines of \"leave, it doesn't matter, (gf's name) can replace you\", and my mom got really mad, and said \"I don't want to have anything to do with you as work or as family, you're never stepping foot into my house again\". \n\nNow I love my uncle, but his gf has completely ruined everything, I don't like her, I see her and I feel angry, but I can't do anything because I'm forced to interact with her, and you'd think my lack of warmth would tell her to not talk to me, but she talks to me as if she was my aunt, SHE'S NOT, and I genuinely wish I could just make her go away and make things go back to normal. I want my family back.",
    "subreddit": "TrueOffMyChest",
    "title": "my uncle's girlfriend is tearing my family apart",
    "upvote_ratio": 0.81,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5bn88/my_uncles_girlfriend_is_tearing_my_family_apart/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 01:09:08 UTC",
    "id": "1j5biby",
    "link_flair_text": null,
    "media": null,
    "num_comments": 14,
    "score": 19,
    "secure_media": null,
    "selftext": "I work in security. My job is just the constant variation of the same thing. Go to X and watch Y. For example, my job for the past few months has just been to watch a fence for 12 hours straight.\n\nIve been working 50 - 60 hours a week for two years doing this sort of work and it's extremely mind numbing. There's no challenge, there's no getting better at my job. I am a body. That's it. Anybody, literally anybody, could do this job.\n\nAny attempts to move into a higher position have been shot down because someone more senior wanted it or my employer decided to hire outside the company. Looking for a new job feels hopeless since it seems like no matter what I take, I'll be taking a significantly lower pay (something I can't afford to do). I can't even go to school part time to move into the industry that I want to because I don't have a consistent schedule.\n\nI feel like I'm trapped working this job and it's sucked me dry of any passion or desire to engage with hobbies I used to love or to go out and try to make new friends.",
    "subreddit": "TrueOffMyChest",
    "title": "I have the easiest job in the world and everything feels pointless as a result.",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5biby/i_have_the_easiest_job_in_the_world_and/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 01:06:56 UTC",
    "id": "1j5bgq2",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "He touched me as a child.\n\nIm so happy hes dead.",
    "subreddit": "TrueOffMyChest",
    "title": "TW sa",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5bgq2/tw_sa/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 00:53:47 UTC",
    "id": "1j5b783",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "I've been doing some thinking about all the conversations I have had with people and I think I have a issue with coming off as \"authentic\" or \"comfortable\". I met this guy online he was really nice I gave him my phone number and we hit off, we have been talking for two days the second day we call I remember he said \"oh!, someone is calling me bye!\" and I didn't think anything of it but uhm I haven't really heard from him since I texted him and he kinda left me on read and I texted him again I don't think he bothered looking at the message and I think I don't want to believe that I had just got ghosted but I think I did? And I don't blame him really because I don't know how to talk to people. I've noticed that I overshare and I can be awkward and maybe I make people sad when I talk to them but at the sametime I don't know how to approach people, or how to really make connections so I just blurt things out and I can see why that would drive someone away that kind of thing is so tiring to deal with. I also noticed when we were talking to him he said now you sound more relaxes or more comfortable or you're not trying too hard and i've got that a lot, I don't know what that meana though because sometimes thats how I genuinely act, I guess because i'm so awkward some of the things I say come off as forced but I can't help it and I don't know what to say really and I don't want to interview people and be like, oh so you like this? and this? and that? how do you feel about this? asking a ton of questions. I also was talking to someone before this guy not ina romantic sense but I think I made things awkward with that person too, I think I made them sad and I didn't mean to but it just happens sorta and I don't notice until like a day later or so and its like damn I shouldve approached it like this or like that. And even when i'm trying to talk with new people I always overthink what I want to say, I LITERALLY WAS OVERTHINKING WHAT I WANTED TO SAY TO BOOK A HAIR STYLING APPOINTMENT LIKE COME ON, thats just pathetic that it took me 3 days to ask my stylist how much is this or how do I get to her studio because I was ovethinking what I wanted to say and because I felt embarrassed and ashamed. And I started to realize that even my bestfriends don't really know what to say to certain things I say so its an awkward silence before I have to be like so uhm ahaha sorry about that!! and I have to make a stupid joke or something because I know they don't know what the hell to say and I made the whole convo awkward. I haven't even spoken to my bestfriend of 5 years, in which I should be thr most comfortable speaking to in like 5 days because i'm trying to think of something to talk about, again this is so pathetic and I don't know why im like this, it shouldn't be hard to talk to people but for some reason for me it is and it just makes me kinda angry and kinda sad and jealous because everyone makes it seem so effortless to talk to people and have a regular convo where you're like \"AUGH I SHOULDNT HAVE SAID THAT IM GONNA PUT MY HEAD IN A WALL!!\".",
    "subreddit": "TrueOffMyChest",
    "title": "I don't know how to talk to people and I think it drives them away.",
    "upvote_ratio": 0.76,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5b783/i_dont_know_how_to_talk_to_people_and_i_think_it/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 00:46:54 UTC",
    "id": "1j5b24x",
    "link_flair_text": null,
    "media": null,
    "num_comments": 15,
    "score": 0,
    "secure_media": null,
    "selftext": "So, towards the end of summer last year, my coworker (26m) and I (24f) went on a date and ended up fooling around a few times after that. I had had a huge crush on him for a while and was so excited to finally go out with him. The date was super nice, but the hookups were unexpectedly really good. I don’t have a lot of experience whereas he does, and he knew that, and he let me take control of the pace and the things we did which made me feel comfortable enough to try stuff with him I hadn’t done before. Unfortunately, life stuff happened all at once, and he ended things like two weeks after the first date. I was crushed. I was hurt, disappointed, confused, and quite honestly, very sexually frustrated. I really, really liked him, and we had gotten very intimate very quickly with the expectation that there would be a lot more to come, and then all of a sudden, it was over. I felt like I was left high and dry.\n\nThe thing is, a couple of months ago, we basically ended up confessing over text that we both still wanted each other in that way and almost made plans to meet up again, but more life stuff got in the way, and we both agreed that it would still be a bad idea to do anyway. But now every time I see him at work, I can’t help but think about the things we said and did, and how much I want to do it again. The fact that I know that a part of him still desires me in that way is kind of driving me crazy. I could torture myself overanalyzing every normal conversation, every glance, every little interaction.\n\nIt would very likely be a terrible idea to do it again, and it would probably end worse than it did the first time, but the feelings just won’t go away no matter how much I remind myself of these things. I am down so, so bad for this guy.",
    "subreddit": "TrueOffMyChest",
    "title": "I desperately want to hook up with my coworker again.",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5b24x/i_desperately_want_to_hook_up_with_my_coworker/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 00:35:30 UTC",
    "id": "1j5ati4",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "So I recently exposed a narcissist but my situation is very different and I can’t find anything online about this situation. So I came here for potential outcomes. \n\nSo back in 2023 of March I started talking to this guy and he knew me from my childhood (we were not best friends we just saw each other in passing during our middle school years) and it went well at first. (It only lasted two weeks) While we were getting to know each other I got on his IG and saw this girl constantly posting on his page but he never paid her any mind and of course I asked and he denies it. But he must have sensed that I was hot on his tail so he decided to end things but still wanted to be friends even though we were never friends but I just said ok. What he didn’t know is that I knew I was blocked after I questioned him about the girl on IG so I made a fake page to see what was up. And even though he said he wanted to end things he was still keeping in touch with me. Even though I’m blocked on his IG so in April 2023 I saw him with that girl and he she got him to move down there with her. He is originally from my city and this girl lives in the DMV area. And with me investigating I realized that it’s a money thing so basically this guy is a prostitute she buys him stuff and he agrees to be her bf. So of course I wanted revenge but I wanted to wait until it was unexpected so for a whole year I gathered information on this girl and realized she may be a narcissist. With my digging on this girl I got her phone number driver license address email you name it I got it. And I tucked it away. So in March of 2024 I made a fake number and pretended that I knew her from one of the colleges she went to but I told her that I wanted to stay anonymous. And she went for it and all I did was expose her bf for being with me. I also wanted to add that had I not been hot on his tail he would have continued to date me. And when I found out about the girl I cut all communication with him and he found a way to contact me and wanted me back and I told him no. He even told me he never wanted us to stop talking but he needed help from this girl and I had all that in the screenshots. And you best believe I sent them screenshots to her when I was hiding behind the fake number. This girl really wanted to know who I was so I decided to give her a call and actually reveal myself and we were on the phone for 27 mins. Mind you I recorded our conversation as well because I don’t trust this bitch. But while we were on the phone she talked bad about her bf and her bf family and I did defend the family because I actually know them. Because the city we are from is small. And at one point in time I was close with the guys cousin. She said really bad things about the bf mom too. And I didn’t like that so I spoke up and I think she could tell I wasn’t going for any of her lies because I knew she was lying. And I’m sure she didn’t like that. I actually got off the phone with her because she wouldn’t let me go. So the day after I spoke to the girl her bf called me screaming at me and accusing me of all these things I didn’t even say. I couldn’t even get a word in but I knew she was going to lie so I wasn’t tripping because in my head I was going to get my lick back. Fuck this hoe. The guy wasn’t even mad that I hurt gf feelings he was mad that I lied on his family and said bad things about him. Which I didn’t say anything bad about him or his family. So after I took a verbal beating from this guy I just said cool. But I wasn’t done yet. So I waited for about six months so now we are in September 2024 and from March of 2024 to September 2024 I kept my eye on them and I watched her crumble because she is very transparent on the internet and the bf broke up with her while she begged for him back because he realized that she lied on me and she must have found me on social media because she changed everything about herself to mimic me. Mind you when I spoke to her in March of 2024 she claims that he begs her but social media says otherwise. And between March of 2024 to September of 2024 this girl and her friends and her momma started to bother me because apparently I’m the reason why her bf won’t speak to her and I still keep calling her bf and pulling him away from her but I haven’t seen that man since March of 2023 nor have I spoke to him the only time I spoke to him was in March of 2024 and that’s because he yelled at me. So in September of 2024 I reached out to him I unblocked him on IG (in case you are wondering he did block me first on IG but unblocked me on IG to get in contact with me because I had him block on everything else then when he asked for a second chance and I told him no I blocked him on IG and he been on that list since September of 2024 and then I blocked him again because he is a dick) and sent him all the details of the conversation I had with the gf. I even revealed to him that I was behind the fake number but he told me to leave him alone so I said ok bet and changed my number and reblocked him on IG. But what I banked on was how much he liked me so I knew he was going to read and listen to all the things I sent and within three days he started calling my fake number (because he couldn’t get in contact with me because I changed my real number) so I deleted my fake number and got rid of my social media account because he had his family look for me too. He also offered to send me money to talk to him but I declined. And of course I’m still watching this all play out on my fake pages and again because she is so transparent on social media she is having a breakdown because he now knows the truth and she can no longer lie on me to him at least. But he is stupid anyway because why would you believe a liar with no proof but I guess because she is a narcissist and the guy isn’t good at setting boundaries. I never been involved with a narcissist well I don’t think I have been and I think it’s because I’m too outspoken and I have no problem getting into a fights. I promise you this is not what the fuck you want but overall I’m a pretty peaceful young lady if I do say so myself. Anywho, this girl is upset that not only is he furious with her but also his family is happy that someone was able to finally expose her for the liar and manipulator that she is (I didn’t know that his family didn’t like her) but apparently she plays victim and uses this guys insecurities and her money so she can get her way and this relationship was going on for years. I’m basically the hero. But I wasn’t done with this bitch yet so I got my black ass on Twitter and put her on blast so much so she lost a lot of followers on social media and her momma is off of social media completely because her momma was bothering me too. And I did this a few weeks ago me exposing this girl on Twitter. So now I’m satisfied. But I wanted to know what happens when you expose a narcissist? I wasn’t the one being manipulated but it was like I was the defender of someone who was being manipulated. And I came here to see if I could get any info because I couldn’t find anything. ",
    "subreddit": "TrueOffMyChest",
    "title": "exposing a narcissist",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5ati4/exposing_a_narcissist/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 00:25:36 UTC",
    "id": "1j5am4f",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 64,
    "secure_media": null,
    "selftext": "After countless of procrastinating, I ended up telling my mom I was sexually exploited by a man many years older than me. She was honestly very supportive, and let me go on with the police investigation.\n\nTomorrow I'm getting my messages forensically checked between me and him, and oh god am I shitting myself. The messages I had with him were VERY sexual, and I feel guilty as I kind of just let everything happen as I liked the attention. I know everything will be okay, as it is apart of their job, but it still scares me that someone will be checking these very intimate messages. There's also the fact that someone's gonna have my phone for a while, and will be able to check my stuff which is also making my heart pound.\n\nFor anyone who went through a similar experience with their phone being forensically checked, how'd it go?",
    "subreddit": "TrueOffMyChest",
    "title": "Getting my messages with my groomer forensically checked tomorrow. I'm terrified.",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5am4f/getting_my_messages_with_my_groomer_forensically/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 00:16:36 UTC",
    "id": "1j5afht",
    "link_flair_text": null,
    "media": null,
    "num_comments": 9,
    "score": 24,
    "secure_media": null,
    "selftext": "Not an English speaker.\n\nI miss you bastard! I miss laughing with you, i miss those non sense conversations or those men conversations about girls. I miss hearing your laugh, i miss you being an asshole all the time, i miss you being a clown to cheer me up. I just wish to give all the money i have to have you here with me and your daughter for just 1 minute. I still remember the time when you were always at my parents house for that sniping game and i always beated you making you angry as hell. I miss those days in school when you never left me alone being in troubles. We were very different, you a fucking clown and me, like you used to call me, \"mister perfect douche\".\n\nBelieve me bro it was... it was a fucking torture seeing you in that hospital bed fighting with cancer and knowing that you couldn't win this time. You couldn't see it but when you died a part of my heart broke. Even when you asked me to take care of your daughter( Sofi) like she was mine i was in a mix of emotions. Scared and honored. You didn't deserved cancer(and your ex to leave you in your weakest moment) believe me when i say that i always wished to take it instead of you. You had a daughter, a gf and a life to be build brick by brick while i was just trying to figure out what the fuck to do with my life. 6 years passed by and i might sound repetitive but i wish you would be here for only 1 minute to see that your best friend tried and is trying his best for your daughter, i wish you would be here to see how much she is grown and how absolutely sweet and kind she become.\n\nYou bastard left me! And even now while i'm writing this you are making me cry you asshole. 6 years bro, 6! I still miss you like the first day.\n\nI just hope you are somewhere happy, calm and with 0 regrets. I wish too you are still practicing at that sniping game cause when i would be there with you the match would be a must!\n\nI saw an old photo of us today when we were 7 and like always together! Don't worry bro we will always be together and we will always be in troubles together like a team.\n\nI miss you asshole!",
    "subreddit": "TrueOffMyChest",
    "title": "I miss you asshole of best friend. I hope you are in a better place now.",
    "upvote_ratio": 0.87,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5afht/i_miss_you_asshole_of_best_friend_i_hope_you_are/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 00:12:29 UTC",
    "id": "1j5acjl",
    "link_flair_text": null,
    "media": null,
    "num_comments": 32,
    "score": 529,
    "secure_media": null,
    "selftext": "Landed a monster win playing games on Stake recently. Like, six figures monster. Not \"fuck you\" money but definitely \"fuck this\" money. No debt now. Fat emergency fund. Future looking secure for once.\n\nBut I literally cannot buy myself anything without feeling like I'm committing a crime?\n\nWent to get a decent laptop since mine sounds like a jet engine - stood in Best Buy for 20 minutes before panicking and leaving empty handed.\n\nTried ordering takeout yesterday instead of meal prepping. Canceled the order twice before finally letting it go through. Then felt sick the whole time eating it.\n\nGrew up poor. Like, generic cereal in a baggie poor. Guess that shit sticks with you even when the circumstances change.\n\nAnyone else hit financial stability and still feel guilty spending on basic comforts? Like my brain is programmed to think broke thoughts no matter what my bank account says.\n\nIt's exhausting. I've friggin EARNED this money (even if luck was involved), but can't seem to actually use it without spiraling.\n\nHow the hell do I fix my brain so I can enjoy what I have?",
    "subreddit": "TrueOffMyChest",
    "title": "I feel guilty spending money on myself, even when I've earned it",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5acjl/i_feel_guilty_spending_money_on_myself_even_when/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 00:03:20 UTC",
    "id": "1j5a5pt",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 0,
    "score": 10,
    "secure_media": null,
    "selftext": "my roommate has not been in a good place mentally for the last few months. She drank a little too much tonight and apparently cut her finger with a nutella jar. We saw blood on the floor, I was the first one to go into her room. She was laying there, not moving and blood over her floor and bedsheets.\nShe‘s okay now as it was just a little cut but for a few seconds i thought she had done something to herself. She already kind of laughs about it now because nothing really bad happened but I can’t forget the utter fear I felt when I saw her laying there. I feel like I am still in shock and i don‘t know what to do \n\nsorry for any mistakes, english is not my first language \n",
    "subreddit": "TrueOffMyChest",
    "title": "I thought she was dead",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5a5pt/i_thought_she_was_dead/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 00:01:18 UTC",
    "id": "1j5a43o",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 3,
    "secure_media": null,
    "selftext": "I (31F) dated my ex (37M) for exactly 4 years. We started in May 2020 and broke up for the last tkme on May 2024, and I say the last time cause he used to break up with me alot, like ALOT (I stop counting after the 40 something time at about two years of dating).\n\nYes, the relationship was a bit toxic, he's a narcissist,  and I'm not saying this just cause I think so or a video told me. He told me from start, he went to therapy and the therapist told him he has signs of narcissistic disorder, adhd and other things.\n\nBut the thing was that, we loved each other so much, I know he loved me, and I loved him to death. Theres a lot of bad memories and shitty things he did, I wasn't the best eaither. He was really jealous, possessive and over protective, and I'm very sociable so yeah, it was a problem, but I knew he loved like he never loved anyone.\n\nLast time we saw each other was in June for my birthday cause he broke up with me one week prior, then we stopped talking, talked again in July and since then we have gone zero contact.\n\nSometime I feel so chill and feel like I moved on, but I still think about him every single day, EVERY SINGLE DAY, and there's days I miss him so much and want to talk to him, every time is getting harder and harder to not contact him.\n\nI wish he would call me, but I know he won't, and I know this is for the best.\n\nHow do you get over someone you thought was the love of your life and thought you were going to marry that person? ",
    "subreddit": "TrueOffMyChest",
    "title": "Can't forget my ex",
    "upvote_ratio": 0.81,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5a43o/cant_forget_my_ex/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 00:01:16 UTC",
    "id": "1j5a42p",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 0,
    "secure_media": null,
    "selftext": "I know some people are gonna be like “well then why are you with him?” \nBut truthfully I never really ever cared up until now. \nI think it’s embarrassing that he likes girls stuff with their butts all out and clearly looking for attention. Not only that but it definitely makes me insecure because in my head I think that he likes that, and even if he tells me he doesn’t and that I’m overreacting over a “like” … it just still makes me feel that way. My advice is if yall have a girlfriend don’t like other girls stuff because it can definitely create some type of insecurity within the relationship. \nAnd I know not all girls care, but I just think it’s important to respect no matter what. \nThat being said. I am now single :)",
    "subreddit": "TrueOffMyChest",
    "title": "I hate that i get insecure over my bfs likes!",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5a42p/i_hate_that_i_get_insecure_over_my_bfs_likes/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 23:52:51 UTC",
    "id": "1j59xpo",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 11,
    "secure_media": null,
    "selftext": "31F nurse in a very toxic environment.\n\nI’ve been denied a promotion twice in 6 years.\n\nI feel my growth has been stunted, no room for promotion, I’m not learning anything more. The staff are bullies. I’m being bullied by three seniors who are ganging up on me. Higher ups told me to be quiet basically when I reported it. \n\nI’ve been run down, chest infection after chest infection, extreme fatigue etc then I went off sick five weeks ago after being told to shut my mouth basically and I’ve been fine since. In a good head space, no fatigue etc. \n\nI’ve job searched every day. No suitable roles as I am specialised theatre nurse. All I keep seeing is clinical assessor/Pip roles and I’m at such a breaking point with my role that I am close to going for that one and it’s hated by people and run by private companies who can sack you at  any time. \n\nI have to return back to an environment where the people are nasty, where the seniors are out to get me (and they are) and where I no longer feel I am learning, improving or getting anywhere. No amount of effort I put in works there anymore, and I’ve tried my hardest. \n\nI’ve even contemplated leaving nursing entirely but no other role pays the same and I cannot afford to retrain for something. \n\nI have a mortgage, pets to feed, bills to pay and now I have to accept the fact that i have to stay in this place for longer until I find somewhere else and even then, work never let me leave for an interview. I have to stay in my work prison and serve a never ending sentence. \n\nThe last day before I went off sick I genuinely contemplated driving my car off the bridge on the way home. Now I have to go back. My doctor said he’d give me a paper for more time off as he understands the pressures. But I don’t know what’s the best thing to do. I’m grateful I have work and have a job, I just wish it was filled with a lot nicer people where I could have a fresh start. ",
    "subreddit": "TrueOffMyChest",
    "title": "I’ll have to face the fact I have to stay in my awful, toxic job.",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j59xpo/ill_have_to_face_the_fact_i_have_to_stay_in_my/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 23:45:44 UTC",
    "id": "1j59s2n",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 16,
    "secure_media": null,
    "selftext": "I worked at three of the biggest influencer marketing agencies over the last decade, and now that I don't, it's finally safe for me to speak the truth without risk to my career - I need to expose that whole industry as a scam and no one is talking about it..\n\n\"Influencer Marketting\" agencies make almost all their money NOT from sponsorships but from influencers paying them monthly fees to FIND them sponsorships that never happen. I was shocked each time I got a new job at a new \"influencer marketing agency\" to discover they all work the same way- colleagues who mentioned it were fired or made redundant. It's kind of like a pyramid scheme... Out of thousands of influencers paying monthly \"subscription fees\", almost no sponsorships actually happened in the years I was there. All of our workload was dedicated to finding more influencers to sign up rather than sponsorship companies.\n\nThink about it- why would we need sign ups in the first place if we can find sponsors? We'd obviously take a cut of sponsorship as that would make more money- right??!! What's going on is dishonest &amp; takin advantage of the poor.\n\nMost people think that a large following of 500K+ followers, makes that person wealthy. The reality is that 99% of people with 500k followers on insta and tiktok (and in many cases, youtube shorts), make nothing. I’ve worked with influencers sleeping in cars, couch-surfing, living below the poverty line for years, incredulous to the fact they aren't making anything, while my colleagues persuaded them to continue building a following and that sponsors were \"just around the corner\". We would be told to persuade these people to by dangling carrots like this. Many of them worked 20 hours a day to build a following- often from uplifting or positive content- and weren't narcissists- it is not a pleasant life, and I knew of so many like this.\n\nI don't like how the industry is taking advantage of these people. Websites like SocialBlade are hilarious - the number of times I've seen them claim people are making $500K+ per year but in reality, they're earning nothing... It happens all the time.\n\nThe key is that most audiences aren't monetisable no matter how big they are, and the ones that ARE monetisable (e.g. \"technical\" topics), are nigh on impossible to persuade sponsors to bite because they're all so stuck in the past (they think of social media as something \"free\" and will only pay to advertise on TV or via traditional routes).\n\nTo make things worse, 99% of companies reaching out just want free advertising. They offer “exposure” or a cheap free product and refuse to pay. They all think that someone with a large social media following is a philanthropist millionaire, or can eat \"free products\", didn't work full time to build that following, and doesn't need income.\n\nMeanwhile, marketing agencies exploit this situation by selling influencers false hope and taking their money with no return. It has to be biggest public perception vs. reality mismatch I’ve ever seen.. on such a grand scale.\n\nNo one is talking about this. Agencies won't talk about it because their income comes from maintaining the lie. Influencers themselves won't talk about it as they fear it might destroy their chances of getting a sponsor in future (which is never going to happen!!). So I had to get this off my chest, now that I don't work for them anymore. I'm frankly amazed these \"companies\" haven't been shut down.\n\nI'm sorry but I can't name myself or the companies for obvious reasons, but they're all the same (afaik), and I can't give examples of specific social media accounts for similar reasons unfortunately. Therefore, you don't have to believe me on this, but I speak the truth &amp; just happy to get this off my chest.\n\nMy advice to you if you're unable to find sponsors for social media following:  \n\\- Don't waste any more time on it. Views can't pay your bills. Don't waste your life..  \n\\- Don't trust any social media \"marketting agency\" that requires a monthly subscription fee from you (if they are genuine, they'll operate on a percentage of sponsorship deals that they obtain for you - NOT a monthly fee from you)  \n\\- Don't trust when anyone tells you \"you're just marketting wrong- it's impossible to have no income on 500k followers\" - they don't know what they're talking about unfortunately. Most influencers even in the 500k braket make NOTHING, but none will admit it for fear of it sabotaging their future chances.  \n\\- Spend your time re-skilling to do something else that will make a living, don't fall for this scam.  \n\\- Even monetisable accounts with monetizable topics are VERY HARD to get sponsors for, that's why so many don't have a sponsor for years.  \n\\- Don't fall for the \"if I get a big following I will automatically find ways to make an income\" trap\n\nThere. Off my chest!",
    "subreddit": "TrueOffMyChest",
    "title": "Influencer Marketing Agencies Are a Scam – I Worked for 3 of the Biggest Ones",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j59s2n/influencer_marketing_agencies_are_a_scam_i_worked/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 23:45:17 UTC",
    "id": "1j59rp2",
    "link_flair_text": null,
    "media": null,
    "num_comments": 13,
    "score": 0,
    "secure_media": null,
    "selftext": "Hello everyone, i 22f seem to get overwhelming amount of attention from guys in their 30s and i just dont know how to feel about it. I live in a small ish community where everyone pretty much knows everyone or has heard of them at least. In addition to that, theres not many people my own age to pick from around here unfortunately. \n\nAnyways, i think i could count at least 5 guys in their 30s who have approached me or expressed interest/flirted with me. Mind you, im newly 22 and already get told i look like im 17. Im not completely opposed to dating out of my age range, but are there things i need to worry about with this? Is it a predatory thing? Is it guys lusting over a younger girl to fulfill some kind of fantasy? \n\nHas anyone else gone through this? I kind of like the idea of an older guy but it is also a bit weird to think about especially from the outside. Any input is appreciated! ",
    "subreddit": "TrueOffMyChest",
    "title": "Why are guys in their 30’s attracted to me?",
    "upvote_ratio": 0.47,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j59rp2/why_are_guys_in_their_30s_attracted_to_me/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 23:40:37 UTC",
    "id": "1j59o42",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 12,
    "secure_media": null,
    "selftext": "some of you might already be familiar with my profile, with my story. I was sexually assaulted a while ago and I really thought I had it figured out. I don't. I'm not going thru all the details of that again but I posted it here a few days after it happened, you can look on my profile if you want to know. \n\nAfter my last post, I went along with many of your recommendations, I took pictures of the bruises, I warned all my female friends bout his conduct, blocked him everywhere and even told my sister about it (not exaclty how it happened, just that I was feeling scared most of the time and that I was SA'd, I didn't wanted to go into detail with her). \n\nAnd I thought, I really did thought, it was all going well. For the past week, I had not thought about him once, I had not cried bout it anymore, I was healing, I think. But today I overheard someone talking bout him. \n\nActually, I heard them talking bout me. \n\nOne of my friends - that was in the party I was SA'd at - kind of has a crush on me and everyone knows it even tho he never told me upfront. Today, I overheard some of this guy's friends saying how much of a bitch I was to be with someone else in front of him. I wasn't \"with someone else\" I was being assaulted. I was crying, I was asking him to stop. \n\nI didn't knew he saw it. I didn't knew any of them saw it. And now I feel dirtier than ever. Yet at the same time, if they saw it why didn't they stopped it? Why didn't they helped? \n\nI want to rip off my skin, to burn it so deep there won't be an inch left of what the man who sexually assaulted me touched. And yet now there's also this dreading feeling that they would still view me as nothing more than a bitch. I feel like I can't breath, like I can't ever run away from how tainted he made me, how dirty and broken he made me. Everytime they look at me all they see is my assault, and they think I chose that, think I am a whore. I can't deal with that. I don't know what to do.\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "my friend tried to rape me, I don't know how to move on and my friends think I'm a bitch",
    "upvote_ratio": 0.88,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j59o42/my_friend_tried_to_rape_me_i_dont_know_how_to/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 23:33:19 UTC",
    "id": "1j59il8",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "How to cope with a boyfriend who has phone/computer addiction? \nOr more accurately help him out of this?\nIt's feels like he's not here in real life except when I open my mouth repeatedly. If i don't say anything at all, we wouldn't barely spend time or talk with each other. \nEvery fucking minute when we not interact he's on phone or go straight to his computer. He can't literally live or do things without his phone. Like cooking food, cleaning, walking the dog and more things. \n\nAt this point I don't feel seen, good enough or loved. Sometimes I feel like he only wants me to be there on his terms when he's bored of the technology ",
    "subreddit": "TrueOffMyChest",
    "title": "Invisible/alone in my relationship?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j59il8/invisiblealone_in_my_relationship/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 23:23:40 UTC",
    "id": "1j59b23",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 2,
    "secure_media": null,
    "selftext": "Throw away account so no one sees this. \n\nI have been working really hard the last 5 years or so to improve my life. \n\nA little background about me- I come from a low-income, below poverty line house hold. Grew up in housing during my childhood. Majority of my family including cousins are either on social assistance, housing, drug addicts, alcoholic, ect. \n\n6 or 7 years ago, I was on social assistance myself. I didn't finish high-school. I was drinking daily. Ended up in an abusive relationship. Managed to get a cleaning job. \n\nSince then I've gotten my GED, partially went through college, ended up building a career before I completed college, am now a program manager on my way to making 90k a year in a field i love that feels like I'm making a difference in people's lives, in a happy loving fulfilling relationship where I live with my partner, we plan to buy a house soon and are thinking about marriage and kids. I have a car. I've essentially hit all of the life goal milestones I wanted to hit by the time I was 30 and more (I just turned 30 a few weeks ago). I've been to therapy, ive been on a good medication for my mental health, I've done the work.\n\nI feel like my life is finally on the right track. Because of this, I've finally been able to shift my focus to more \"shallow\" or less important things that have been kinda low on my radar. \n\nFirst let me say, I love myself - not in a self centered kind of way, but I appreciate that I'm resilient, goal oriented, determined, am empathetic to peoples experiences, and I have a lot of love to give. And I have a lot of respect and compassion for myself- just as I do for others. \n\nWith that being said, my appearance has always been something that's bothered me. I've always had bad skin, I gained quite a bit of weight over the last 4 years- and I'm just not in a place where I feel good about how I look. So I've decided, this year, that's what I'm going to work on. I've bought more professional clothes, started my skin journey to help with my skin texture and acne scars and redness. And planning on getting my teeth fixed. Getting a good hair regime. And controversial- i decided id try ozempic. My insurance is covering it so essentially it's like why not? Why wouldn't I give this thing a try to support me in losing weight and feeling better about my appearance. It's not that I think I'm UGLY I know I'm not- i just feel like I haven't really taken care of myself and I'm working on it. \n\nAnyway long story short- I feel like I'm getting some much push back randomly now. And the more I think of it the more I realize how much push back I've gotten generally on decisions I've made. \n\nMy dad once said how will you live on your own your on welfare (this was 7 years ago before I met my boyfriend and 3 months before I got a fulltime job as a cleaner and my own apartment)\n\nMany times as I've changed jobs to move up and learn more I've gotten aren't you scared? Are you sure you want to do this?\n\nAnd now from some family members and old friends its - wow that treatment is a lot of money, I've heard so many negatives about ozempic etc. My own mother has issues with me improving the way I look for some reason.\n\nI just don't understand it. I would never try to put someone down for bettering themselves in anyway. It's actually almost hurtful.\n\nOf course I realize I don't have to and won't listen to others on my life choices, because my choices have gotten me to where I am today. I guess I'm just venting because it feels like the people who don't even make decisions try to influence yours. \n\nAnyway thats all haha.",
    "subreddit": "TrueOffMyChest",
    "title": "I'm tired of people who don't even make decisions in their own life trying to make mine.",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j59b23/im_tired_of_people_who_dont_even_make_decisions/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 23:22:40 UTC",
    "id": "1j59a9z",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 0,
    "score": 4,
    "secure_media": null,
    "selftext": "It was only a couple of months between his first doctors visit and finding out it was terminal. all of this has moved incredibly fast, and I don't feel capable of talking about it much. In the few times I have mentioned it to other people, I'm always very calm. I'm very calm when I see him, too. I just can't seem to cry about it when you'd expect me to, but then I break down at random times. \n\nHe's a lot older than me, so if I ever thought about it, I probably would've guessed he'd die before me. But not like this. Not this soon. \n\nI'm not family or anything, or a really close friend. there are people who have known him for more than a decade, and I have to be some kind of blip in his life, having only really been his friend for a few years. In a way, it doesn't seem like I have any right to be upset about this. Not when he's got actual family and friends who are as close as family. but here we are. \n\nthe thing is, like, my own parents are...fine, but fell short in a lot of ways. i'd never, ever admit this to anyone i know, but I did/do see him as kinda a parental figure. Or, at the very least, a trusted older adult. Someone I could be honest with and rely on, which is pretty rare in my life. He looked after me a bit. Now I'm trying to look after him. I don't think I'm doing a very good job of it, but I'm doing my best to do as much as he'll let me. \n\nI feel so worn thin. I'm trying so hard to be here for him, and also be here for my best friend who's going through a rough time mentally, and my family, and also work and have my own life and not go absolutely fucking insane. i don't know. this is more important than anything else i could do. I'm just so tired and sad and i'm not sure i deserve to be but there it is. I want to tell him that he's important to me, that this is really fucking me up, but i have no idea where to find the words. I don't know that the right words exist. I'd give anything to fix this. If I could die instead, I would, but that's not how cancer works. I don't know. I'm tired and right now I just desperately want things to be okay, or to not have to be the strong one for once, but who else is gonna be?\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "friend is dying of cancer, can't tell almost anyone about it",
    "upvote_ratio": 0.76,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j59a9z/friend_is_dying_of_cancer_cant_tell_almost_anyone/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 22:55:24 UTC",
    "id": "1j58nr5",
    "link_flair_text": null,
    "media": null,
    "num_comments": 8,
    "score": 0,
    "secure_media": null,
    "selftext": "Hi everyone, \n\nLast summer I 22F met a man on this app who is 45M. The day after we met online we had a phone call and ended up spending nine hours on the phone! The following month he flew out to see me and I spent that whole weekend with him. We had an instant connection and even nine months later things still feel really great. \n\nHim and I live only a few states apart so for the past nine months we have been traveling a lot just to see eachother. We have been traveling back and forth so much that this weekend is our 20th visit with eachother and we have spent roughly 100 days together in person! \n\nWhen we first started seeing each other I didn’t tell anyone because I was too afraid of the judgment people would say. I have no clue how people in my family or community might feel about our age gap. Overtime it just got more and more involved but I still did my best to hide my relationship from everyone.\n\nThis upcoming May I need to find a new place to live and I don’t really have many options. The best case scenario is for my partner to move to my state and for us to live together. That is a realistic plan for us but the only issue is that I don’t think I can hide that from my friends/family. I am also starting to think about just telling them since there are times where it is hard to have to hide my relationship, especially when it’s such a big part of my life. \n\nI am really worried about what my family might say. I am worried they will look at me in a negative light. I know that it’s just their opinions but it isn’t easy to feel judgment. I am really stressed and confused on what the right decision is. \n\nAny advice would be greatly appreciated 🤍",
    "subreddit": "TrueOffMyChest",
    "title": "I’ve been in a secret relationship for the past 9 months and I’m afraid to tell my family",
    "upvote_ratio": 0.46,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j58nr5/ive_been_in_a_secret_relationship_for_the_past_9/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 22:54:56 UTC",
    "id": "1j58nd7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 18,
    "score": 38,
    "secure_media": null,
    "selftext": "Probably gonna delete this soon as I just wanted to get it off my chest and have no one to talk about this with. I’m sorry if this is too explicit.\n\nKinda embarrassing but I have a personal porn account on twitter just for reposting videos that I find hot and stuff like that, probably my fault as this stuff is the wild west but I’ve had that account for almost 3 years and have NEVER seen any CSAM EVER. \n\nI only watch videos of adult couples who are promoting their stuff so that type of thing never pops up. \n\nOne of the accounts I follow but never really see had been sold and taken over or something and reposted a sexually suggestive video of a girl that was very obviously young as fuck like 12-13.\n\nI clicked on the original account to see if all the videos were like this and it was literally just a bunch of young girls maybe 10 to mid teens with some in EXTREMELY explicit situations. \n\nI was absolutely disgusted and reported the account IMMEDIATELY and the account that reposted the video.\n\nThen worst part is that the reposted video had over 1k likes and 350 reposts, I looked at the reposts and it was HUNDREDS of GROWN ASS MEN and a bunch of fake OF accounts with hundreds of thousands of followers (obviously not run by whoever’s pictures they’re using) just mindlessly reposting whatever. \n\nI’m just disgusted, this is the type of thing you hear about but never really see for yourself. I can’t stop thinking about those poor young girls and how they must be feeling and how they hell they were taken advantage of to get into that position. Also the poor young girls who were probably groomed into sending explicit vids and don’t know those videos are floating around on the internet, or perhaps they sent them to another teen and they got leaked. Sad and disgusting. I hate this world. 🤮 \n\nI know this is partly my fault for watching porn online but it honestly jumpscared me seeing that, I don’t really watch porn that much anymore but this has scarred me for sure. 🙃",
    "subreddit": "TrueOffMyChest",
    "title": "I saw CSAM on “X” today and it just ruined my day and pissed me off",
    "upvote_ratio": 0.79,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j58nd7/i_saw_csam_on_x_today_and_it_just_ruined_my_day/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 22:26:17 UTC",
    "id": "1j5805v",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 1,
    "secure_media": null,
    "selftext": "I really don’t have anyone to talk about this to so I’m just gonna share this here. \n\nA year ago I (20M) was at a party with some of my friends. At the party there was this really pretty girl, I’m talking people’s heads were turning when she was walking by. We were alone at the snack table and started talking (I don’t remember much details), the conversation went really smoothly and at the end she invited me to go to a rap concert with her. I politely declined as it’s not my genre of music.\n\nThe party went on, everyone got slightly drunk and the girl invited me to dance with her. At some point the dance became kind of intimate (to the point she wanted me to „grab her ass” jokingly)… so  ofcourse I excused myself and went to get a drink. \n\nAt some point me and my friends went upstairs to chill on the couch, later in the evening the girl joined us and squeezed in right next to me. Some time passed and it was getting late so people began to fall asleep. I wanted to go find a bed for myself but it turned out the prettiest girl I’ve ever laid my eyes on fell asleep holding onto me, snug on the hoodie over my left ribcage. Being the awkward fuck that I am I just spent the night with one arm parallel to my body and the other on top of the couch as to not hug her without consent. \n\nMy memory has never been the greatest so I probably left out some details, but generally our chemistry when talking was great. \n\nIn hindsight it seems pretty obvious she could have been kinda into me (or she was jus being nice, guess we’ll never know) \n\n",
    "subreddit": "TrueOffMyChest",
    "title": "Im so dense, she was flirting with me (I think)",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5805v/im_so_dense_she_was_flirting_with_me_i_think/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 21:41:05 UTC",
    "id": "1j56y05",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "I fuck up everything good in my life. I had the most amazing guy and I fucked it up. \n\nI’m a miserable, depressed piece of shit. With no self esteem and severe social anxiety. \n\nMy life sucks. I ruin everything for everyone including myself. I drain the happiness and fun out of everything. I don’t know how to laugh, be myself or make jokes anymore. \n\nI take several medications. Nothing helps anymore.\n\nI had multiple shots at my dream job and I fucked every last one of them up. \n\nI’m 25 with no future and no friends. All of my college friends moved away and forgot about me. I don’t have any friends. The only time I get a text message is when my medications are ready. \n\nI’m stuck at home being a caregiver for my sick mother. Who sometimes still controls me like a child. I have too much guilt to leave her behind and go else where. \n\nI have no money, no license (bc I’m too much of a pussy to get behind the wheel), no car. Nothing. \n\nI’m not a normal girl. I hate dress clothes, don’t want children, no make up. Only video games, superheros and having a potty mouth worse than a sailor. I’m clingy, rude, no social skills, and can be loud. Who would like that? Even my own fucking dog hates my guts.\n\nMy boyfriend dumped me, my soul cat of 17+ years just died, I knocked my front tooth out which won’t be fixed for another 2 months, I live in a shitty apartment with insanely loud neighbors to where I can’t sleep at night. Shall I go on?\n\nIt’s been 25 years of miserable years and bad luck. If I didn’t have bad luck, I wouldn’t have any at all!\n\nMy life is gonna end at a ripe old age with no one that cares about me or would even come to my funeral. I’ll be alone and miserable forever. \n\nIn the end, it’ll always just be me, myself and I. \n\nI feel at least a bit better getting that all out.. ",
    "subreddit": "TrueOffMyChest",
    "title": "I’m a failure..",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j56y05/im_a_failure/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 21:52:31 UTC",
    "id": "1j577p6",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 3,
    "secure_media": null,
    "selftext": "English is not my first language\nFormat from mobile\nAll my life I felt like I was weird, I felt like I forgot things, that I couldn't empathize with people, my imagination was strong when I was a child and that's why I felt like no one could understand me, I'm currently 30 and after so much time I received the test that finally removed my doubts about what condition I had, I would believe that I had some kind of autism because of my behavior, but what I discovered left me devastated and I don't feel like I can talk to my family about it. I have mild cognitive impairment and although there are guarantees that I can continue with my life, the truth is that with the pace of life I lead it feels very difficult, I don't have the family support that I would like and at this moment if I tell them my condition they will use it to criticize me instead of supporting me, I feel like a failure for not being able to do what others could, what I expected was some guidance and now the only thing I hope is that I don't develop Alzheimer's or Dementia and lose the memories or what I once was I simply feel that I lost something and although for many it is insignificant, for me it was  One of the hardest news I have ever received in my life.",
    "subreddit": "TrueOffMyChest",
    "title": "I waited for more than 20 years for this result and I am not happy",
    "upvote_ratio": 0.81,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j577p6/i_waited_for_more_than_20_years_for_this_result/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 21:27:07 UTC",
    "id": "1j56m70",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "cause i just had a massive argument with my dad about phone limit times and we were talking 3 HOURS HERE. ngl i dont think its that long at all and i only used it to call w my friend even though i had to end it mid call cause he bursted into my room and started yelling at me for being on my phone for too long like it was after dinner time and i even did the dishes today and i was just having my free time. i rarely have my own times since im only allowed to use my phone for an hour and a half everyday but today was an exception cause it was my long distance friends birthday and i just wanted to celebrate it with her.",
    "subreddit": "TrueOffMyChest",
    "title": "how long do yall use ur phone",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j56m70/how_long_do_yall_use_ur_phone/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 21:18:33 UTC",
    "id": "1j56eve",
    "link_flair_text": null,
    "media": null,
    "num_comments": 42,
    "score": 0,
    "secure_media": null,
    "selftext": "cause guys i honestly dont get it like my parents can see what app im on, how much time i spend on that app, what websites im visiting and they said that i cant use more than 15 mins of tiktok per day and i think its insane please let me know if it is nornal\n\n  \nthe app they use is called family link and i think its time for me to like get over them and learn myself how to limit my phone time cause i literally cannot live with my tiktok time limited with 15 mins and the whole device an hour and a half everyday",
    "subreddit": "TrueOffMyChest",
    "title": "is it normal for parents to control your phone when ur 14?",
    "upvote_ratio": 0.22,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j56eve/is_it_normal_for_parents_to_control_your_phone/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 21:03:17 UTC",
    "id": "1j561yb",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "I dont know if it technically counts as self harm, but everything makes me mad. Games, my family, loneliness, etc etc etc. I've hit my wall so much that I have to change how I hit it. I think a part on my wrist might be broken, so now I have to use my knuckles. I reached out to 988 and they suggested taking it out on a plushie. I only had one and it's in pieces now, so back to the wall. I wish I could go to therapy so fucking bad, but we cant afford anything. I wish I was raised by people who made me feel comfortable enough to talk about my problems, but the most they would tell me is that im stupid for hitting myself and the walls.",
    "subreddit": "TrueOffMyChest",
    "title": "I cant stop hitting my wall",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j561yb/i_cant_stop_hitting_my_wall/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 21:01:47 UTC",
    "id": "1j560mr",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "I, (21 f)am dating my high school sweetheart again after years of not seeing or speaking to each other. \n\nWe met working a shitty fast food job in high school, and I fell in love with her almost immediately. She’s smart, so fun to be around, made me laugh and made me feel genuinely loved and appreciated for the first time in my life. I felt more confident, more comfortable around her. Not to mention she’s also the most gorgeous person i’ve ever seen. \n\nWe dated for a bit, and then she broke up with me towards the end of our senior year. I was heartbroken, and went off to college still processing and dealing with the breakup. As silly as it sounds and I know most people think this with their first love, but I really thought i was going to marry this girl. We chatted on and off throughout my freshman year, just normal shit like “hey how are you doing” and “we should catch up” before I finally decided it was finally time to fully move on and forget about her, so I blocked her on everything that summer, and deleted her number. \n\nWhile i still thought of her from time to time, I wasn’t angry or hurt about the breakup anymore, I had accepted that 17-year-olds know nothing about love, and all I can do with heartbreak is learn from it. \n\nFast forward to the beginning of my junior year of college, and I’ve dated on and off for years now and was in the process of trying to end a terrible long term relationship. I drove from college to my hometown, around 3 hours, to be with my friends after ending things while my new ex blew up my phone with calls and messages telling me what a horrible person i was for breaking up with her (I was not, she treated me terrible and refused to listen to me when I had an issue). \n\nMy friends and I decided to grab food and hangout in my car in one of the parking lots in our hometown. We pulled in, and I saw my first Ex’s car. It had a very distinctive bumper sticker, so I knew it was her. I didn’t get out or try to say anything, but my heart skipped a beat. I really truly believed I would never see this girl again. I debated reaching out, but in the end I unblocked her on snapchat and reached out with a simple “hey! were you at x lot the other night?” and we spent a few weeks catching up and then hung out for the first time in years. \n\nShe told me she missed me, and had always regretted the way things ended between us. I had no intention of trying to date again when I reached out, but I admit I did miss her too. That was about 9 months ago, and one thing led to another and now we are fully back together and it’s been amazing. \n\nI know it’s only been three years since we broke up originally, and I will say that I still don’t know anything about love. I’m a different person than I was in high school, and so is she. She makes me feel like the most beautiful person in the world, and i’ve never come close to feeling this way for anyone but her. All I do know is that as long as I’m able, I will do my best to love her the way she deserves, because as far as i’m concerned she does the same for me. I can’t help but wonder how my life would be different now if we hadn’t gone to that one parking lot that night. \n\nThank you for reading, xoxo",
    "subreddit": "TrueOffMyChest",
    "title": "I think i believe in fate because my first love came back into my life",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j560mr/i_think_i_believe_in_fate_because_my_first_love/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 20:41:09 UTC",
    "id": "1j55iu5",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 68,
    "secure_media": null,
    "selftext": "30M. I’ve been insanely busy this past week to the point that I basically forgot that rubbing one out is a thing one can do to chill out. Between work and life throwing me curveballs at every turn, my brain has felt like pea soup for the past 24 hours. \n\nLast night I was so insanely horny that I couldn’t stop thinking about my coworker who could like me but could also find me repulsive for all that I know. Genuinely thought about texting her and asking if she wanted to go out sometime. Probably would’ve led to some pretty bad shit for me, and I love my job too much. \n\nFinally today I had 10 minutes and was able to fully clear my head. Now I feel so much more at ease and all the things I have to think about don’t seem so threatening anymore. Phew! ",
    "subreddit": "TrueOffMyChest",
    "title": "Thank fuck for post nut clarity",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j55iu5/thank_fuck_for_post_nut_clarity/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 20:37:59 UTC",
    "id": "1j55g68",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 28,
    "score": 1154,
    "secure_media": null,
    "selftext": "today I found out my mom was murdered. blunt force trauma to the head that lead to brain bleeding. she had a migraine for 11 days and vomited daily. I had no idea she was sick. she passed in july of last year, and the county I am in is so backed up that the medical examiner took 8 months to get back to us. we all assumed it was a fentanyl overdose that she may have come in contact with because one of her friends was an addict. it turns out that she had no drugs in her system.\n\ni’ve been waiting for 8 months. i’m only 20. my dad hasn’t been around at all for my whole life. my mom picked terrible men. her whole life has been around horrible men. she was raised being beaten by her father by anything and everything possible he could find. she married a man who got addicted to crack, my father. she then married another man who cheated on her the entire relationship with other men. the final man, a man who had stolen from her in a relationship prior and who has killed 2 of his previous partners indirectly, took her, too.\n\nthe only answer it could be is that the final man took her from us. he had never killed them exactly, but both of his previous wives were completely clean before they met him. 5 and 7 years later, they both died of a heroin overdose.\n\nI cut off my relationship with my mom in 2019 due to something I was a victim of when I was younger by the man who cheated on her with other men. he did some fucked up things. a lot of fucked up things. he let a lot of fucked up things happen to me under his supervision. I had caught a disease from what he did/let happen and decided to move in with my grandma because I did not like the man she was now with, the man who (may) have killed her, the final man. I had no contact with her after I got a restraining order.\n\nshe and I had started to get along for once in 4 years. I had hugged her (albeit halfassedly) for the first and last time. she cried and cried. I don’t know what I would have done if she were to have passed and I didn’t get on good terms with her again.\n\nI wanted to see her succeed in her life. she spent all of her life desperate to be shown that she was worthy of being loved. I tried to show her before she passed, a few months before, that the way I had loved her growing up was enough proof that she was worthy of love. that if she can say she isn’t worthy of it, then my love I showed her as a kid meant nothing. she finally started to understand.\n\nwe were going to go to college together. I wanted to help her get her GED. to start going to school. to make the loser of a boyfriend she has had for years go work instead of making her work 2 part time jobs being disabled and still not being able to make the rent. he did nothing for her other than steal from her and hurt her.\n\nI had to protect myself by moving out those years ago. she didn’t want to listen when I knew he was bad news. i’ve known since I was 14. I just wish I could have done something to save her. I wish he never met her. I wish I could have been there to stand up for her when he hit her.\n\ni’m terrified. i’m so scared of being angry. I don’t know how to deal with the fact that someone took her from me. she was my everything for years. someone so cruel took her from me and made her be in pain. no one knew he had hit her. no one knew her migraine was not just a migraine. she couldn’t tell anyone or go to the doctor because she would have to admit he hurt her. again.\n\ni thought I processed it all when she died. but being told today that she died due to blunt force trauma and brain bleeding makes me feel like I lost her this morning. I don’t know what to do. I don’t know how to feel. I feel like my world just broke. again. and now I have to deal with detectives, with getting information, with anything that I can do to help them investigate.\n\nI just want my mom back.",
    "subreddit": "TrueOffMyChest",
    "title": "today I found out my mom was murdered.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j55g68/today_i_found_out_my_mom_was_murdered/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 20:33:34 UTC",
    "id": "1j55cg2",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "Not much to describe honestly… \nJust wanted to get it out. But I’m in love with a boy since the 4th grade… \nBtw I’m a college student now… \nHe’s in a different country now and I’m in a different one…\nAnd I kinda just wanted to let it out, and maybe see if anyone else has gone through the same… \nIt’s been 11-12 years, but I’ve never been able to tell him…\nAnd you know the worst part is that I know that I love him, because he’s respectful, smart, caring, kind and just an overall amazing guy… \nBut idk why, I’ve just never told him… \nNot asking for advice or anything… I’m just putting it out there. Maybe someone might relate? ",
    "subreddit": "TrueOffMyChest",
    "title": "This boy that I like…",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j55cg2/this_boy_that_i_like/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 20:33:10 UTC",
    "id": "1j55c34",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "I'm a 21-year-old trans woman. I realized I was transgender some four or five years ago, and I have been on Hormone Replacement Therapy (HRT) for almost a year. I suffer from anxiety and depression and was diagnosed with Cyclothymic Disorder. So yes, I deal with body dysmorphia and gender dysphoria. I won't deny that it likely fuels a lot of my feelings. \n\nBut despite that, I am extremely self-conscious of my weight. And you'd think I'd be fine with it. I support body positivity heavily and would not ever judge others about their weight. Weight is not a proper scale of health, nor should it be tied to your self-worth; weight is weight. It only ever seems to be myself that I judge for my stomach. \n\nI have a potbelly. When I look in the mirror, all I see is my too-large stomach. And how it doesn't match the body that I'm SUPPOSED to have. And I do everything in my power to hide it because it causes me so much embarrassment. I wear high waisted skirts and pants, I'll tighten my belt just a little too much to tie it in, and I'll wear shape wear all so I don't have to acknowledge it. It makes me feel like less of a woman. Which I know is stupid. Women come in all shapes and sizes. Hell, my girlfriend is plus-sized and she's the most attractive woman I've ever laid eyes on. And yet, I still can't help but compare myself to other women, who have flat stomachs and small shoulders. \n\nI can never stick with exercise long enough to see any results. I like eating unhealthy, sugary foods. I eat a lot, in part to help my chest grow bigger, as HRT affects new fat distribution. I like to eat. And I live in the south, so you KNOW the food here is good. I'm terrible at forming habits. It feels like no matter what I do, I'll never have the body that I actually want.\n\nSo, sometimes, I wish I had an eating disorder. I've TRIED to give myself an eating disorder. I wish that I could go days without food and let my stomach shrink, just so I can finally look the way I want. I wish I could live on scraps of food. But I can't. Food is always there, mocking me until I finally give in.\n\nAnd the worst part is that I feel like I can't tell anybody. I can't talk to my girlfriend about it because it's a trigger for her own weight dysphoria. I have no friends I can talk to about it, and I'm terrified to talk to my parents about it. I hate the way my body looks and I wish I could just force it to look the way I want.",
    "subreddit": "TrueOffMyChest",
    "title": "I sometimes wish I had an eating disorder.",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j55c34/i_sometimes_wish_i_had_an_eating_disorder/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 20:26:13 UTC",
    "id": "1j555we",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 7,
    "score": 1,
    "secure_media": null,
    "selftext": "I used to be a single mom, full-time student and I had a difficult (yet fulfilling) job. I took a research opportunity, and that is where my life fell apart. When I got back home from the research experience (July 2022), I no longer believed my son was my own…I pushed through it, but eventually his father raped me and I couldn’t hold it together anymore. I left everything behind and moved to Hawaii with 2 suitcases and no real sense of reality or self. \n\nNeedless to say, I did it…I was able to craft a normal-ish life. I’m renting a room, I have a good job where I’ve proven my work-ethic, a few solid friends, and pets to keep me company. That being said…the delusion of my son not being mine never actually went away. \n\nI tried and failed to reestablish contact a few times over the last few years, but that part of my brain has never come to terms with it. I don’t exactly know where I went wrong, and now I’m living my own life…but it just feels like an unfinished story. \n\nI don’t know why or how the delusion came to afflict me…but it fucking sucks. I cannot talk about it with other people, and have instead just deflected any questions about my son in a light that makes it seem like my choice, even though nothing is further from the truth. \n\nI’ve tried professional help, but after being told to get better at eating shit by my last therapist…I guess I’ve just resigned myself to living a life of altered reality, where nothing makes any sense but hey at least I’m not homeless. \n",
    "subreddit": "TrueOffMyChest",
    "title": "I’m living with Capgras delusion",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j555we/im_living_with_capgras_delusion/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 20:21:18 UTC",
    "id": "1j551or",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "so, I have three cats and they are my life. I almost want to spend all my time with them. if I am outside I am already missing them. they really became my identity. I can’t control my obsessive behaviour towards them and I am talking to them, hugging them, petting them, making the best and most healthy dishes for them. I can’t help that I just love them so much I can cry about it. my boyfriend says that I am all about my cats. like people say as a joke crazy cat lady but I am afraid I am really one. actually I love that I am like this but I also have the feeling people found me weird and boring and doesn’t follow me with this. maybe I need help or advice? ",
    "subreddit": "TrueOffMyChest",
    "title": "I’m obsessed with my cats",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j551or/im_obsessed_with_my_cats/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 20:20:52 UTC",
    "id": "1j5518x",
    "link_flair_text": null,
    "media": null,
    "num_comments": 8,
    "score": 0,
    "secure_media": null,
    "selftext": "so i’m F 21 and I just went to the gynecologist for the first time and so I got my first breast exam and pap smear done. pap smear was not bad at all for those worried about it, literally the worst part is how like intrusive it is having someone being literally so close to you in that way when you don’t know them. but anyways after she did the breast exam and i had to open my legs up a bit for the pap smear i thought i might’ve been a little wet. i just don’t get why i would be cause it was honestly very uncomfortable for someone i don’t even know to be touching my breasts so thoroughly, i was not enjoying it in any way i was just uncomfortable and it was really awkward. i just wanted to know really if its like normal that i think i got wet from it. i could be wrong though i dont know i couldn’t feel myself or anything but i do think i was",
    "subreddit": "TrueOffMyChest",
    "title": "i think i got wet after a breast exam?",
    "upvote_ratio": 0.27,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5518x/i_think_i_got_wet_after_a_breast_exam/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 20:10:06 UTC",
    "id": "1j54s03",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "Basically, the title, here's some context.\n\nI (F19) and my best friend D(F19), have been close friends since elementary school. The summer before COVID me and my parents moved to South Florida for the start of high school, and still we talked everyday. We would talk on Facetime for hours, fall asleep on the phone, play multiplayer games, and watch movies through shared play together. We got through college app season together, first jobs, and she was the first person I came out to. I've never had a sibling, but I'll always call her my sister. Even though we've practically been 1000+ miles apart for almost 6 years, she's always my #1 call. I tell her I love her everytime we hang up. \n\nD is in college in New Jersey for nursing, and just recently started sessions with a psychiatrist. She is actively on medication for depression and sleep.  She's always been a very introverted person, but recently she has been telling me that she's been going to different club meetups and parties. I was excited for her because this was a chance for her to make some friends and get out more. We downloaded Life360 together and I told her to keep her phone charged, text me when she got back, and have fun.\n\nI'm not dumb, I know kids are drinking alcohol and smoking at college events. Personally, I've made a life choice to stay away from that crap, but I don't hold judgment to my friends and others partaking. However, D has skipped the little white claws and high noons and started drinking straight vodka and tequila whenever she goes out. At first, when she told me, I just assumed she was taking a little shot here and there and calling it a day. However, some of her friends who know me and our relationship have let me know via Insta that she's drinking to the point of blacking out and keeps multiple bottles of alcohol in her dorm room. I've called D and told her that she's turning into an alcoholic, that she should stop going out as much, and that drinking leads to more destructive behaviors. She brushed me off and called me judgemental and stuck up. She's even blown off our gaming nights to go smoke with her friends. \n\nLast night she texted and told me she had to call me about something serious. She told me that she was drinking alone last night to the point of wanting to kill herself.  Her roommates had found her called the police and she was brought to a psych ward. She told me that the police and her dad found out about the alcohol and that she ended up coming out to her dad unintentionally. She’s also been lying to her psychiatrist and has been skipping her meds. She said she's been admitted and was calling to let me know so I wouldn't worry. I just told her that I love her like always, and that I'm glad she's still here. \n\nBut after getting off that phone call, all I could think was “I fucking told you so. I told you the dangers of drinking and you ignored me.” I’ll I feel is anger. I feel angry that she would think that way about herself and want to leave me and her parents and her little sister. I’m angry at her on campus “friends” who observed this behavior and didn’t stop it. They let her get this bad and I wasn’t there to help her. It kills me that I’m halfway across the country and can’t afford to see her and make sure she’s okay. And most of all, I’m upset that if she ended up killing herself, I wouldn’t be able to do anything about it. I’m just her former middle school friend on FaceTime a million miles away.\n\nI haven’t cried or felt sad and I’m not sure if this is normal.",
    "subreddit": "TrueOffMyChest",
    "title": "My best friend tried to off herself yesterday night, and I still haven't cried",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j54s03/my_best_friend_tried_to_off_herself_yesterday/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 20:06:44 UTC",
    "id": "1j54p4q",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 2,
    "score": 0,
    "secure_media": null,
    "selftext": "TW: Violence and threats\n\nI work at a care home for people with various physical and mental disabilities. The one thing I absolutely hate is how passive management is with the participants. They let them make any decision they want even if it ends up with someone falling down the stairs with little to no consequences.\n\nThe one guy they are horrible with and let him get away with anything. He is extremely violent and has hurt me and others on numerous occasions. The only consequence he faces is when he breaks things he just doesn't get to use it till it's fixed or replaced. Which is nothing, the worst part is this guy is smart and knows he can do whatever he wants and get away with it.\n\nThe worst time I experienced this was when me and another staff took him out to buy him candy with his own money. He wanted to buy a knife (it was a butter knife) and we said 'no'. It took alot just to get him away from the knifes and out the door. We managed to get him some of his candy and as protocol we gave him some. Still mad with us daring to say 'no' he threw the candy at me and tried to run back to the store to \"get the knife so I can stab you f*ckers\". I had to do a hold to stop him from going too far and hurting someone else. However the hold we are trained to do doesn't restrain both hands so they decided to scratch at my arm hard, to the point I was bleeding. It took a long time to calm him down and get him back in the car. The part that broke me was the fact he wanted me the one shaking and crying to apologize and my coworker who did nothing but call management to let them know what was going on also tried to get me to apologize. I couldn't cause I went completely non-verbal and just got in the car. I missed a week of work cause I was terrified of that participant and was locked up in my room. I filed a report for injuries, but nothing came of it.\n\nNow I just hate the participant. I'll never do anything to hurt or try and upset him, but I will always hate him and wish for his downfall.\n\nOne thing I want to note is that I understand alot of the people I work with can't control how they act. This one in particular also struggles to control their anger. However I've seen them handle 'no' from their parents and staff he likes and he was completely fine. He just doesn't like me and gets upset any time I ask him to do something or deter him away from dangerous things (I'm not rude about it I always ask very nicely I'm just not a guy or pretty enough so he hates me).\n\nTLDR: I despise a guy cause he can get away with anything he wants, including hurting others and he knows it.",
    "subreddit": "TrueOffMyChest",
    "title": "I hate one guy at work",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j54p4q/i_hate_one_guy_at_work/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 19:57:51 UTC",
    "id": "1j54haw",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 2,
    "secure_media": null,
    "selftext": "Last year, I think I was sent an email in December saying that I \"needed to send proof of income\" effectively tomorrow. It was also a \"2nd notice.\" assuming the 1st one was lost in the mail. I was already gathering that for a different service, so I just made copies of the pay stubs, waited an hour, and turned in everything asked. That is when I was told that I had been Flagged for something involving income and needed to see a medicare insurance adjuster. I wondered if any were available and was told no and that I needed to come back tomorrow or call in.\n\nI asked if I could make an appointment but was told none were available, as \"due to holiday training and staff shortages, we are unable to fill requests for appointments at the moment.\" However, I would \"put a note in my file that it was a late notice.\"\n\nI asked if I could get an extraction as I never received proper notice. I was then told, \"Also, due to staffing shortages and holiday training, we cannot do extractions, nor can we, as we are not responsible for lost or delayed mail.\"\n\nShe then told me that the best option was to come in at 7 in the morning to be the first in line. I told them that I work tomorrow and can't come in. I was told I didn't have to, but it would be at the \"small penalty\" of losing my medical and dental through California. So I did that and was one of the first 15 people waiting in line for the doors to open in cold, rainy weather. I got a ticket and waited for about an hour, thinking I could make it to work on time at 1030am. I sat and told them I was there for a medical adjustment with a medicare insurance adjuster.\n\nI was told they were not one and that the hour's wait was to set an appointment. I was told I could have called or come in earlier to have a specialist set it up. I told them I tried yesterday, and there were none available. I was hit with, \"Well, it's not my fault you poorly planned this. Seeing as you had 2 weeks.\" I told them about the late notice and a note in the file. The man eye-rolled me and just scribed out the latter on my ticket. Telling me to expect my number to be called again in 2 hours and that in the future to be \"more mindful of prep and time management.\"\n\nI called my boss; he was surprised but was cool with me coming in later as long as I kept him updated. And so I waited as eight became 9 and 9 became 10. I checked in as it should be around time for the meeting and was told due to a lack of adjusters today, there will likely be unseen delays. So I had just to wait, and I skipped breakfast to get there, messing with my phone and eating some of the fruit offered there. I messaged my boss every half hour as he was skeptical that any department could wait this long.\n\nby the 11 or 12th hour of the day, they started giving out parking passes as the parking lot had a two-hour limit and needed one. There was a small argument between one of the managers and staff members about whether they should ask the ones here over the limit just to move their cars as they technically violate the parking code, and we shouldn't be encouraging that behavior. a 3rd staff member had to step in just to hand out the passes.\n\nSo, by the 13th hour and a half, when I was falling asleep and wondering how much of my shift I would have left, someone poked me in the face and told me to look up. A new number had popped up. It was mine.\n\nI go through the door with paperwork in hand to see the Ajestor about what the problem was. It turns out they wanted to know if I had SSI payments and asked why I didn't have any from SSI. I told her that I wasn't on SSI, and she told me that was the problem. When applying for Calcover, I marked down that I had a federally recognized disability, autism. So they wanted to see if I was making too much for the program; when I didn't show any SSI payouts, i was flagged for possible fraud and they tried to ask me in person if I had any other forms of assisted living payouts or financial aid. I told them i was disqualified due to being able to work.\n\nSo the adjustor told me that next time, I needed to uncheck that box as legally, for health care, I didn't have a federally recognized disability as it implies I'm getting federal aid. So I waited nearly 6 hours for a 15-minute meeting asking me not to say I have autism on a federal level.\n\nMy god, why do we put people through this?",
    "subreddit": "TrueOffMyChest",
    "title": "waited 6 hours for a 5 min with human services",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j54haw/waited_6_hours_for_a_5_min_with_human_services/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 19:54:14 UTC",
    "id": "1j54e9w",
    "link_flair_text": null,
    "media": null,
    "num_comments": 31,
    "score": 0,
    "secure_media": null,
    "selftext": "For context, last night I (16f) had sex with a guy that i met for the first time (17m) and we both like each other. The only problem is that he came in me multiple times with no condom but i’m on birth control (vestura or whatever) but i can’t stop thinking about the chance of me being potentially pregnant.\n\nTMI: my privates have also been very sore and bleeding throughout the day and i’m in mild pain because of it down there. I’m not exactly sure what to do because the last time i had a pregnancy scare (i was 15) my parents raised hell, wouldn’t support me and said if i was to be pregnant then i would have to keep the kid even if problems arise. \n\ni’m not sure what to do.\n\ntldr; protected but also unprotected sex, pain and blah blah idk",
    "subreddit": "TrueOffMyChest",
    "title": "I could possibly be pregnant and i’m not sure what to do",
    "upvote_ratio": 0.4,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j54e9w/i_could_possibly_be_pregnant_and_im_not_sure_what/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 19:35:12 UTC",
    "id": "1j53y93",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 25,
    "score": 4,
    "secure_media": null,
    "selftext": "I was just a kid. Just a fucking kid. And yet, somehow, I still feel the weight of it like it happened yesterday. Like it’s still happening.\n\nI didn’t understand it back then—I only knew that something felt wrong. That I wanted to run but couldn’t. That I froze. That my body didn’t feel like mine. That someone I should have been safe with took something from me that I didn’t even know could be taken.\n\nAnd now, years later, I still carry it. In the way I shrink when someone gets too close. In the way certain touches make my skin crawl. In the way my heart races at memories I never asked for. In the fucking guilt—as if I should have done something different, as if I should have known, as if it was ever my fault.\n\nI want to know—does it ever go away? Do you ever stop feeling like something is wrong with you? Do you ever stop feeling like your own body is some kind of graveyard for what happened?\n\nIf you’ve ever felt this—if childhood left you with scars that no one can see—talk to me. Tell me I’m not the only one.",
    "subreddit": "TrueOffMyChest",
    "title": "Can You Ever Heal from What Happened as a Child?",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j53y93/can_you_ever_heal_from_what_happened_as_a_child/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 19:29:57 UTC",
    "id": "1j53tt6",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 10,
    "secure_media": null,
    "selftext": "I don't really know what to make of this, and I don't really have anyone to talk to about it. I (23F) started my master's this academic year and was brought in as a graduate assistant in one of the academic advising offices on campus. Our office has a new director who comes from a high school administration background and relatively new advisors (two of them, both have been here five years max).\n\nUntil yesterday, I didn't know why the previous GA left her role. She clearly left in a hurry because my office (her office) still had wall decorations, cork boards with posters and flyers, supplies, and cabinets chock-full of folders with papers, guides, flyers - you name it, it's here. It looked like the place was already in use is what I'm getting at. She created entire binders about our department's programs and even fully stocked the supply closet that we have. I knew she hadn't left due to graduation, it had to be either right before she graduated or she hadn't renewed her contract, but I didn't know why. It's not really my business, but I was curious and wanted to be sure it wasn't for something nefarious.\n\nSo, my suspicions rise when a classmate of mine, M, recognized the office that I said I'm a GA for (a handful of us are GAs, most of them for our college, but me in this advising office) and she brought up that she used to work there in undergrad until she graduated last year. M started asking about names from when she was there, and it became apparent we've had a lot of staff changes in less than a year. I thought, \"Interesting, I wonder why?\" She also did not like most of the people (advisors/director) who are/were here. I kind of shrugged it off, figuring that she probably just had some bad experiences or that the leadership prior to our current director was suboptimal, because I liked my coworkers. Naïveté on my part, I'll admit.\n\nBut something hasn't quite left me since that day: M said the previous director, let's call him Colin, resigned after being caught in a relationship with a student. I took this with a grain of salt because I hadn't heard that, not even from the other student workers who like to gossip, and M had made it clear that she didn't enjoy the office atmosphere.\n\nThings came to a head for me yesterday, when I met with the current director to discuss some issues with the website. Things progressed to how she doesn't like how disorganized the supply closet currently is, and her plans to clean it out with our administrative assistant over spring break. She mentioned having so much stuff left behind by the previous GA, like thick binders of who-knows-what, and not knowing what to do with them. They're multiple 5-inch binders stuffed to the brim.\n\nBringing up the GA snowballed until Director casually mentioned how my coworker, let's call him Andrew, one of the two advisors in our department, was the one caught making sexual advances - and *toward the previous GA.* They had gone out for drinks after-hours (unsure if it was with a group), and he had texted her inappropriately about hooking up. The then-director, Colin, received word of this but didn't want to do anything about it. He was promptly fired for his inaction once an actual, full-blown Title IX case opened against Andrew.\n\nThe GA left after this incident and no one has seen her since. She left everything behind. Her friends harassed the office to try and hold Colin accountable, but it wasn't until the case was opened that action was taken.\n\nI'm in shock and just don't know how to process these instances. *He* came onto my predecessor, yet she left, and he is still working here. I don't even know if she's graduated, but it makes sense now why her stuff was left behind and why nobody talks about her aside from the student workers who don't know the truth.",
    "subreddit": "TrueOffMyChest",
    "title": "TIL that my coworker had a Title IX case against him - from my predecessor - and he's still here.",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j53tt6/til_that_my_coworker_had_a_title_ix_case_against/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 19:25:14 UTC",
    "id": "1j53puu",
    "link_flair_text": null,
    "media": null,
    "num_comments": 20,
    "score": 4,
    "secure_media": null,
    "selftext": "Hi everyone, I just need to vent out.\n\nI am 26 F, and my boyfriend is 24 M. We met through this girl who is our mutual friend. They are roommates. But since last year, it has been a bit up and down between all the three of us. It all started when my ex suddenly showed up at my door wanting to talk. But this girl friend of mine got angry at me because I asked back the money I am owed back, and went and told my boyfriend that my ex showed up, we “talked” and some other stuff. This caused a major break in between our relationship, and I only knew about this recently that she was the one who ratted me out when it wasn’t her place. I would have told him, but she went ahead and told him adding unnecessary untrue details to it.\n\nWe had some misunderstandings, and we moved past that. But as of now, she seems to be becoming more possessive of him, though she has her own boyfriend. She expects him to take her out everywhere, doesn’t include me, and he seems to be doing it. But when I ask him, it’s always reasons and excuses. \n\nShe still owes me a little around $600, and I am honestly scared to ask her about it. They have been doing a lot of video calls, texting constantly and I know it may be nothing but I just cannot digest the fact. I know I need to be more trusting but I feel like a third wheel in my own relationship. He expects me to adjust to this, but why should I be adjusting in MY relationship.\n\nYesterday night, I questioned him about it and he came to hit me. I got shocked that he raised his hand on me when I asked why did he video call her. He keeps saying I am more important to him and I am his first priority but I just cannot understand why he would get so angry when I questioned about it. This was the third time in a row he raised his hand on me. But later consoled me. I asked him to choose between me or her, he said he is in a situation where she is his roommate and he cannot do anything. I hate the fact that she is so touchy around him, I just hate it. \n \nI trust him that he wouldn’t do anything behind my back like sleep with her, but I just cannot let it go. I am still in shock from yesterday night. I feel like I lost all my friends because of him, I don’t feel like I belong with anyone and I don’t even have anyone to talk about this that I have to vent it out on Reddit. \n\nTL;DR my boyfriend seems to be involving our mutual friend a lot into our relationship and seems to be choosing her over me.",
    "subreddit": "TrueOffMyChest",
    "title": "Boyfriend seems to be choosing our mutual friend over me",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j53puu/boyfriend_seems_to_be_choosing_our_mutual_friend/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 19:04:11 UTC",
    "id": "1j537hs",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 5,
    "score": 1,
    "secure_media": null,
    "selftext": "I often have this nightmare where my mind convinces me that the dream I’m having is a memory and in it, I’ve killed someone.\n\n I vividly remember stalking them getting them out to a secluded area and brutalizing them. I wake up, genuinely believing that this is something I have done and then blocked out of my mind I find myself searching for evidence in my waking life of this person that I have allegedly killed and I can’t really tell if it’s just a sign of my terrible mental health or something that other people also experience.\n\n  I’ve had the dream on an almost weekly basis for the last five years in my dream it’s always the same person that I have killed and it’s always the exact same way it is downright terrifying to me because although every piece of tangible evidence  proves that I did not have the time or the ability to pull off something this heinous there is a little voice in the back of my mind that wonders what if?\n\nIt’s gotten so bad I’ve started looking through missing persons posters trying to see if I can match the person in my dreams to a person in real life and  I’m terrified that one day I will find a match .",
    "subreddit": "TrueOffMyChest",
    "title": "Am I a Murderer or just Mentally ill?",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j537hs/am_i_a_murderer_or_just_mentally_ill/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 18:54:52 UTC",
    "id": "1j52z34",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 1,
    "secure_media": null,
    "selftext": "I F 21 and my boyfriend M 22 have been together for 7 years, we recently took a break a year ago to explore life but decided to get back together cause we missed each other. My problem is that I love him more than life itself but I need to cut it off, he feels like a friend and not a partner and our life goals don't align anymore and just generally I don't think I want to be in a relationship anymore. I know that makes me the ass but I can't figure out how I should navigate telling him. I don't want to lose him and he's made it very clear if we separate again he will have nothing to do with me but it's not fair to string him along when the feelings have fizzled out for me. Any advice on how to navigate telling him is very appreciated \n",
    "subreddit": "TrueOffMyChest",
    "title": "Not in love anymore? 21f 22M",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j52z34/not_in_love_anymore_21f_22m/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 18:54:15 UTC",
    "id": "1j52yjk",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "I’ve always wanted to live life on my own terms, but my Muslim Arab parents make it feel impossible. Even though I’m an adult, they still try to control every aspect of my life my career, my choices, even how I spend my time. The moment I push back, I’m met with guilt-tripping and emotional manipulation: \"You’re disobedient.\" \"You’ve dishonored us.\" \"I will never forgive you until the Day of Judgment.\"\n\nAnd many of the things they react this way to aren’t even that big of a deal. For example, I’ve always wanted to cut my hair short, but my mother made it clear that if I ever did, she wouldn’t forgive me and that it would be a a sin hanging over my neck until Judgment Day. Even something as small as asking them to knock before walking into my bedroom turns into an argument, as if having basic privacy is an act of rebellion.\n\nAnd if not through words, they use threats. They tell me they’ll force me into marrying someone against my will or that they’d lock me in a room if I disobey them. Even if they don’t act on these threats, just hearing them is enough to make me feel powerless, like my life isn’t really mine to control.\n\nIt feels like their love is tied to control as if I can only be a \"good\" son or daughter if I follow everything they say without question. Their obsession with obedience and authority makes it impossible for them to see me as an independent person. It’s as if my life belongs to them, and any choice I make for myself is seen as betrayal.\n\nI know they believe they’re acting out of love, but it doesn’t feel like love. It feels like a cage. It’s exhausting to constantly be torn between my own happiness and their expectations. I’m tired of feeling like my worth is tied to how obedient I am. I just want to be allowed to make my own decisions without fear, guilt, or the weight of their disappointment crushing me.\n\nWhat hurts even more is that when I try to talk about this, I’m always met with the same dismissive responses: \"They’re your parents, you must obey them no matter what\" Society expects the owns who go through this to just accept it, as if their love should come with conditions and control. But I don’t want to spend my life suffocating under obligations I never agreed to. ",
    "subreddit": "TrueOffMyChest",
    "title": "The obsession with control with Muslim arab parents",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j52yjk/the_obsession_with_control_with_muslim_arab/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 18:52:41 UTC",
    "id": "1j52x4u",
    "link_flair_text": null,
    "media": null,
    "num_comments": 32,
    "score": 8,
    "secure_media": null,
    "selftext": "Hi everyone, I really need some advice cause this is insane, I live in a fairly small country and recently I began dating someone (like it's been 7 months) we get along great and everything is fine, i was out shopping with my mom today and she pointed out someone to me and told me they're my cousin. I'm literally speechless, the person she pointed out is literally the brother of the individual I'm dating, I tried asking how we are related and I doubt it's a close relative, most likely distant and they are not directly related to me. None the less I feel sick and I'm just really uncomfortable, I plan to speak to them about it tonight cause I'm thinking of ending things, I don't think i can continue dating them and I'm glad i found out relatively early on. \n\nI'm confused about how i should feel i know it's not my fault because I didnt know but it still makes me feel disgusted.\n\nI need advice on how to cope with this. \n\n** EDIT: please read the comments before answering, for those of you who want to know, I'm not going to be with this person in any way, shape or form, I was not in a relationship with them we were just going on dates and that. I'm not interested in being with any one remotely related to me. \n\n",
    "subreddit": "TrueOffMyChest",
    "title": "I found out I am dating my cousin",
    "upvote_ratio": 0.83,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j52x4u/i_found_out_i_am_dating_my_cousin/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 18:49:00 UTC",
    "id": "1j52twe",
    "link_flair_text": "Positive",
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I have been struggling with depression and bipolar for years but being back with loved ones (family, friends and lover) made me realize how loved I am. There has been some added responsibilities and I learned how to be more compassionate and empathetic after 10 years of living abroad. Some years, alone. \n\nI don't believe life gets better before. Now I discovered that it does get better but not in a typical way where suddenly your career, health, relationships would work out at the same time. There will be some tests that would drive me insane but I knew I would pull through. \n\nMaybe when I'm 40 I would be back to square one but the lesson I learned before will always be relevant. \n\n",
    "subreddit": "TrueOffMyChest",
    "title": "Road To Recovery",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j52twe/road_to_recovery/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 18:48:58 UTC",
    "id": "1j52tul",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 1,
    "score": 0,
    "secure_media": null,
    "selftext": "Writing from a throwaway.\n\nThree days ago, I met a guy. He found me on social media, and we talked on the phone for a few days. He seemed easygoing and respectful, so when he asked if I wanted to meet for a cigarette, not at my place, just somewhere outside in the neighborhood.\n\nWhen he arrived, we sat outside and talked for a bit. Then he suggested going to a nearby hotel. Only if I wanted to, of course, but it was cold and dark, and he said we could just sit inside, have a drink, and talk. He promised he wouldn’t try anything, that he didn’t want to be intimate either. He seemed harmless, trustworthy even. So I agreed, telling him I only had two hours anyway.\n\nAt first, he was still friendly. But as time passed, he started acting off. I kept my distance, positioning myself in a way that made it clear I wasn’t comfortable with any physical closeness. Then he went to the bathroom. When he came back, he was only in his boxers.\n\nI told him to put his clothes back on and that I was leaving. That was the moment I felt truly unsafe. I got up, heading for the door when he grabbed me by my ponytail and pulled me to the floor.\n\nI fought as hard as I could, but he knew exactly how to overpower me. At first, he didn’t rape me he *enjoyed* me fighting back. He hit me, yanked my hair, and choked me so hard I couldn’t even make a sound. He threw me all over the room. My body is covered in bruises, even on my throat. And then, at some point, he raped me. I pleaded for him to stop, but he just threatened me over and over again.\n\nEventually, my phone rang. I saw my chance and told him I had to answer it, that my friend would be suspicious if I didn’t call her back immediately, and that she had my location (she didn’t and it wasn’t a friend calling I was lying). I told him I’d just meet her quickly and then come back. He let me go and I left.\n\nIf this had happened to someone else, I would never blame them. But standing in my own shoes, I can’t stop thinking: What the fuck is wrong with me? Who goes to a hotel with a guy they just met? I’m almost 30. I should know better. I should have learned my lesson by now.\n\nBut I don’t feel scared. I don’t feel sad. I don’t even feel vulnerable. And that makes it hard to process what actually happened to me.",
    "subreddit": "TrueOffMyChest",
    "title": "I think I was raped and still have problems to process it",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j52tul/i_think_i_was_raped_and_still_have_problems_to/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 18:43:45 UTC",
    "id": "1j52pb2",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 6,
    "secure_media": null,
    "selftext": "Are you OK? Did you drink some water? Are you hungry? Maybe you should eat something before you bite someone.\r\nAre you having a bad? Do you need a hug?\r\nDo you need someone to grab your butt?\r\nBecause I will\r\nWhy don't you smile grumpy. \r\nDo want me to poke you? \nSmile 😊\r\n",
    "subreddit": "TrueOffMyChest",
    "title": "Are you OK?",
    "upvote_ratio": 0.8,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j52pb2/are_you_ok/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 18:41:54 UTC",
    "id": "1j52ns5",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 5,
    "secure_media": null,
    "selftext": "I (19M) am bisexual. About two years ago, I fell in love with my best friend, T (now 19M). I knew he wasn’t into men, so I tried—and succeeded—in getting over it. However, one night while I was drunk, he was taking me home, and I confessed. I told him that I had been in love with him but that I wasn’t anymore. I apologized sincerely and explained that I just felt he had a right to know.\n\nNaturally, he was uncomfortable, but we agreed to try and maintain our friendship. Things were never quite the same, but we remained close. I made every effort to respect his boundaries and avoid making him uncomfortable. I also felt guilty, as if I had hurt him and ruined our friendship. Though he never explicitly said so, that was the impression I got. Whenever I asked, he insisted that everything was fine.\n\nAbout a year and a half after that, due to circumstances beyond our control, we had to sleep in the same bed. I asked if he was okay with it or if we should switch rooms, and he said it was fine. Still, I did my best to stay on my side of the bed so he wouldn’t feel uncomfortable. Unfortunately, at some point during the night, I rolled over onto his arm in my sleep. He woke me up and asked me to move. The next night, he decided to sleep in a different room, saying it was because of the bed. I thought that was an excuse, but I didn’t press him—he had every right to make that choice. Instead, he slept in a room with two of our female friends, A (19F) and K (18F).\n\nAfter that, things mostly returned to normal, except I noticed that A and K became more aggressive toward T.\n\nFast forward to about a month ago: I was out for coffee with A, and we were discussing T. He had made an awful joke toward K, and I was defending him when A suddenly said she had to tell me something. She revealed that on the night he changed rooms, he had told them about what happened. He told them I had feelings for him, that he constantly felt uncomfortable around me, and even outed me as bisexual (I am closeted because I live in a very homophobic country). He also told them that he couldn’t wait to work abroad for the summer so he could get a break from me.\n\nAt first, I didn’t want to believe her, but she knew details only he and I had discussed, and I was sure I hadn’t told her. A said they hadn’t told me sooner because they thought I wouldn’t believe them.\n\nI was crushed. I confronted T over the phone, but he claimed he didn’t remember anything from that night and insisted A and K were just trying to ruin our friendship.\n\nWe’re meeting for drinks in a few days to talk face-to-face and hopefully resolve things. I don’t know what to think. Everything points to him betraying me, and his excuse isn’t convincing—but I don’t want to believe it. Any advice would be welcome.",
    "subreddit": "TrueOffMyChest",
    "title": "My best friend told my biggest secret",
    "upvote_ratio": 0.73,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j52ns5/my_best_friend_told_my_biggest_secret/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 18:39:08 UTC",
    "id": "1j52lb5",
    "link_flair_text": null,
    "media": null,
    "num_comments": 157,
    "score": 834,
    "secure_media": null,
    "selftext": "Hello, I (21F) have been big most of my life. My parents didn’t cook much so I had a lot of fast food growing up then it was a mix of me stress eating/having pcos. During covid I went up to 250 pounds but last year was a bad year for me mentally and I lost 90 pounds without going to the gym. My body looks good in clothes now but my naked body is pretty saggy and has wrinkled lose skin and cellulite in some places. My boobs which used to be my favourite thing about me now look like small sad deflated balls of sand. I’ve been talking to this cute guy to meet up for casual sex and I want to do stuff with him but he goes to the gym every day and his body looks great and mine looks terrible. He’s seen what I look like in photos and in clothes but im afraid he will be disappointed by how I look naked and I don’t want to catfish him or go through the process of him rejecting me in person.\n\nI’m against sending nudes for security reasons and I also wouldn’t want to go through with it if he’s just going to screw me that night just to get off and ghost me because I don’t look good. Should I just cancel and stop talking to him? I really like him but I feel like I might have to stay celibate till I can get the motivation to go to the gym and have the money for a breast lift.",
    "subreddit": "TrueOffMyChest",
    "title": "I feel like my body is too ugly to have sex with a gym guy",
    "upvote_ratio": 0.9,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j52lb5/i_feel_like_my_body_is_too_ugly_to_have_sex_with/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 18:37:57 UTC",
    "id": "1j52k7t",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 1,
    "secure_media": null,
    "selftext": "I’m socially inept and I have no friends left and all I want to do is have a healthy social life but I’m so depressed and awkward that I don’t even try. Idk what to do anymore because I want to meet people but I just struggle so much with it. I don’t have social hobbies and I stick to myself most of the time. I guess it’s just a fantasy ",
    "subreddit": "TrueOffMyChest",
    "title": "I want to be socially adept",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j52k7t/i_want_to_be_socially_adept/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 18:36:53 UTC",
    "id": "1j52jag",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 1,
    "secure_media": null,
    "selftext": "I(18/ M) passed my theoretical exam for my drivers license today, it‘s crucial to me to have a license because I live on a mountain far outside the city. \n\nI went home and told my mother about the great news, she asked me wether I had to do another one or not, we had agreed 2 weeks earlier that I would do the 2 exams( general knowledge/ Automobile) split because learning and memorizing 1400 questions isn‘t for me. I told her I did have to do another one but the next placement is on the 20th of march. she got very mad screamed at me and threw things while yelling what a disappointment I had become. \n\nI have to add, the last couple of months have been hard on me, my boss had a big problem with my appearance( for understanding I worked at a high class gym in my city) because I am very muscular and outshine him in a lot of ways, I also have a buzzcut but that shouldn‘t matter. because of my boss bullying and nagging me the last 7 months( yes it started in august), I quit, today I handed in my letter of resignation, I couldn‘t do it anymore, working 50-60 hours a week for an ungrateful boss that hates me and wants to fire me anyways isn‘t my thing I don‘t take disrespect. I‘ve been into working out for a couple of years and got my personal trainer license in winter of 2023, my mom was so proud. Yet she didn‘t work, my first paycheck went entirely into her purse, I didn‘t mind because I like responsibility and do plan to have kids in the next few years, so I have to be able to provide for people, yet she blew all my money on cigarettes cheap alcohol and gas to drive my sister and me to school, oh and the rent and electricity bill of course, there are no gas bills because we heat with wood.\nI was and am fine with that nothing wrong there, but after almost a year of unemployment for her she started becoming unbearable, she started yelling at me daydrinking, at one point she tried to punch and fight me physically. \nI begged one of her friends to find her a job at their workplace so she could finally get some fresh air, she had a boyfriend whom I got along with very well, very intelligent man, but her stubborn attitude and her narcissistic behavior obviously drove him away, I couldn‘t even blame him, in the time of my mothers unemployment I raised my half-sister (13/ F)\ndrove her to practice on my bike,until I crashed it beyond repair, I made arrangements for her to be driven and picked up from everywhere. my mom started working, it is nice to see her happy and thriving, but she always had a bad temper and a lot of self hatred. I love my mother, I have always loved her for every sacrifice she made for me. but I stopped feeling anything towards her today.\n\n after a heated argument, me staying mostly calm because I‘m the type to shut down and become quiet once I‘m yelled at, and my mother yelling at me. She said, that I don‘t have money, I don‘t have assets, I don‘t even work anymore, and that all this bullshit that has been piling up was too much for her to handle. \nI asked her if she wants me to move out and she said I should fuck myself and go to hell or wherever else I wanna go, I‘m in tears. I‘ve been living in this house for 7 years, a comfortable life that I tried to sustain for as long as possible. I have a job offer in chicago, but I don‘t have the funds to go there, I don‘t have enough money to buy a one way ticket for me and my fiancée (18/F) and one month of rent+ a downpayment on an apartment. I could move there but it‘s 10000km away. I have had reasons to move out before but decided to stick around so my sister has a male influence growing up, now she‘s a teenager and I‘ll never stop being there for her. I have packed my bag, I have prepared to get away from my home which I‘ve lived in for so long. I‘m applying for jobs tomorrow, going to a jobcenter, getting all my documents, renewing my CV and just applying at every gym I know. I‘m crashing at my fiancées place tomorrow night and see how long it takes for me to find something to start over with in a proper manner. I‘m in shambles, I know I could live in this house for another month, another half a year too, but I lost my will to do so long ago. I‘ve always wanted to compete in bodybuilding, but I am scared that all the dreams I have such as: Building a beautiful healthy family, having a homestead, winning and receiving an IFBB pro card, retiring my future wife and building wealth for my family, I come from nothing but I need to do everything, I‘m hopeless scared and alone, I‘ll figure it out by myself though I‘m confident.\n\nif there is anyone who has advice for me, anyone who has been in a similar situation, please reply.\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "I lost my home, my mother and my job on the same day",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j52jag/i_lost_my_home_my_mother_and_my_job_on_the_same/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 18:30:28 UTC",
    "id": "1j52dmb",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "Internet stuff, anyway. Pictures, videos, files, steam mods, whatever. Save it, archive it, back it up. You don’t know if the creator is going to nuke it, the platform goes down or you lose track of it. Better safe than sorry. Only knaves don’t save!",
    "subreddit": "TrueOffMyChest",
    "title": "PSA to archive stuff you like.",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j52dmb/psa_to_archive_stuff_you_like/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 18:25:22 UTC",
    "id": "1j5297d",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 1,
    "secure_media": null,
    "selftext": "*!no names are real names!* For some context let me start by explains my family tree and giving some history. I 20 female am the oldest child. My parent we’ll call them Bob and Lynda (not real names) had three kids me and a set of boy/girl twins ( East and brook). Then my mom cheated and got with a guy (Tony) and had two half brothers (Timmy and tommy). She then cheated again with a new guy (Bret) who was also cheating on his wife. He had two kids with his ex wife (Kat and Sam) my now step sisters. And my mom Lynda and Bret had two more kids (spike and Leo). Meanwhile my dad and step mom (Molly) had one daughter (Katie). So there’s 9 kids  total with my mom, in order it’s: me, East and brook, Kat, Timmy, Tommy, Sam, Spike Leo. My parents had 50/50 custody of us given to them by the court. My dad tried reporting my mom for abuse and the court did nothing about it. It’s very pro mommy where we live. My mom Lynda and Bret are very abusive parents. They used to to things like hit us, throw us outside, make us stand on chairs for hours on end without being able to get down, put shock collars on us and starve us. I remember once that I missed a spot mopping the floor and they made me use my toothbrush to clean it ( no I didn’t get a new one). We were also very low income but my mom and Bret always found a way to take trips to Disney and have expensive date nights. Them being out often left me home alone with kids for hours if not days at a time. This went on from the time I was 11-16. At 16 I finally said enough was enough and made the decision to live with my dad. I got thearapy and have been doing much better. It’s been 4 years since I left. I have tried to fix things with my mom and Bret multiple times but my mom always falls short and blames me for leaving instead of herself for her actions. However when I left to stay with my dad my sister brook chose to stay with my mom without giving anyone an explanation. My dad wasn’t bad to her but they where never close. My sister brook is my moms golden Child, her favorite and her mini. My sister was a snake my whole childhood and could get away with murder. So she left my dad and never looked back. Well this year she turned 18 and on her birthday my mom had posted a video of her asking my step dad to adopt her and today was the day of her adoption. I found out through my moms ex baby daddy Tony that she was being adopted because Timmy messaged him about being taken out of school to witness it. He shared the messages with me and then I shared them to my step mom and other family. Not my dad because in these 4 years he has been grieving my sister leaving and finding this out will only hurt more.I’m devastated for my dad and have left it up to my step mom to tell him. I just cannot understand what there thoughts are and why my sister has done any of what she’s done in the last 4 years but I cannot say I’m happy for her. But I wanted to get this out and I just needed to vent it somewhere. I guess in the 4 years I’ve been gone I’ve really been holding in a lot of what happened to me and still cannot find it in myself to let go or forgive them. Thank you Reddit for listening. ",
    "subreddit": "TrueOffMyChest",
    "title": "Trueoffmychest My sister is getting adopted by my step dad today and I’m not happy about it.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5297d/trueoffmychest_my_sister_is_getting_adopted_by_my/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 18:19:34 UTC",
    "id": "1j5244e",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 0,
    "secure_media": null,
    "selftext": "I'm feeling really numb this week weirdly missing my ex when we've been broken up for a year and I shouldn't miss him he made me delete any males I talked to from my life and was a bit controlling so why do I find myself sitting here really wanting to message him on Instagram when he's got a new group of friends including females maybe I'm just jealous I don't know I just miss the good times and the person I thought he was before I realised 3 years into our relationship that he wasn't the best person ever. I just don't know ",
    "subreddit": "TrueOffMyChest",
    "title": "I lowkey miss my toxic ex",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5244e/i_lowkey_miss_my_toxic_ex/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 18:14:46 UTC",
    "id": "1j52025",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "Lately Facebook has been making me super depressed, so my boyfriend suggested we try to go a full week without checking Facebook. It's actually been great, the first few days were hard but now I don't even really care about checking Facebook. On a conscious level, I feel like not being on Facebook is great. But I also noticed on Tuesday that I was feeling really low and didn't know why. Same yesterday, and today is even worse. It occurred to me that my brain isn't getting its usual constant dopamine supply throughout the day from checking Facebook and seeing that I have notifications or new info to read (even if it turns out to be nothing interesting). I know that social media is engineered to give you a hit of dopamine with every notification to keep you engaged and coming back for more. And I'm starting to think my brain is literally addicted and I'm going through withdrawal. I'm actually really proud of myself and given how awful I feel right now, I feel even more resolve to break this addiction and not go back to how I was. But man, I feel like shit. I just feel so depressed and want to do nothing but sleep. I keep wanting snacks even though I'm not hungry, and I think that's my brain desperately seeking other sources of dopamine. This sucks. I really hate feeling this way and I hate what social media has done to my brain.",
    "subreddit": "TrueOffMyChest",
    "title": "I think I'm going through withdrawal",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j52025/i_think_im_going_through_withdrawal/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 18:10:55 UTC",
    "id": "1j51wpu",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "It doesnt matter wheter i allow them to copy my homework or make presentations so that we can waste time in class\n\nIt doesnt matter if i put in the most amount of effort out of everyone\n\nIt doesnt matter if im the only reason some people pass their classes\n\nIm just too boring\n\nIm too dull\n\nIm nothing.",
    "subreddit": "TrueOffMyChest",
    "title": "No matter what i do,i dont matter.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j51wpu/no_matter_what_i_doi_dont_matter/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 17:54:33 UTC",
    "id": "1j51i1d",
    "link_flair_text": null,
    "media": null,
    "num_comments": 32,
    "score": 4,
    "secure_media": null,
    "selftext": "I am a woman, but I hate being one, and the reason is my family. I don’t want to write details, but I have come to hate being a woman.\n\nI don’t want to become a mother, and I don’t want a relationship with a man.\n\nI’m not even a lesbian.\n\nI just want to live in peace.\n\nI wish I could transition and appear as a man just so I could live peacefully.",
    "subreddit": "TrueOffMyChest",
    "title": "I hate being womam",
    "upvote_ratio": 0.62,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j51i1d/i_hate_being_womam/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 17:23:10 UTC",
    "id": "1j50qkp",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 6,
    "secure_media": null,
    "selftext": "I feel insecure about living an average or normal life. And I hate myself for being doomed to be so normal that I can’t even build up enough courage to abandon seeking comfort in society and living unconventionally. of course I’m so pathetic that I’m scared of the uncertainty of living on the streets and The people that have been shunned by society like drug addicts, and killers. It seems like recently uniqueness and alternative life has become so much more popular or valued rather than conformity. I don’t know. I really don’t know. ",
    "subreddit": "TrueOffMyChest",
    "title": "I don’t know what to do with my life, if anything",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j50qkp/i_dont_know_what_to_do_with_my_life_if_anything/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 17:18:22 UTC",
    "id": "1j50me8",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 3,
    "score": 1,
    "secure_media": null,
    "selftext": "I put the nsfw tab on here just incase some find it triggering. Also I’m pretty sure this will just be lost in the void of new posts so I might as well just be honest. \n\nIn the last 3 years my 3 closet friends have passed away all from unexpected and tragic accidents. All unrelated just honestly the crappiest thing ever. One was 31 and two others 21.  I had a good sized friend group after that of people I went to school with last year a guy in that group SA a girl much smaller than him when they were alone. I decided I couldn’t be a apart of that group of people anymore and distanced myself from them. No one else seemed to think what he did was a “big deal” and also claimed the woman was “making it up” I met the woman and can say I believe her story completely (she also chose not to press charges) \n\nNow around 5 months later I’m miserable. I have no friends anymore and even miss the group I used to hangout with although I can never go back to them because of the horrific act that guy did that the rest seemed fine with. I’m alone 100% except for the 1 hr a day I spend sparing in martial arts. I went on a first date recently to try and meet someone new and I honestly was probably pretty bad company, not that I was a bad date, I paid for dinner and we had a good time. I just wasn’t there mentally, couldn’t really stay focused and afterwards she said that we didn’t need to meet again. \n\nBoys I’m done. I hope you guys can figure life out better than me. If I somehow make things better and find myself happy again I’ll share how in the hopes of helping others but right now im just gonna end this here. Too much rambling that will never be read by anyone else \n\n",
    "subreddit": "TrueOffMyChest",
    "title": "No reasons to keep going",
    "upvote_ratio": 0.56,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j50me8/no_reasons_to_keep_going/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 17:12:16 UTC",
    "id": "1j50h3w",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 3,
    "secure_media": null,
    "selftext": "I don't want anybody to see me. I'm embarrassed to go out in public when there are people around. My friends keep asking to hang out, and it makes me sick. I don't want them to look at me, I don't want them to have to put up with me. I'm fat, I'm hideous, I can't believe I'm supposed to even be human.\n\nI'm working on losing weight, I'm learning how to be pretty. If I'm strict I can be thin by the end of the year. Then I can re-join the rest of society. I'll learn how to be a doll, quiet, pleasant, nice to hold, cute to look at. Finally, I might be able to excuse the space I take up.",
    "subreddit": "TrueOffMyChest",
    "title": "Ugly",
    "upvote_ratio": 0.8,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j50h3w/ugly/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 16:58:28 UTC",
    "id": "1j504rd",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "I have no social connections, and I've never had. Little did I know that it was going to ruin my life as I grew older. I realized that without social connections I can't deal with real troubles in my life, especially the troubles related to interactions with a government. Damn, I can't even get basic safety of my damn life, and I'll probably wind up killed in the next few years. Even though I've got some money, I can't use them to deal with that. Because I have to know people among local authorities to do that, that is, I gotta have connections, an influence, at least some power. Too bad I don't have any. Now I'm a bit scared and desperate, but way more than that I'm frustrated. I feel like I'm a looser who fucked up own life, a weak part of a chain.",
    "subreddit": "TrueOffMyChest",
    "title": "I have no social connections. My life wouldn't be over if I had some.",
    "upvote_ratio": 0.46,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j504rd/i_have_no_social_connections_my_life_wouldnt_be/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 16:57:17 UTC",
    "id": "1j503q8",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 5,
    "secure_media": null,
    "selftext": "First post here and from phone so apologies if there’s poor formatting. Also not sure if this is the right platform but turning to here as I need to get this out of my system.\n\nAs the title says, I (21M) ended things off with my girlfriend (21F) last night and I feel awful. I had initially thought that I would feel relieved \nbut it’s tearing me apart. She was my first. We were together for 2 years and all of 5 mins it was just gone. Took everything in me to not lose it on the train ride home. Even though I initiated it, I hate myself for what hurt it has caused her and I haven’t been able to sleep or eat well. It’s really harder than I had imagined.\n\nOf course with any relationship, there were low moments but there were also some of the highest highs and I was so blessed to be with her. I broke things off because I haven’t been in a good place recently and I didn’t want to “bleed” on her due to whatever circumstances I may have. In hindsight, this was immature thinking as I chose the easy way out and I’m now dealing with immeasurable amounts of pain as a consequence.\n\nToday at work the events from the previous night replayed in my head over and over. I said what I had wanted to say but something still didn’t feel right. Thing is, I do not think this is a “take time to heal” situation. Part of me feels like it was poor judgement to not fight off my thoughts of leaving.\n\nI really miss her terribly. \n\nNot looking for any sympathy here. Just wanted to pen down my thoughts that clearly aren’t very cohesive with no fear of judgement. \n\nIf you’re reading this, thank you for everything. I’m sorry for the small things we bickered about that escalated unnecessarily. Thank you for our fun dates that brought me so much joy. I’m sorry for all the tears you shed because of me and my actions. Thank you for the past two years.\n",
    "subreddit": "TrueOffMyChest",
    "title": "I broke up with my girlfriend last night and it’s killing me on the inside.",
    "upvote_ratio": 0.73,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j503q8/i_broke_up_with_my_girlfriend_last_night_and_its/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 16:34:54 UTC",
    "id": "1j4zka7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "In my younger years, I’ve struggled with drugs. I’ve done everything you can think of, but the only drug that scared me to my core was meth. The first time I smoked it, my brain said , “This is what you’ve been looking for your whole life,” so I was a functional meth addict for 3 years (would go on week-long benders every 4-5 months), then I quit, cold turkey with all substances, for 5 years, started getting muscular at the gym, got my life stable and manageable. \n\nNow I own my own landscaping company and I flip homes; life is good. But it was getting overwhelming. The paperwork that comes with self-employment is the bane of my existence. Especially because I was diagnosed with severe ADHD as a child. \n\nSo about a year and a half ago, I went to my doctor to get diagnosed again so I can get prescribed some kind of medication. I knew I was going to need something to keep my business growing without completely crumbling it under my lack of focus.\n\nI went through the long process and got denied because by divine providence I smoked weed for the first time in years about 5 days prior. I was infuriated. So I finally said fuck it and looked up old contacts and bought 3 grams of meth the next day. I still remember holding that bag like I was Sméagol with the One Ring lol. The deep whisper that calls to all addicts beckoned me to go all in, to smoke that shit right up.  But by that point I had already realized the simple joy of living a true, peaceful life and I knew I would throw it all away if I started back up again. \n\nI bought a milligram scale and started off with 25 milligrams. The realization of seeing what 25 milligrams of meth looked like made me understand the sheer power of amphetamines. For years, people were smoking grams of this shit. Consuming it like candy, yet all you ever need is a crystal the size of a grain of sand.\n\nI put them into individual pill cases and started to take one a day. If I haven’t taken a dose before 10am then I would skip taking it altogether. \n\nI’ve tried Adderall in high school from friends, and I really enjoyed how it made me focus, meth felt cleaner, more aggressive. Over time, I started to remember my appointments without having to write them down. My sleep schedule became predictable as I never sleep during the day anymore. And my willingness to work harder is becoming effortless. Sex is always amazing, and I stopped drinking again because I’ve become sociable without the need for alcohol. \n\nThe best thing that has happened is that I’m more aggressive with business negotiations. I’m less nervous and I’m not afraid to assert my dominance when I feel it is necessary. \n\nNow, I can never think of ever smoking this stuff again. I know I’m the exception and I’m not telling you to use drugs. Meth is powerful and will destroy your life before you realize what’s going on. But I just needed to tell someone. Ask me anything you want. Btw I still haven’t finished the 3 grams I first purchased a year ago. It’ll probably last me another year before I have to go back out on the streets for more.",
    "subreddit": "TrueOffMyChest",
    "title": "I’ve been self-prescribing my adhd with crystal meth for little over a year now and it’s changing my life.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4zka7/ive_been_selfprescribing_my_adhd_with_crystal/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 16:14:43 UTC",
    "id": "1j4z304",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 0,
    "secure_media": null,
    "selftext": "We were both wrong in this situation.  Long story short. We both cheated on our partners and fell in love with each other. Things got messy and we cut contact with each other. Zero contact and blocked each other on every thing. Found out she was lying about about seeing another guy while we were having an affair lol.  (Not sure if that was true) I went through a lot of emotions. Found out that someone was telling her lies about me to make her hate me, and I think the same thing happened to me (someone telling me lies about her to make me hate her) I don't want to get back with her, I just wish that I could talk to her. Get everything straight and have some closure.  I truly believe that we were with the wrong people and we could have been great together.  We obviously went about it the wrong way and hurt a lot of people in the process. I always wonder what could have been if we did it right. But I've accepted that that won't happen. But it's almost been a year and I still think about her everyday and HATE that there was never any real closure. I just wish I could just talk to her. Pathetic i know. I just can't let it go and I've been driving myself crazy. I don't want to feel this way. How do I make myself forget all of this mess and get back to normal",
    "subreddit": "TrueOffMyChest",
    "title": "Not sure if I love her or hate her (rant)",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4z304/not_sure_if_i_love_her_or_hate_her_rant/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 16:07:52 UTC",
    "id": "1j4yx7b",
    "link_flair_text": null,
    "media": null,
    "num_comments": 10,
    "score": 31,
    "secure_media": null,
    "selftext": "In the beginning of the year, my (27f) ex husband (27m) came to me after not talking for a year since the divorce finalized, to confess to me of having sexual fantasies about children and looking at cp while we were together. I took this information to the police and have been working with an investigator since then, and made a controlled call to him with the investigator where he confessed only to looking at animated cp because “the real stuff is really hard to find”. Today I was told that they spoke with him and looked at his devices and haven’t found any evidence and are closing the case. And it’s a relief that, to the best of my knowledge, he didn’t hurt any children or consume any content that hurt actual children. But I was also warming up to the idea that he would face some kind of consequences for his actions. Because he also emotionally manipulated and raped me throughout our entire marriage. I know that I could still try to press charges for what he did to me, but I don’t really have any proof except for my own words. And I want to be able to just move on and enjoy my life now that I’m free from him. But he has a new girlfriend who is significantly younger and reminds me of me when I was young and fell for his bullshit. It feels so wrong that he can just do all of this and put me through so much and have nothing happen. \n\nI hope he’s telling the truth about getting help and wanting to change, but I also can’t help but believe that every word that comes out of his mouth is a lie, even when he believes it’s the truth. But I’ve done what I can, it can’t be my responsibility anymore. ",
    "subreddit": "TrueOffMyChest",
    "title": "The cp case against my ex husband has been closed and I don’t know how to feel about it",
    "upvote_ratio": 0.82,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4yx7b/the_cp_case_against_my_ex_husband_has_been_closed/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 15:59:29 UTC",
    "id": "1j4ypt0",
    "link_flair_text": null,
    "media": null,
    "num_comments": 89,
    "score": 52,
    "secure_media": null,
    "selftext": "\nI (20F) just went through my boyfriend (21M) of seven months phone for the first time. I have my face in his phone, and he’s told me multiple times that I can. However what I found has hurt me and hit my confidence in myself and my relationship.\n\nI know that some girls have felt it too, that little nagging feeling that something is wrong. When I looked, I went straight for the girl best friend. And that is exactly where I found messages between them, Sexting. \n\nIt was about a year ago at this point that these messages were sent, however, they were saved in chat. He is still best friends with this girl and did not tell me about this because he said that he didn’t wanna lose her.\n\nTo give a little context, I have been cheated on with the girl best friend before, twice. So this immediately raised some red flags for me. To top it off too, recently the amount of times we are intimate has severely decreased(once a week or sometimes less) \n\nI cried for a bit, and then I woke him up to talk to him about it. He apologized, and I was very mature and tried not to let my jealousy show. I told him it’s OK that he is still friends with her. I just wish she had told me.\n\nHowever, a couple days later here we are, I can’t stop thinking about it, and how she’s everything I’m not. She’s skinny with blonde hair, he sexted with her and never does with me, and he seemed to be way more attracted to her than me.\nI can’t help but overthink and be jealous.\n\n\nEdit:\n\nthank you for all of the advice. I talked to my boyfriend and we have started to work it out, and set some boundaries so we can move forward. I am a firm believer of not having friends of the opposite sex but I also would never want to make him choose between us. He is an amazing guy and hopefully this just ends up being something we look back on. We have some growing to do of course, we’re young and new to this relationship, but we want to work it out together.\n\nTo clear some things up, no he did not cheat, just saying I have experience that issue with girl best friends in the past, and saying that I invaded is privacy is wrong. He put my face in him phone and told me I can look through it if I needed to. Yes, I’m crazy jealous, yeah I have some self doubt, but I was just venting about something that was bothering me, so then I could put words to paper and evaluate how I wanted to go about handling this.\n\nJust want to remind some people that everyone is different, along with their relationships.\nI hope you have the day you deserve &lt;3",
    "subreddit": "TrueOffMyChest",
    "title": "The girl best friend is always the issue",
    "upvote_ratio": 0.71,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4ypt0/the_girl_best_friend_is_always_the_issue/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 15:03:35 UTC",
    "id": "1j4xfoh",
    "link_flair_text": null,
    "media": null,
    "num_comments": 32,
    "score": 1124,
    "secure_media": null,
    "selftext": "Not an English speaker.\n\nSo i'm actually walking back home from the park where i was and i can't stop smiling and laughing alone like a crazy person.\n\nSo after a long walk i stopped in a bar in the park and ordered a coffe and sitted outside thinking and thinking. After like 5 minutes i heard a couple starting to argue pretty loudly.\n\nI don't know who they are but just listened a bit. They were arguing about a possible break up after he caught her kissing another guy and she wasn't apologetic or something like this but was arguing back that everyone make mistakes and after 3 years of relathionship for her this wasn't a major reason to break up cause she was drunk and don't remember anything about it.\n\nI'm gonna say the exact piece of conversation that i heard: her \"are you serious? You wanna break up with me for a kiss that didn't meant anything? Are you insane?\" him \"of course, what else would you expect? Me cheering you up for another? Or maybe more?\" her \"but this insane, it's not cheating. It was just a kiss when i was drunk. It meant nothing\" him \"to you maybe not but to me yes. It's called taking responsabilities of our own actions. I can't believe i'm even here to argue about this\" her \"me too cause this insane, it was just a damn kiss while i was drunk that meant nothing\" him \"well this ends here, i'm tired of you and your excuses\" her \"you know right that if you break up with me you will never find anyone like me right?\" him \"well honestly i hope so\" pause and then she \"do you think you are funny? Should i laugh?\" him \"do what you want but i really hope to never find someone like you\" her \"i was way out of your league anyway so it's your loss and not mine\" him \"whatever you say ex gf now i wanna go home and text your sister. She is hell hotter than you\" her \"don't you dare. I will ruin you if you only try\" him \"well this is funny cause a few days ago she texted me first so let's see how things goes\".\n\nBelieve me i almost chocked myself from not laughing at this. I just love this things and this little conversation made my day ahahah.",
    "subreddit": "TrueOffMyChest",
    "title": "I overheard one of the funniest conversations ever and i can't stop laughing",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4xfoh/i_overheard_one_of_the_funniest_conversations/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 15:02:10 UTC",
    "id": "1j4xeie",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 0,
    "secure_media": null,
    "selftext": "Since November, I had a plan that if things turned out a certain way that I would most likely end my life.\n\nHowever, I have been trying to find things to keep me going.   To survive out of spike at least.\n\nHowever, if I lose access to my disability income, that will be /the last straw/ for me.\n\nI am hoarding pills away, making sure I have enough just in case I end up losing everything I need to survive.\n\nEvery day I live as a survivor.   Every day I try to find reasons to hang on.\n\nHowever, I also feel like I need an exit plan now.\n\nNo one is going to save me, except for myself.  However, I can only do so much with my chronic pain conditions and my health.   I cannot work full time.\n\nI hope my parents are proud for what they wanted out of things here.   At the expense of their only daughter.",
    "subreddit": "TrueOffMyChest",
    "title": "Preparing to end things",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4xeie/preparing_to_end_things/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 15:01:13 UTC",
    "id": "1j4xdrg",
    "link_flair_text": null,
    "media": null,
    "num_comments": 16,
    "score": 0,
    "secure_media": null,
    "selftext": "I know it’s stupid, but I can’t shake the feeling that I’m failing as a provider.",
    "subreddit": "TrueOffMyChest",
    "title": "My partner makes more money than me, and I feel like less of a man.",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4xdrg/my_partner_makes_more_money_than_me_and_i_feel/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 14:59:10 UTC",
    "id": "1j4xbz7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "TLDR: Wife’s family felt entitled to my money to help with their mother’s retirement, and none of them have ever expressed one word of gratitude.  Not looking for advice, just venting.\n\nBackstory: I’m 65M, wife is 61F.  Married 36 years.  Wife has three siblings: one older brother, one older sister, one younger sister.  We were very close with all of her siblings and their spouses for many years; we went on dozens of vacations with all of them, always had gatherings at holidays, spent weekends at each other’s homes, etc.\n\nHer brother and I were as close as we could be, always hanging out, playing music, and having a great time.  I loved him more than my own brothers.  He began to hate me in 2020 because I had the gall to disagree with his political views.  When he found out I voted for Biden, he screamed at me “WE’RE FUCKING DONE” at a family gathering.  He’s barely said two words to me since then.\n\nHer older sister and her husband have had a simmering ill-will towards my wife and I for many years.  Back in the 80’s and 90’s, I was earning great money, and we used to take them and their kids on vacations that were 99 percent paid by me, because they didn’t have two nickels to rub together.  If we bought a new piece of furniture or TV or whatever, we would offer them our barely used stuff, for free, which they (seemingly) gladly accepted.  We did these things because we loved them. Evidently, they took our generosity as “treating them like a charity case”.  Now that they are both in high-earning careers and don’t need anything from us, they basically hate us for “treating them that way”, and now simply look down their noses, sneer, and snub us.\n\nHer younger sister and her husband have always been “good Christians” but have become more fervent (“Evangelical” Southern Baptist) over the years.  I made the mistake of having a discussion about religious beliefs (I am an atheist) with the husband several years ago.  I know a thousand times more about his “Holy Bible” than he does, and the discussion did not go well for him.  Ever since then, they have done their best to ostracize us from the family at every opportunity.\n\nFast forward: My wife’s 80-year-old father passed away a couple of years ago, leaving his wife (my MIL, also 80) widowed.  They relied almost exclusively on Social Security for their retirement income.  After his death, there was a “shortfall” in the MIL’s monthly SS income.  My wife’s three siblings had a meeting and decided that the shortfall would be made up by the four siblings, split evenly.  Each “share” came to $2,500 annually to make up the MIL’s “shortfall”.  All three of the other couples are fairly wealthy, with annual incomes in the $250-350K range, and all have 401(k) accounts over $1 million, which they brag about.  My wife does not work.  I own a small business, which has slowed dramatically since covid; I make around $75k in a good year.  I would like to retire at some point, so I am trying to save every dollar that I can in order to do so.  I will rely heavily on Social Security for retirement income.\n\nThe long and short of it is that I had to funnel $2,500 per year into MIL’s “retirement needs” that would have otherwise gone towards my own retirement savings.  The way the siblings view it is: “your money is your wife’s money, therefore she needs to chip in to help her mom”.  Fortunately, two years into that arrangement, the MIL sold her house (she moved in with one of the siblings) and netted around $200k.  She told my wife that with that money, plus her SS income, AND the $50,000 she “already had in savings”, I would no longer need to contribute to her income, especially since her expenses were now basically zero.   So thankfully, I only had to “donate” $5,000 of my retirement money to the MIL.\n\nThe shitty part is that not one of the siblings, or the MIL, have ever expressed one word of thanks or gratitude to me even though they are well aware that the money we contributed came 100% from my earnings.  We still have to see them every now and then at weddings or funerals or whatever, and they have never even acknowledged my contribution and sacrifice. Their sense of entitlement is appalling, especially in light of the fact that they all have a great disdain for me and consider me to be “their asshole brother-in-law”.",
    "subreddit": "TrueOffMyChest",
    "title": "My wife’s family are a bunch of ungrateful a***oles.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4xbz7/my_wifes_family_are_a_bunch_of_ungrateful_aoles/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 14:47:42 UTC",
    "id": "1j4x33s",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 2,
    "secure_media": null,
    "selftext": "I went from ugly to good looking dude and they way I get compliments, Ive made more friends, I got into a relationship, world is unfair and anyone who says looks doesnt matter can fuck off, im starting to believe in blackpill too, it says you'd be treated by how you look and it's true, halo effect is real",
    "subreddit": "TrueOffMyChest",
    "title": "looks matter very much",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4x33s/looks_matter_very_much/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 14:38:38 UTC",
    "id": "1j4ww33",
    "link_flair_text": null,
    "media": null,
    "num_comments": 16,
    "score": 2,
    "secure_media": null,
    "selftext": "I don’t even know where to start, but I need to get this off my chest. My ex (26F) and I (26M) were together for a long time and have a 4-year-old son together. I was completely loyal to her, but she put me through hell.\n\nBefore we were evicted from our home last year, she was already actively cheating on me—first with a guy named Liam. She would stay at his place while I was home taking care of our two stepkids (5 and 8) and our son (4). I was struggling financially because she was out drinking all the time with her friends, spending money we didn’t have, while I stayed home looking after the kids.\n\nThen, in December 2022, she started cheating on me with a different guy—Mark. She promised over and over that she’d stop, but she never did. We ended up getting evicted in April 2023, and she moved in with her brother. I was staying elsewhere, and she had our son and her two kids. During this time, she kept lying to me about where she was living. She said she was at her brother’s, but in reality, she had secretly moved in with Mark. I found out when I logged into her accounts—yeah, I know I shouldn’t have, but it was the only way to get the truth because she compulsively lies. (She was living at her brothers for a couple months then after the wedding she moved in with him)\n\nShe even took Mark to her sister’s wedding, bought him clothes for it, and kept telling me we were going to fix things. She made dozens of promises—saying she’d visit me with the kids, bake me cakes, buy me gifts—but she never showed.\n\nEven after I found out everything in October, she still asked me for money in December, saying Mark wouldn’t help her. And I gave it to her, like an idiot. In total, I’ve given her around £3,000 because she made it seem like we’d work things out. I even paid for the carpets in her new house because she told me she’d cut Mark off once she moved. But now I know that was just another lie.\n\nThroughout all of last summer, she was constantly gaslighting me. I caught her sending nudes to Mark while playing Stardew Valley with him late at night while I was asleep. She’d go out every night with him, and whenever I confronted her, she’d call me crazy and make me feel like I was the one in the wrong. At one point, she and Mark even tried to get me to be friends with him—we all played games together, and I had no idea what was actually going on behind my back.\n\nEven now, when I ignore her, she acts upset and says \"there's still something there.\" But all she ever does is use me. She sends me explicit pictures and videos while claiming she “just wants to be friends.” And when I tell her she’s confusing me, she shuts down the conversation because it's “too stressful” for her. Meanwhile, I’ve been the one supporting her, giving her money, and being there for her when she needed help.\n\nI also hate her friend Emily because she covered for her constantly. she’s cousins with Mark and was helping her lie to me the whole time.\n\nOne of the worst moments was when I visited her brother’s place while she was staying there. I found used tissues under the bed, and she swore up and down they weren’t what I thought they were—but come on, it was obvious. It was disgusting. And yet she still called me crazy. (She actually made out they were snot cause she had a cold but there was like 50 tissues under the bed lmao)\n\nWhenever I ask her what she wants, she just says, \"I don't know. I need to live alone and figure things out because I’m not well mentally or physically.\" But if that were true, why is she still stringing me along, keeping me as a backup plan while she’s with him?\n\nShe tells me I’m “stalkative” and that I’m the bad guy, but I only ever found out the truth by logging into her stuff—because without doing that, I’d still be believing her lies. I know I should’ve just walked away, but I love her. I actually cared.\n\nMaybe I’m just too nice, or maybe I’m an idiot. But a part of me always thought this was just a rough patch, that we could fix things and go back to how we were before all of this. Maybe she’s sick mentally, or maybe she’s just a terrible person. I don’t know.\n\nThe one thing I do know is I feel used, betrayed, and like I’ve wasted so much time and money on someone who never really cared about me the same way. And the worst part? She still wants me to keep all of this quiet.\n\nAt this point, I feel like I should just tell Mark everything and ruin things for her, because I don't think it's fair that after everything she got it all.\n\n\n(This is actually typed by me)\n\nLike I'm currently on my parents sofa, I barely see my son, I keep trying to find private or council places but I'm getting nowhere. My depression is genuinely awful like I feel like after everything I have nothing I've just lost it all and no matter how much I try it won't get better. I used to be depressed at uni, even tried to kill myself on my birthday but my flat mates actually got me a birthday cake and stuff and it put me off for a bit, like it was genuinely heartbreaking.\n\nThing is my credit score is completely fucked as well cause I let her use my credit card and my very account and stuff and my credit score is tanked to hell because of it.\n\nLike I am genuinely screwed and it's like trying to claw myself out of quicksand, struggling is just making me sink further into it.\n\nI don't know what do you guys think? Is there a chance do I give an ultimatum or just do I give into everything\n\n[I've ran this through chatgpt because originally I was just trying to get this off my chest through it and get some advice but I figured here would be a good place to get some Human advice and it'd help get rid of all the identifying details\n\nIf anything doesn't make sense just comment it and I'll elaborate on it cause I've noticed a few details are wrong but  I mostly wanted to get it off my chest anyway]\n",
    "subreddit": "TrueOffMyChest",
    "title": "My ex cheated on me multiple times, used me for money, and still won’t leave me alone",
    "upvote_ratio": 0.63,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4ww33/my_ex_cheated_on_me_multiple_times_used_me_for/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 14:19:35 UTC",
    "id": "1j4wh50",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "Throwaway account.\n\nSorry if the story is too long because the details are a bit fresh.\n\nI  have been struggling with depression and suicidal thoughts for a couple of years.\nI am finishing up university, but since I major in Humanities, my career prospects seem bleak. Also, I had problems with with uni so I had to repeat a few semesters. Both of these things are a source of my anxiety and depression.\n\nI have friends and family members, but not a significant other or a person with whom I can talk about my problems.\n\nFor the past several months, I have been looking for a job without too much success. At the same time, I was trying to find help for my depression, insecurities and suicidal thoughts. Since I'm broke and cannot afford a therapist, I found an organization that offers free counseling. After filling out their application, they told me I should go to the hospital because they are not qualified to handle patients experiencing suicidal thoughts.\n\nI had my reservations about doing that since public healthcare, especially regarding mental health, albeit free, is pretty bad in my country.\n\nFast forward one month, I managed to get two job offers, one in a translation company, which is a 9 to 5, and an evening teaching job.\n\nI was pretty excited about the success in getting not one, but two job offers so I decided to take it easy and not exaust myself with work. I thought that the best course of action for me was to start doing both jobs until I figured out which one I liked more so I could focus on that job or even quit the other one.\n\nMonday was my first day on the translation job. In short, it went pretty horribly. The \"translation\" job turned out to be a regular office job, where I had to scan documents and edit Word files, and it did not involve any sort of translation or useful skill that could help me further my career. Bear in mind, I have had several translation jobs and I am not a complete beginner.\n\nAfter coming back home, I just started crying and felt desperate because that unpleasant experience on my first day on the job brought up all my repressed emotions to the surface, uncertainty about my career, loneliness, and the fact that all people my age have accomplished something in their lives except me.\n\nTherefore, I gathered my courage and took a taxi to the hospital, hoping to find a therapist with whom I can talk about my problems.\nI went to the ER and talked to the nurse working at the reception, who was very compassionate and patient. Then, she led me to talk to a psychiatrist, who after listening to my woes politely informed me that I would be transferred to a psychiatric hospital (or a mental asylum if you like) since the hospital is full and they can't take me. He also told me that I should not try and leave the hospital otherwise they would be required by law to call the police since I said that I sufferred from suicidal thoughts.\n\nThen, I waited for two hours until the ambulance arrived and an ambulance crew member escorted me to the car, holding me by my arm so that I would not try to escape, completely ignoring the fact that I came looking for help and did not try to hurt myself.\n\nFast forward to the insane asylum, I was interviewd by a middle-aged psychiatrist, who gave an impression as if he wanted to be literally anywhere else but in that room talking to me. After the interview, he told me that I would have to be committed either involumtarily, which would last for 48 hours, or voluntarily, in which case I would have to talk to a different doctor and stay in the insane asylum until she decided what is to be done with me. I tried patiently explaining to the psychiatrist that I only wanted to find help for my anxiety and suicidal thoughts and that I did not want to be committed to this institution. Moreover, I stressed that my emotional issues are connected to my career and that I had to go to work on the following day. I tried reasoning that missing the second day of my job and possibly losing both of the job offers is hardly productive for my mental health. He shrugged it off saying that it wasn't the end of the world.\n\nThe nurses then marched me off to the psych ward, gave me different clothes, and showed me to my room. The room had three beds and the furthermost one from the door had a heavily-sedated patient, whose arms and legs were tied to the bed. The nurse, in all seriousness, even asked me if I would prefer to sleep next to the sedated patient or I would choose the first bed.\n\nThe lights went out and I took the sleeping pills that the nurse offered and slept peacefully... until at least my roommate woke from his sedative-induced stupor and started cursing, swearing and yelling at the top of his lungs, demanding to be released from the restraints.\n\nTwo days have passed since then. I have not showered, brushed my teeth or shaved since I wasn't prepared to be committed to an insane asylum and had not prepared any of my things when I initially went to the hospital to get help.\n\nA lot of thoughts have gone through my mind in the past few days so I hoped that writing it all down and sharing with strangers would help me make some sense of it.\n\nTLDR: Tried to ask for help and find a therapist. Got committed to an insane asylum instead.\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "Got committed to an insane asylum",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4wh50/got_committed_to_an_insane_asylum/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 14:16:26 UTC",
    "id": "1j4weqt",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 0,
    "secure_media": null,
    "selftext": "I wasn’t snooping—I found it open on our desk. What I read shocked me, and now I feel like I’m living with a stranger.",
    "subreddit": "TrueOffMyChest",
    "title": "I accidentally read my partner’s diary, and now I can’t unsee it.",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4weqt/i_accidentally_read_my_partners_diary_and_now_i/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 14:05:16 UTC",
    "id": "1j4w6hp",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 0,
    "secure_media": null,
    "selftext": "Yesterday, I commented on a post about someone dealing with a family issue. I tried to offer a perspective, saying something like \"You're facing a small problem; there are people who have it worse,\" and that \"the grass is always greener on the other side.\" I thought I was being helpful, but I realize now that I was completely wrong.\n\nThe person I commented to scolded me, saying I was diminishing her experience and making irrelevant comparisons. I immediately understood my mistake, deleted my comment, and apologized both in the comment section and through direct messages, but I haven’t received a response.\n\nToday, I noticed she deleted her account, and I can't help but feel like it could be because of my comment. I'm feeling terrible about it and just wanted to share my experience.",
    "subreddit": "TrueOffMyChest",
    "title": "I Made a Mistake in a Comment and Now I Feel Terrible",
    "upvote_ratio": 0.44,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4w6hp/i_made_a_mistake_in_a_comment_and_now_i_feel/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 13:39:02 UTC",
    "id": "1j4vn9k",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 2,
    "secure_media": null,
    "selftext": "I'm 27M and life is so weird to me. I see people seemingly caring and loving each other but I struggle to feel that at all for anyone. I know my parents and family love me and I had a great environment growing up. But I'm just... detached. Like, I gained the ability to cry on command to feign sadness when something bad happens, but in reality, I don't feel anything at all. When my mother died, I know I was supposed to feel sad. I know I was supposed to love her as she did me, very much... but I failed at both. I really tried.\n\nI've had relationships in the past where my partners would tell me they love me, but I couldn't feel the same way. They treated me amazing and I try my best to be a good partner, but I could never get attached to someone or care for someone in that way. \n\nI know it sounds cruel, but I just can't seem to love anyone nor care for anyone no matter how hard I try.\n\nI find it hard to feel what others feel. For example, when my friend's dad died, I knew I needed to feel sad, but I just didn't. I didn't understand what he was feeling so I just tried my best to be there for him and take care of him. Even though I couldn't relate to him at all. It's just, I know this is the action that should be done, but I have no emotions attached to it. \n\nWhen I got a perfect GPA in college, and my cousin who was in the same college as me, in the same course did worse, I knew she didn't feel good, but I cant describe what that would feel like, if that makes sense. I mean, I've been bad or failed at things before and I just felt indifferent. So when my family was praising me and comforting my cousin, I was so confused because I had to feign being happy and sad at the same time. \n\nIt's so frustrating because I want to feel for people, but I can't look at people as anything else other than just... people. I can't relate to their struggles even though I try. I know I'm supposed to but I can't. I've been acting this whole time but I have no idea what's wrong. \n\nI know how I'm supposed to feel but I can't feel it. Everything is just monotone for me and things that happen just happen. I know what emotions are and it's so hard for me to feel them or relate to anyone else's. Idk I just wanted to put it out there and maybe find out what's wrong with me...",
    "subreddit": "TrueOffMyChest",
    "title": "I can't feel anything and it's weird",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4vn9k/i_cant_feel_anything_and_its_weird/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 13:31:34 UTC",
    "id": "1j4vi0l",
    "link_flair_text": null,
    "media": null,
    "num_comments": 30,
    "score": 166,
    "secure_media": null,
    "selftext": "I just want to say thank you for all the replies. Honestly, it’s really opened my eyes. I think I was very lost in my feelings, and I truly appreciate everyone encouraging me to go for it, as well as those who reminded me to be careful and respect her boundaries. That’s really important to me. The last thing I want to do is make her feel uncomfortable or like I’ve overstepped, so I want to be very mindful of that.\n\nI also just want to say thank you for all your love and support. I'm a bit shocked. You guys are incredible people. \n\nSomeone suggested a book for me to read, and someone else suggested that I HEAL... Yes. I do think this is the crux of the matter. Thank you for that. I looked into the book and honestly, I think it's exactly my current experience. \n\nI got a lot of DMs asking for my personal experience and also, how to become a male escort. I thought I'd give a tiny update on what I plan to do, and then my story, in case people might be interested. \n\nSorry of its long and jumbled. I've only ever really spoken about some of these things with my current client. \n\nOkay so my idea: I don’t know if it’s going to work, but I think it allows me to put the idea there in a careful way. Based on how she reacts, I might then make the decision to drop her as a client because I don’t think this situation is healthy for me. Some people have pointed out that this isn’t a great way to do business as an escort, and I completely agree. \n\nHonestly, if I’m being real, I don’t think I'm a good escort anyway 😄 businesses wise.\n\nSo, here’s my plan. My birthday is later this month, and there’s a company in our area that specializes in theatrical productions. They have a live performance at a restaurant where you get dinner and a show all in one. From what she and I have talked about, this is exactly the kind of thing she values. She loves theater, singing, opera, she’s very cultured in that way. And it’s something that appeals to me, too, for my own reasons, which I’ll write in my back story, in case someone is interested.  She also knows this is something personally meaningful to me.\n\nSo, I’m going to buy two tickets, but I won’t invite her outright. Instead, I’ll reach out and jokingly reference the terms of the boyfriend experience she paid for, something like, “You know, technically part of the package is me checking in on you, and I haven’t heard from you in a while (haha)\". Depending on how she responds, I might then say something like, “I was actually given two tickets to this event, but I don’t have anyone who would really appreciate it. Would you maybe want to come with me?” She knows that’s true. I really don’t have anyone else for something like this.\n\nThe reason I thought this might be a good approach is because a lot of people pointed out that her paying puts her in control of the dynamic, which I completely agree with. But in this scenario, there’s a disconnect from that. It’s something separate... What do you think? \n\nHere's my story: \n\nI grew up in a small rural town, close to where I currently am. My home life wasn’t ideal, a bit of a mix of financial instability and neglect. I didn't finish school and by the time I was around 16, I was doing odd jobs, mainly in auto repair. \n\nI learned from the older men in town, working informally in backyard garages. I guess I figured this would be my future. Everyone in this town was kind of like that. Grew up there. Married someone who lived there. Never left... Everyone has dated everyone, kind of thing. I was never really interested in dating. \n\nThere was a girl a bit older who only showed up on weekends and during school holidays. She was visiting from somewhere bigger. She went to school in the city. We weren’t close or anything, but just knowing someone like that existed, that could... Leave the town? I don't know. I think it gave me hope or something. \n\nLater on, I got an opportunity to work as a farm laborer in the area. The farmer was an older man, past retirement age but still running around and working. He had a wife and two adult children. I was fixing fences and machinery, driving tractors, hauling feed, digging in the dirt with spades, but eventually the farmer saw, I don't know, potential? In me. He gave me more responsibilities, and a few years later, I had some kind of a foreman role. \n\nOne day, I was about to go into the farmer’s office when I overheard him and his son talking about me. I ended up eavesdropping, probably shouldn’t have, but I did. His son is more 10 years older than me, I'm not exactly how much older, and he was basically saying that me and my whole family were low class. \n\nAnd honestly? It hurt. But also because I felt like he wasn’t wrong. We were low class. But my mom was trying her best. She wasn’t around much, but that was because she was working constantly to make ends meet. And I have my own complicated feelings about her, but I also recognize that she was doing what she thought was best for us.\n\nWhat really got to me, though, was the son has had every opportunity handed to him... His family is wealthy, he can travel wherever he wants, study whatever he wants, never worry about money. And yet, he does nothing. I don’t want to sit here and judge someone else’s life, but he sleeps until 10am every day, barely does anything, then goes out drinking every night. \n\nHalf the time, he’s passed out on a couch, sometimes puking from drinking too much. And that’s the person calling me low class?Someone who’s never had to fight for anything, never had to struggle to survive?\n\nBut maybe he has his own demons he’s dealing with. Maybe this is just his way of coping. I don’t know. What I do know is that comments like that stick with me. And I do know that I’m not that guy passed out on the couch. I’m out here trying.\n\nEventually the farmer offered to pay for a GED for me. I took the opportunity and I'm so grateful for that man. I took a GED course that was offered by the university in the next town over. The \"big city\". But it was actually just a bigger town 😂\n\nIt opened my eyes. Suddenly, the world felt bigger. I had savings from working on the farm, and I wanted to go further, get a degree, but I needed a way to make some more money.\n\nThat's when I kind of considered escort work. I don't really have some dramatic story. I just Googled \"Male escort agencies near me\" 😅\n\nI was surprised by how many results popped up. At first, it was just research, out of curiosity more than anything. But found a website that seemed legit (or at least, more polished than the sketchy looking ones). I sent an email, attached a couple of photos. And then a few weeks later I got a call and I met up for coffee with two men. One was the \"manager\", the other was an escort himself. They explained the business was small, just a handful (lol) of guys. Their clients are men and women. They weren’t high-end, but they aimed for discretion and professionalism.\n\nAt first I wasn't sure. But I did like these men and the way they carried themselves. They were confident, polished, almost like businessmen who just happened to be in a very unconventional business. They made it seem... professional. I decided to just give it a go. Why not...\n\nThey provided me with a handbook of some sorts. It had information on how to conduct one self as an escort. How to negotiate with clients. Self defence... Information on drug use. How to identify and avoid STDs. Things I always need to take with me when seeing clients. How to dress yourself. Some legal aspects that might arise. Honestly it was all very helpful. \n\nMy first client was a woman in the middle of her PhD. I didn’t know what I expected... But I guess it was not was I was expecting? She was blunt, straightforward, and treated the encounter like a business transaction. There was no awkwardness, no false pretenses. It was surprisingly easy. She was my client for a long time. I saw her maybe twice a week. \n\nOver the next two or three years, the agency changed. More men joined, some left, and eventually, the guy managing it moved on to other things. The few of us who remained started working more independently but still using the agency’s reputation, but mostly managing our own profiles.\n\nThat brings me to the current situation, I guess. \n\nSome people have asked about my future plans, whether I’m thinking about a different job or what happens if things pan out with my client. So I thought I’d write something about that here.\n\nFrom the beginning, my business as an escort was always slow. It seems like the escorts who take both male and female clients get more work, but I was only comfortable working with female clients, so maybe that played a role. Either way, it was never something that fully supported me. There were times, especially over the last year and a half, when I didn’t get any work at all. It was really just a side hustle, something that sometimes worked out and sometimes didn’t.\n\nI'm trying to focus on getting my degree. I’m older than most of my classmates, of course. \n\nIn my second year, I got the opportunity to work as a pharmacy assistant. The pharmacy was close to my university, so I could walk over after class. I’m really grateful for that job because it helped me a lot financially. Then, from there, I landed an internship at a company in my field. It’s part-time, but they’re paying me to work there, and there’s an understanding that once I graduate (which, if all goes well, should be by the end of this year), they’ll offer me a full-time position.\n\nSo, escorting was something I turned to as a way to earn extra income, and for a while, it did help. But I always knew it wasn’t sustainable, and I’ve been slowly stepping away from it. In fact, before this specific client, I hadn’t taken on anyone in quite a while. I had a few once off clients here and there. \n\nSome of the comments suggested that I should let my client know that I’m quitting escorting and that if she still wants to stay in touch, we could. That’s something I’ve been thinking about too. Because the truth is, I am stepping away. The agency doesn’t really exist anymore and it’s basically just a bunch of us still lingering. But I think I’d like to make this official. It feels like the right time to close that chapter and fully focus on what’s next.\n\nAs for why this event that I want to ask her to is special to me:\n\nIt ties back to something from my childhood. When I was growing up, there was an old lady in town who played the organ at the church. My home life wasn’t great, as I've said. But to give more context, my mom was raising me, my sister, and my sister’s baby, my niece, who was unfortunately born addicted to heroin. My dad was... somewhere, but not in the picture.\n\nI had a cheap bicycle and used to ride around town a lot. One day, I rode past this lady’s house and saw that she had a dog. I don’t know why, but I just went inside her yard and started playing with her dog. I was about eight or nine at the time. She invited me in for tea and cookies. She was a retired music teacher. She actually called my mom to let her know I was there, and my mom was absolutely livid, telling me how inappropriate that was. And yeah, maybe it was. But the old lady seemed to like me.\n\nI ended up going back a few times, I guess I helped her around the house and in the garden sometimes. She was a widow and her son was living overseas. She tried to teach me how to play the piano. I never really got good at it, but it became something special to me. I sometimes go to concerts when I can, sometimes there are music concerts at my university. \n\nSo this specific even that I want to invite her to, really resonates with me. I don't know if it's the right thing or not. I guess we'll see. \n\nIf you've made it this far, thank you for time. I think I really needed this and I needed all of you. ",
    "subreddit": "TrueOffMyChest",
    "title": "I'm a male escort and I have a crush on my client: Part 2? (Tiny update on my plan, and back story)",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4vi0l/im_a_male_escort_and_i_have_a_crush_on_my_client/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 13:29:00 UTC",
    "id": "1j4vg4f",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "I am 19M (from India) , first I will give some details about myself I lack in confidence department because many set backs due to lazyness and lethargic .i don't know how to overcome this shi(not even trying), i don't have communication skills, eazy going,creativity just playing video games in life. If I got any suggestions on other things i don't have confidence to express it and explain it in right words \n\n College will be ending in 2 months I am scared of my future , if I choose a path it feels like i will be distined to lose and I don't know what path will be effective . It feel like I want to run away from my responsibility .i don't know how to kill my lazyness and make use of my time, I am always dwelling in past , can't think about future plan   This not big  issue for you guys but it makes me to overthink \n\nI couldn't share with friends and family because I am fearing that they will judge me by that ,I just wanna share my problem with someone so my mind will be free .",
    "subreddit": "TrueOffMyChest",
    "title": "I really don't know. what to do?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4vg4f/i_really_dont_know_what_to_do/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 13:24:33 UTC",
    "id": "1j4vczc",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 1,
    "secure_media": null,
    "selftext": "Hello, it is my first time ever posting on reddit and english is not my native language so sorry if I am screwing stuff up.\n\nQuick context: I am a 26 year old male with a partner of 5 year (28F) that I love very much together in our house with cats. My friend called \"V\" is a great person to be around, really soscial and funny. We met at university and were good friends from the moment we met and although life has lowered our time together, we still meet for DnD once a month at least and chat when time allows!\n\nAnyway,last year V told our close group of friends that they are transitioning but we can still use male pronouns and everything around him for now. We all accepted it and told him that we are here if he needs help.A couple of months went by and he started the hormone treatment, grew out his hair and starting dressing and acting more feminine. I started to find it a bit interesting to witness the transformation and my GF talked with him about his feelings and some tips and tricks regarding clothing and make-up. \n\nThe first \"feeling\" came when he was going to a dress-up party where he asked my GF to help to dress as a proper women for the first time with a wig, make-up and everything. She was happy to help and went over to his place where he and his roommates live (all girls) to work her magic. All went well according to my GF's text and she send me a picture when he was done. He looked so good! Cute but also sexy and most importantly, happy! That is when I first felt \"something\" and I was a bit shocked, I kinda pushed it away as a reaction to seeing the guy I know for 7 years suddenly as a beautiful women.\n\n The next feeling came later on the evening when I got a message from him (drunk) that was a picture of him blowing me a kiss and saying \"I love yooouuuu\" and some other stuff that he is happy to have me and my GF in his life. This gave me a butterfly in the stomach feeling but I thought it was just a corny message that some people send to friends when drunk (I remember plenty of instances where other friends told me they love me after a night of drinking as I am dropping them of at home and vice versa). I showed the message to my GF and she jokingly asked if I am going to leave her for him. I told here no because I really love her and this is just a random drunk text plus he mentioned her also in the text that followed so it was not only aimed at me.\n\nThat leaves me with the situation right now where I am 90% convinced that this is all just a temporary feeling and will blow over as they complete their transition and I move on with my GF in the meantime.\n\nWhat the hell should I do if the other 10% turns out and I cannot stop thinking about him/her when he starts looking for surgery etc? I really love my GF and I also don't want to ruin a great friendship. Do just thug it out or try to talk with V about it? Thanks in advance",
    "subreddit": "TrueOffMyChest",
    "title": "I (26M) am starting to feel attracted to my MtF (25) friend and am confused.",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4vczc/i_26m_am_starting_to_feel_attracted_to_my_mtf_25/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 13:17:28 UTC",
    "id": "1j4v85a",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 61,
    "score": 1,
    "secure_media": null,
    "selftext": "Preferably with something with caliber... But that's not an option so I'll type into the void instead.\n\nI was at the dentist today, and she went on and on about how I need to get better with brushing my teeth or it's gonna get expensive. That it shouldn't be so hard since I got out of bed and got there... Yeah because I had an appointment? She asked me why it is so hard and I said it isn't hard, I just forget. \"But you don't forget to shower do you?\" Yeah, yeah I do. \"Do you forget to eat?\" Yup. Then she just started going on about how I have to fix this... Like I KNOW! I also need to fix getting the fucking dishes done... I desperately need to do laundry. I've been meaning to throw out this worn pillow for weeks, it's still on the darn floor. My desk was so cluttered with empty soda cans I grabbed a bag to fill and have it sitting by the desk... It's now full and my desk is getting cluttered with cans once more. I have homework due at Sunday I haven't even begun, one which is reading an entire book... I also really really need to clean out the backseat of my car... Oooh and my medication for my arthritis. I have it in the kitchen, I need to take it to my bed because it's an injection and I usually take it before I go to sleep... Haven't taken it in weeks before I keep forgetting to take one of the boxes.\nAnd what do I do instead of getting anything I should down? Play videogames.\nLike, I know I should do all these things, I know I should eat better, probably cook my food and not just heat up frozen dinners. I should take care of my health, I should take care of my hygiene and housework, I should... I should... I should ... But just seeing it I get so overwhelmed I rather put it away until it becomes a fricking mountain I can't deal with at all. I hate myself. I don't know what's wrong with me.\nA \"friend\" said \"just get it done\"... Mhm very helpful. You have all the tools you need. You don't need to run down into the next buildings basement and book the laundry room and then on that day haul everything back and forth. You have a dishwasher you can fill and let it do the work if you don't feel like standing and doing the dishes. You actually enjoy cooking, I hate it. I wish it was that easy to just get it done. It should be that easy to just get it done but it isn't and right now I just wanna go to sleep and hope I never wake up so I don't have to deal with this bullshit anymore.\nGuess I'm just having a really bad day today. ",
    "subreddit": "TrueOffMyChest",
    "title": "I just need to vent my brain",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4v85a/i_just_need_to_vent_my_brain/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 13:16:06 UTC",
    "id": "1j4v78i",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 1,
    "secure_media": null,
    "selftext": "I M/18 and my girlfriend F/18 have been together for little over a year now. We started dating at boarding school so we saw each other EVERY SINGLE DAY, so we also argued a lot. After boarding school ended we moved back. This meant we would se each other a lot less because we live 2 hours apart. But that worked fine, seeing each other about 1-3 times a week instead. It is almost always me going to her place, waiting 2 hours. A few months back around mid October, kind of wanted to break it up because I didn’t feel very happy in the relationship, but I said I would wait a little because we had a trip to Berlin which was super awesome and things were going great. Now it’s been a while, still taking the train 2 hours to see her and I feel that the past few weeks my feelings for her has dwindled. I feel a lust for other woman, don’t find my girlfriend as attractive anymore and very little need to see her. I don’t look forward to seeing her which I hate because I wish I did\n\nI have told her how I feel and we said we would give a little time and if it keeps going we should break up. The problem is I can’t decide, one part of me is screaming stay with her because I love her but not the same way anymore but I still love her and at the same time I feel like the only solution is breaking up. I’m not sure if it’s because I love the idea of her what is making me so confused\n\nWhat do you guys think?\n\n\nplease help me guys 🙏🏽❤️",
    "subreddit": "TrueOffMyChest",
    "title": "Confusion",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4v78i/confusion/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 13:08:19 UTC",
    "id": "1j4v23r",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 6,
    "secure_media": null,
    "selftext": "I feel so self conscious in public. As a Uni student, I stayed home almost the entire semester last year because I just hate to be in crowded lectures halls. \n\nI feel so uncomfortable walking to the campus from the uni accommodations cause there’s so many people walking the same way. \n\nI haven’t made many friends cause I can’t talk to people, the only ones I have are through a group project and one that I knew earlier online. \n\nI sometimes really wanna study somewhere not in my room, but I can’t stand going to the libraries or cafes cause they’re always so crowded. It feels horrible\n\nThe main point is this. Sometimes when I’m at uni, I will feel so vulnerable, so self conscious, that I’ll go into a bathroom stall just to be alone for a moment. Not just bathrooms either. I’ll hide anywhere I can. I was once waiting to take an exam, there were so many people in line and the invigilators were late setting up, so I walked through this door in the hall where j was waiting, into this random break room where I probably wasn’t allowed to be, but I just couldn’t stand there. \n\nI spend a lot of time on how I look, how I dress, because I don’t want to stand out. If I look sharp and nondescript, I’m that much closer to invisible. Or at least that’s the rationale I’ve come up with, it’s sort of a subconscious behaviour.\n\nI can also barely leave my house without headphones. Maybe it’s some sort of protection, some defense mechanism that disconnects me from the world around me. \n\nI know my fears and anxieties are extremely exaggerated, logically there’s no reason for me to be nervous. Maybe there’s some underlying psychological disorder that’s causing it, I do have ADHD and autism, but I can’t afford therapy or any sort of treatment so I really just have to deal with it for now, until I graduate. But it mostly hurts because I know that it won’t just get better with time, I need to do something about it, the future won’t be brighter just because the present is so dark. But I’m trapped like this for now.",
    "subreddit": "TrueOffMyChest",
    "title": "Sometimes I go into toilets to be alone",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4v23r/sometimes_i_go_into_toilets_to_be_alone/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 13:03:56 UTC",
    "id": "1j4uzav",
    "link_flair_text": null,
    "media": null,
    "num_comments": 8,
    "score": 3,
    "secure_media": null,
    "selftext": "I honestly debated sharing this for a while, but it's really bugging me. It seems dumb but I promise, it's a rough one, for me at least.\n\nI started playing a game just for fun and to see what it was about, but I ran into a bit of a problem when first starting out. I understood the assignment really well for the first time playing but hated how belittled I was for my inexperience despite how quickly I caught on. So I fabricated a simple lie saying I used to play years ago but lost my account.\nThis wasn't really a problem for a while, didn't expect to make any long-term friends while playing so I just stuck with the lie, so much so that I partially believed it.\n\nI then made a handful of amazing friends that I care deeply for and they care deeply for me. We've been a little group for about I'd say a year now. I feel so unbelievably bad lying to all of them like this even though it's the only thing I've lied about around them (I don't have the guts to lie to them so this really is the only thing). I feel like a terrible friend by lying about a game that we all built our friendship on but I'm too scared to back out of this considering how far in I am.\n\nI feel like actually saying what I did will do me good rather than continuing to just shove the truth to the back of my brain and is why I came here of all places.",
    "subreddit": "TrueOffMyChest",
    "title": "I lied about my experience in a videogame.",
    "upvote_ratio": 0.72,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4uzav/i_lied_about_my_experience_in_a_videogame/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 12:25:06 UTC",
    "id": "1j4uao8",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 3,
    "secure_media": null,
    "selftext": "I'm an almost 22 year old animation student and i sell candy at the mall. most of my coworkers are highschoolers at their first ever job, no hate to them but as an adult who's been working for three and a half years this is a very weird spot for me to be in. This job gets the best of me, made me hate people more than i did before and made me realize how fucking DUMB kids today are, teenagers come into my store a minute before closing and start fooling around. I'm sick of having to constantly watch them not stealing anything and not touching the fucking GUMMIES with their hands (my god i genuinely hate when people do this). i don't get paid enough to feel 25 years older than i am, i feel so tired and trapped and don't know what to do. If i don't get my ass out of shithole jobs like this after i'm 30 i'll end it all",
    "subreddit": "TrueOffMyChest",
    "title": "I HATE working retail (and kids)",
    "upvote_ratio": 0.8,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4uao8/i_hate_working_retail_and_kids/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 12:19:37 UTC",
    "id": "1j4u79y",
    "link_flair_text": null,
    "media": null,
    "num_comments": 12,
    "score": 0,
    "secure_media": null,
    "selftext": "(Fake names)\n\nMy friend James introduced me to his wife Sarah when they first got together around a decade ago. I don't think Sarah liked me at all until a couple months ago when we started hanging out through a shared interest. To be honest, I'm not sure she likes me much now, and I think she only spends time with me when her friends are busy. I feel like James told her to be friendly to me because he knows I'm socially awkward and suffer from depression especially recently. Anyways, we have been bonding over the same hobby for the past couple months and something about her drives me wild at times man. When I first met her, I didn't think of her like this at all and would have said she was probably a little above average looking. After getting to know her as a person and seeing the way she carries herself, she has become extremely gorgeous to me. \n\nI respect both of them too much to do anything, and I'm genuinely content with being friends with Sarah because she is a fantastic person like James. I've been minimizing contact with her recently though and it sucks because I know that I would never act on these feelings. The reason I haven't been talking to her as much is because I don't want James to feel like something would happen between us. I was spending much more time with Sarah than James because we are both into the same stuff right now.\n\nI'm glad Sarah doesn't feel the same way toward me as I do her, but it sucks knowing that she wouldn't feel the same even had she never met James. I feel so guilty and ashamed for liking her. ",
    "subreddit": "TrueOffMyChest",
    "title": "Sexually attracted to my friend who is the wife of another friend",
    "upvote_ratio": 0.2,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4u79y/sexually_attracted_to_my_friend_who_is_the_wife/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 12:15:18 UTC",
    "id": "1j4u4pq",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 8,
    "secure_media": null,
    "selftext": "I lost my 20s to depression and struggling to put my life together. Everyday I wonder what did I do wrong. In my 20s, while fighting depression, I have always tried my best to put my life together.\n\n* I never went on YOLO stuff like going on trips or oversea travels.\n* I rarely if ever waste money on socialization.\n* I very rarely eat out, watch movies, etc.\n* The only fun I truly had was dedicating my effort to training jiujitsu (2-4 hours a day, 4-5 days a week), which I maintained for 3 years until COVID.\n* I keep track of my finance.\n* I always have some sort of active learning hobby to keep my mind away from depressive thoughts. Such as learning basic excel, learning basic personal finance, routine music practice, routine certificates studies.\n* I keep missing out on opportunities due to my location (Sarawak Malaysia) and my lack of skills that can make potential employers overlook my location.\n\nWhen I received a good job offer of a career I worked for, COVID happened. After that the job market was screwed. When I had my 1st job, I was underpaid and rewarded with performance punishment. My incomr was MYR1500 per month (USD340), and I learned waterfasting so that I could save 10% every month. After work, from 5.45 to 8pm I would study to get UI/UX Coursera.\n\nAfter 9 months of this everyday, I had a mental breakdown and forgot everything I learned. I quit my job to join an apprenticeship program, but eventually it didn't pan out... due to my location.\n\nI turned 30 late last year. Currently I'm developing a game (something I have been working on on the side for 2 years now). But the future is bleak. I'm still stuck in this third world town where opportunities don't really exist.\n\nAnd I'm barely hanging on, still fighting my clinical depression, hanging on to keep it together.",
    "subreddit": "TrueOffMyChest",
    "title": "I lost my 20s to depression",
    "upvote_ratio": 0.84,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4u4pq/i_lost_my_20s_to_depression/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 12:04:48 UTC",
    "id": "1j4tynm",
    "link_flair_text": null,
    "media": null,
    "num_comments": 85,
    "score": 170,
    "secure_media": null,
    "selftext": "Basically, I'm a clutz!\n\nI'm very grateful to doctors and nurses who care about their patient's overall wellbeing, not just about their injury. But when you're me, that can lead to some serious problems. Showing up to the hospital with a severe nosebleed, two puffy, black eyes and a bump on my forehead that puts comic books to shame, I absolutely understand they're worried. And especially when the explanation is \"I walked into a door\".\n\nHere's the thing though: I ACTUALLY WALKED INTO A DOOR!!!\nNot only that, I was wearing crocs. And yes, I know: ewww crocs! But my mum bought them for me and they're really practical when I just need to put some shoes on to run to the mailbox. \n\nIn case you're unfamiliar with crocs, they're like bouncy rubber balls when you wear them and hit your foot on, let's say, a door! \nSo here I am, in a bit of a rush, shoving my feet into said crocs and then attempting to run out the door. Only, I somehow misjudged the distance to or the size of the door? Maybe? Whatever the reason, when I pulled the door open while simultaneously rushing at it, my foot hit the corner of the door. So the door stopped instantly, but my body didn't, resulting in my face smacking straight into the side edge of the door. Impact no 1. As if that wasn't bad enough, my leading foot was between the door and doorframe, so when the door bounced off my back croc, it hit my front croc, bounced back and smacked me in the face again. Impact no 2. It then bounced into the front croc, and back again. Impact no 3. I'm pretty sure that's when my nose got squished. I'm not sure how many more times it happened, but it sounded like a machingun was going off! I was so disoriented, seeing double, blood flooding out of my nose, my eyes rapidly swelling shut, and it felt like my forehead was splitting down the middle.\n\nSo yeah, I don't blame the hospital for thinking my \"I walked into a door\" was a lie...",
    "subreddit": "TrueOffMyChest",
    "title": "Everyone thinks I'm a domestic abuse victim. I'm not, I just literally walked head first into a door...",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4tynm/everyone_thinks_im_a_domestic_abuse_victim_im_not/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 09:45:40 UTC",
    "id": "1j4ryaa",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "My daughter was sexually abused her mother’s boyfriend late last year. \n\nI lived in a different state at the time working out some personal issues. I got a call from my mother, she told me it happened 2 weeks prior. Nobody wanted to tell me because they were “afraid of the way I would react.”\n\nNeedless to say I was angry that nobody told me. Immediately, I called my kid’s great grandmother (mom’s side) told her to bring me my daughter. She did. \n\nI reported it. My son was removed from their mother’s care for her failure to comply with a CFS safety plan: keep the kid away from the pedo. I won custody of my son shortly after his detainment. He was placed in my care.\n\nRight after, he was arrested and charged in violation of CA penal code 288(A) and given a $100,000 bail amount. \n\nShe paid the damn bail, after blaming my daughter. And now cries to me about how much she misses her kids.\n\nI now raise 2 small children alone. I couldn’t be more grateful to have been in a position to be there for them when they needed me most. ",
    "subreddit": "TrueOffMyChest",
    "title": "My Child’s Mother Bailed Her Abuser Out of Jail",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4ryaa/my_childs_mother_bailed_her_abuser_out_of_jail/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 11:44:07 UTC",
    "id": "1j4tmua",
    "link_flair_text": null,
    "media": null,
    "num_comments": 98,
    "score": 0,
    "secure_media": null,
    "selftext": "I'm currently trying to make my gf break up with me so I can die alone\n\nSo I'm 27 suffer with adhd and shit loads of other stuff and have zero social life or hobbies \n\nI'm in a long distance relationship because I got lucky and when I was being an asshole online this girl took pity on me and started talking to me and never stopped \n\nBut the thing is I'm starting to realise that I'm not a good partner i can barely communicate I can't keep my anger in check and can't keep or even get a job\n\nI have nothing to offer her especially as I refuse to move to her country i can't even drive or cook for myself\n\nSo I'm starting to try and get her mad at me every few days so she eventually gets fed up and leave \n\nThen I plan to live long enough for my parents to die then die myself \n\n",
    "subreddit": "TrueOffMyChest",
    "title": "I'm trying to get my gf to break up with me so I can die a hermit",
    "upvote_ratio": 0.32,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4tmua/im_trying_to_get_my_gf_to_break_up_with_me_so_i/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 11:15:26 UTC",
    "id": "1j4t7km",
    "link_flair_text": null,
    "media": null,
    "num_comments": 30,
    "score": 76,
    "secure_media": null,
    "selftext": "Essentially the title. It annoys me so much when people say \"money isn't everything/can't buy happiness\", usually said by people who have enough money.\n\nMoney would literally solve all my problems and I'm not even talking about extreme amounts like 100k plus. 15-20k would solve ALL my problems. And I'm not saying that this isn't a shitload of money. It would allow me to pay my debt my ex left me with, get the education I need to find a better job and fix the broken things in my home. \n\nIts just crazy to think that for a billionaire this amount of money is peanuts, a blip, while it would make my life not a hell of stress and worry.\n\nAnd before you come for me, I know life isn't fair and with hArD wOrk I can pull myself out of it, I'm not sitting on my butt doing nothing but I just needed to vent to the void or something.",
    "subreddit": "TrueOffMyChest",
    "title": "Money would literally solve all my problems",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4t7km/money_would_literally_solve_all_my_problems/"
  }
]