[
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 18:51:30 UTC",
    "id": "1j4amcd",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 2,
    "secure_media": null,
    "selftext": "Somebody relate pls",
    "subreddit": "TrueOffMyChest",
    "title": "Yall im about to fail my maths test",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4amcd/yall_im_about_to_fail_my_maths_test/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 18:47:28 UTC",
    "id": "1j4ainj",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 10,
    "secure_media": null,
    "selftext": "I just need to get this out.\n\nI’m 44, an only child, and my mother was 64. Our relationship was never easy. Throughout my life, she always seemed \"embarrassed\" or \"ashamed\" of me for one reason or another. We hadn't spoken in three years, though deep down, part of me still longed for the kind of mother-daughter relationship I never had.\n\nThen, three weeks ago, I received a message on Facebook from my cousin, saying they had \"heard\" about my mother and hoped things got better. My heart sank. No matter what had happened between us, she was still my mom. I immediately started reaching out to family—her siblings, my aunts and uncles—only to be told they couldn’t say anything and that I needed to call my stepdad.\n\nLong story short, my mother was dying. Stage 4 cancer. ICU. When I asked if I could see her, I was told she wasn’t sure if she wanted to see me. That *hurt* in a way I can't even explain. By the time I finally made it to her home, she was in hospice care and could no longer speak. Her husband made it clear that she hadn't wanted me to know she was sick—she didn’t think I would care. *WTF.* I got to say goodbye, but only to the shell of the woman she once was. And now, I don't know how to process any of it.\n\nThe only time I ever really stood up to her—never in a disrespectful way—was when I asked her to stop belittling me in front of others and to show me some respect. I am college-educated, have never been arrested, and earn four times what she did. But in her eyes, none of that mattered. I was overweight. I had a teenage pregnancy many, *many* years ago. That was all she ever saw. This drove anxiety, depression and a few failed attempts...well, you know. \n\nShe never had a relationship with her only grandson, either. He wasn’t told she was sick. He never got to say goodbye.\n\nIt’s just... frustrating. Heartbreaking. Infuriating.\n\nThank you for letting me vent.",
    "subreddit": "TrueOffMyChest",
    "title": "Lost my mom -- Feeling kind of cold about it all",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4ainj/lost_my_mom_feeling_kind_of_cold_about_it_all/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 18:35:10 UTC",
    "id": "1j4a7hn",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 1,
    "secure_media": null,
    "selftext": "I’ve been with my boyfriend, Luis, for three years, and we’ve always had a close relationship with great communication. But in the past few months, I’ve noticed that he has become distant. He doesn’t text me as much as he used to, he seems absent when we’re together, and even our intimacy has changed.\n\nWhen I ask him if something is wrong, he just says he’s tired or stressed from work, but I can’t shake the feeling that there’s something more. He no longer makes plans for us, and when we do spend time together, it feels more like an obligation than something he genuinely wants.\n\nI don’t want to pressure him if he’s going through something personal, but I also don’t want to ignore my own feelings of insecurity in the relationship. I’m unsure whether to give him space and wait or to be more direct and address the situation head-on.\n\nI just needed to get this off my chest because this uncertainty is really affecting me.",
    "subreddit": "TrueOffMyChest",
    "title": "My boyfriend has changed, and I don’t know if I should be worried",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4a7hn/my_boyfriend_has_changed_and_i_dont_know_if_i/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 18:32:52 UTC",
    "id": "1j4a5d8",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 1,
    "score": 0,
    "secure_media": null,
    "selftext": "I have never been the skinny girl or the pretty girl, so when I became infatuated with a boy and finally heard him say yes to my request to date him, I thought I was in a fairytale. Last summer, I (18) went to visit my boyfriend (21), who lived over 400 miles away. I was given an ultimatum: if I didn't go see him, he would dump me. So, the naive me, hopelessly in love, agreed to take two weeks off my well-paying job to meet him.\n\nAfter a 14-hour train ride, I was enveloped in his embrace, and I felt so happy, thinking, \"This is it; he’s the one.\" I was exhausted from the long day and immediately fell asleep in his bed. However, I woke up to a strange feeling and found myself unable to breathe. He was having sex with me and choking me. When I opened my eyes in shock, all he said was, “You like that? you fucking slut.” I felt so stupid and used, I couldn’t look at him the same way again.\n\nI stayed there for the rest of the two weeks, but all we did was argue. I wanted love and to spend time with him, while he just wanted to play games, use me, and sleep. Once the two weeks were over i got the train home to encounter a 7 hour delay, I spent a total of 21 hours on a train, only to be raped by a man in an alley at 3 a.m. on my way to the hotel.\n\nI called my boyfriend, crying and upset, as my face had been bashed in. He called me a whore, saying I shouldn’t dress the way I did in public and that it was my own fault. Then he dumped me. I had a mental breakdown of sorts lost my job, self harmed almost daily never allowing my skin to be clean and overdosed twice. The worst part is no one believed me accusing me of being an attention seeker and dramatic and those who did believe me played it off as no big deal. Although it has been five months, I still feel unloved. I have always craved affection, and I genuinely do not believe anyone could ever love me for who I am without wanting to use me although i hope one day im proven to be wrong :)",
    "subreddit": "TrueOffMyChest",
    "title": "Just need a little rant is all",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4a5d8/just_need_a_little_rant_is_all/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 18:28:08 UTC",
    "id": "1j4a10l",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 2,
    "score": 8,
    "secure_media": null,
    "selftext": "I have been trying to process and work through what I saw yesterday, but it has been really hard. The event itself was a lot but now I’m dealing with the “why’s” which make me feel guilty since what happened has nothing to do with me. I was just a witness. I tried writing through it, but it hasn’t been enough so I’m trying again, thinking that if I get it in front of others I can start to live past it. \n\nYesterday evening, I was sitting on this big rock while I was waiting for the bus. A little ways down the road there was a taxi van. He was either backing out or adjusting his U-turn, but obviously reversing and not moving super fast. From where I was sitting, I didn’t see how fast the bike courier was going when he hit the front side of the van. And the biker immediately went under the front wheel of the van and I could hear him and his bicycle crunch under the tire. \n\nThe position the biker was on the ground was how he stayed for the whole 20 minutes that he was out there. He never moved. So, I’m almost positive he died during the collision or if there was some way he survived, he could have been fully paralyzed. \n\nBut there weren’t many people to see the accident head on like I did. A man in his Jeep came out and a few security from the booth around (my stop is near a campus) came out to help. They checked for signs of life and directed traffic around him and had someone call 911. Police came and did much of the same. The fire department came and started doing CPR but they didn’t take off the man’s helmet. The ambulance came and I didn’t see any defibrillator or adrenaline unless they did those things in the back once they loaded him on the gurney and took the man away. But even after they put him in the ambulance, it didn’t leave or take off. There wasn’t a rush. \n\nIt felt like I was out there for two hours but it all happened in about 20 minutes. And, it’s hard to think about the collision and how if the biker hasn’t passed away I’m sure the injuries will last a lifetime. And I think about the taxi driver who just sat in the van with his head down and how he will most likely lose almost everything because of an accident. \n\nI don’t know why I had to see it but I did and I don’t know what to do with it if anything at all. ",
    "subreddit": "TrueOffMyChest",
    "title": "In an instant, I saw two lives change forever in two completely different ways",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4a10l/in_an_instant_i_saw_two_lives_change_forever_in/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 18:21:58 UTC",
    "id": "1j49vjf",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 14,
    "secure_media": null,
    "selftext": "Edit: since I talked to him about it, I decided to delete this post.\n\nFor my husband, I let him know he could at least turn off the notifications for his family group chat. It doesn’t make sense since they only tend to trigger him and there’s no real advantage in responding the chat.\n\nHe kind of shrugged it off because “what if it’s an emergency?” I said then they should be CALLING him. It was weird. I can’t stop him from staying in the chat. I can’t understand why he can’t still. ",
    "subreddit": "TrueOffMyChest",
    "title": "I just wish my husband’s dad to be gone.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j49vjf/i_just_wish_my_husbands_dad_to_be_gone/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 18:02:26 UTC",
    "id": "1j49dv1",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 1,
    "secure_media": null,
    "selftext": "Most of my perception comes from observing from my parent's relationship. They love each other a lot and spend pretty much all of their time together. However, there are times when my mom feels a bit smothered by my dad, and this has led to arguments in the past, but I would say that overall she enjoys spending most of her time with him.  I've even tried inviting her to different events but she would often turn me down to spend time with my dad. I feel like this has led me to create an unrealistic expectation that my partner and I should be spending a lot of our time together.  A few of my partners have told me that they felt smothered, or that I was never satisfied with them. Was it a matter of different needs, or was I truly doing/expecting too much? Or is it a little bit of both?  People say a relationship is supposed to feel \"easy\" or \"natural\" in the beginning, but it's never felt that way for me.  I have to be doing something wrong-whether it's not communicating well enough, expecting too much from my partner, or not setting firm enough boundaries for myself, or maybe all of the above. ",
    "subreddit": "TrueOffMyChest",
    "title": "I think my perception of a \"healthy relationship\" is what's sabotaging them.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j49dv1/i_think_my_perception_of_a_healthy_relationship/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 17:58:07 UTC",
    "id": "1j499mz",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 5,
    "score": 5,
    "secure_media": null,
    "selftext": "I (22F) broke up with my boyfriend (20M) of 6 months on new years of 2024. I broke up with him for a plethora of reasons including him accusing me of stealing $500, him accusing me of cheating, him proposing, how he treated me, him telling me he was going to commit suicide and it was my fault, and much more. For the record, I didn’t do any of the things he accused me of. Well it didn’t end at the breakup. This specific individual is in the military and most of our relationship was long distance. He sent me death threats after the initial break up which I did contact the police and his commanding officer about. I told him to leave me alone and blocked him. However for the year of 2024, he had his friends that live where I live follow me and threaten any guy I was seeing into breaking up with me, he constantly messaged me on different numbers saying words coated in honey to try to get me back and he even showed up to my house when he was on leave. One of the many reasons I broke up with him was that he was home for Christmas of 2023 and refused to see me and I got really upset because I still “loved him” at that time. I have now learned through therapy that it wasn’t love, I was just caught in the web. Well Christmas of 2024 came around and he was back on leave and he had his mom message me telling me that he was going to commit suicide if I didn’t show up. I told her to leave me alone and it was of course an empty threat (maybe even a test). He left after that and apparently, according to his mom he was deployed. Well I got a text on my birthday (February 4th) saying that he still loved me and yada yada which went ignored and then I got a call from his military base. Apparently he had went missing in action and I was his beneficiary. I haven’t heard anything from him since but I feel free finally. I have a date this week and I’m going to see if anyone threatens my date into ending it with me. I kinda feel bad that I was so harsh but I also think it was survival. I think that if I was any less harsh, it would’ve been a lifetime of pain for me. ",
    "subreddit": "TrueOffMyChest",
    "title": "I’m finally free of him",
    "upvote_ratio": 0.73,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j499mz/im_finally_free_of_him/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 17:51:31 UTC",
    "id": "1j493kq",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "Title. The sad truth is I was a compromised person when I made these friends and the relationship became really one sided and they fucked me hard. Lost money, time, respect, friends...lost pretty much everything I have basically.\n\nThe fucked up thing is when I take a step back from the situation I see that these people don't even look at it like I do. They don't even really care or realize they have done anything. \n\nAnd in a way they didn't do anything because I was looking for the type of support that a family is supposed to give you when in fact they were just friends and our social backgrounds became really obvious as we grew up and we sort of grew apart...\n\nI see them from time to time. That's all I really want. Sometimes I want it to go back to when we were all tighter but then I remember that the person who really made that a family space was me and the truth is that after what happened I'll never really be the same and my desire to put out that kind of energy isnt really there anymore because I'm sick of being used and abused.",
    "subreddit": "TrueOffMyChest",
    "title": "Group of Friends Fucked Me Over",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j493kq/group_of_friends_fucked_me_over/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 17:36:17 UTC",
    "id": "1j48pud",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 2,
    "secure_media": null,
    "selftext": "I have to get this out.\nMy family makes the BLANDEST food to EVER exist.\n\nI moved out years ago for college, and only now have I come back for a visit.\n\nBear in mind, I'm a very culinary guy, I love making various different foods, all different textures, tastes, consistencies and all.\nBe it Italian, french, central European, Slavic, Arabic, mexican, Indian, all sides of Asian cuisine.\nI love exploring different tastes and savor every bite.\n\nHowever, when I visited my parents I remembered WHY I became so interested in culinary arts.\nIt's because my parents make food comparable to eating a stack of A4 paper.\nIt's not even bad, it's just... Bland, so bland that eating a meal that would take me ten minutes takes up to an hour.\n\nI swear, any dish they make is outperformed, and I do not exaggarate here, by a fucking piece of bread with some salt and pepper sprinkled over it. I wish I was joking.\n\nWhich is fucking abysmal because the food actually looks good! It looks like it something that you'd want seconds for but when you actually bite into it, you wish to be put away for ten years in jail just so you don't have to eat it again.\n\nThe taste of my family households cooking is what I imagine slop to taste like.\nYou know those cartoons where the lunch lady always gave this grey slop in the cafeteria? I'm pretty sure my parents eat that on the daily, just with a different look each day.\n\nIt's amazing, no matter what they make, be it soup, sandwiches, schnitzel, literally any fucking thing they make is just akin to the taste of a rock.\n\nI just finished dinner and wish I didn't.\nThankfully I have money of my own so I can just say that I'm not hungry and then go out on the town later.\nBut still, I am amazed how they eat that... Stuff. I can't even call it shit cause at least shit tastes awful.\n\nIf their food was a person it would be this puny, dresses always like he's going to work, overly friendly and unopinionated guy at the party that talks to you when you contemplate jumping out of the building just so you can avoid his dribble about the fucking idk, how much he likes MHA.\n\nYou'd probably love my parents cooking if you enjoy the taste of water.\n\nTheir food reminds me of the food bodybuilders eat, you know?\nCooked chicken and rice, with no spices, sauce or additions, only that chicken and rice.\nMy parents make food with all manners of ingredients yet they still taste like... Fucking chicken and rice.\n\nIt's amazing I was able to eat that stuff for 18 years without consuming bleach, which, ironically, would have more taste than their cooking and give me my will to live back.\n\nOk, I'm better now, see ya.",
    "subreddit": "TrueOffMyChest",
    "title": "Blandest food ever",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j48pud/blandest_food_ever/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 17:33:40 UTC",
    "id": "1j48nfz",
    "link_flair_text": null,
    "media": null,
    "num_comments": 23,
    "score": 393,
    "secure_media": null,
    "selftext": "My, f29, boss, m late 40s, kept the camera feed of me on his computer screen at all times. Obligatory throw away account cause the details in this might be easy for some of my coworkers to find this and I don't want to give up my main account. Also I was posting this on am I over reacting but my update actually came as I was typing this on that sub so now I'm switching it to here that everything seems to be wrapped up.\n\nSo I work in a mostly male dominated field in a CNC machine shop as a brake operator. I am the only woman at my company that works on the shop floor. About a year ago there was a fist fight between 2 other operators and there were no cameras inside to show who started the fight so both operators had to be let go. To prevent this from happening again the cameras went up all over the shop. Absolutely no blind spots, crystal clear HD camers, we know this because our boss has a TV screen above his desk now where he can watch all the cameras. He can have up to 8 of the camera feeds on his screen at one time and it has the ability to cycle though all of the feeds, switching feeds every few minutes. \n\nThe problem came about a week ago when a coworker of mine came up to me and told me there was only one feed on the screen. Me at my machine. I have never been written up or even talked to about problems with my work so I was very thrown off by this. When I had the opportunity where I could think of a reason to go into his office to see for myself when I walked in his office sure enough I saw my empty station on the screen. I pretended not to notice and just asked a question about a part I was working on that could be a reasonable question and went back to my work like nothing was wrong. Over the next week or so I tried to put it out of my mind but I couldn't get past it and more coworkers approached me and said they saw me on the screen. \n\nSo late last week I went to HR and asked if I was in trouble for anything. The HR guy looked surprised and asked me what I was referring to and I told him how closely I'm being watched and it seems to be just me singled out. He said he would look into it and get back to me but as far as he knew there was nothing wrong. About an hour later I get called into the managers office with HR, screens are back to normal showing 8 different work areas. I'm happy for a second until I am asked why I'm spreading misinformation. I ask what they're talking about and I proceed to be gaslighted for the next 5 or so minutes about how the cameras have always been this way and I'm seeking attention. I say multiple coworkers have mentioned to me about seeing it and we can bring them in to ask. They threaten to write me up if I keep bringing up this \"blatant lie\" and that I'm slandering the manager to my fellow coworkers.\n\nI contact a lawyer cause at this point I'm like fuck it I'm going to quit this job anyway might as well raise a little hell but then part of me decides it's just not worth it and with everything I've been through lately its just not worth it. I decided to contact my ex who I've been broken up with for a year and fill him in. We we're together for 5 years and he's the love of my life, about a year ago he was offered his dream job across the country and asked me to go with him. My mother was dying of cancer at the time and I was the only one she had left to take care of her. He planned on turning down the job to stay with ne but I told him I'd never forgive myself if he passed on his dream job for me. About 6 months ago my mother passed and idk why I didn't contact him but it kinda felt like my whole world fell apart so I just accepted this was my life now.\n\nWhen I told him what was going on he said \"why don't you come move in with me?\" I didn't know it but he hadn't dated anyone since we broke up (and neither had i) because he had always planned on us reuniting after my mother passed and when she did he didn't want to rush me cause he wanted to wait until I was ready. I wasn't ready at all until he asked me that question but without hesitation I said yes. I put in an application that day at a CNC shop near where he lives and that was yesterday. So that's where this post was going to end on am I over reacting for picking up and moving across the country. And then the phone rang.\n\nApparently the place I was hiring was impressed with my years of experience and they're a newer shop so I actually have more experience running a brake then most of their employees. They offered my about a 25% raise of what I'm currently making and I accepted on the spot. They asked when I could start and I said next week. Immediately called my boss and told him he's a fucking creep and that I quit. HR has been calling me nonstop begging for me to reconsider but that ship has sailed. Ex bf or possibly just bf again said he's excited for me to move in but will be setting me up in a separate bedroom at first just so we can take things slow and figure things out which I think is very smart of him and I'm glad cause I think we need that time too.\n\nMy current landlady is an absolute sweetheart and knows how rough this year has been for me so she's letting me break my lease with no penalties and she already has someone lined up to take my apartment. I asked if they wanted to buy some of my furniture since I'm only taking what I can fit in my truck and they offered me a thousand buck for my living room set and all my drawers and dressers. Not having to worry about all that I can fir the rest of my stuff in my truck easily and I'm starting my cross country trek tonight. Fuck creeps and if you're thinking about putting up with that bullshit, don't. There's always another option, maybe even one youd.never thought possible.\n\n\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "My boss keeps a camera feed of me going for a week.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j48nfz/my_boss_keeps_a_camera_feed_of_me_going_for_a_week/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 17:22:42 UTC",
    "id": "1j48djq",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 3,
    "score": 1,
    "secure_media": null,
    "selftext": "I always feel guilty. I know it's not others fault or my fault but I do. When I'm alone with guys my age I kinda panick on the way there. I feel scared and it isn't there fault so I feel guilty. I get there and I'm always so tense until a while and I remember they won't hurt me and than I have hallucinations in my room or terrible dreams and I wake up and all I feel is guilt. I hate it so much even worse Is my problem is always there and  I move on but I end up back where I started scared and guilty and it's hard to tell anyone.",
    "subreddit": "TrueOffMyChest",
    "title": "I feel guilty and I don't like why I do",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j48djq/i_feel_guilty_and_i_dont_like_why_i_do/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 17:13:53 UTC",
    "id": "1j485ht",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 2,
    "score": 6,
    "secure_media": null,
    "selftext": "If I put \"(ex's full name) criminal\" a court report from 15 years ago pops up as the first search result. Highlights include \"attempted rape, strangulation, busting a locked door down, throwing a glass at the victim, trying to hunt her down when she hid in a neighbors house\" I am so fucking glad I broke up with him for cheating and posting my nudes under a body shaming site. Fuck that asshole... he's stopped harassing me at work ever since I threatened to pepper spray him/ beat his ass if he didn't stop pestering me.",
    "subreddit": "TrueOffMyChest",
    "title": "Recently found out some glaring details about my ex.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j485ht/recently_found_out_some_glaring_details_about_my/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 16:48:47 UTC",
    "id": "1j47j8o",
    "link_flair_text": null,
    "media": null,
    "num_comments": 62,
    "score": 43,
    "secure_media": null,
    "selftext": "Hey guys. Throwaway account here—I (20F) just want to vent after a trip to the mall recently that legitimately made me realize just how much my body has changed. I tried on a dress in the size I was last year, and after I tried to force the zipper and it didn't work, I felt so disgusted with myself. \n\nI weighed myself on my scale for the first time in a while and realized I'd gained about 50 pounds in less than a year. I'd just started college, and a healthy eating and exercise routine I'd gotten into in my senior year of high school went down the drain during my first year as I began drinking more, getting takeout and eating out at least 4+ times a week, and not exercising (trying to balance a crazy social life with academics was just not something I was cut out for). \n\nThis year, I'm getting more into home cooking, exercising, and staying away from junk foods, but whenever I feel like I'm making progress I end up relapsing for some reason. For example, I made excuses during exam season and ended up getting a lot of takeout again, ruining my progress. Whenever I go out with friends or am with family, I feel too embarrassed to mention I'm trying to diet because I'd always been the chubby kid growing up, and I wanted to continue living as the \"thinner, glowed up\" person I'd become when that isn't who I am anymore. As a result, I end up eating a lot during hangouts or just giving in to temptations. I also sometimes have the bad mentality of \"I ate something unhealthy today already, might as well just use today as a cheat day\" way too often. \n\nOverall, this isn't just about the weight gain itself: I feel like I've lost the discipline I once had and my self-confidence just keeps slipping away. It's been a week or so after a stressful life season, and I'm attempting to start this process again. I'm now 3 days into my new routine of encouraging myself to get out more as well as eating healthier and reducing portions, and I've been seeing some good calorie deficits without even feeling too worn out. I hope I can keep up the progress this time. I need to do this for myself, not only for my physical appearance, but my mindset and to re-instill discipline. I'm not trying to make excuses, just ranting about everything here to get it off my chest. If anyone sees this, thanks for reading! ",
    "subreddit": "TrueOffMyChest",
    "title": "I gained 50 pounds in a year and feel miserable about my body",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j47j8o/i_gained_50_pounds_in_a_year_and_feel_miserable/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 16:07:06 UTC",
    "id": "1j46iy7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 0,
    "secure_media": null,
    "selftext": "I (14M) and my friend (14F) have been friends since childhood. People say that we are both attractive for our ages and because of that we often get shipped as a couple by our other friends. It doesn't bother me that much because I am used to hearing stuff like this. My father, however, gave me some requirements for marriage and they are odd. One of the requirements is my partner can't be the same age or older than me. The thing is, when we started talking over text, things escalated. Now we call each other romantic names. And the topic of us having children came up more than once. And there is also my friend (2 years older than me. Let's call him WILLIAM) and WILLIAM has feelings for my friend (F). But the guilt is eating me out. My parents gave me freedom and I am misusing it. Though we read in different schools, our friends and mutual friends know about us. Her friends often flirt with me for being very handsome. Though my face is one of my biggest insecurities. Yesterday I was in the bathroom of our community hall. And I saw her. She said hello, I said too. We talked and she started flirting with me. I didn't find it weird since she has done it more than once, so we were in the bathroom and she suddenly asked me \"Will you kiss me?\" I paused. And when I did, she came over and gave me a kiss on the cheek. I blushed so hard that when my mom noticed she said \"what happened, why are you blushing?\" I couldn't tell her the real reason, so I made one up. Next day she messaged me to meet in the same place. I went thinking she surely couldn't do it again. When I met her we talked for a few mins and she asked if I could kiss her as well. I didn't wanna hurt her but at the same time I am afraid of my parents. So I kissed her on her hand. She was happy, I was too, but deep down, I was dying. Now I am sitting in my room thinking, should I confess my feelings for her or should i tell abt my feelings to WILLIAM. I have to make a decision quick because this secret is something I cant hide forever.",
    "subreddit": "TrueOffMyChest",
    "title": "I am in a situtionship and don't know what to do",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j46iy7/i_am_in_a_situtionship_and_dont_know_what_to_do/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 16:03:05 UTC",
    "id": "1j46fh7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "Same as the above. I’m 33F and I think I’m stuck or in a funk or whatever.\n1. Had two bad relationship in my twenties (sex*** coercion etc) and have sworn off men and relationships. It doesn’t seem very much better for anyone around me.\n2. Was sexually harassed while doing my post graduate in a male dominated field and it seems like that’s all colleagues associate me with since then. The victim of the pervert. \n3.Stuck at the same job since 6 years. No tenure or chance of promotion till then. Feel like a junior even though I have paid my dues. \nDoes it get any better ever? Sorry for the question. Life just seems to be in a rut lately.\nI know people may suggest therapy and I’m aware I need it. I just can’t seem to take that jump. ",
    "subreddit": "TrueOffMyChest",
    "title": "How do you get used to being disillusioned with life?",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j46fh7/how_do_you_get_used_to_being_disillusioned_with/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 15:58:45 UTC",
    "id": "1j46bn8",
    "link_flair_text": null,
    "media": null,
    "num_comments": 188,
    "score": 7277,
    "secure_media": null,
    "selftext": "So, this happened 3 years ago. But it hasn't left my mind. I (23 F) at the time, proposed to my fiancee (25 M) at the time. After I proposed we got into the car and called my family and his to tell them the news. I called my grandma first then my granny. Then we called his mom and dad. Then I called my parents.... I asked my mom to put me on speaker and it went as followed.\n\nMe: Momma, Daddy, I'm getting married!\n\nMom: I'm not paying for it.\n\nMe: ...... Okay?\n\nDad: Congratulations missy.\n\nFollowed by a awkward uncomfortable pause. Then I just told them we had to call other people and hung up... my fiancee and I looked at each other in disbelief. I knew growing up that I wasn't the favorite but... I never asked for anything or that I wanted them to pay for it.... it just broke my heart... Only my husband and best friend know she said this to me... I'm already low contact with my parents...",
    "subreddit": "TrueOffMyChest",
    "title": "I proposed to my fiancee and this is what my mom said when I told her.....",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j46bn8/i_proposed_to_my_fiancee_and_this_is_what_my_mom/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 15:53:29 UTC",
    "id": "1j467az",
    "link_flair_text": null,
    "media": null,
    "num_comments": 26,
    "score": 0,
    "secure_media": null,
    "selftext": "I've been a \"gamer\" for 20+ years. Last year in quit over the course of a few months and haven't looked back. On the other side of gaming culture, when I look at it, it's just people screaming about \"DEI\" in video games and constant complaining about every aspect of gaming. Games are too long, they're not long enough. They are too big, too small, the worlds are too busy, too empty. \n\nThen there's all the meta-news about the industry and hardware. If you were to believe the average gamer at face value, the status of Nintendo's next phone-with-joysticks is more important than their own personal safety. \n\nI've just never seen a group of more first-world entitled assholes in my life -- and I into the fountain pen and mechanical watch world.\n\n---\n\nVideo games are just a crutch. As addicting as any other consumerist bullshit, but they also suck away hundreds and thousands of hours of one's life each year. ",
    "subreddit": "TrueOffMyChest",
    "title": "I quit video games about a year ago. It's been truly amazing.",
    "upvote_ratio": 0.3,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j467az/i_quit_video_games_about_a_year_ago_its_been/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 15:20:28 UTC",
    "id": "1j45g1n",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 13,
    "score": 0,
    "secure_media": null,
    "selftext": "I (14f) dress in a more alternative style (I'm goth but when trying to be comfortable switch over to grunge). As we all know, A LOT of alternative music is very 'depressing' if you can call it that, I think everyone understands. A large portion of alternative teens is also.., severely depressed. \n\nI met most of my alternative friends in the psych ward, or through friends of friends. I love them, they're fun and I used to feel like they understood me. I was in said psych ward for self harm and suicide about a year and a bit ago and yes, I still have my moments but I have learnt to manage my emotions, weaned off self harm and am no longer suicidal. I have been taking meds for depression and anxiety, but I got taken off a while ago and I am doing fine. I no longer have that 'what's the point of anything' outlook on life. I look forward to graduating, getting married, becoming independent and having children. I still have my fleeting problems with anxiety but as mentioned, in the long run I'm FINE. \n\nA lot of those friends have not gotten better. But not in the sense that they haven't been able to. I have been speaking to them and they have expressed that they don't want to get better. They are content being depressed. They also consume sad media constantly, like movies and music, and they're OKAY with that. \n\nI, though, have grown not so fond of it. I love them but I feel like I can't be around people that don't want to get better. I don't think it's a good influence to hang out with severe addicts. I don't want it to seem like I am abandoning them because they're too hard to deal with, but I don't want to put myself in friendgroups with alcoholics, people who are severely depressed and people who are constantly NEGATIVE. \n\nI came to this conclusion when one of my friends reccomeneded smoking to get rid of my problem, and I think that's when I knew that this is not the enviorment I want to be in. I just can't keep listening to the same problems over and over again when they don't want or care to fix them. \n\nI'm also starting to grow out of the alternative style. I'd rather wear bright colours and make myself look as colourful, joyful and feminine as possible. The goth make up is something I'm not into either anymore, I just don't like having people stare. \n\nNow, I recently turned to God and my friends have been.. not accepting. I told my best friend I wanted to try religion again and she got mad. She said I was abandoning her in atheism and \"Who will we hate on Christians with now?\" She doesn't like the idea of me going to church or ordering a Bible. We have had multiple arguments about this. She also recently did something controversial that I won't get into. I said I was reconsidering our friendship because of it and when she asked why I stated my reasons and added that I don't think her actions align with the type of people I should be surrounding myself with according to scripture. She got mad and blocked me. \n\nI'm sick of being misreable, sick of acting like nobody understands and sick of acting like I'm some tortured poet. I'm not. They're not.",
    "subreddit": "TrueOffMyChest",
    "title": "I'm sick of being alternative, different and miserable. Am I finally maturing?",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j45g1n/im_sick_of_being_alternative_different_and/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 15:17:00 UTC",
    "id": "1j45d9i",
    "link_flair_text": null,
    "media": null,
    "num_comments": 12,
    "score": 13,
    "secure_media": null,
    "selftext": "around two weeks ago i was doing my laundry as usual and i found this thing in the washing machine. it looks like a tooth/crown, there is some glue at the bottom. i asked my flatmate if she lost a tooth because i know i didn’t and even my cousin who was staying over at the time, but no, it’s neither of theirs. we live in a rental flat, but this is a brand new washing machine we got in 2023, no previous owners, so it can’t be from the previous tenants or owners. our washing machine is in the kitchen in our flat and not in a communal washing kitchen so i’m honestly just puzzled and slightly spooked. does anyone have any ideas on where they could be coming from? do i need to sage the entire flat and move out?",
    "subreddit": "TrueOffMyChest",
    "title": "Teeth belonging to no one in my laundry?",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j45d9i/teeth_belonging_to_no_one_in_my_laundry/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 15:14:05 UTC",
    "id": "1j45av7",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 6,
    "score": 9,
    "secure_media": null,
    "selftext": "This happened two years ago and I still cry when I think about this. I had a coworker at one point who had very thin boundaries - she would consistently causally trauma dump at work without regard to how it affected others and mostly coped with her trauma through drinking. I’m fairly certain she was drinking at work, but never saw her take swigs. Just saw her acting intoxicated and smelling like alcohol. I grew up with an alcoholic parent, so her behavior was fairly uncomfortable for me to be around, meaning I did not get close to her even though she shared many very private things with me. I almost wish I had invested in her more just so I would know more about her family - maybe I would have had enough information to intervene if I had befriended her. \n\nOne day, her niece came in to work with her. This little girl was probably about 5. When she walked in the door, she had her hands cupped around the sides of her face so she could only see the ground in front of her. She made no eye contact and would not verbally respond to anyone, including her aunt. \n\nThis was the angriest child I have ever seen. She glared at everyone, held her hands in fists for almost the entire time she was there, stayed completely silent, and kept her back to the wall for the majority of the time she was in the shop. I’ve been through a lot of trauma therapy and it was very obvious to me that this child was hyper-vigilant if not in fight or flight. \n\nAfter the child was picked up by another family member, I stepped outside for a smoke. My coworker, the aunt of the child, was already outside smoking. \n\nI sat down next to her and she casually said to me “my niece told her friend that someone licked her hooha.” It was like cold water had been dumped over my head as she told me more about it. I felt so sick for so many reasons. A FIVE YEAR OLD told their friend that someone licked their private parts, that friend told her mom, who told my coworker’s niece’s parents. And no one was doing anything actionable. No therapy, no intervention, no questions. Just shrugs and “hope that’s not actually happening”. \n\nAfter my shift I called child services and went to the police station by my work. I tried everything I could to get a report filed, a welfare check done, literally anything. Because I didn’t have the name of the child’s parents, the police AND child services told me I didn’t have enough information to complete a report. I called so many times with different ideas of how I could make a legitimate report, but I simply didn’t have enough information. \n\nI think about this multiple times a week, sometimes every day for the entire day. I myself am someone who survived CSA. I have complex trauma and I know what it’s like to be a child in a setting where no adults are protecting you, even when they know what’s going on. \n\nOur boss commit suicide that same week, so everything at that work place became even more chaotic very quickly. I left because I could not cope with the instability. Part of me wishes I had stayed just to garner more information, but that work place was so toxic that I started to experience suicidal ideation. I had to leave for my safety. Now that I’m farther removed from the experience, I feel like I could have pulled myself up by my bootstraps and stayed long enough to get more info for the sake of this little girl. \n\nI’m not sure why I’m sharing this. Yesterday this popped up in my head for the millionth time and I had such a strong reaction to the memory that I vomited. I will never be able to get the image of that little child’s angry face out of my head. I don’t think I’ll ever forget her and I will always wonder if there is something I could have done to help. ",
    "subreddit": "TrueOffMyChest",
    "title": "Coworker shared with me that her niece is being molested and no one is doing anything about it",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j45av7/coworker_shared_with_me_that_her_niece_is_being/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 15:13:22 UTC",
    "id": "1j45aak",
    "link_flair_text": "Positive",
    "media": null,
    "num_comments": 3,
    "score": 25,
    "secure_media": null,
    "selftext": "So to reddit I go! \n\nI've finally lost 10lbs (out of my goal of 20) and can fit in my favorite pants again. It took a few months of adjusting diet and exercise but I'm on the right track now and I think I've got sustainable healthy habits going on so this should be long term. \n\nThat's it, that's my personal happy I just had to crow about somewhere I wouldn't be annoying folks I know irl. \n\n",
    "subreddit": "TrueOffMyChest",
    "title": "I'm happy and have no one to share with",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j45aak/im_happy_and_have_no_one_to_share_with/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 14:49:57 UTC",
    "id": "1j44reh",
    "link_flair_text": null,
    "media": null,
    "num_comments": 154,
    "score": 809,
    "secure_media": null,
    "selftext": "I’ve gotten to the point where I am applying for jobs I’m overqualified for and still getting rejected before interviews. \n\nI used an AI service to help with resume and cover letters with the buzz words that everyone loves in my industry. I’m at a complete loss. My workplace filed for chapter 11, our pay was cut in half and I’ve been looking for the last 6 months. The only time I make it all the way through the funnel is if the job is garbage or commission only (SLAVERY). So obviously I’ve wasted a ton of resources running around to interviews.\n\nMarch is now the first month I haven’t been able to pay my rent. My credit is maxed out from my bills last month and I plotted a week long vacation next week because I simply can’t afford the commute due to being paid bi-weekly. I’d love to use that little time I have for pleasure but it’s going toward crisis.\n\nWhat the fuck? \n\nEdit: I am in sales and I’m applying for any work at all, full time included.",
    "subreddit": "TrueOffMyChest",
    "title": "What the actual fuck is the job market in the US",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j44reh/what_the_actual_fuck_is_the_job_market_in_the_us/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 14:39:44 UTC",
    "id": "1j44jhj",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 95,
    "score": 918,
    "secure_media": null,
    "selftext": "20 years ago, I was a stupid teenager in love. My boyfriend was 23 and I was 16. Things started out great, but they progressively worsened as he introduced me to drugs. By the end of it all, I was working for an escort agency, giving the boyfriend my money. I was bullied and forced into fucking old men and I was scared to leave my relationship. My parents finally found me (I had run away) and managed to get me help. I turned things around and ended up doing well in life. I never told anyone what had happened and I had planned to take it to my grave.\n\nFast forward 15 years (5 years ago), a detective knocks on my door. He wanted to know about my ex and the sex trafficking. I reluctantly spoke with him and agreed to do some recorded phone calls at the police station in order to get a confession. I also turned over my high school journals that detailed the abuse and rapes. We recorded a two-hour confession that detailed everything. It felt like a slam dunk. That was 2 years ago.\n\nGuys, it's been 5 years and I am tired. I am tired of waiting 3-6 months to hear back from the detective. I'm tired of having to tell and retell my story to different detectives. The further I get away from it, the less I remember, and the less credible I sound. I'm tired of worrying about my safety, and if people will even believe me. And I'm tired of getting my hopes up, only to hear back from the DA that they're working on more pressing matters. I get that my case is \"old news\" and not a priority. I don't begrudge the detectives for prioritizing more current, relevant cases. But I'm tired of advocating for a win that I don't think I'll ever see.\n\nSo today, I will be emailing the detective and asking them to drop the case. I wanted to hang on because I wanted to get this dude on the sex offender registry, so that other girls wouldn't have to go through what I did. But I can't be a martyr and sacrifice myself any longer for this cause.\n\nI have no one to talk to about this. And I just need to say that I'm sorry, and I tried :(",
    "subreddit": "TrueOffMyChest",
    "title": "Today is the day that I drop the charges against my rapist",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j44jhj/today_is_the_day_that_i_drop_the_charges_against/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 14:26:11 UTC",
    "id": "1j4495t",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 0,
    "secure_media": null,
    "selftext": "When I was 14 I was online groomed by a 21 year old. While we never met and had sex (he tried hard to get us to meet) we would video call which was always sexual. He could have hundreds of pictures or videos of me nude. It lasted a year before the relationship ended. Started again when I was around 17. Not a lot of sexual stuff but very verbally abusive cause I wouldn’t.  Completely ended when I was 18 cause my now husband helped me realise the whole thing was unhealthy. And therapy made me realise was grooming even though we never met. \n\nI’m 27 now and 3 weeks ago I had a miscarriage for a planned pregnancy. I’ve been numb or completely devastated since but I’ve started missing my groomer and having dreams about meeting him to talk. I don’t want to mention it in therapy and I don’t want to tell my husband. We both know these feelings can pop up while I’m going through therapy but the timing is so messed up that I would feel so much more shame and guilt about everything if I spend any time talking to professionals or someone I love about it. I understand I have to work through the grooming and I mostly don’t talk about it even in therapy but why now? Why do the feelings and dreams come now at the worst time. Why do I miss him?",
    "subreddit": "TrueOffMyChest",
    "title": "I miss my groomer after I just had a miscarriage.",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4495t/i_miss_my_groomer_after_i_just_had_a_miscarriage/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 14:25:06 UTC",
    "id": "1j448cy",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 0,
    "secure_media": null,
    "selftext": "I've been having some pretty bad Existential OCD recently which (thankfully) I'm beginning to overcome slowly. But one thought that came during this experience just won't leave my mind. The fact that I'm able to see and perceive things and have eyes in general is really fucking weird to me. I don't like having eyes. I don't know why this happened or why I'm even thinking like this, but when I think about the fact that I have eyes, it makes me so uneasy. Does anyone else feel like this?",
    "subreddit": "TrueOffMyChest",
    "title": "I have an irrational fear of my own eyes",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j448cy/i_have_an_irrational_fear_of_my_own_eyes/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 14:23:02 UTC",
    "id": "1j446sl",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 4,
    "secure_media": null,
    "selftext": "I just have to write this down and the things I have been feeling for the last 4 weeks. I think that my mental health has been plummeting really bad and I just don’t know who I can talk to anymore. \n\nIt started when I have been having chest pain for the last two months or so then about three weeks ago I was hospitalised due to that chest pain. The diagnosis given was due to GERD and I have really severe case of GERD. Hospitals in general has always been very depressing for me and while I was stuck there, it definitely feels lonely. \n\nMy loneliness amplifies when the people I am surrounded with doesn’t acknowledge me as much anymore. I am in college and I have a group of friends including me there’s 5 of us. While I was not with them, the 4 of them did stuff together and went on to have sleepovers. I think what hit the most was that none of them says they wished I was there. It was simply a thing they did between them and then it was never brought up again. \n\nIt becomes more evident how used they are already without having me around. They made plans without including me. Even though, I was there. It would be nice just to get an invitation. I assumed they didn’t ask because I might not be able to make it due to transportation issues. \n\nI wish I was a little more seen. \n\nI’m sorry if this is all over the place, I just need to let it out somewhere. ",
    "subreddit": "TrueOffMyChest",
    "title": "been crying myself to sleep",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j446sl/been_crying_myself_to_sleep/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 14:14:55 UTC",
    "id": "1j440kq",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "I wish I could tell you how I see everything much clearly now. I know I became very abusive towards the end and I was trying to be better once I realized but it just wasn’t enough. Even though I was holding on to past hurt from you and others there was no reason for the way I started to treat you. I was verbally abusive to you and that wasn’t okay, dumping my emotions on you every time things didn’t go my way wasn’t okay. And I deeply apologize for everything I ever did to hurt you. I understand why you never want to hear from me again and that crushes me everyday. I wish you had the same realizations of how you were hurting me and I wish we could’ve moved past everything before it went this far but I was stubborn and selfish. The way we ended I couldn’t have ever imagined and I’ll remember this feeling forever. You included an unknown third party in our break up and I will never understand that but maybe it had to happen that way. Thank you for loving me the best you could, I’ll remember you always. \n",
    "subreddit": "TrueOffMyChest",
    "title": "dear I,",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j440kq/dear_i/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 14:09:04 UTC",
    "id": "1j43w5m",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 50,
    "score": 42,
    "secure_media": null,
    "selftext": "I don’t know where to start. I found out two hours ago and my emotions are everywhere. My mind’s racing and my heart is breaking all over again. \n\nThis man… I so badly wanted us to work out. I so badly wanted us to grow old together, have more kids, have more stability, find peace within each other. But I was wrong again like the two times before. He’s never going to love me the way that I love him. He’s never going to respect me the way that I respect him. I love him so much and all i want to do is sweep it under the rug again… but I don’t think I should do that anymore. I don’t know. \n\nThis information comes at a time where I am questioning if I should be alive. My kids deserve a better mom. They deserve a happy one that doesn’t constantly fight with anxiety and depressing thoughts. Maybe that’s why he cheated? Maybe that’s why he went out of his way again to look for more women… to find someone who is everything he wants cause clearly I am not that someone. I am nothing and he just reminded me of that. I hate myself for being so weak. I am so scared. I am terrified of confronting him when he gets home from work. I am so afraid of tearing apart my family all because he can’t be loyal. Why can’t he just be loyal? \n\nWhy do this to me again? What did I do to deserve such treatment and lack of care? What is so wrong with me that he just can’t be loyal to?\n\nMaybe it’s because I’m a stay at home mom? \nI don’t have a career and that’s the women he chases. Everything I own, he bought for me. We’ve been together for 4 years. I’m so tired. I know this seems like I’m being dramatic, but I loved this man. He was my person. I could take hurt from anyone but him. I could’ve braved any storm with him by my side… and now I have to go at it alone. I don’t know what to do. Someone please help me. I don’t want to kill myself, but I want to die. I want to disappear. How do I stop these feelings? These thoughts? I’m so fucking sad. \n",
    "subreddit": "TrueOffMyChest",
    "title": "He cheated on me… again.",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j43w5m/he_cheated_on_me_again/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 14:04:16 UTC",
    "id": "1j43sjb",
    "link_flair_text": null,
    "media": null,
    "num_comments": 11,
    "score": 12,
    "secure_media": null,
    "selftext": "I am so frustrated with myself and my life right now. Everything came crashing down in December when I was let go from the job I had and loved for almost 10 years. The reality of my situation hit me like a bucket of cold water and has left me shocked and almost paralyzed into such a pit of despair and depression. I feel worthless and useless. I have applied to so many jobs that I have experience for, education and certification on and even used ChatGPT to modify my resume countless times. I have received 0 interviews! Nothing! Nada! What the hell man?! How can it be that I am good for absolutely NONE of these jobs? I am so frustrated. I never considered going into business for myself until now but I am scared. If i fail, I just don’t know what I will do. I have a family, kids that look up to me and a husband that has been incredibly patient. I just don’t understand what I’m supposed to do now or where to go from here. I’m sinking. I can feel myself falling into a void. And I’m scared of what’s to come if I don’t find a way out of it. ",
    "subreddit": "TrueOffMyChest",
    "title": "I hate my circumstances right now",
    "upvote_ratio": 0.88,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j43sjb/i_hate_my_circumstances_right_now/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 13:45:50 UTC",
    "id": "1j43ek1",
    "link_flair_text": "Positive",
    "media": null,
    "num_comments": 9,
    "score": 1,
    "secure_media": null,
    "selftext": "\n\nSo today, my friend called me while I was in an online game (Mobile Legends). The problem is, whenever I get a call, my 4G+ drops to H+ and my game starts lagging, which is a huge deal in a game like MLBB where being AFK can ruin everything. So, I hung up. He called again, and I hung up again.\n\nNow, for some reason, both he and another friend are acting weird toward me—like they’re purposely cutting me off. They avoid me, walk ahead of me but constantly look back to check if I’m gone, and just overall act distant.\n\nThe part that really got me was when I asked for a cigarette. They claimed they didn’t have any, but they were literally heading to our usual smoking spot. Another friend (who isn’t aware of what’s going on) also asked for a cigarette, and I saw them looking back at me, almost like they were waiting for me to leave before giving him one.\n\nAt that moment, I knew they were avoiding me. So, I walked up to them quickly and made an excuse that I needed to go cook. One of them realized that I had caught on and started feeling bad. As I was leaving, he suddenly said, “Wait, maybe he has some.” It was like he was trying to make up for it, but it just confirmed that they were avoiding me in the first place.\n\nWhat bothers me the most is that I’ve always been there whenever they called or asked me to hang out. But the one time I decline, they start treating me like this? I don’t get it. If they were upset that I didn’t answer, why not just say something instead of acting all passive-aggressive?\n\nAm I wrong for feeling betrayed by this?\n",
    "subreddit": "TrueOffMyChest",
    "title": "I Feel Betrayed by My Friends Over Something Stupid - Am I Wrong?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j43ek1/i_feel_betrayed_by_my_friends_over_something/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 12:55:19 UTC",
    "id": "1j42ewg",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 4,
    "score": 0,
    "secure_media": null,
    "selftext": "The whole thing happened over 10 years ago, and I had actually repressed the situation pretty well until my ex messaged me again recently. Now I think about it every day and have panic attacks because of it.\n\nBack then, we weren’t together yet, but he knew that I was in love with him. One evening, we were at his best friend’s place, and the two of them were smoking a bong. They wanted me to smoke as well. I asked what it was, and they said weed. Being stupid, I took a hit, but whatever it was, it definitely wasn’t weed. At first, I got extremely dizzy, then I couldn’t move anymore, and I started panicking inside because I couldn’t speak or even breathe.\n\nAfter about 10 minutes, his best friend told him to check if I was still breathing, which he did. When he confirmed that I was still breathing, the other guy left the room to go to sleep. That’s when my ex started undressing me and then had sex with me. It must have lasted for several hours, and towards the end, I was somewhat conscious again and could have said something. But I didn’t—I just couldn’t.\n\nAt some point, he stopped, and I went home. I had never felt as horrible lying in my own bed as I did after that night. Afterward, I desperately wanted to be with him—probably because I thought it would somehow undo what had happened. About a year later, we actually got together.\n\nBut maybe I’m overinterpreting the situation. After all, he knew I loved him, so maybe he thought I wanted it too. \n\n\nI’ll probably talk to my therapist about it, but I’m afraid I’m making it into something bigger than it actually was. Besides, it was my fault too. I don’t know, I just wanted to get it off my chest.\n\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "It feels like I was SA'd even though it probably wasn't sa",
    "upvote_ratio": 0.25,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j42ewg/it_feels_like_i_was_sad_even_though_it_probably/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 12:47:59 UTC",
    "id": "1j42a49",
    "link_flair_text": null,
    "media": null,
    "num_comments": 19,
    "score": 33,
    "secure_media": null,
    "selftext": "I have never really thought about kids. For me having kids is not the goal but rather the outcome. Like I want to have kids with a loving partner whom I have a healthy relationship with. But how would I be in a healthy relationship if I don’t even know how one looks like? My parents had a very toxic marriage and my relationships with both of them are bad and getting worse. I don’t respect either of them. They’re both very hysteric and unstable. I can not forgive them for how they used and continue to take everything out on me specifically (since I’m the eldest child). I have major anger towards them. \n\nI have almost given up on the idea of meeting anyone, cause I’m not even sure I’m capable of being a loving partner or interested in having children who might resent me as much as I resent my parents. It’s a constant thought loop that I can’t get out of. A loop of shame, anger and hopelessness. ",
    "subreddit": "TrueOffMyChest",
    "title": "I resent my parents too much to have kids…",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j42a49/i_resent_my_parents_too_much_to_have_kids/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 12:45:46 UTC",
    "id": "1j428ri",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 22,
    "score": 81,
    "secure_media": null,
    "selftext": "I posted on here about four months ago.(you can go read my other post before this one if you want) My dad had Cirrhosis of the liver due to years of alcohol abuse. He was diagnosed with it back in September of 2024 and has been in and out of the hospital since then. It started off with his liver failing and slowly went to his kidneys starting to fail. His feet, legs and stomach were pretty much always full of fluid that he was constantly needing to go get drained and he was always in pain. He went into to hospice about a week ago and one of his last wishes were to be at home so my grandparents had the hospital bed and all the equipment set up at there house. Once he was at home In hospice he went down hill really fast. He was confused most of the time, and the rest of the time he was sleeping. \n\nI got a call from my grandfather around 8:30am on Monday that I needed to get over there as fast as I can because they didn’t think he wasn’t going to make it much longer. I got over there around 10:30am and honest to god wasn’t prepared for how horrible he looked. He went down hill so fast. His oxygen levels were at 30% and his heart rate was 45bpm. My grandma cranked up his oxygen and was able to get it back up to 94%. His eyes were open but you could tell he really wasn’t seeing anything. He could hear us but couldn’t talk, he could hardly breathe,every breath he took was a gasp and then nothing for a second and then a gasp again. All the immediate family was there, talking to him to let him know that we were there and that we loved him. It got to the point where we couldn’t even get a BP reading on him and his finger monitor for his O2 and HR weren’t getting readings as well. He passed away about four hours after I got there on Monday, March 3rd at 2:02pm. Him taking his last breath will forever be stuck in my head. \n\nThank you to whoever decided to read this, I just really needed somewhere to write down what happened. It still doesn’t feel real. ",
    "subreddit": "TrueOffMyChest",
    "title": "My dad passed away two days ago due to alcohol abuse.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j428ri/my_dad_passed_away_two_days_ago_due_to_alcohol/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 12:12:58 UTC",
    "id": "1j41o9u",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 3,
    "score": 3,
    "secure_media": null,
    "selftext": "Why can’t the world accept that I’m just an ordinary person? There are plenty of elite, hardworking people out there, and that's fine—but what's so wrong with me choosing a simple life? It’s not like I’m committing crimes or hurting anyone.\n\nMy leader keeps telling me I'm \"not qualified.\" But I do my job. I just won’t sacrifice my life working overtime. And because of that, I’m treated like I’m worthless. My job feels miserable. So, I started looking for a new one.\n\nTurns out I can’t find one. All I want is a decent job—two days off, eight hours a day. Is that really too much to ask? What did I do wrong?\n\nI’ve never done anything illegal, never hurt anyone. So why do I deserve this? My leader keeps calling me a loser. Fine. I planned to leave this toxic environment and find something better. But now, I can’t even find a new job. Does that mean I really *am* a loser? Yes, just because I’m not “good enough” by their standards, I suddenly become worthless; all my dreams and my personality and my value mean nothing anymore.",
    "subreddit": "TrueOffMyChest",
    "title": "I’m just an ordinary person",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j41o9u/im_just_an_ordinary_person/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 11:54:22 UTC",
    "id": "1j41czf",
    "link_flair_text": null,
    "media": null,
    "num_comments": 48,
    "score": 0,
    "secure_media": null,
    "selftext": "\nFor the context, our love felt more beautiful than anything I’d read in books or seen in movies, deeper and more real in a way that’s hard to explain. Part of it was because we both had real trauma growing up, which made us so similar. We bonded so purely and beautifully, expressing our truest selves to each other. It was more than I ever could’ve dreamed of. Even our first kiss, after nearly a year of waiting, was unlike anything else, the world didn’t just feel like it stopped, it did. We were also overwhelmed, and he cried like babies as he kissed me. That’s the kind of bond we had.\n\nI never wanted long distance, so he promised he’d move to my city, but he never did, mentioning financial reasons. Still, he visited every few months, and we always looked forward to those moments. He even deactivated his socials on his own, though I never had any problem or concern with them. \n\nOf course, not everything was perfect. His one toxic trait: whenever things didn’t go his way, or we argued, he’d start disrespecting and insulting me. It was a dealbreaker, but I still tried to be understanding. He had no real human connections all his life. He never even got to talk much to his family because of it being dysfunctional, no close friends, zero experience in relationships. I told myself he just can’t do any better, or could be because BPD runs in his family, or maybe because of the traumatic environment he grew up in. \n\nBut now, for the last four months, things were rough. We even broke up for a few days, ironically after our first intimate experience. I felt insecure or anxious afterward (he was my first boyfriend, and I have a bit of sexual trauma too), but he misunderstood it, assuming I didn’t like it or didn’t want it again. After that, he changed, became indifferent, stopped reassuring me, and didn’t seem to care about the relationship at all or even if we break up. It reinforced my fear that he didn’t feel the same anymore, trapping us in a cycle of blame and misunderstandings. I had spent so many nights crying during that time. \n\nHe eventually felt sorry and we fixed things, but I had already noticed a red flag: he seemed to care about physical intimacy more than anything; and shut down when he thought he wouldn’t get it. So then I started noticing more. During this rough phase, he reactivated his accounts, made new ones and never mentioned even after we patched up, and tried to hide them when asked. It also started needling me for the first time that why had he never added me on his instagram and its been so long we’re together, and I once saw a text from a coworker that felt off.\n\nI couldn’t ignore it all anymore. So, I decided to have a sudden, intense conversation with him, hoping his reactions would reveal the truth. \n\nThen his reactions did reveal. A lot. Not just cheating or anything, but about his whole identity. \n\nI started asking, he was so confident with his grand words and said that I can have his passwords and his phone (because he knew I’d never do that I don’t believe in invading privacy in a relationship). He kept manipulating me into believing there was nothing, and I almost fell for it, he was that good. But then, we stumbled upon the conversation with his coworker. He initially refused to let me see it, then tried to manipulate the situation. When I finally read it, I noticed he had tampered with it. The last text had originally been 12 weeks ago, but now it showed 17 weeks ago. And then, the part that made my heart sink: them talking about how fun it would be when he will move to Germany, and how she would be waiting for him.\n\nThat explains why he was so excited and obsessed about moving there, it didn’t make sense to me. But I believed it could be because he’s travelling alone for the first time. Those texts were from months ago, right after he started that job. Now, five months in, i believe they must have something concrete going on. It’s pretty clear from the way he provided no further clarifications when I saw that and refused to show anything else (they converse usually on discord he could’ve shown that if he was real). \n\n\nBut what struck me even more than the cheating was seeing in real time, how good he is at manipulation. My friends warned me, but I never believed it. He seemed too pure-hearted. But that day, I saw it: how effortlessly he lies. I’ve never seen anyone lie that efficiently. Even when I was trying to ask, he turned down all of my questions with so great replies that I started feeling like “What am I even thinking?”\n\n\nHe was even at that time making a grand gift for my birthday. It included multiple handmade beautiful gifts including a scrapbook, different boxes each with different kinds of letters and tapes in it for different situations. He was even better with words, the things he said, and the way he made me feel. It’s driving me insane. How can someone be that person (and) be cheating at the same time?? It’s giving me a complete identity crisis. If he’s really this good at manipulation, like I saw yesterday, then none of his words were real. His entire personality was fake.\n\nHe was standing there so willing, so confident about giving me passwords or proving his loyalty. But the moment I “actually asked”, he changed completely. He stalled, started arguing and gaslighting, clearly, anything to buy time. He tried deleting chats right in front of me, thinking I wouldn’t notice, thinking he could gaslight me again. Maybe he was too frantic to cover his tracks this time, but it was so obvious. This time he was maybe too much in a panic to realise how evident his manipulation is or to control what I’m thinking. And I know the coworker thing is just the one thing I happened to catch. The way he deleted other chats before giving me a bit of an access, it all proves there was so much more happening, in those months. Until now. \n\nThis has traumatized me to the point where I feel like nothing is real. Like I’ll wake up and everything around me will be gone, like everything is in my head. I know this is just the trauma speaking, and hopefully, I’ll be okay soon. But it has shaken me to my core. If this is true, then everything—he—was a lie.\n\nHow can someone be so convincing, so manipulative? For the first time in my life, I’ve seen deception on this scale, and it’s terrifying.\n\nIn a nutshell I observed so big of a contradiction between what he is portraying so confidently and the real truth. And now I don’t know who he is.",
    "subreddit": "TrueOffMyChest",
    "title": "My boyfriend (26 M) was cheating on me (19 F). I feel I’m actually losing my grip on reality.",
    "upvote_ratio": 0.47,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j41czf/my_boyfriend_26_m_was_cheating_on_me_19_f_i_feel/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 11:51:04 UTC",
    "id": "1j41b1z",
    "link_flair_text": null,
    "media": null,
    "num_comments": 32,
    "score": 46,
    "secure_media": null,
    "selftext": "I've (17M) liked this girl for far longer I'm willing to admit. She's the most intelligent (it's actually incredible), she's sweet as pie, with a sense of humour as good as silver, and she's gorgeous. She's objectively the best. She's in a league that's hers alone. But what *actually* makes her special is the sense of bliss and hope her presence creates.\n\nIn June 2024, my then-best friend started talking to her—intimately—just two weeks after he stopped begging his ex (who he'd been super manipulative &amp; toxic to) to take him back. I trusted him when he insisted I was just being paranoid. Then, two weeks in, he became her first boyfriend. She had once hated him but dismissed his past behaviour as “just alcohol and family problems.” She believes he's the only one who understands her. He lied repeatedly, told her I liked her just before asking her out, and even lied that I had slapped him. I was humiliated. Looking back, he was always a sleazy friend.\n\nIt's been 9 months since. I've become increasingly lonely as I have to avoid most hangouts because for the sakes of my mental stability I cannot bear to be around my ex friend. The rest of my friend group seems unbothered. Neutrality is king.\n\nI feel I've been unremorsefully abandoned by everyone close to me in favour of some weasel who solely acts in self-interest with no regard for morality or empathy. I feel so disposable. It feel purposeless and as if the world were mocking all which I believe in. It's killing me. Every breath is exhausting. Living like this makes life itself unbearable.\n\nThe worst part is it's all my fault. I hate myself for it. I had so much time to be the one to connect with her, or even to just admit my feelings, but I never did. I promise it wasn't a lack of will but one of wit. I would've done anything, but I didn't know anything to do. I still don't really get the whole emotional connection thing. Maybe that's why I'm disposable.\n\nI don't know what to do with myself anymore, I'd appreciate any advice.",
    "subreddit": "TrueOffMyChest",
    "title": "I liked this girl and now I can't get over her. It's making life unbearable.",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j41b1z/i_liked_this_girl_and_now_i_cant_get_over_her_its/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 11:44:13 UTC",
    "id": "1j41749",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 1,
    "secure_media": null,
    "selftext": "I have just graduated high school and it is my first week of university. I’m studying a bachelor of social work, maybe it just because it’s the first week but with both the module and in class lectures/tutorials I feel as though I have learnt and know absolutely nothing, which is stressing me out. \n\nFor some of my class I have an assignment due in 4 weeks and I found that so crazy/wild because during this whole week I haven’t learn anything. I’m not sure if it just me and I just don’t know what’s going on or if it’s like this for everyone . But it’s also so awkward trying to make friends and the people I have meet I feel as though I am unable to click with them. \n\nNote taking is another thing in itself because I don’t even know how that works. \n\nThis is just a quick rant while also asking for any advice. \n\nAny advice is highly appreciated!! ",
    "subreddit": "TrueOffMyChest",
    "title": "I have absolutely no idea what is happening in University and it’s honestly stressing me out",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j41749/i_have_absolutely_no_idea_what_is_happening_in/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 11:28:53 UTC",
    "id": "1j40yl5",
    "link_flair_text": "Positive",
    "media": null,
    "num_comments": 1,
    "score": 5,
    "secure_media": null,
    "selftext": "Just a little OffMyChest but I really miss when a game would come with a manual with a novellas length of lore. Or a movie would have an intricate attempt at worldbuilding that could be explained in bonus features on the DVD.\n\nNot every project needs this, sure. And though I don’t love having to spend all the extra money I appreciate Visual Dictionaries and Character Portfolios because more often then not when I enjoy something I’d love to know more about it. \n\nBehind the scenes content is cool, so is concept art. But often those don’t actually expand on the plot, other than insight into different ways it could have gone.\n\nI want to iterate I’m not talking about tie-in content. Book and comics that expand on visual media are cool but I’m specifically talking about getting bonus content with the film or game. \n\nIt gave me more content and showed me the sincerity of the creators. I miss it, and I’d like to see it make a return.",
    "subreddit": "TrueOffMyChest",
    "title": "I miss when movies games and shows came with a lot of bonus content",
    "upvote_ratio": 0.86,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j40yl5/i_miss_when_movies_games_and_shows_came_with_a/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 11:24:13 UTC",
    "id": "1j40w00",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "Throwaway acc. \n\nI F29 feel stuck in my life and feel sad. I’ve felt like this for a number of years. In fact it started when I started my current role in healthcare after qualifying form university. I’ve thought about a career change so many times and have dabbled in a few things but haven’t fully dove into anything bc as much as I dislike my job, I’m good at it and earn a decent salary. It’s also a safe job. \n\nLong story short, I come from a poor working class background, mum with mental health issues, parents divorced and live separately. Mum is on benefits and dad works a minimum wage job. I come from a background where we don’t just abandon our parents and I love them and want to help them. I’m however an only child. \n\nI’ve been married to an amazing person a number of years ago and as amazing as he is, he too is burdened with family issues. We also live with the in-laws. His mother became disabled last year and a lot of her care is depended on him. He also holds responsibility for his disabled sister as well. He does a lot for everyone; he’s practically had to be the dad of the family since his dad wasn’t around much when they were younger. But now I see it taking a toll on him and he won’t admit it, only in snippets he says ‘I sleep so much bc I’m so stressed’. I try to support him as much as I can, but he’s doesn’t want me to get more stressed with my family stress too.\n\nI believe my stress comes from having a poor relationship with money. But let’s not deny that you need money to survive in this world. However, I feel this huge financial burden that I need to provide for my parents, especially as they near to pensioning ages and I really don’t want their financial stress when we have children bc no doubt it will happen. \n\nI had a plan of my job role for this year and it was going to allow me to be in a higher position and earn more money. However, this now is either not going to happen or will be delayed. Then I questioned myself, do I even want it? Or am I doing it to save my family from poverty. \n\nThe problem is that I don’t want know what I want to do. I went into this career path when I was younger but I regretted it so much. Due to stress I’ve developed PCOS and I’m 2st heavier than my previous baseline. I’m always tired, my husband is always tired and I feel that we don’t enjoy life as much bc of all responsibilities and we don’t even have children yet!!! Adding children onto this will just cause misery I’m sure of it \n\nI just don’t know what to do. We’re all trying our best but before being married, even in a relationship; when I felt stuck I would change my environment and look for things to do. I can’t do it as much anymore bc it’s not a me decision anymore it’s a we decision and although we have plans to move out, we’re saving up and you know what the housing market is like, so it will take a while.\n\nAnyways thanks for reading this if you got to the end 🫶🏽",
    "subreddit": "TrueOffMyChest",
    "title": "Sad and stuck",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j40w00/sad_and_stuck/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 11:12:38 UTC",
    "id": "1j40q1p",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 3,
    "secure_media": null,
    "selftext": "22 Male, I was borrowing my brother’s car to run some errands because my car is in the shop. I was in an alley and trying to cross and two way. There was tons of traffic in the first lane, a lady let me through so I creeped forward to check the other lane. It was clear so I proceeded to move forward, when I looked again a car came at me and hit me on the passenger front right bumper. The insurance company said I was 100% at fault. My brother has accident forgiveness but I feel like I just fucked over my dad. I’m on his insurance and feel like an absolute asshole. My anxiety is through the roof and feel like shit. I’ve been non-stop thinking about the outcome. ",
    "subreddit": "TrueOffMyChest",
    "title": "I caused an accident and am fault",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j40q1p/i_caused_an_accident_and_am_fault/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 10:44:37 UTC",
    "id": "1j40brw",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 1,
    "score": 4,
    "secure_media": null,
    "selftext": "I’m 20. We’re having family problems and my mother has always used me as her therapist. She told me she’s wanted to kill herself because she feels like a bad mother. She’s not. She makes mistakes but damn I feel like this is a huge jump? I don’t know how to handle this, i feel like i’ve been her couple’s therapist and now i’ve had to walk her off a ledge. I’m just, tired. I just needed a void to scream into, I’ll probably delete this when i’m sober.",
    "subreddit": "TrueOffMyChest",
    "title": "i don’t know how to handle my mom",
    "upvote_ratio": 0.83,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j40brw/i_dont_know_how_to_handle_my_mom/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 10:35:42 UTC",
    "id": "1j407fn",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 3,
    "secure_media": null,
    "selftext": "We used to run around everywhere and play. There are 8 now, but when i was a kid it was 5-6 depending on my age. When it was the 5 of us and I was having troubles keeping up with the older ones, we would run around each town we lived in and just have fun. We'd walk to stores and parks, we even lived in a rural hot valley area (basically a desert) and would roam around and tell each other stories. \n\nWe'd have hang out spots with other kids and play until sundown. Then we'd sprint home because Mom told us to be home by the time the street lights are on and they were already on. \n\nI miss when my brothers were into drawing so we would all sit at the table and draw together. We'd also play board games, card games  (even poker lol) all day and have a blast. When we got a console we would sit and watch my brothers play games like Skyrim, Fall Out or we would play Halo 4 together. \n\nI hold all of these moments so close to me even though i don't talk to any of my siblings anymore. I can't bring myself to, not after the trauma we all went through. My mother was terribly abusive. It was always us against her. Then it became her against me because my older siblings moved out all at once and i became the focal point for her negative emotions. I'd be lying if i said i wasn't a little resentful about that. But i understand it now.\n\nI don't have any emotional connections to my siblings anymore, last time i was around all of them they all felt like strangers. I guess im \"emotionally estranged\". \n\nMy family is just really broken. I miss how it was before we all realized it. I think it was the realization that made everyone leave. \n\nI know the abuse was happening my entire childhood, but i miss what it's like having a sibling. \n\nI crave familial connections, it's why i'm so desperate to have my own family, but not with my mother and siblings. I guess I feel as if things are too fucked up to try to start over with them. \n\nI feel bad about it tho. I tried getting involved when my younger sibling went through horrific abuse but there was only so much i could do. Being able to do nothing except watch it unfold broke me again and gave me an even bigger reason to never talk to my mom again. \n\nBut i can't even bring myself to contact that sibling.\n\nAnytime something bad happens to one of us it makes it harder for me to reach out. I'm not sure why but i know it's not normal \n\nI just miss being a kid and having people to depend on. it used to be us against the world but now it's just me.\n\nIt just gets lonely sometimes.",
    "subreddit": "TrueOffMyChest",
    "title": "sometimes late at night i miss things when i was a kid and it was me and my siblings against the world",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j407fn/sometimes_late_at_night_i_miss_things_when_i_was/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 10:34:54 UTC",
    "id": "1j4071v",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I was only 12 years old living in rented house with my parents i am single girl child it was Diwali time when me with my neighbour friends playing and enjoying one of my friend suddenly tell me to come to her room she wanted to show me her paintings it was 9 pm but I still agree as she was my good friend their we talked and laughed in her room until her mom down stairs call her and she told me to wait for her until she come . I was sitting their and suddenly her father come to the room and he sit beside me tried to talk to me he even tried to talk very sweetly which didn't make sense because he told he how much he loves me like wtf when I was trying to runway he hold my wrist and tried to grope me I was so anxious he was trying to tear my shirt i kicked him in his chest and runaway ASAP he would definitely r#p#d me if I didn't escape later I told my parents they didn't do anything instead blame me they didn't even threatened him atleast they changed the place . It was a scariest night of my life still can't forget the chills I get thinking of it also my parents responses surprises and broke my heart also . ",
    "subreddit": "TrueOffMyChest",
    "title": "The scariest night of my life",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j4071v/the_scariest_night_of_my_life/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 10:31:24 UTC",
    "id": "1j405cd",
    "link_flair_text": null,
    "media": null,
    "num_comments": 18,
    "score": 1,
    "secure_media": null,
    "selftext": "I just got broken up with by my boyfriend of 1 year and 2 months. We were in a long-distance relationship, and I honestly feel like my whole world just crumbled. We had plans to meet up in April, but now that's not happening, and I'm struggling so much. He said he doesn't love me anymore and can’t handle the long distance. I get it; it's tough to be apart like that, especially when you can't be physically together like others. But it's still hurting so much.\n\nHe sent me this breakup text while I was taking a nap, and I woke up to it. Now, I'm terrified to sleep because it feels like it’s really over. Here’s part of what he said: \"Lately I have realized a feeling I didn't know I had... when I'm in a long-distance relationship, I feel chained to my setup. It’s not your fault, but the freedom I have felt when going on photo walks and disconnecting from my phone is something I can’t go back to.\"\n\nI know I have attachment issues, and he was aware of that when we started dating. He was everything to me, and I can't imagine my life without him. He was all I thought about every day, and I would wait for him to get home. Now, I’m just here, and I don’t know where to turn.\n\nI just want to know, is there any way I can get him to love me again? I feel like I can't live without him. He was my everything, and now it’s all gone",
    "subreddit": "TrueOffMyChest",
    "title": "I f18 got broken up by my 18m boyfriend",
    "upvote_ratio": 0.53,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j405cd/i_f18_got_broken_up_by_my_18m_boyfriend/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 10:20:37 UTC",
    "id": "1j3zzwd",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 0,
    "secure_media": null,
    "selftext": "Well, yesterday I was hanging out with a friend of mine who happens to know my ex and some of his friends. For context, my ex and I were on and off for two years, and then we started to see each other as friends with benefits, which has lasted for quite some time. Yesterday, my friend revealed to me that he's absolutely sure that my ex had a girlfriend he has been with for a variable time span (it could be three months, but also ten, surely less than a year though). This girl was the classic friend \"I didn't have to worry about\" and she's absolutely beautiful and also a really kind person. Obviously, he didn't bother to tell me and he cheated on her with me at least two or three times. This happened more than a year ago, and now I have a boyfriend, different friends and my life got significantly better, but I can't shake the feeling that he's treated me like a fool and he has been basically using me, when I've always thought he respected me. I don't know if I should tell her (not my circus), given that they're already broken up and that me and her are not friends, just acquaintances. Moreover, I've always felt insecure about her and \"inferior\", in a certain way, so I would just like to put this all behind me and forget about it. I don't know how could he do this to me, the one person who was always by his side, even when he had nobody else. \n\n",
    "subreddit": "TrueOffMyChest",
    "title": "I recently discovered that I was the side piece",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3zzwd/i_recently_discovered_that_i_was_the_side_piece/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 10:02:18 UTC",
    "id": "1j3zqqm",
    "link_flair_text": "CONTENT WARNING: ANIMAL ABUSE",
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "This is my last day on this house, and leaving is not even bringing me the peace I've been desperately wanting for years because this man can not stop himself from ruining EVERYTHING.\n\nLet me start by saying the following.\nMe and my mom got stuck on the road because of an accident and we had to turn back to a city that is not ours, or we'd have to spend the night on the road.\nMom called step dad asking him to feed our cat, that is not even a year old yet. \nHe was laying in bed, and refused to do it. A task that would not take one minute.\nHe also said that, if he  let the cat out of the room if he fed her, he wouldn't do an effort to bring her inside again.\n\n\nMom and I strictly believe cats are animals that should 100% stay indoors and any time outside should be supervised. \nIt took me a few years to convince my mom that, because my step dad managed to convince her first that cats need to \"exercise their wild instincts outside, and if they die because of that, it's because it's destined to\".\n\n\nHe truly thinks cats belong outside and me and my mom are abusing our cat by not letting her outside unsupervised.\nEven after our cats have gone missing before because he didn't support me keeping the cats indoors, and after his cat got mauled to death by street dogs. He found her on his doorstep, bloody and dismembered. Yet, he thinks that's just how things should be.\n\n\n\nToday, I will be moving away for university.\nThis is the first time I'll be living by myself, in a huge city, as an autistic person with a lot of social anxiety and a bit agoraphobic. \nI also depend a lot on my mother.\nShe's going with me for a week to help me and support me.\n\nShe asked my step dad to feed the cat for this whole week.\nHe doesn't want to.\nHe says he will not touch her litter box and won't feed her, because according to him, the room will smell like death.\n\nI found my mom crying today because of this, she thinks he'll leave her to die or set her outside and she'll go missing, or die outside too.\nWe have no one else to ask for help.\n\nI told my mom that, she may have made me forgive this man who was homophobic towards me, made a bunch of weird sexual comments about me even when I was a minor, talked shit about me to my own family and his family, threw away two week old kittens out of the house to another side of the road in front of me, cheated on my mother multiple times, and told us to pack our things and get out whenever he felt like it, but if anything happens to my cat, I will never, EVER forgive this piece of shit.\n\nI hate this man. He has made my life miserable for years. Whenever I think he can't step lower, he does.\nThis is a life for God's sake. It's an innocent life that can't take care of itself.\n\nMy mom thinks he's doing this out of spite for her.\n\nI hate him.\nI hate him so much. I'm so tired. ",
    "subreddit": "TrueOffMyChest",
    "title": "My step dad sucks",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3zqqm/my_step_dad_sucks/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 09:58:21 UTC",
    "id": "1j3zool",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 1,
    "secure_media": null,
    "selftext": "This is gonna sound completely irrational (it most likely is), but the title pretty much says It all.\n\nMy partner and I have been talking about trying to have kids at some point in the near future. I am very much excited at the idea of being a parent. But I have this... I don't know how to explain it, feeling of dread or apprehension that my children would not get the same treatment my nephew (my older sister's son) gets. \nHe's very much the baby of the house (which, fair, he's 3 years old. And I love him very much too), but I feel like he gets spoiled. A lot. He's very very possessive and his bad behaviours rarely ever get corrected because my sister goes ahead and makes a big scene about it any time someone that's not her tries to (even calmly) discipline her son.\n\nMy mom and dad absolutely adore him and do everything they can for him. \n\nI have no idea why but I have this fear my kids would not get the same treatment and affection he does. I know I sound completely insane, but I am genuinenly really struggling with the thought.",
    "subreddit": "TrueOffMyChest",
    "title": "I think my family won't treat my kids the same way they treat my nephew",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3zool/i_think_my_family_wont_treat_my_kids_the_same_way/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 08:17:19 UTC",
    "id": "1j3ydnr",
    "link_flair_text": null,
    "media": null,
    "num_comments": 72,
    "score": 174,
    "secure_media": null,
    "selftext": "For context I’m (17M) a student who studies maths, physics and chemistry, I recently started dating someone (17F) an artist. Her subjects are all art related except for business. In spending time with her I’ve started to resent my own What crushed me was that her work was something she enjoyed and that brought her success and recognition but my work is something that drains me and that I’ve been unsuccessful in for a long time. I keep comparing my life to her and saying I wish I had her life to her, which puts a strain on our relationship she said she finds me less attractive when I’m like that but I can’t stop thinking about how much better her life is to mine. \n\nEdit: thank you for all the responses, I’ve already spoken to a school counsellor and she gave me the bare bones “don’t compare yourself to anyone” advice which is easier said than done. Secondly by success and recognition I mean that she won an art competition on national tv at a young age and is currently working on art piece that will be displayed in a museum. In recent times I’ve been feeling hopeless about my own future because I don’t think I enjoy maths as much as I used to and she made me realise that life would be a lot better if I enjoyed what I did, I just feel really depressed right now about it all",
    "subreddit": "TrueOffMyChest",
    "title": "I wish I had the life of the woman I’m dating",
    "upvote_ratio": 0.84,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3ydnr/i_wish_i_had_the_life_of_the_woman_im_dating/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 08:06:47 UTC",
    "id": "1j3y8qm",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "So when was like 6-15 years old I used to throw out my food after I came home from school, which my mother made for me. I think I did it because I didn't find it taste and just did want to eat anything because my anxiety. But still I got used to this habit and almost always did it, nobody ever noticed it though so I was kinda feeling okay.\nBut I think I did it too much , so I now don't have any eating scadual and don't really eat much especially when at home. But I still don't know how to think about it really. Never told anybody about this so decided to post this her",
    "subreddit": "TrueOffMyChest",
    "title": "I used to throw out my food while I was younger",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3y8qm/i_used_to_throw_out_my_food_while_i_was_younger/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 08:02:40 UTC",
    "id": "1j3y6t4",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 4,
    "score": 0,
    "secure_media": null,
    "selftext": "TrIm 34M victim of Child SA... Forgiveness is not working for me.. victims are told to be quite and suffer mentally abd abusers find new target...It weaking me...we like you hear in news how someone gets to avenge themselves..but when we ask to do the same everyone says stop don't do it....\nIf feels like the abuser is laughing at us ,at our weakness....\n",
    "subreddit": "TrueOffMyChest",
    "title": "Why everyone says forgive and move on? But every cultural story, every movie, we like is based on Getting revenge?? IMAGINE YOUR LIFE AS A MOVIE...WHO WINS.. WOULD YOU WATCH IT...?",
    "upvote_ratio": 0.25,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3y6t4/why_everyone_says_forgive_and_move_on_but_every/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 07:50:27 UTC",
    "id": "1j3y0s7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 2,
    "secure_media": null,
    "selftext": " I (18M) don't know what to do with myself. I know I shouldn't worry because I'm young and \"I still have a lot of time\" because whenever I post something similar on this app people tell me this. But I'm seriously starting to get worried. No one looks my way at all and everytime someone does, they get bored and ghost me. I think maybe I should stop looking and I'll find someone who is interested in me at all. The worst part is I'm not even looking for a long term relationship, I just want to have fun and I keep getting burned. I wish someone would atleast say something mesn to me because that would be someone saying anything to me. I'm so isolated and bored.",
    "subreddit": "TrueOffMyChest",
    "title": "I don't think I'm anyone's type",
    "upvote_ratio": 0.63,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3y0s7/i_dont_think_im_anyones_type/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 07:06:10 UTC",
    "id": "1j3xfr3",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 6,
    "secure_media": null,
    "selftext": "I was really good at studies until my 6th standard. I studied at a really good school near my mother’s house. But then I had to move to my real home with my father, mother, and brother. I joined a new school, and everything changed. I struggled to keep up with the new environment, and my schooling started falling apart. I became depressed.\n\nSomehow, I managed to pass my 10th through NIOS open school. Then I joined a government school for my 11th, but I fell into the wrong friendships. That led to me being sent off from school.\n\nHere comes the plot twist...\n\nAfter that, I was just sitting idle at home while my brother was doing his BTech in Biomedical Engineering from a well-known government college. My father had passed away by then, and I started feeling like a burden to my mother. I wanted to help her financially, so I started looking for jobs.\n\nFor two years, I worked multiple jobs—petrol pump operator, hospital attender, security guard—just trying to earn something.\n\nThen, in November 2019, after quitting my exhausting job as a hospital attender at the age of 19, I joined Delhivery as a courier delivery person. The job was insanely tough—at least 30 deliveries per day for a salary of ₹8,000 per month. I lasted two weeks before quitting and joining Swiggy as a delivery rider.\n\nSwiggy was fun at first. I was earning daily, spending recklessly on food and cigarettes, just living in the moment without thinking about the future.\n\nThen, two weeks later, everything changed.\n\nOne late night, around 11 PM, on my way back home, I met with a horrific accident. A truck carrying a full load of wood logs crashed into my bike.\n\nThat moment destroyed my life and shattered my mother’s hopes.\n\nI was bedridden for 4 years. My injuries were severe—multiple fractures, permanent damage to my hip and leg. The hospital treatment was not good enough, and recovery was extremely difficult.\n\nBut I didn’t give up.\n\nAfter years of suffering, I finally started walking again. And now, I’ve joined BCA online at Manipal University Jaipur to build a better future for myself. I’m learning to code, and I want to use this opportunity to change my life.\n\nI don’t know where this journey will take me, but I’m not giving up.\n\nThanks for reading. I just wanted to share my story.",
    "subreddit": "TrueOffMyChest",
    "title": "I lost everything, but I’m trying to rebuild my life",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3xfr3/i_lost_everything_but_im_trying_to_rebuild_my_life/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 06:47:15 UTC",
    "id": "1j3x5sb",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 0,
    "secure_media": null,
    "selftext": "I love my baby and I am so excited to meet them, but I’ve been miserable my entire pregnancy. I’ve been sick nonstop and I am exhausted and I want this to be over. I’m in the third trimester and nearing the end anyways, but the thought of waiting even one more month is making me so depressed. I just want to not be pregnant anymore, I don’t want to wait 7 more weeks. I’m drowning. ",
    "subreddit": "TrueOffMyChest",
    "title": "I want to induce preterm labor on purpose",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3x5sb/i_want_to_induce_preterm_labor_on_purpose/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 06:45:29 UTC",
    "id": "1j3x4w1",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 5,
    "secure_media": null,
    "selftext": "Edit: i forgot the obligatory Click meniton  \nI (16M) have a mother who loves birds, especially cockateils, she has three in total, until about 2 months ago. two of them ended up getting a little too close and WHAM. babies. Now my mother is overall not very good at parenting, she messed up me and my sister pretty bad. But when it comes to her pets she at least acts like she loves them.\n\nNow when these babies hatched, two survived, and they were looking really nice and healthy, that was until a couple weeks ago. my mother was starting to get annoyed at their constant screaming (you know... as babies do) and decided that they were eating enough seed, it wouldnt matter if they were seperated or not from their parents (they were still being fed by their mother and father occasionally throughout the day). so cue her forcibly taking them, cramming them into a small cage, and not letting them see their parents anymore so they \"wouldnt scream again\".\n\ni was going to say something, but due to being too scared to say anything (if anyone disagrees with her on something big, she gets explosive) i kept my mouth shut. i mainly helped her with them when we had to hand feed them when they were infants, so i wasnt as worried as checking on them as i should have been, becuase i thought she could handle it. aparently i was wrong, she cant, and her decision to seperate them ended up being fatal for the youngest. in heindsight i think he was stressed from being seperated from his mom so suddenly, and so he stopped eating. according to my mom, he haddent really been eating too much over the past two weeks or so (ie, since she seperated them). i could be wrong though. (i have some experience with birds and i at least do my reserch.)\n\nthe youngest couldnt stand up. just trying to walk resulted in him just stumbling and falling over. i asked my mom why dont we take them to an avian vet, to see if something was wrong, and her words were \"i dont want to deal with some sick bird, its too stressful. if they die they die. and plus the vet bill will probably be 200 dollars and i dont want to spend that much\" so cue me flabbergasted, i try and hand feed the bird, at least a little bit. and it works, he's eating some, and putting him on his mother's cage floor, and hes slowly eating some seeds. im estatic, and i think, \"oh, ill check up on him in an hour.\"\n\ncue me falling asleep for a few hours instead, and  i wake up to check on him, and he's already passed away. i tell her, and what does she say? \"oh well, i'll bury him tomorrow put him in a plastic bag until then\" (not really relevent, she buried all our previous pets in plastic ziplock bags and such so thats going to be a nice supprise for the next owner. i recommended that she stop doing that but she still does anyway)\n\ni cant belive im related to her, how can one person be so heartless. she loves all her pets until they get sick, then theyre just another burden to her, talk about unconditinal. and worst thing is, i bet she wont even listen and pretend like it died from some illness. again, it could have been something else but im pretty confident she killed it.\n\ntldr: my mom shouldnt have birds, and especially never should have tried to hatch and raise baby cockateils if she really gets annoyed that easily. birds will be noisey (i know from experience).",
    "subreddit": "TrueOffMyChest",
    "title": "My (abusive) mother tried to raise baby birds, it did not go well.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3x4w1/my_abusive_mother_tried_to_raise_baby_birds_it/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 06:39:47 UTC",
    "id": "1j3x1yo",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "TW: mentions of SA\n\nto make a long story short, i (F19) started talking to this guy we’ll call Jesse.\n\nanyways the first time i hung out with him, i told my mom i was out with a different friend and not a boy. the same night i told her the truth because i had a little bit of a guilty conscience, and if i told her the truth i wouldn’t have to lie in the future. \n\nso, i told her the truth and she always gets defensive when it comes to me and my relationships and i genuinely don’t think she trusts me. she started telling me that there’s no such thing as boyfriend and girlfriend in the bible and that if i wanted to date him i wasn’t even allowed to kiss him. does this not sound weird and irrational??\n\nthen she proceeded to try to scare me out of being in a relationship with him by saying things like “do you want what happened to your sister to happen to you? do you want what happened to me to happen to you?”\nfor context my sister was SA’ed but not by her boyfriend. my mom was also SA’ed but not by her boyfriend either as far as i know. \n\nout of all of her kids i’ve never really done anything bad. i don’t drink, smoke, party, do drugs etc. i fully understand that i lied to her abt where i was going but that was really the only “big” lie i’ve over told. she even accused me of stealing 20 dollars from her the other day. \n\ni understand im her youngest child and she wants me to be safe, however she’s gonna need to let me off this leash eventually. my whole life she has been super overly protective and it’s only when it comes to relationships where she jumps to conclusions and thinks im trying to buss it down and buss it open😭 i also told her she doesn’t need to worry about this because im not ready for this step even in the slightest and Jesse would never do anything i wasn’t comfortable with. \n\ni also want to say that i’ve only been in one other serious relationship and it was long distance. \n\ni guess im just hurt that my mom doesn’t believe me anymore for nothing. today, i asked to borrow her car because she doesn’t use it since she doesn’t work and she has a full tank. i’m a mobile dance instructor so my gas has been depleting fast. my job requires a TB screening and the closest location to me is abt 30 minutes away so on friday i got the start but i needed to come back 48 hours later. so i ask my mom to use her car and she asking me all these questions \n\nher: when\nme: 7:20pm\nher: when\nme: today\nher: where\nme: *location*\nher: where\nme: i just said the location why are you asking me where again?? a clinic??\nher: interesting\n\nat that point i gave up and told her id take my own car even tho it doesn’t have gas in it. she tried to tell me to go tmr before work, but i told her im not waking up earlier than i need to because she doesn’t trust me. \n\ni told her that now she knows abt Jesse i don’t have a reason to lie so idk what’s up with her. when it comes to me specifically in relationships my mom goes berserk but all my other siblings didn’t have to deal with her mouth. but yea that’s all i have to say im just sad. \n",
    "subreddit": "TrueOffMyChest",
    "title": "my mom doesn’t trust me",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3x1yo/my_mom_doesnt_trust_me/"
  }
]