[
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 23:44:03 UTC",
    "id": "1j95b0t",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "im struggling a lot. \n\nfor a lot of my life, i can never bring myself to do things. If i was reading or watching something while another important thing was pending, i'd never get up. The constant nagging inside me to finish that work would eat me up from the inside. If i did focus on something, it would be too much, if my folks weren't around to remind me, i'd forget to eat or sleep until that thing i focused on was done. I was called lazy, and irregular.\n\nnow, i'm in high school. this is probably the most important thing of my life, the set factor to tell if i'll even make it to college. i look at my grades and i feel something inside me die. for a lot of my life, i was an average student. i would never do homework because i'd forget/something would distract me, but my tests and quizzes would bring me up to at least a b average. i'd never pay attention in class either, since i was too busy daydreaming or something, i would just figure things out along the way. \n\nnow as someone whos learning more advanced things in my school, its harder to keep up. to be honest, i don't think i ever learned to study. i even got up to the advanced classes in my school and theyre just kicking my ass. (one of my teachers even talked to me today about moving down to a lower level. it was humiliating.) sometimes i feel like wanting to cry while getting ready for school since i know i'l fail and fail and fail again and again. it doesnt help that i go to a really good school, which seems contradictory, but everyone's so smart here. i watch my friends who bawl their eyes out over having gpas of 4s and 4.5s, while i can barely get mine to stay in the 3 range. \n\ni just feel like ive let my family down. as an oldest sibling, i have to set a good example for my younger siblings, but i cant. my parents worked their asses off to get to where they are now only to have a kid who is failing school. \n\ni dont know whats wrong with me. am i stupid? sometimes id talk to close friends (not mentioning my grades because im so ashamed) and the way they react makes me think that they have an easier time learning stuff and focusing. what do they have that i don't? its like im slower than them and i still cant get myself to do the slightest bit better. ",
    "subreddit": "TrueOffMyChest",
    "title": "im slowly failing school",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j95b0t/im_slowly_failing_school/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 23:43:22 UTC",
    "id": "1j95aiy",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I forgot my phone once and sobbing (it was in the lost and found i saw it but the place was locked up), I saw two dog run full sprint (small corgis maybe?). My dad (he was driving) pulled out as they are yelling at are car. I thought they where lost but my dad said that it may be alert dogs. We drove pass them to see if they when to one house. We drove to the house and I went down the drive (dad stayed by the road for owner running after them/make sure they don't run into the road). The drive was steep and the dog circled me as I descended. The was a lot of trash bags and trash all around. The was like five square feet and it piled up three feet. The house looked abandoned and I saw a window broken only the screen left. A third dog inside screaming it's head off. The was a large plant in a pot on the porch that difficult to move around.  The door was  open not enough to see a sliver inside but just enough to push it open with no real force. I repeatedly thought about tapping it and the door creaking open to see a rotting body. As I slowly bring my hand to the door, moments before I touching it a woman run out of the back yard thanking us for getting her dog back home stating that one dog was not hers. I still feel odd about her say one wasn't hers. Not the rotting house of bile and filth but the one sentence she said to us.",
    "subreddit": "TrueOffMyChest",
    "title": "Fast pups",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j95aiy/fast_pups/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 23:31:45 UTC",
    "id": "1j95139",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "He keeps saying things to our kids about me. Stuff that I feel like he should be talking to me about if he has issues with. For example: he wants me to make a phone call about something, which since he’s off for a week, he could also call too!! I’m a SAHM and I also home school our children. I’m also the one that is in charge of making all of the kids appointments etc. (another problem I have, he always makes me call when he could call too but his excuse is “I don’t have their insurance information, you do.” When clearly he doesn’t need it to schedule an appointment with their pediatrician or dentist that they always go to) anyways sorry I’m kind of off topic. He’ll talk bad about me to our kids and get them to agree. Saying things like “your Mom needs to be calling these people instead of expecting me to do it, right?” So of course my kids feel like they have no choice but to agree. My oldest tells me the things he says. I want to confront him but she doesn’t want him knowing she told me but at the same time I don’t care anymore. I remember a long time ago I would vent to my parents about him and he would get upset telling me to stop and to just talk to him about it… here we go, now he’s doing the same except it’s to our own children and to his family members who also don’t like me too much. I love him but there’s a lot of issues we’re facing atm. I have no one to talk to so I guess, here I am. I always feel comfortable being able to let everything out here. ",
    "subreddit": "TrueOffMyChest",
    "title": "My husband keeps talking bad about me to our kids!",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j95139/my_husband_keeps_talking_bad_about_me_to_our_kids/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 23:31:37 UTC",
    "id": "1j950z5",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "hi, i am freshly 20 years old. my life hasnt been the greatest, but it also hasnt been the worst. i have anxiety, depression, eating disorder, and most likely a lot of undiagnosed shit. i am in college, i have a bf, i have many siblings, i have goals and aspirations, i want to be a mom, i want to have a cat and a dog, i want to live life and see the amazing things it has to offer but i just cant handle this uncontrollable sadness.\n\ni have tried just going day by day, medication, therapy. my family, bf, friends, no one knows how intense my depression is. i cant talk about my feelings, i feel alone 24/7, my mind never stops, and idk how to be normal.\n\ni dont know what to do, i am sad no mater how good or bad my life may be. i am in the best stage of my life rn and all i want to do is die. there is no motive or reason, its just how i have felt for years. there is nothing i can do to make this pit go away. I have been suicidal for years, and my attempts have failed in the past. im just so tired of crying and being alone.\n\ni am a nice person, i am pretty on my good days, i do things for people when they wouldnt do the same for me. i am a good person but its getting harder and harder to just get up everyday.\n\nis there an easy way to do it? i will be leaving behind grieving family but i dont even care at this point. \n\nplease, someone just tell me what to do or how to do it or just talk to me.\n\nim so lost, and im afraid and im so so tired.",
    "subreddit": "TrueOffMyChest",
    "title": "I don't want to die but i want it all to stop. suicide has been on my mind",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j950z5/i_dont_want_to_die_but_i_want_it_all_to_stop/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 23:26:28 UTC",
    "id": "1j94wqs",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "i don’t want to see your face. i do not care how good you think you look. ",
    "subreddit": "TrueOffMyChest",
    "title": "i hate it when people send me unsolicited selfies. immediate turn off. i do not want to talk to you for a bit.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j94wqs/i_hate_it_when_people_send_me_unsolicited_selfies/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 23:13:18 UTC",
    "id": "1j94lu7",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "I definitely need to see a therapist about this one :\n(TW: CA, SA, and self-harm)\n\nI (21F) had this life-altering experience when I was around 15 or 16, during high school. At the time, the friend group was fairly large and a friend of mine started dating a new student, we all had gotten close pretty quick since we all hung out together and that was the dynamic then.\n\nDuring class one day he sent me a Snapchat asking if I could step out to talk about my friend—his girlfriend. Thinking something was wrong, I asked the teacher if I could be excused (which she allowed because we were just making valentine’s day cards and class would be over shortly.) What started as an innocent conversation about childish relationship drama suddenly shifted.\n\n(TW) I was choked to the point where I lost focus in my eyes, and what felt like blood circulation being cut off, I’d been sa’d and I froze... while I was panicking internally I kept thinking it wouldn’t go any farther knowing we were LITERALLY in a main hallway with a camera right above us. So it felt impossible that something like this could be happening in such a visible place... clearly i was wrong and naive.\n\nAt the time, I didn’t fully understand what had happened, but the bell had rung and our friend group met as usual, walking each other to our next period. That’s when I had a panic attack. A friend noticed and as I’m trying to explain what happened she notices our vice principal, of course my friend tells her, to which I’m immediately sent to the principal’s office.\n\nI explained everything. They told me they would “conduct an investigation” and sent me home. I was never given the opportunity to write a report. I ended up missing a month+ of school with no updates on the situation. My parents would constantly call the school wondering when I’ll be able to go back, how i’m going to catch up on my work etc. we eventually were called in for a meeting. Most of the meeting now is a blur, besides the infamous hurtful quote of all time “It seems like you wanted to,”  my heart drops and I shut down, I remember the same unable to breathe  feeling and was in complete shock as my parents scolded me. \n\nI was still sent home after this as they would figure out our next steps. From when the situation first began to the conclusion we’d gotten (TW) I endured physical, verbal, and emotional abuse from my parents. Over time, I started believing it was my fault—something I still struggle with today. That belief led to years of severe self exiting ideations and harm.\n\n(Note the both of us were eventually allowed back in school, but I had be isolated in a office and he’d been in ISD (in school detention, eventually he moved))\n\nFast forward to years of no contact, he reached out with an apology. By then, I had already let go and forgiven the situation. If I’m honest, I hold far more resentment toward my parents than him—at least he apologized….\n\nMore recently, we crossed paths on social media. We caught up through texts, he would apologized again, I’d make dark humor jokes out of it, called, etc., it felt like the old friends we were before the bad. And for a moment, I thought he had changed. I felt relieved—happy even—to know he had grown into a better person. As time passed I stopped hearing from him… and out of curiosity I ask his roommate if everything was okay with him.\n\nI found out he had been arrested.\n(TW) Domestic assault and battery plus Domestic assault and battery by strangulation.\n(Note: He’s now released and there were no charges from the plaintiff)\n\nGuys — It feels like I’m subconsciously reliving that nightmare that once was. I don’t know why, and I can’t shake it. The scariest part is I can’t stop thinking about the woman he hurt… I don’t even know her, but I’m fixated on her. And for him… I don’t know where to begin on how I feel.. I feel stupid, guilt, naive to thinking he was a good person… I feel empathy, concern, and curiosity… I feel angry, condemnation, and to shame him… I feel like I need to do something but I don’t know what to do.\n\nWhat is wrong with me?! Why is this effecting me so heavily?!?!",
    "subreddit": "TrueOffMyChest",
    "title": "am i protecting a criminal?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j94lu7/am_i_protecting_a_criminal/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 23:04:47 UTC",
    "id": "1j94ete",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "So many things are going wrong guys. I got diagnosed with a ton of health issues that have cut my life short. Because of these health problems my business has greatly suffered. I’m $175k in the whole because of many things - bad business partners, theft, etc. I have a wonderful wife that I love more than anything in this world but I’m going to cause her to lose everything. \n\nI think it’s just best for me to put a gun in my mouth and let he collect my meager life insurance policy. At this point I physically can’t work, so I can’t make that money back at all. I wish someone could just fucking save me.  ",
    "subreddit": "TrueOffMyChest",
    "title": "Last Moment on Earth",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j94ete/last_moment_on_earth/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 22:46:47 UTC",
    "id": "1j9401h",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 0,
    "secure_media": null,
    "selftext": "26 male never had a girlfriend before I try to talk to women but it never goes any further than just friends I have pretty much lost all hope and this ever happening. I am the only one out of 5 siblings That's unmarried and doesn't have kids. Even all of my friends from school are married and have kids now I honestly feel like there's not a bigger loser out there than me",
    "subreddit": "TrueOffMyChest",
    "title": "I have no social skills",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j9401h/i_have_no_social_skills/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 22:37:52 UTC",
    "id": "1j93swn",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "(Mobile User, idk if that still matters lol)\n\nOkay so, I (19nb afab) am in love with my best friend, let’s call him Eren (18m afab). \nMe and Eren met in college when we were both 16 and have been practically inseparable for the past year, he’s funny, honest, kind, thoughtful and absolutely everything wonderful that a person can be and as I’ve said, we are closer than ever. \n\nNow Eren has a fun habit of playfully, platonically flirting with me it’s always been our dynamic, he jokingly flirts with me, I jokingly flirt back and we’ve always found it funny. However, for the past few months I’ve been finding myself growing more and more flustered by his flirting, but in a good way? To the point where I’m starting to overcompensate by making it very VERY clear that it’s all in good fun, afraid of him finding out I like him. I don’t want to ruin our friendship with this, I can’t lose him. \n\nAnother thing is, I’m fully not his type. He loves tall, masculine, strong men, and I’m none of that. I’m 5’2, not strong and feminine leaning in my appearance, I’m the complete opposite of his type and it kills me to know that. \n\nI’m just so lost, I want to tell him how I feel, but I don’t want to ruin things. I’m trying so hard to be there for him as a friend, but my heart shatters every time he talks about some guy he’s talking to and knowing I will never be that person. \n\nBut yeah, that it all, any advice would be appreciated but isn’t expected, thank you for reading.\n\nTLDR: I’m in love with my best friend but I’m not his type and I don’t want to ruin our friendship by telling him how I feel. ",
    "subreddit": "TrueOffMyChest",
    "title": "I’m in love with my best friend and I don’t know what to do",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j93swn/im_in_love_with_my_best_friend_and_i_dont_know/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 22:37:18 UTC",
    "id": "1j93sgi",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 18,
    "secure_media": null,
    "selftext": "It’s just something I (36M) can’t reliably share with anyone in my usual circle without coming off like a creep or a bother or something, might as well be the big online where I get lost in the traffic. It’s not *just* lust, but rather, everything she (38F) does makes me want her so badly and in so many ways. We have two kids. We’ve been building a life together for sixteen years now, going on seventeen in May.\n\nShe’s a supermom. And a superwife. And a superwoman with published works to her name. And a number of other superthings.\nThing is, she gets so busy and overwhelmed herself, I’ve learned not to encumber her further if I can help it. Helping out with whatever I can once I’m home from work, and whatnot. I just feel like dumping all this on her would help neither of us at this point in life, but I just NEED to get it out somewhere before I get back to being a Supportive Husband Without Sideways Hassle Just So Things Can Get Somewhat Quiet For One Damn Minute.\n\nShe’s the hottest thing I’ve ever seen. This sentiment has been building up for years. And I’ve seen some awe-inspiring things in my time. She contains them all and eats them for breakfast at the same time. She might be nothing special to your run-off-the-mill Chad, with her stretch marks and mom-bod and all. But she’s everything to me, and that’s inevitable. I just can’t let her know right now, but instead I feel the world needs to know. I’m that selfish.\nI love her mind and her gentleness at the same time that I cherish her body. They’re inseparable to me. I crave to make love to her personality and her tired smile, and I wish to be able to do even more for her than I already do. She’s so dedicated to our children and to myself, I wish upon the fucking star there was some way I could let her feel exactly how immense her beneficial impact is on me as well as the kids. I wish I could mind-meld with her so I won’t struggle this much to express it.\n\nShe is the love of my life. And I can’t tell her right now the way I want to, because she’s finally asleep. So have at it. I’ve said it. Maybe I’ll cope once I’ve gotten at least a part of it out.",
    "subreddit": "TrueOffMyChest",
    "title": "My appreciation for my wife is overwhelming",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j93sgi/my_appreciation_for_my_wife_is_overwhelming/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 22:25:36 UTC",
    "id": "1j93ivd",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 2,
    "score": 13,
    "secure_media": null,
    "selftext": "My best friend since we were in middle school has had a rough few years since he knocked up his girlfriend. Mostly about money. They went in debt for a shot gun wedding, and they went into debt to get a mortgage, and it's been gradually getting worse over the last 4 years. \n\n He's been in panic mode about it for a while, and he's overwhelmed having to work 60-hour weeks on top of child care, errands, and housework. His wife also has a spending problem that he just can't seem to shake because she gets what she wants. \n\n They just got their tax money, and he was saying that all of it needed to go to debt or they'd start having collections come. His wife wanted to go to Florida for her friends wedding. He protested, but ultimately, he agreed to go for the weekend. He told me he didn't really have the PTO or money, but they can't go on vacation this year otherwise, so it's something. \n\n They got down there and did the wedding, and instead of coming back, they decided to go to Disney World for two weeks. I didn't even bother asking about the money or anything. I just told him to have fun. This immediately worried me because he's been talking a lot lately about suicidal feelings and he refuses to seek help because he \"don't have the time or money\" and insist he'd never do anything, just saying hoping he dies in a accident so his family would be taken care of. \n\n Everyone has heard of those Disney trips that are before divorce, abandonment, or suicide and I'm really worried that's what this is. His debt is well over 6 figures, not including his mortgage, and he's suddenly spending like there is no tomorrow and not worried about it not worried about it He seems extremely happy but I'm worried about him. I asked about his situation, and he left me on read. I hope he won the lottery or something down there. ",
    "subreddit": "TrueOffMyChest",
    "title": "I think my friend went to Disney World to do something drastic",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j93ivd/i_think_my_friend_went_to_disney_world_to_do/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 22:19:20 UTC",
    "id": "1j93dsf",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 0,
    "secure_media": null,
    "selftext": "I like myself as an individual, but I also frequently feel guilty for being male. I know this way of thinking isn’t healthy, but I’m a male and I know how other men are. It’s hard not to think this way.\n\nI’ve never feared for my safety around a woman. Only men. I’ve never been almost jumped by a group of women. Only men. A woman has never stole my things. Only men. The worst thing a woman has done to me is hurt my feelings. The worst thing a man has done to me is literally try to kill me.\n\nNo wonder women don’t wanna date men. They’re fucking unpredictable and terrifying. Bad men ruin the experience of life for literally everyone.\n\nI know I’m not the only man who feels this way. My entire male friend group feels the same way.",
    "subreddit": "TrueOffMyChest",
    "title": "I feel guilty for being a man because so many men are genuinely awful.",
    "upvote_ratio": 0.35,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j93dsf/i_feel_guilty_for_being_a_man_because_so_many_men/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 22:03:57 UTC",
    "id": "1j930zt",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 42,
    "score": 34,
    "secure_media": null,
    "selftext": "Sorry I just wanted to get a second opinion on this (English isn't my first language so sorry)\n\nMy (24M) Therapist, thinks I was sexually harassed by my aunts as a child, but I feel like he might be over exaggerating\n\nEssentially when I was young, my aunts and other female family members would always be touching me, usually pinching my cheeks or butt, and trying to kiss me on the lips, because \"I was just too cute and they couldn't help it\". It mostly stopped when I was around 10 I think.\n\nI hated it all, but I didn't really say or do anything, because I guess it was harmless?\n\nAny ways I'm a pretty hands-off person now, and don't do a lot of physical touch with anyone, and my therapist thinks that's how it started.\n\nI can believe that, but he keeps calling it \"sexual assault/harassment\" which I feel is too far a stretch as it wasn't sexual, and that's a very serious conviction.\n\nThey tried to argue what if my uncles did that to my sister? But I don't think those are comparable things\n\nIdk I just don't think its as bad as he's making it, like I hated it, but I survived and am fine now. I may not see this therapist anymore, I'm not sure.\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "Therapist keeps saying I was \"sexually harassed\", I don't know if I agree",
    "upvote_ratio": 0.85,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j930zt/therapist_keeps_saying_i_was_sexually_harassed_i/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 22:00:46 UTC",
    "id": "1j92y8w",
    "link_flair_text": "CONTENT WARNING: ANIMAL ABUSE",
    "media": null,
    "num_comments": 0,
    "score": 3,
    "secure_media": null,
    "selftext": "TW: MENTION OF DR*G USE. \n\n\n\n\n\nI spent years, from 18 to 31, almost my entire adult life being manipulated and abused by my ex. Who I knew was an alcoholic but I didn't realize was a drug addict. (meth and cocaine, apparently)\n Boy, that was a doozy when I figured that out. So naive on my part. \n\n Until therapy. Therapy was great for me. I didn't even know I was being abused until my therapist was basically like, \"Hey. None of this is normal. This is not okay.\" Even though my family and friends were worried for me and tried to get me to see it, I continued to stand up for my ex and cover for them until therapy. \n\nWherever you are Therapist Jas, you helped me start to save myself. \n\nWhen I decided I wanted out, all i wanted were my things and my dogs. No smear campaign. No fights. Just my items and to disappear into the void. Things did not work out like that, actually. \n\nThey didn't allow me to take most of my things, most of which were given to me by my great grandma and grandma.\n\n I left with two duffel bags and a tote. \n\nOn the day they were \"nice enough\" to let me get more of my things, all i ended up with was my great grandmas table (which was a win to me) and some lovely boxes of actual garbage can trash that they put together for me. Including but not limited to old food wrappers, contents from multiple ash trays, a sex toy I'd never seen, and most of my photos ripped into tiny shreds. They would not let me have my dogs. \n\nLike a buffoon, for weeks I attempted to get my dogs back. They couldn't afford to feed the dogs much less themselves so I offered to buy the food, cover upcoming vet bills, allow visits.\n \nThey kept my dogs. I never got to see them again. I never even got to go inside the home and say goodbye. \n\nIt's been a few years but I found out recently that my ex lost their house. And then another. So satisfying for me to hear honestly, But what threw me off the most was when I found out what happened to my dogs, thanks to One of my exes family members. \n\nOne \"ran away\". This particular dog never left the yard. Never left my side. She was a very good girl. In the 10 years I'd had her, not once was she ever lost or missing. \n\nOne \"we don't know\" what happened. So a dog just disappeared into thin air. Got it. \n\nAnd the last one...\n\nWas neglected and malnourished and treated so badly he went blind. He was so bad that by the time one of my \"exes friends\" took him to the vet there was nothing they could do but put him down. \n\nThe family member said it wasn't two weeks later and the ex got a new dog. \n\nI was devastated. That particular family member no longer has dealings of any kind with my ex, but found me to let me know about what happened. I appreciated that, even though I was heartbroken. He knew i fought hard for those babies and I would have kept fighting but i couldn't because I ended up getting a well deserved order of protection for a multitude of other reasons. \n\nIt's been a few years. I'm married and a mom now. I live a very safe, comfortable, happy life with a man that is extremely good to me. I'm still working to rewire my brain from the years of chaos and abuse. I'm still pretty triggered by certain things and I still have nightmares from time to time. \n\n\nBut most of all, I'm still grieving my dogs. I wanted to save them. I wanted to fight for them. I wanted them with me. To live happy, free lives. I miss them. And I hope they didn't think they did anything wrong when I left. I hope they know I cry everytime their pictures come up on my photo memories. I hope they know I did my best and I never forgot them. I hope they knew I loved them and that I still do. \n\n\nAnd I hope that my ex never has a moment of peace or fortune or anything close to good for what they did to my dogs. Not even what they did to me. But to my innocent, sweet, loyal, amazing dogs. ",
    "subreddit": "TrueOffMyChest",
    "title": "I hope my ex never finds a moment of peace",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j92y8w/i_hope_my_ex_never_finds_a_moment_of_peace/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 21:58:38 UTC",
    "id": "1j92wdu",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 7,
    "secure_media": null,
    "selftext": "I’ve been disabled since I was 15. I’m 39 now and, while I try to be grateful for what I have, (food in my belly, clothes on my back, a roof over my head) I want so much more that I know I can never have. I want children and a husband and a dog. I want to climb Mount Everest and swim in the ocean. I want to learn ballroom dancing. It hurts that I can’t have any of those things ",
    "subreddit": "TrueOffMyChest",
    "title": "I envy healthy people so much",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j92wdu/i_envy_healthy_people_so_much/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 21:58:02 UTC",
    "id": "1j92vv7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 2,
    "secure_media": null,
    "selftext": "tw for rape/abuse/controlling behaviour\n\nhi guys i am very nervous to post this as it is my first post on reddit and i couldn't figure out how to go anonymous without making a new email but here it is. \n\ni (f19) have known my boyfriend (m19) since april 2023 and have been with him officially since june 2023, he previously had a girlfriend 'polly' (f19) from january 2021 to around december 2022, she broke up with him at this point but he said that after a few weeks of her ignoring him they rekindled but issues were still arising so they officially split in march 2023 and he hasn't been in contact with her since.\n\nhe has expressed to me that she had issues with her mother and often stayed at his house for extended periods of time, was a big smoker at the time and would often steal from his older brother when she had no money, and that she was depressed/depressive throughout the relationship and was also prescribed medication towards the end of their relationship which he said was changing her behaviour and attitude negatively, he believes this is why she left him in december 2022 because of their differing views. he also told me that she has history of making accusations, before she had reported him i was asking him questions about her and their relationship and he said that in the beginning he got a message from a boy who had been previously accused of rape by her saying that she was a liar, he obviously believed her as they were together but in hindsight this should've been a red flag he also said that they didn't have much of a sexual relationship and she was very paranoid with protection which obviously would make sense if she was a victim of rape so i guess that's how he thought of it but later on down the line she denied that she was raped and said that it was consensual.\n\nin september 2023 his ex accused him of coercive and controlling behaviour (we didnt know when she first filed the report until months later) and he was taken into police custody in october 2023 for a few hours. initially she had reported that he was abusive towards her but quickly dropped the gbh charges, i assume she didn't have enough evidence - his solicitor stated that the evidence she saw for the gbh charges consisted of 2 photos of grazes and bruises she had. she initially said that he had punched her 100 times in one period of time, also in one of her statements she said that she had taken photos of bruises on her arm that he had given her as she was sat in his bed next to him this alone is baffling to me as if he was 'so controlling' i don't believe he would let her do this especially if he was the cause.\n\ni completely believe him when he says that he did not do it as i have been with him for about the same amount of time they were together and have had none of the same issues with him, also i have read/heard multiple of her and her family's claims and the written ones just don't match up - for example, her brother said he saw my boyfriend strangling her and her face was purple and her mother said that on the same day and time he only had her pinned on the bed. this instantly gives me red flags.\n\nmy first thought was obviously that since they broke up and got back together multiple times throughout their relationship she was hoping that the same would happen but he met me and moved on instead (her friend had messaged her when she was not speaking to him and told her that 'polly' had advised him to move on). also it is very possible that she was aware that he was with me and not just having time to himself as his mother frequently posts on facebook and had made a post in july 2023 that she was picking him up from the city that i live in and mentioned me in the post, my boyfriend's mother has proof that she has been frequenting her profile as she accidentally requested to be her friend one day. the only piece of evidence that i have seen that i am aware she has kept (evidence she had of bruises from an injury have been thrown out with the gbh charge) is a clipped screenshot of him texting her saying 'i'll find another girl to abuse' obviously i have defended this as a retaliation to her emotional manipulation/abuse his solicitor also requested that the police access her phone to retrieve all of their iMessage conversation for context. personally i believe that him saying that is not an omission but an inappropriate joke of some sort.\n\nshe claimed that while they were together he would tell her what she could and couldn't wear, wouldn't let her see her friends or family, wouldn't let her take her pills, wouldn't let her attend school, etc. i have seen photos of her in his phone of them together with his friends, i also met his friends and they brought her up casually before he knew she had reported him so no mal intent there in my opinion, i have also seen photos of her school work.\n\ni do not believe a word that she said in her statements she said that she was so badly affected by him that she cannot sleep comfortably, walk for long periods, sit comfortably in a car or travel by airplane but she continues to post herself at clubs in the city that i live in (him and her don't), she has gone on multiple holidays since reporting him, one she showed on instagram just shy of 2 months after she made her original report, etc.\n\nof course when they were together he was also between the ages of 15 and 17 so i am honestly surprised that it is even been taken to crown court and gone of for so long it seems so menial to me.\n\ni am just nervous as it seems that in court he will be judged by a jury and i know they are to be unbiased but it is still nerve wracking to know that his fate lies in the hands of strangers, he has made it known to me that he would like a restraining order to be put in place, i would prefer a protection order as from what i know they are longer lasting, i think that he could also charge her with deformation of character as she was telling his friends that he was abusive to her during the first summer that we were together (june/july 2023). \n\nplease don't suggest that i leave him often when i share this with friends they say i should just leave him to avoid the stress but it is not about me, i love him and want to be there and support him the best that i can but i honestly don't know what i would do if he was found guilty and sentenced for a long period of time, we having been talking about saving up for a deposit on a house, getting married and having a baby in the coming years.\n\ni don't really know what i'm expecting from this in all honesty but just wanted to share without feeling like a burden, i'm sure there is more information that i have missed as this is just a late night rant of sorts so i may make some edits at a different time but feel free to ask any questions or give any advice.",
    "subreddit": "TrueOffMyChest",
    "title": "my boyfriend's ex is accusing him of abuse",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j92vv7/my_boyfriends_ex_is_accusing_him_of_abuse/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 21:57:40 UTC",
    "id": "1j92vjt",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "I know everyone says “life isn’t a race,” but it’s hard not to feel like I’m behind. I see people my age getting degrees, starting businesses, traveling the world, or just seeming like they have it all figured out. Meanwhile, I feel like I’m stuck, unsure of what I’m doing or where I’m going. I try not to compare, but it’s tough. Does anyone else feel like this? How do you deal with it?",
    "subreddit": "TrueOffMyChest",
    "title": "I feel like I’m falling behind in life, and I hate comparing myself to others.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j92vjt/i_feel_like_im_falling_behind_in_life_and_i_hate/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 21:45:22 UTC",
    "id": "1j92kue",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 51,
    "secure_media": null,
    "selftext": "I (26F) had been feeling like a caretaker for most of my relationship with my ex-partner (39M) who is an alcoholic. He would be sober for a long time, and then relapse. The more I thought about the relapses, the timing seemed way too convenient. He would relapse during times, when I went to see family, when I got a new job, when I got my graduate school qualifying exams, when I went to travel abroad alone for the first time in several years. It started feeling like he was punishing me for having a life of my own.\n\nThroughout the relationship, I had financially supported him. Even when he was sober, it was not uncommon that rent was late, he was in medical debt because of avoiding to get a good insurance plan, he never paid taxes, etc. I was always \"borrowing\" him money that I ended up realizing I will never get back. \n\nEnough was enough.\n\nHe asked me to quit my job and move to a new location with him, which I did. I gave up EVERYTHING only for him to relapse. \n\nThat's when I decided that I am done, and that I need to live my own life. I knew that he had taken money from our mutual savings (so 90% mine, 10% his) without asking me before, so I \"forgot\" my credit and debit cards on to the kitchen table while starting to move my stuff out, and took his wallet from his pocket, placing it on the bottom of his bedside drawer. He was going to hit withdrawals if he didn't have money for booze, so I knew he was going to steal my cards. It was not until a day later that they \"disappeared\" and I saw charges made. Booze. Sex club(?), Casinos. Lots of takeout. Impulsive purchases online.\n\nI called the police, reported the cards missing, and said that my ex was the suspect, and that he is currently trying to drink himself to death (which he always is when he relapses and doesn't hesitate to say it). They came over immediately, I was there too, and they found the cards in his possession, and as he turned violent towards them yelling I set him up, he was arrested him on the spot. I've come clean to the police about his tax avoidance as well, along with illegal threats against me from 2-3 years ago (that I have screenshots of), as the statute of limitations has not run out. \n\nHe's looking at several charges now, including resisting arrest,  illegal threats, stealing, potential tax evasion and negligence, several fines, and isn't a first-time offender. I don't know how he's doing, whether he's sober, I don't care. I have my own life to live. \n\nSince then, I've begun making more money, and traveling the world, and I am finally starting to feel like myself again. I've even made new friends, which I haven't for years, as all of my old friends made me choose between them and him, and I foolishly chose him. ",
    "subreddit": "TrueOffMyChest",
    "title": "My ex's alcoholism made me break up with him, and I \"set him up\" the day I moved out",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j92kue/my_exs_alcoholism_made_me_break_up_with_him_and_i/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 21:40:56 UTC",
    "id": "1j92h5h",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 2,
    "secure_media": null,
    "selftext": "I am 33 female who has worked retail for most of her career and wanted/needed a career change due to rising prices and living on my own. I was so bored with retail that I started to burn out. I thought I needed a new path. I don't have a degree. College wasn't for me and I couldn't find what I liked. \n\nWhen I saw a call center job advertised on indeed for more pay I took it and never looked back. I turned in my two weeks and completed it at my retail store and said goodbye to some of my coworkers I really enjoyed being around. But I needed to do this for my own financial being and my physical health. The benefits rock and the pay is so much better. I'm making more than I have ever made.\n\nProblem now is that my mental issues are rearing their ugly head with the amount of hard calls and abusive customers I've dealt with. I'm only 5 months in with this job. \n\nI suffer from anxiety and PTSD and I thought I had over come those issues. I see a therapist. Now those issues are coming back to haunt me and it's been a struggle. I feel like such an idiot. I want to quit and go back to my retail job so bad but I know it won't pay my bills. This job has done wonders for me financially.\n\nI feel like no matter what I do I am stuck. If I stay here I feel like I'm going to go crazy. If I go back then I will suffer financially but I miss the peace of mind. I'm thinking I should get back on my medications and just keep pushing. I want to keep pushing. I hate myself for my mental struggles and wish I could block them out in order to provide for myself. I just feel so lost on how to take care of myself mentally right now. \n\nThanks for letting me vent though. I'm going to go back and keep pushing through. I might update I don't know...",
    "subreddit": "TrueOffMyChest",
    "title": "I left retail for a call center job with better pay and I regret it",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j92h5h/i_left_retail_for_a_call_center_job_with_better/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 21:27:45 UTC",
    "id": "1j925zu",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 6,
    "secure_media": null,
    "selftext": "im tired of people playing stupid games with theyre social circles . we are humen beings . we need connection,  we need those deep conversations . we all gotta stop consuming buncha stupid videos and end the dopamine cycle , start getting a grip on real meaningful interactions . im 18 male btw and i use social media too but everytime i wanna try something new as of relationships , everybody stick to their chatting and online dates with people they cant see and cant trust. ",
    "subreddit": "TrueOffMyChest",
    "title": "isolation",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j925zu/isolation/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 21:27:32 UTC",
    "id": "1j925ss",
    "link_flair_text": null,
    "media": null,
    "num_comments": 10,
    "score": 0,
    "secure_media": null,
    "selftext": "Here are some examples of my bravery:\n\n-I went to a college where I knew no one (in a state where I knew no one)\n\n-As an adult, I got on an airplane to move to a place where I knew no one. With nothing but my luggage and my dreams. I didn't even have a job or apartment lined up.\n\n-I've gotten on airplanes to visit places I've never been before. By myself. For no reason other than because I wanted to.\n\n-I've gotten my pubes ripped out in the most painful way possible (full Brazilian waxing)\n\n-I've gotten tattooed twice (and gotten so many chest waxes I've lost count)\n\n-I've gone up to total strangers in public to ask if they want to come over for sex. With no nervousness whatsoever on my part.\n\n...Yet (and this is where my bravery ends) the mere *thought* of asking out a woman I already know on a simple date gives me *crippling* levels of nervousness.\n\nMy phobia of asking a woman out really holds me back. Other than a one night stand 4 years ago, I haven't had sex I didn't pay for in 10 years.",
    "subreddit": "TrueOffMyChest",
    "title": "I'm a pretty brave guy...except in the one area where it really counts",
    "upvote_ratio": 0.44,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j925ss/im_a_pretty_brave_guyexcept_in_the_one_area_where/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 21:19:50 UTC",
    "id": "1j91zbx",
    "link_flair_text": null,
    "media": null,
    "num_comments": 11,
    "score": 5,
    "secure_media": null,
    "selftext": "I am so lonely and missing intimacy...\n\nMy husband passed away in December, after a long 4 month battle with Cancer that took him from me.\n\nIts been almost 3 months and it's been so damned hard and difficult navigating being a widow under 40. I already have Depression and Anxiety and ADHD and OCD and PTSD, add on top of that the last 3 weeks with my husband that haunt me still, and I'm not doing great. I'm managing to get by the best I can but I miss human contact. Friends have visited, say with me, spent time with me, given me hugs.\n\nBut i miss that warmth of being held. Of my foot sliding under thr covers to find his. My nightly forehead kiss or holding hands in the store. I miss casual skin contact and the forms of intimacy you have with people you love that aren't just sex. It makes me feel so alone. Like my cup is so empty. Like there is a void. \n\nIve truly never felt more supportive and loved by all the people in my life, but at the same time, I feel so, so, so immensely alone and empty and abandoned and lost and scared. ",
    "subreddit": "TrueOffMyChest",
    "title": "I miss him...",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j91zbx/i_miss_him/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 21:14:53 UTC",
    "id": "1j91uzb",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "\n\n(We live in Muslim country so things are much difficult so we can't go to authorities)\nI need to share this because it’s eating me alive. This isn’t just her story—it’s mine too.\n\nHer Story: How She Was Trapped\n\nShe met him thinking he was just a good friend. He never acted inappropriate, never said anything with double meaning. He built trust first, slowly making her believe he was a safe person.\n\nThen one day, they went on a trip together. She tried to refuse weed, but he kept pushing until she gave in. Once she was intoxicated, everything changed. He made her believe he liked her, even loved her. And in that manipulated state, he took what he wanted.\n\nThe next day, she still couldn’t process what happened. She even wore a skirt for him, as if she was trying to convince herself that it was something real, something meaningful. But when the trip ended, so did his act. He turned cold—immediately, like she never mattered.\n\nIt took time for her to accept it. First, she blamed herself. Then, she started questioning reality. Finally, she realized—she was just another toy to him.\n\nShe told me:\n\n\"I didn’t know it was all his plan. I was just a toy for him.\"\n\n\"I feel dirty. I feel like I’m not clean anymore.\"\n\n\"Why did he act like he cared, only to throw me away?\"\n\n\nThis wasn’t a love affair.\nThis was grooming.\n\nHe conditioned her trust, intoxicated her, used her, then discarded her. And even after realizing everything, she still blamed herself.\n\n\n---\n\nMy Story: Why This Hurts Me Too\n\nShe told me everything. And I believed her. I still do. But the hardest part? Other people don’t.\n\nEven my own uncle dismissed it. He refused to believe the evidence, called her a liar, and even defended the abuser. That’s what broke me the most—if people can so easily ignore her pain, then what about mine?\n\nBecause this isn’t just about her story—it’s about what this has done to me.\n\nI wake up angry every day. Not just at the abuser, but at the world that lets people like him exist without consequences. I want to protect the next victim. I want him to feel the fear she felt.\n\n\n\nSo I need to ask:\nDo you think she was having an affair to which she alwys said that he was just a good friend whom she trusted ?\nOR\nDO YOU THINK SHE WAS GROOMED...?\n\n\nI WANT REVENGE NOT JUST FOR HER BUT FROM MY ABUSER TOO... ANY ADVICE.\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "I Think She Was Groomed, Used, and Discarded—Now I’m Left with the Pain Too\" do you think she was groomed as an young adult girl.. early 20s..how to i help and avenge abuser..?",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j91uzb/i_think_she_was_groomed_used_and_discardednow_im/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 21:12:37 UTC",
    "id": "1j91t16",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 15,
    "secure_media": null,
    "selftext": "Me and the Situationship old enough to be my dad are not seeing each other anymore. I was very excited and relieved, he's started seeing other people. I know if I ended things he'd just give me the silent treatment, yell at me, attempt to make me look bad at work, or physically hurt me all things he's done at work when he thinks I'm rejecting him. \n\nSo I was very happy and relieved to find out he went on a date with someone else, he even gave me the silent treatment all day yesterday. Today though, he's acting normal though, saying hi and trying to make jokes. I found out I might have to work with him tomorrow so i asked the one supervisor that I do trust if I could skip working with him. I've already told a few supervisors i feel uncomfortable with him and everyone just laughs it off, \"oh yeah he's just a character, that's him.\" Situationship even gloats, \"my job is whatever I want, they're not gonna do anything. Our boss isn't gonna do anything I told her already.\"\n\nTrusted Supervisor doesn't know anything that's happened outside of work, I only told him what Situationship has done AT work. I'm so embarrassed, nervous, I even feel humiliated. I don't want to make an official report but Trusted Supervisor is telling me to take it to the highest in the office, our boss's boss's boss. I am dreading it. I have 2 weeks or he'll make the report himself.\n\nI'm not gonna mention the assault, the weird relationship we had outside of work, only the inappropriate behavior that happened during work but still. I'm worried Situationship will say I just have a vendetta against him. He already gets away with everything, maybe he will bring up our relationship outside of work to cover his ass. Situationship just gets to do whatever he wants and it's irritating me. \n\nHe called another supervisor (who's black) a monkey and almost dropped the N-word. He was screaming this in my face on the street, we work at a hospital and multiple people heard this. No one cares, the supervisors I have told just said, \"yikes yeah he was really mad that day.\" \n\nDread dread dread that's all I feel right now. ",
    "subreddit": "TrueOffMyChest",
    "title": "I might have to report my coworker and I really don't want to",
    "upvote_ratio": 0.86,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j91t16/i_might_have_to_report_my_coworker_and_i_really/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 20:59:45 UTC",
    "id": "1j91hpb",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 8,
    "secure_media": null,
    "selftext": "I thought it would be different. I thought I would be a different kind of mother, I thought my partner would be different kind of father. I ignored cracks in our relationship because I do love him a lot and I wanted a child. And now I‘m in my bed crying because I don‘t know how to get through the next day. My back is killing me, the baby has reflux all day long, we barely get out of the house and the post partum fears of him dying or getting hurt are a constant thought circling though my brain. Pumping, changing diapers and cleaning bottles is all I get done when I‘m home alone. And when my partner finally comes home and I could do the chores I‘ve been wanting to do or actually take care of myself for a minute I lack the energy. I can‘t really talk to my partner about it either - best case scenario: he gives well intentioned but surface level advice, worst case: we have a fight. He‘s a good person and he‘s never been lazy or unreliable but he has always struggled with other peoples emotions - especially mine. \n\nEvery night I dread what‘s to come and when it‘s finally morning I feel drained and disgusting.   I knew post partum would be hard, but I really thought I‘d be stronger. But I‘m not. And the worst thing is I don‘t feel that bond I‘m supposed to feel. I love my son but he feels like stranger and i just can‘t figure him out. maybe this was all a mistake but now it‘s to late to go back. All I can do is hope it gets better.",
    "subreddit": "TrueOffMyChest",
    "title": "I regret starting a family",
    "upvote_ratio": 0.9,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j91hpb/i_regret_starting_a_family/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 20:45:36 UTC",
    "id": "1j915du",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 1,
    "score": 6,
    "secure_media": null,
    "selftext": "So I’m now 17 I’m also a girl. My older half sister was my dad’s daughter from his first marriage and she was 6 years older than me. I say ‘was’ because she was disowned about 6 years ago for unrelated reasons. Anyways I don’t know when it started nor do I know when it ended and to be honest all I know is that it happened. When I was about 4 years old she full on raped me but I don’t like to think about it as that is the most gut trenching memory I have. My parents don’t know that it happened and in all honesty I don’t want to put the burden of what happened to me on them. My “sister’s” bio mom was an abusive drug addict and I know that in order to know what she knew she probably went through her own sexual abuse but at the same time I hate her with every ounce of my being as I blame her for why I can’t remember anything before the age of 9 or the fact that I had a fucked up childhood. I guess I just wanted to get what happened off my chest as literally no one knows and it’s something I’ve been hanging onto for close to 12 years.",
    "subreddit": "TrueOffMyChest",
    "title": "My older half sister molested me from around the ages of 2-6 and I’m finally going to stop pretending it never happened.",
    "upvote_ratio": 0.88,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j915du/my_older_half_sister_molested_me_from_around_the/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 20:41:22 UTC",
    "id": "1j911s4",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 3,
    "secure_media": null,
    "selftext": "there was a time where i had a twitter where i posted certain things , used to send nudes to men on here. i feel lonely, one of the reasons i did it was to take control back of my body that my ex raped me for. i hate my body so much \n\ni deleted everything at some point and it feels like that’s all i’m good for. i feel like getting back to it and sexualise myself for money and company. i don’t have a love life at all which doesn’t help me \n\nit feels like my body is the only semi-decent thing about me and felt close to doing porn. a little irrelevant but i feel like being a stripper/escort or hire one to feel something \n\nedit: **PLEASE STOP MESSAGING ME FOR NUDES FUCK OFF also tried therapy multiple times and not going back** ",
    "subreddit": "TrueOffMyChest",
    "title": "wishing to go back to my old ways",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j911s4/wishing_to_go_back_to_my_old_ways/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 20:35:12 UTC",
    "id": "1j90wb1",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "This is my first year in college &amp; when I first started in I joined the freshman gc. About a month of into the semester, I haven't made any friends. I texted the freshman gc &amp; see if anyone wanted to be friends. Angela responded, we met up, and she introduced me to her friends and we've all been hanging out since. Yesterday, I'm getting texts in the gc but I'm not really reading them until I see Angela says my name. I respond how did my name get brought up. Angela says when we all were hanging out yesterday I didn't engage with anyone or say anything and it took her a minute to realize I was there. Then Angela, Randi, &amp; Kasey are all basically saying I don't talk when I'm with them, all I just follow them around, force them to sign me in their dorm to \"hangout\" with them, &amp; they know nothing about me. I texted back saying \"I do talk sometimes its just sometimes I don't talk bc of social anxiety or bc I have nothing to say. The other day only asked yall to sign me bc it was raining hard and I didn't want to walk across campus to my dorm in the rain. I wasn't going to hangout yesterday but then after we left the dining hall Brigitte said she would sign me in and I felt bad asking her to sign me out after she just signed me in. If yall don't wanna hangout with me I won't come around anymore.\" Angela, Randi, &amp; Kasey said we do want to hangout with you we just want you to talk and engage with us instead of sitting there and being a wallflower and something must be wrong with us since you been with us since last semester. I tell them nothing is wrong is them its me and I'll feel like I'm not anyone's friend in the gc and it's my fault bc I don't talk enough but I'm trying more now that I'm in college and I'll still eat with yall and try to more but idk abt hangout rn. About 5 min after I send that message I was walking to class with my I was walking to class with my headphones on and passed Angela. I didn't feel like talking so I didn't say anything. She responds to me in the gc saying I said hi to you and you literally just ignored me. how can we get to know you if when we give you the opportunity and you're not here with us I respond to her and say I didn't see u I had my headphones on and I was going to class. Then Kasey says you did see her. Then a few of the other people in the gc tried to defend me. Today I walk in the dining hall and I see some them sitting together. Usually I go sit with them or least say hi but after yesterday I felt weird doing that. They never spoke to me and I never spoke to them. I'm not sure how to feel about this. I just wanted friends but now I feel even more out of place.",
    "subreddit": "TrueOffMyChest",
    "title": "I was called out for being too quiet and now I feel weird around my friends",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j90wb1/i_was_called_out_for_being_too_quiet_and_now_i/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 20:32:01 UTC",
    "id": "1j90tls",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 3,
    "secure_media": null,
    "selftext": "Anxiety sucks. I've been having an ongoing issue with two co-workers who have basically just been mean girls since the day I started a couple years ago, and the only thing that I'm guilty of doing is trying to do my job to the fullest, which I know they haven't been a fan of because I draw more attention to our team which means more work might be given to our team and more responsibilities which they don't want. I know they don't want this because they have actually vocalized that to our manager, whenever there's a chance for more opportunities or extra work to be done they both shut the idea down so hard and fast and I'm usually the one who's okay doing the small tasks.\n\nThere's multiple incidents where they have both been unprofessional and have come at me in aggressive ways for various reasons. Every single incident has had another teammate witnessed the whole thing. my manager is aware that there is an ongoing issue and there have been corrective actions taken for one coworker since they have complaints in multiple departments from multiple people.\n\nAnd last Thursday they decided to ambush me in a meeting accusing me of not doing my job or avoiding work and insinuating that I was lying when I tried to tell them what was going on, and I had it, so I talked to my manager and they suggested I go to HR, because if I didn't they were going to report it so I figured well if it's going to happen one way or the other I might as well do it. so I reported this to HR something I have never done before. And I have anxiety through the roof, because I've never gone to HR with a problem before because normally in my other jobs the mean girls are the girls that the managers adore and they see me as the problem.\n\nSo in my head I'm going to lose my job because I'm the problem, when I haven't instigated anything. And I hate that I think that I'm the problem and I hate that I have so much anxiety for just trying to stand up to myself and have a non-toxic work environment and not be disrespected in front of my coworkers or at work.",
    "subreddit": "TrueOffMyChest",
    "title": "Workplace drama",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j90tls/workplace_drama/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 20:25:40 UTC",
    "id": "1j90nz8",
    "link_flair_text": null,
    "media": null,
    "num_comments": 95,
    "score": 167,
    "secure_media": null,
    "selftext": "As the title says my (m17) girlfriend (f17) just called me misogynistic and I dont really know how to think about it. We were talking in the phone and somehow got to the topic of our future life together and about how many kids each of us would like to have. I think about having two kids later in life, however she only wants one. Because I would really love to have two kids, I listed her some things in which my own siblings  helped me a lot and how good it would be for the kids to have a sibling. Then she said that my view is misogynistic as I wouldn‘t leave her room to chiose freely\n\nSorry for the spelling/grammar mistakes, English isn‘t my first language\n\n\nEdit: My sisters were there for me while I was bullied a lot, and were my only real „friends“ i had during that time, thats what i meant when I said they helped me a lot es",
    "subreddit": "TrueOffMyChest",
    "title": "My GF called me a misogynist",
    "upvote_ratio": 0.85,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j90nz8/my_gf_called_me_a_misogynist/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 20:23:36 UTC",
    "id": "1j90m78",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 0,
    "secure_media": null,
    "selftext": "Met the girl of my dreams, cutes big eyes, bright smile, fun and energetic, close to GOD, i 1st met her at grade school but we were not that close at those time wasn't even interested at her during those times but i admire her energy and her eyes, time skip to highschool i would often remember her idk why i would suddenly miss her, i only get to be her classmate for once, but her face, eyes and smile is somehow drilled in inside my head, after then i started stalking her socials rarely since its set on private there wasn't much to see, graduated highschool and im still somehow missing her, later on i met her on a senior highschool conference, she still looked the same as the last time i saw her, she was much more cuter and prettier in person, i never knew someone i admire from a long time ago would grow up to someone like her, i do like to approach her, i did a small hi gesture but she doesn't seem to have notice me, after then i realize than she may not recognize me or know me at all anymore it was natural since i never really made much of  connection even back then, she pick a private school and i goes to a public senior high, somehow i would often see her on my way to school and found out she lives nearby my school, so eversince then i would often go late to school just to time her going out for her school too, i never interact on her during those times, later on i gathered courage to talk to her through online and surprisingly she does reply and talk, she then gotten close enough to meet up, and we started off good, she was kind of flirty in a friendly way or im just delusional, and to this day i just confessed my feelings to her but i never mentioned how i liked her for years as i dont want to seem like a creep or a stalker, i really thought i had a chance on her, but i guess its just way too good to be true, i wished i just kept my mouth shut and let things be the way it is, in just a few words i broke that one thing that is keeping me by her side, now im just dating a girl that resembles her but the eyes could never be the same, i think im about to break and create someone like me",
    "subreddit": "TrueOffMyChest",
    "title": "Sometimes its too real to be true, just got rejected",
    "upvote_ratio": 0.2,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j90m78/sometimes_its_too_real_to_be_true_just_got/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 20:13:55 UTC",
    "id": "1j90dxn",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 4,
    "score": 0,
    "secure_media": null,
    "selftext": "\n\nFor context, I (45F) have rental policies which I'm very particular about. One of these policies is that tenants are prohibited from having any colors in their house except beige, white, and black. Although this might seem strict, I allow tenants to have colorful screens, clothing, and food boxes (albeit in the trash). I also provide storage for food, which is properly colored to fit my needs. I also do check-ins every two months to make sure my terms are followed, and the property is not damaged. Occasionally, they'll be unannounced so there will be no cover-ups.\n\nOne of my tenants (29F), has been renting with me for five years. We went over the lease agreement, and she agreed to my terms. Since then, she has gotten pregnant and birthed a beautiful baby girl named Paisleigh, whom I insisted upon the name for.\n\nIn the present, it's a brisk August morning. As usual, I go to check my property. It is completely in shambles. The decorations, furniture, walls, and all of that were fine, but there was one massive oversight. Toys scattered everywhere. I would be fine if they were correctly colored, but no. These are colorful toys. Dolls, stacking donuts, blocks, wooden cars, rubber ducks. It was such a disgrace to my property, I had to look away. I reminded my tenant that of course, she can have toys in the house, but they must be in accord with the rental policy. She apologizes, and I leave. I thought my warning would be okay.\n\nFast forward to a few months later, I return, again unannounced. Still, she keeps these pigmented, bright toys around. I further warn her, but it's not enough. She insists bright colors are good for development. Later that night, I enter her house using my spare key, silently creeping into her room. The baby is sleeping inside a playpen, so no worries there. I wait to make sure that she's truly sleeping, then I pounce. I acutely latch onto her throat, and she screams. I feel her voice box vibrating through my strangling hands as she tries to scream, but nothing comes out, just sputtering and choking. I keep choking as she thrashes about, until around three minutes later, and I know I'm done. She has no pulse, and her body is as limp as a ragdoll.\n\nI transport her corpse and the sleeping baby into the car, driving to a beachside town to dump the body. I drive back to my house, and I don't know what to do with the baby, so I decide to barbeque her. As she sleeps, I preheat the grill, lighting it ablaze, and then after about 14 minutes, I set her on the cooking rack. Soon I can hear wailing from under the hood of the grill, before she could gasp for air anymore. It's terrible and loud, but eventually, with the smell of charred meat, it ceases. I drive to a nearby college town to dump the second body.\n\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "I let my tennant go after she broke my policies.",
    "upvote_ratio": 0.1,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j90dxn/i_let_my_tennant_go_after_she_broke_my_policies/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 20:12:07 UTC",
    "id": "1j90cgj",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "My (25M) gf(22F) has 5 exes, which two do them had my same name, even one of them having my same surname, she kept it a secret from me for 5 months until she invited me to her house and met the fam, overnight I had to go to the bathroom and heard her sister and mother talk about how another one with the same name, I kept myself the secret and pressured her with hints, she wouldn’t say, she was just sad and changed subject of conversation, after 2 months of knowing I confronted her and said it was a secret she was going to take to the grave if I didn’t found out, or maybe until marriage. Also her body count being 9 and mine 2, which wouldn’t bother me if I wasn’t a guy who hates one night stands and she had had 4. I don’t know… I can’t find the courage to end the relationship as she had had exes beating her or cheated on. Sometimes she relates those men to me and even her father which abandoned her at 5, every small resemblance I have with an ex or guy that did her wrong I will do the same thing according to her. I want to make peace, she’s just had many experience and can’t seem to move on. I’m constantly worrying and everyday is a small fight. I love her but damn life is hard.",
    "subreddit": "TrueOffMyChest",
    "title": "Making peace with gf past",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j90cgj/making_peace_with_gf_past/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 20:11:48 UTC",
    "id": "1j90c73",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 5,
    "secure_media": null,
    "selftext": " To preface I am in college now and this was almost 3 years ago. Okay so I (F 20) had a big group of friends in high school. We all got really close senior year and there were a lot of characters so I will be using fake names. It was around prom season this whole thing started. There was a boy I was talking to and he wasn’t super favored by alot of people but everyone talked to him because he was like a class clown. We’ll call him Jacob. Jacob had originally planned of going to prom with a girl Tess. Tess never wanted to go with him so when he met me and we started talking he told her that they shouldn’t go together because it would have been boring because she didn’t even want to go with him. This was wrong I know and should’ve told me something because me and Jacob went on to date and he was actually insane. \n\nAnyways this caused a big drama and caused Tess and her close friends to hate me. Tess’s friends were friends with some of my friends and my friends began to act weird to me. Not talking to me all that often but that was fine because I still had my core friends. My core friends being Sasha, Kylie, and Khloe. I ended up having a falling out with Kylie and Khloe too due to all of our other friends deciding to hate me for dating Jacob but that’s besides the point. \n\nJump to prom and all of the weird behavior continued and I had to go on a party bus with all the people who I know knew were talking shit about me. I ended up leaving with Sasha and Khloe because I couldn’t stand to be on the bus and we met up with Jacob. Prom ended so odd and it was clear no one wanted to talk to me because I was with Jacob. \n\nFast forward to the summer after prom. One of the boys who was in my old friend group posted something on his spam story on Instagram with a video from the party bus from prom, “ Missing prom. Don’t see any ‘dirty looks’ but I digress”. This was a direct dig at me because I had told Khloe that whole group had been giving me and Sasha dirty looks on the bus.  Me and Khloe had already fallen out by this time . (Sorry for all the jumping around Im just trying to give context). So I tell Jacob who I’m already dating by this point that he had posted something so Jacob decides to post on his story a picture from prom captioned “I loved prom but definitely not those dirty looks😍”. This starts a war in instagram notes of all places. We’ll call the boy who posted Joey. Joey begins posting in his instagram notes saying how me and Jacob are so mad and then begins and argument with Jacob on instagram notes. I was mortified because really? Instagram notes? \n\nBut anyways they go back and forth with petty comments to each other but I stay out of it. This goes on for probably 20 minutes. Then joey decides to personally attack me and posts “Letting him hit in 3 weeks? Not very disney of you” And he always used to say I could be an actor on Disney channel so I knew this particular comment was for me. I start crying because now personal information is being shared. Oh and every person I used to be friends with was egging him on in their instagram notes. I want to be clear that other than going to prom with Jacob I had never said or done anything to any of the people that were mad at me and posting about me. Joey keeps going and decides to post about things I only told Khloe and Kylie. About my personal sex life with Jacob. Joey posts that on instagram notes and I freak out because now everyone is looking at this and most people know it’s about me. \n\nThat’s when I start getting texts from fake numbers. Slut shaming me, calling me ugly, threatening me and telling me to respond. I couldn’t deal with it. It all ended 20 or so minutes later but I was like wtf. I don’t talk to any of these people anymore other than Sasha. Jacob ended up being a maniac so we broke up. Anyways this all happened almost 3 years ago I guess I just wanted to see what people would say and if going to prom with Jacob made me deserve all this?",
    "subreddit": "TrueOffMyChest",
    "title": "My high school friends posted about my sex life of instagram",
    "upvote_ratio": 0.73,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j90c73/my_high_school_friends_posted_about_my_sex_life/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 19:54:56 UTC",
    "id": "1j8zx5c",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 2,
    "secure_media": null,
    "selftext": "\n\nI’m so jealous of people who go to art school. That was my lifelong dream, but I can’t pursue it due to future anxiety. The socio-economic condition of the world is so uncertain, and I don’t want to throw my future away. It’s not that I don’t trust my skills, but I still find it very risky.\n\nBut whom I despise the most are the talentless people who go to art school. I’ve been putting effort into this field since childhood. I’ve been practicing every medium, trying to learn every technique; studying color, objects, anatomy, proportions—everything… I put my years into my current skills. But for example the people who graduated from my high school that decided to study arts in university—none of them put that much effort into it. Most of them went to art school because they weren’t good enough in any other subject, and this felt like the easiest choice. They took classes in their senior year to create a decent portfolio, and that’s all. All they did was tracing shitty Pinterest drawings before that. And some of them are nepos, who got into art colleges by mostly using their parents’ connections.\n\nI’m jealous, I’m so fucking jealous. They don’t deserve it. It should’ve been me.",
    "subreddit": "TrueOffMyChest",
    "title": "This post can make me sound arrogant and condescending, but at this point I can’t care.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8zx5c/this_post_can_make_me_sound_arrogant_and/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 19:54:26 UTC",
    "id": "1j8zwps",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 25,
    "secure_media": null,
    "selftext": "Well when i was under the age of 6 i had 5 siblings. The two came after I turned 10. I didn't play with them at all because by the time the last two were of playing age I was already a teen. \n\nBut my mom always made sure that we behaved in public. Whether it would be by her pulling us to the side by the ear and threatening an ass whooping or to leave us at home, it worked. We would walk single file behind her, sit at restaurant tables and chat quietly with each other, never raising our voices. We ended up homeless for a year or two when i was young, so we were put in one small room. We were made to clean the house and learn chores so we could help the people we were staying with. \n\nWhen my mom was able to find a house, she said it was always hard because renters always thought that many kids wouldn't be worth a tenant. So anytime we moved we would clean the house spotless. We moved a lot. We also would clean spotless whenever the land lord was visiting. \n\nMy mom knew how it looked to have so many kids behind her, especially when her husband wasn't around because of work so it was only him. She thought people saw her as a poor, ghetto woman with an army of kids who she couldn't control so she made damn sure we wouldn't be like that. \n\nBut like why have that many kids in the first place.... or continue having them even after experiencing homelessness? We were back and forth between many of friends and family after my parents divorced. And we moved 13 times before I was in high school. Yet she still had kids but that's another topic for another day.... \n\nThat basically taught all of us to keep up with appearances. My mom was also incredibly mentally, physically and emotionally abusive so there was always fear in my house. It was my siblings and I against her, so we were all close and together. \n\nBut then we started to turn on each other as we got older, probably from my older siblings maturing and growing bitter and angry at the abuse. I'm going through that phase now. \n\nEither way it led me to become emotionally detached from my siblings. There was always just so many things going on, it was hard to keep up. \n\nOnce my older siblings moved out I was the oldest in the house and it became my responsibility to cook and clean for everyone. I got tired of it and moved out a month after graduating. \n\nI got sick of taking care of others when I was a child, so I just left. Another step i took to separate myself from my family. \n\nSure, having big families are fun. It's never quiet, immediate family reunions are crazy and loud (my mom also had 7 siblings so imagine how big they got), you get to grow up with multiple best friends, but when you have an emotionally and mentally unstable mother with an enabler husband, it's terrible. Never a peaceful moment, especially not with the homelessness or having to share rooms with siblings when we got our own houses, constant arguments because nobody knew how to regulate themselves and constant abuse. \n\nIt drove my older sister insane. I haven't seen her in years. It's driving me insane now. \n\nI never had room to be myself, not until after i turned 18. I never got to properly develop so now I have mental issues. And chronic illnesses. \n\nGrowing up with 7 siblings was hard. My mom's attention was only focused on the younger one. Yeah, we would have fun times and a lot of them but that doesn't overshadow the abuse or anything else.\n\nI always get jealous of people who are close to their siblings. I can never have that, not anymore. I can barely form and maintain friendships, much less familial relationships. \n\nNot to mention how people react whenever i tell them how many siblings I have. I've had to fight  few people who talked crap about my mom being a whore. My siblings have had to fight other kids for the same thing. Nothing says bonding time more than beating the kid who made fun of your younger sibling. Classy? No. Fun? Yes. ",
    "subreddit": "TrueOffMyChest",
    "title": "Growing up with 7 siblings in a low middle class family has really shaped me",
    "upvote_ratio": 0.9,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8zwps/growing_up_with_7_siblings_in_a_low_middle_class/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 19:54:06 UTC",
    "id": "1j8zweu",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "My manager is such a bitch.\n\nHas no control over his emotions, gets over stressed out and takes it out on everything. I am typing this as he threw a temper tantrum and left the office to smoke half a pack of cigs. No sense of professional communication or aptitude to handle adversity or difficult situations thrown at him.\n\nI hate it working under him- while he is forsure more experienced than me. Just as a man I feel I’m better suited for his job. \n\nHe consistently procrastinates and then wonders why shit doesent get done. He is an asshole to people in our building and doesent understand why our department gets such a bad rap.\n\nBut I’m only at this job temporarily I will continue to deal with it. I’m just glad I realized it wasn’t me, he is just a bitch.\n\nIf you feel the same please comment!",
    "subreddit": "TrueOffMyChest",
    "title": "My manager is such a bitch",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8zweu/my_manager_is_such_a_bitch/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 19:39:07 UTC",
    "id": "1j8zj6o",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 19,
    "score": 3,
    "secure_media": null,
    "selftext": "No matter what, I don't see how life is worth living. I don't know if it's due to the fact that I'm missing something and I'm just too stupid to see it or if I'm actually smart and thinking about things that an average person wouldn't, but I see life as entirely meaningless.\n\nIt doesn't matter whether I assign my own meaning to it or accept that it's objectively meaningless and do what I want, there's nothing that justifies the suffering that is inevitable, no matter how good your life is. Besides, no matter what anyone accomplishes, they will eventually be forgotten and their accomplishments will also go to waste. Living for the little things/occasional moments of joy and assigning meaning to them doesn't make any sense to me.\n\nI can't even really talk to anyone about this, besides my therapist (therapies haven't been useful ever since I started going a few years ago btw, even after switching therapists), because nobody seems to understand it and they are just fine with working their pointless 9-5 jobs. Even if you don't work a regular 9-5 and actually like what you do, it still seemingly doesn't matter in the long run. Everyone would just scratch it off as mental illness and not think about it any further, but nobody so far provided me with a solid argument against this nihilistic thinking. I guess that's what I'm looking for. One god damn thing that objectively makes sense.\n\nAnyways, that's all from me. I really doubt that I'll be around for much longer, but whoever might be reading this, thanks.",
    "subreddit": "TrueOffMyChest",
    "title": "It frustrates me that no one relates",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8zj6o/it_frustrates_me_that_no_one_relates/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 19:29:55 UTC",
    "id": "1j8zazc",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "",
    "subreddit": "TrueOffMyChest",
    "title": "Not many people know this about *scars*:  Whether they're emotional or physical, they're not really *healed*.   There is a tiny residual numbness from each one that will be there for the rest of your life.",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8zazc/not_many_people_know_this_about_scars_whether/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 19:29:32 UTC",
    "id": "1j8zaob",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 8,
    "score": 2,
    "secure_media": null,
    "selftext": "When I was a teenager I got away with a drunk driving incident that totaled my car and damaged three more. \n\nNo one died, but the airbag of the car I hit from behind didn’t go off and the driver broke his nose on the steering wheel.\n\nI was so young at the time my family took care of the insurance correspondence while I delt with legal stuff for a hit and run charge that came from it.\n\nMy mother was going through old files and found her folder of all the documents from that time.\n\nI read through them and found out the extent of the man’s injuries who broke his nose. Whiplash so severe he lost work, peace of mind, and quality of life. I never knew these things until now and I couldn’t help but cry reading the reports. I don’t know why I never thought it was more than a broken nose, but I was young and unstable and I guess I had other priorities.\n\nIt probably wouldn’t have helped my state of mind knowing at the time, but something about it feels wrong learning so much later in life. \n\nIm an adult now but still ‘young’ enough that people I’m not close with don’t really respect when I tell them I’m sober. The people I love will never know the extent of the shame I feel when I drink. None of them know the real reason that accident occurred for certain, but I’m sure they’ve suspected.\n\nSobriety is a bitch but self pity wont fix an injured neck. \n\nTLDR; I found out the true extent of injuries I caused in a drunk driving incident. No one ever knew I was drunk and I faced very few consequences considering the circumstances. Don’t drink and drive.",
    "subreddit": "TrueOffMyChest",
    "title": "I totaled my car drunk driving",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8zaob/i_totaled_my_car_drunk_driving/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 19:27:24 UTC",
    "id": "1j8z8t3",
    "link_flair_text": null,
    "media": null,
    "num_comments": 35,
    "score": 32,
    "secure_media": null,
    "selftext": "My (30f) ex (33m)  is dating a neighbour in my building. We broke up about 8 months ago. We were together 3.5 years. Throughout the course of our relationship there were definitely issues. We lived together for two years and after the break up we still lived together for a month and a half as we had to sell our house. What's wild is we talked about getting married two months before we broke up and he was 100% on board. We broke up over a really intense fight where he blamed me for something he lost. It's a long story, but we fought for 3 days, decided to take a break for a week to think about what we wanted to do about this. He decided to end the relationship.\n\nLiving together still was hell. He was awful. He threatened to throw my stuff away because he thought I was dating. I found out he made two catfishing dating profiles right after we broke up which he later matched with me on and then would block me. I found out from a close friend of his what he was doing. Curiousity got the better of me. I made a real profile of myself to see if it was true. He swiped on me, blocked me, and remade those profiles a few times. He called me dumb each time I disagreed with him with things concerning selling our house. He skipped out on the last mortgage payment. He also refused to help prepare the house for sale. I did everything on my own. Meanwhile he still ate my food, kept walking in on me while I was changing (the door didn’t lock), and would sometimes pressure me to still sleep in our bed because as he put it: “we slept together for almost 4 years, what’s a few more nights.” He also got me an insanely expensive birthday gift and wrote me in as a plus one to a wedding both after we broke up. For weeks after he moved out, he kept trying to sleep at our old house for a whole week. I put my foot down here and told him I needed space. \n\nI tried to be respectful as possible from the start to honor his wishes. I didn’t want to be with someone who didn’t want to be with me. Besides one conversation about our relationship after we broke up a few weeks in, I left him alone. I only talked about the house or things we had to communicate about. I tried setting some boundaries, but after he called me dumb, I gave up and bit my tongue through it until he moved out. \n\nHe always knew where I was moving to, it was also in our documents for the notary. I told him when I found a place which street and he mentioned the building. Since I moved in, I swore I saw him often driving by. I knew he bought a car (that also looks incredibly similar to mine). I also was pretty sure I saw his bike parked outside my building a few times. I heard from a cousin who followed him on Strava that he also ran close to my place or in my street multiple times a week for months. Then there was when I had a dating profile, I saw he was on there for real as himself and it kept saying he was 650 feet away and sometimes 1 mile away. I'd sometimes block him and then he'd have a brand new dating profile again showing the same sometimes. Each time I deleted him, for months he popped back up. It was triggering me so much. I did delete all dating apps two months ago. I had a stalker (different guy) for five years with court dates and all. This same ex helped me through this. He was so empathetic about everything I went through with having a stalker. And here my ex is, also invading my space. In a different way, sure. \n\nNow last Saturday I saw him help a girl move a piano in. He was in the entry way of my building. I felt my heart race and my anxiety spike. There was another guy there so I was hoping that maybe this guy was her boyfriend and he was just friends with them. Then this morning, as I was returning from walking what used to be our dog (now just mine), he walked out of the elevator freshly showered. He smugly greeted me as if I was an old acquittance.  As I looked out the window of the elevator, I saw he used a key to the building. That made me feel a bit uncomfortable too. I was now even more suspicious and panicking. I texted a mutual friend. I don't care that he's dating. If I saw him in the city on a date, I probably wouldn’t react much. I do care that he's in my space. The mutual friend confirmed he's seeing someone and told me her name. We have a group chat with everyone that lives in the building and low and behold there she was.\n\nJust...what the fuck. Who does this? He knew when he probably first went to her place that I live here too. And when I guess things got more serious, he also knew. What's worse is that that friend told me a friend of ours set them up who also knew exactly where I moved to. If I was dating someone and I found out they lived in his building, I’d either stop seeing that guy, I would send a courtesy text, or I’d at least ask the person I’m seeing if we could primarily hang out in my building. \n\nI feel he could have at the very least sent a message. I thought I was being paranoid for months thinking I saw signs of him being in my space. Now I hate the fact that I may run into him this often, but I would have much rather known he’s dating someone than think he was stalking me. I also was just moving on with my life. Seeing him is still a bit upsetting. It's one thing if this was years later, but it's only been 8 months.\n\nAll of the things he's done since…It's so unbelievably cruel. I am so angry. I haven't messaged him because I don't think he'd respect my boundaries. I just want to move on. I deserve that. I don't deserve this.\n\nI've come to the conclusion that he should be the one who feels uncomfortable seeing me. Not the other way around. I shouldn't have to feel uncomfortable in my own space.\n\nSorry for the cursing, but what a motherfucking asshole. Never called an ex that, but he absolutely deserves the title.\n\nJust needed some other people to know about this jerk.",
    "subreddit": "TrueOffMyChest",
    "title": "My ex is dating my neighbour",
    "upvote_ratio": 0.82,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8z8t3/my_ex_is_dating_my_neighbour/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 19:00:48 UTC",
    "id": "1j8yl9d",
    "link_flair_text": null,
    "media": null,
    "num_comments": 11,
    "score": 62,
    "secure_media": null,
    "selftext": "The day I always feared has arrived. My cat looked completely disoriented, and his head was shaking uncontrollably. My brother took him to the pet hospital, and it turned out he has a tumor in his liver and another in his brain.\n\nI was deeply connected to him—we had him for 15 years. With everything I’ve had on my plate lately, this is the last thing I needed.\n\nI'm a 23-year-old guy, lying in bed, crying like a child. I always dreaded this day because of his old age, and now it’s here. The emotions are overwhelming. I don’t think I’ll ever adopt another pet again—the pain of losing them is too much. It’s just not worth it.\n\nSome people think, “It’s just a pet,” but they don’t understand. Try living with one for 15 years—it becomes a part of you, like family. I’m shedding tears as I write this. Why does life have to be so dark, so heavy? It’s hard, man. And it’s even harder when you’re a man, expected to bottle up emotions because showing them is seen as weakness in this fucked-up world.\n\nI can’t talk about this with my friends, so here I am, pouring it out here because I have nowhere else to go. I’ve been trying to pick myself up bit by bit after the negativity of the past four years… and now this?\n",
    "subreddit": "TrueOffMyChest",
    "title": "Had to Say Goodbye to My 16-Year-Old Cat an Hour Ago…",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8yl9d/had_to_say_goodbye_to_my_16yearold_cat_an_hour_ago/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 18:59:20 UTC",
    "id": "1j8yjxi",
    "link_flair_text": null,
    "media": null,
    "num_comments": 42,
    "score": 231,
    "secure_media": null,
    "selftext": "\nHi all. My mom has always treated me like I am her second favourite after my sister all my life. This has really messed up with my self esteem. Now I am married with a son and another one along the way. Anyways, there have been three situations where I asked her to come and stay with us for a bit. We initially both stayed in the same city but now are 2 hour flight away.\n\n1) First, my husband had a work trip in Oct last year. The morning sickness was at its peak at 3 months. And I just wanted someone around incase there is a medical emergency for 3-4 days. We have a nanny to help with my son for most of the day. So all she had to do was just be around. She refused saying she has a neighbour’s birthday party to attend. I let it go.\n\n2) Last month, I called her and asked her if \nshe can be with my son for 3-4 days when I will be in the hospital around my due date. Again the nanny is there. She just has to manage the night when he is sleeping. She refused saying she can’t leave my dad alone during easter time and needs to cook for him. My dad is a perfectly abled man who can cook his own food.\n\n3) Yesterday, my husband’s side of the family had an emergency situation and my husband had to leave for his parent’s place for 3-4 days. This time I was sure I will not ask my mom to come down again. But my husband called my mom and literally begged her to come down as he didn’t want to leave me alone with my son at this juncture. Her cold response was that she has to be with my dad and cook for him etc. She asked us to keep the nanny to stay over for a couple of days. I fully support my husband’s decision to be with his parents at this time for reasons I can’t divulge. \n\nAfter yesterday, I lost it with her. I told her that she wont hear from me again and she is a sad excuse for a mom who can’t even be with her daughter when there can be a medical emergency. And in case I die she need not come either. So she blamed me for moving cities without considering all this. And that my dad has slogged all his life to educate us etc. how can I think she can leave him and rush to me. For context, I moved cities because I got a better job that pays her bills to a certain extent and gives me some semblance of work life balance. As for my dad, he is not a baby.\nWhat kind of mother would want to miss the birth of her grandchild or not want to be with her daughter when she is almost due",
    "subreddit": "TrueOffMyChest",
    "title": "I have decided to cut ties with my mom after she refused to be there for me when I needed her the most.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8yjxi/i_have_decided_to_cut_ties_with_my_mom_after_she/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 18:58:56 UTC",
    "id": "1j8yjkr",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 0,
    "secure_media": null,
    "selftext": "People think that because they went a year without sex and it wasn’t a big deal, they can relate to someone who reaches 25, 30, or 40 years old without ever having kissed or held someone’s hand. They simply can’t. Everyone who tells me sex isn’t a big deal can’t truly understand it, no matter how hard they try. They can’t relate because sex (not just the act itself, but everything around it, like the confidence of knowing you’re attractive enough to attract someone) has become something they take for granted. Only someone who’s never experienced it can truly grasp its importance. You just can’t.  \n\nI know sex can be awkward, messy, or even empty. People get used, hurt, or end up feeling emptier than before. But here’s the crucial part: wanting to experience it doesn’t mean I’m chasing some idealized version. Even in its most ordinary forms, sex is still pretty great, and people still get something out of it. Otherwise, why would so many pursue it despite its imperfections?  \n\nIt’s frustrating to watch others freely explore, make mistakes, regret, have intimate conversations, go on dates, or even just buy condoms “just in case”—gaining experience all the while. People say, “Oh, but sometimes sex can be bad!” But many of us haven’t even had the chance to have sex at all, good or bad. That’s the frustration. \n\nTo all the virgins who want to claim it’s unimportant to them: I’m glad it isn’t for you. Maybe you have low libido, or dating isn’t your focus—that’s valid, and I’m happy for you. But just because you’re a virgin and don’t care doesn’t mean I have to feel the same.  \n\nTo the fatalists: Stop projecting worst-case scenarios and using your bad experiences to dissuade others. Using your story as a universal warning against sex is like telling no one to drive because you had an accident. Yes, sex can get complicated, like anything human, but that doesn’t mean we should avoid it by default or assume the worst.  \n\nAnd stop recommending prostitutes. First, it’s not legal where I live. Second, sex workers might satisfy curiosity about the act, but they can’t replicate the intimacy of someone choosing you.  \n\nTo everyone who says sex isn’t important: Would you trade places? Would you spend the rest of your life without sex, without being touched, without anyone calling you attractive? If it’s so “overrated,” why not? Would you stay in a relationship with a partner who never touches you, has sex with you, or makes sexual comments? If it’s truly irrelevant, this shouldn’t bother you. After all, if you tell me to “just focus on hobbies and friends,” you should be able to do the same to prove your point.\n\nAnd don’t hit me with, “Who says sex is overrated? No one says that!” I’m tired of hearing it in every post I make, or in others’ posts people claiming it’s “not a big deal,” “overrated,” or “no different from masturbation.” It’s a lie they don’t even believe themselves. They trot it out to comfort virgins, but in the real world, look how much energy, money, and drama people invest in sex. If it were “nothing,” why does it drive so much behavior? Sex isn’t everything, but it’s not “nothing” either.  \n\nIf sex is “overrated,” why don’t you stop seeking it? Why not live as if it doesn’t exist? Until then, your indifference just sounds like privilege disguised as wisdom.",
    "subreddit": "TrueOffMyChest",
    "title": "Being virgin sucks a people don't get it",
    "upvote_ratio": 0.41,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8yjkr/being_virgin_sucks_a_people_dont_get_it/"
  }
]