[
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 16:10:11 UTC",
    "id": "1j7aw9k",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 1,
    "secure_media": null,
    "selftext": "my friend might be (by my own definition) a bad person, at the very least they have awful ideals, but im too attached to them to stop being friends with them. i feel like such a fraud to both them and myself.",
    "subreddit": "TrueOffMyChest",
    "title": "i should probably stop talking to my best friend but i cant",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7aw9k/i_should_probably_stop_talking_to_my_best_friend/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 16:08:53 UTC",
    "id": "1j7av98",
    "link_flair_text": null,
    "media": null,
    "num_comments": 16,
    "score": 1,
    "secure_media": null,
    "selftext": "I come from a very religious family But right now I don't believe in god anymore, The idea of god itself is just doesn't make sense anymore to me and Honestly it never did from the start I was just praying and believing because I was told to do so.  \nBut also Atheism doesn't make any sense to me either and I don't know what I should believe in now.  \nOf course my family does not know that and if they did they would probably kick me out of the house.   \nRight now I am in a state of \"I don't know\" and I fucking hate it.",
    "subreddit": "TrueOffMyChest",
    "title": "I don't believe in anything anymore, I don't know what I should believe in anymore.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7av98/i_dont_believe_in_anything_anymore_i_dont_know/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 15:44:10 UTC",
    "id": "1j7abdn",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I'm *extremely* anal about following rules to a tee at work. I've even gone to one of my bosses before to report the fact coworkers won't stop forcing me into their rule-breaking (In all fairness, I tell coworkers I want no part of their rule-breaking antics...yet they force me in anyway. They really have no one to blame but themselves if they get in trouble or fired as a result of me informing my boss)\n\nHere's what my coworkers don't realize though: I'd love nothing more than to let my hair down like they do.\n\nMental illness is the only reason I'm such a stickler about rules.\n\nI can explain. As a result of my severe mental illness, the mere *thought* of having to work at any other company makes me want to kill myself (I have a hard time adjusting to new workplaces. Plus, I'm *extremely* picky about which jobs I'm willing to do. That's why I cling to this job like it's gold)\n\nYou see, I'm rigid about rules not because I *want* to be, but because this job is a matter of literal life or death for me. I feel like I can't afford *any* sort of blemish on my workplace reputation.\n\nIt's pretty ironic my fixation on having a flawless workplace reputation ends up making me not very likeable to work with.\n\nIs it my coworkers' fault I have such a severe mental illness I'd rather die than get a job elsewhere? Absolutely not.\n\nIt is, however, 100% my coworkers' fault that they pull me into their rule-breaking antics after I've already said no.\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "I'm unbearable to work with because of my mental illness",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7abdn/im_unbearable_to_work_with_because_of_my_mental/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 15:39:41 UTC",
    "id": "1j7a7x6",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "I'm so tired...of the debts, these emotions, the fights with my boyfriend and being so afraid for my 10 month old baby daughter's future. We're so behind on our bills, we're in so much debt...we owe so many people money. Our friends, our families....I'm so ashamed to face them, I don't even talk to some of them anymore because I'm so ashamed. I feel so guilty...I want to pay them back but I don't have the means to....whatever little money we get we use to pay for food and our utilities. There's never any extra left. We're stuck in a constant loop of borrowing money to pay for all our debts, and we've been stuck for years...nearly as long as we've been together. We know it has to stop but then how will we pay for things?\n\nWe're constantly looking through job postings and sending out applications, I actually got a response from 1 of them but it doesn't start until April (if I can submit all the requirements, which is proving hard to do because we have no funds for it...it sucks that you need money to make money), my boyfriend hasn't found anything yet, though he reassured me after one of our fights that he is looking at every job posting out there and stepping out of his comfort zone, like I finally did last year. Our fights have mainly been about our relationship (we're like roommates, raising a baby) and money troubles, that usually leads to fighting about his difficulty finding a job. Some days I understand that it's just really hard to find one, also we stayed in one industry for so many years that branching out now is....hard. And some days I doubt that he's actually expanded his options, because I expanded mine and I found one so why can't he?\n\nOur relationship is suffering almost just as much as our finances, it's dying. I'm barely interested in sex, meanwhile being intimate physically is his love language. He's barely interested in other forms of intimacy, which is my love language. We've had so many discussions to try and find a compromise but to no avail. Most days I think our relationship is actually over, I've actually tried to break up with him in the past. A few times before I even got pregnant, a lot while I was pregnant and a few times after our baby was born. All those times tho he's refused, says he wants to keep fighting for our relationship.\n\n I had..or maybe, have really bad post-partum depression, it took me 3 months to even \"like\" my baby. I was depressed and anxious the entire pregnancy, but he was just so....unreliable. Like yeah, he did what he could to make sure I got my check-ups and other needs but he wasn't a good emotional support system, he did the bare minimum is what I would call it. He was feeling a lot of pressure and stress, you could just tell.  I know how this makes him sound but he's not so terrible, just...dense I guess and pessimistic. I also know how this makes me sound but I was working during my pregnancy because we couldn't afford for me to not be working too. We both know that we both definitely should have stepped up when I got pregnant and looked for a better job than the ones we had, but we didn't. We were both scared, and we've regretted it ever since. Because even now that decision is bleeding into our current issues.\n\nI've considered just taking my baby and leaving so my boyfriend and I can get some much needed time apart, to think. But there's nowhere I can  go. I also have like a lot of cats that I don't want to leave him with because that would be an AH move, they're mainly my responsibility not his. And yes I know they add to the expenses but they barely eat anymore because we can't afford to feed them regularly. We've tried to get them adopted but no one here wants rescued stray cats. Most people in our country think they're a waste of time and money...\n\nI know we need therapy, together and separately..but that costs money...and...money is the one thing we just don't have....\n\nThese issues have been weighing so heavily on me for a long time, but as I'm typing it I just feel silly...like these aren't really problems...other people have bigger problems is what my brain is saying. Insecurities I guess....\n\nTLDR; My bf and I are broke, in debt, still looking for jobs, have a baby together, dying relationship, exhausted, fighting all the time and DEFINITELY need some form of therapy...",
    "subreddit": "TrueOffMyChest",
    "title": "I need therapy, I'm so tired....",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7a7x6/i_need_therapy_im_so_tired/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 15:38:41 UTC",
    "id": "1j7a757",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "i 33 female is married to 27 male, we have been together for about 5 years going in 6, married for almost 4 years, april will be our anniversary, i love him sooo much, but i cant help shaking off that we are falling out of love, we dont go out together we dont have date night, we dont have time for us as a couple, the days he has off from work he never wants to spend it with me, like watching movies or just being together, i know we have 2 kids a 15 year old female and 4 year old male, we all go out as a family every week, we always make time for our kids, we love them, they are our everything, but he is not paying attention to me, we had sex, i feel our sex is boring, there is no fun out if it, we just do it to do it, i want couple counseling, but he dosent, he buys me everything i want, anything i can think im tired of having the world handed to me, all i want is his attention love, but i seem not to get it at all, i dont know what else to do, i love him trully, but im getting tired of all this, i dont know if its my depression getting to me, or its him that he dont love me anymore",
    "subreddit": "TrueOffMyChest",
    "title": "losing feeling",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7a757/losing_feeling/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 15:30:36 UTC",
    "id": "1j7a13g",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "Idk what's wrong lately. I have been trying to be a good daughter, get good grades, do chores, stay home, not spending parents money, don't pass curfew, interact, talk, always tell them where I am, no boyfriends, etc.\n\nBeing a good daughter isn't enough. So I gave them money hoping that would spend it to ease themselves. But I guess that isn't working either.\n\nParents.They obviously don't like each other, has been almost a year since they slept in the same bed. And said nasty things about each other within my, very obvious, ear shot. \n\nI can't take sides, because I understand both sides. Which is stupid, why am I like this. Always sympathetic.\n\nWas divorce ever an option in their mind? Am I cruel for this narrow suggestion? \n\nTheir comments, I can't help it. It's driving me crazy. \nWhat do you mean by, \"I don't know how long can I sleep.\" as I talk about getting the house a new couch. A sofa bed, to replace the broken one and to improve sleeping arrangements as things are obviously not changing. Is it the finance to afford it? You're not paying, but I'm! I'm trying to make a change, I'm putting my wants on hold. My needs too!\n\n\"Good, quickly finish your course. I'm tired.\" I know what it means and I'm in denial. What. Are you timing it? To just dramatically out after my Diploma?? Am I not doing enough? Am I not enough of reason to make you stay?\n\nI gave it all. I listen when you told me not to look for a job. To just stay home and watch the house. For a year.\nI missed out on experiences. \n\nI gave you all of my leftovers money, granted by the scholarship. What was supposed to be mine and yet I gave it all to you as you vented financial frustration. \n\nWhat if I act out. What if don't care and just stay out late and come back late? What if I don't come home for the night as I try to get high somewhere with someone? Will that give you a sense of purpose? A reason to hold conversation with one another? \n\nAm in my 20s. I have yet to know life beyond books, education and grades. While you. You had it all. Travels, partners, jobs, income, big decisions, all the adult experiences. \n\nAm I selfish? Are you selfish? ",
    "subreddit": "TrueOffMyChest",
    "title": "I feel like I want to act out...",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7a13g/i_feel_like_i_want_to_act_out/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 15:04:42 UTC",
    "id": "1j79hp6",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "Sorry for the long ass post. I would have made it longer but wanted to spare you the novel. \n\nI’m honestly just really lost and struggling so much right now. I’m 25, and suffer from a long list of mental and physical disabilities. I’m not really able to work right now due to my disabilities but am in the middle of a long process of trying to get on disability payments. I still live at home with my mum and brother (dad is deceased), and I just found out last week my mum has stage 4 bone cancer. My partner of 3 years doesn’t live with me but is soon having to move out of his family home so has been putting pressure on me to move out with him as we’ve been together for a significant amount of time and we should be moving onto the next stage of our relationship. I’ve tried to explain that it’s difficult for me to move out as I don’t have a job and the income I do get from the government isn’t going to be enough to pay for rent let alone my food, medications, my dog’s food and be expected to save for my doctor and specialist appointments but also to save to eventually buy a house like how he wants us to be able to do before turning 30. He just keeps telling me to apply for work and I only have experience in retail but due to one of my medical conditions I can’t even stand for more than 5 hours on a good day without being in debilitating pain where I literally struggle to walk. I have no experience in being a receptionist and no matter how many jobs I apply for no luck. He wants me to move out as well as I’m being treated as a stay at home mother looking after my mum and brother (this is well before the cancer diagnosis). I don’t think as well that it’s sitting in for him that I very badly need and rely on being on my mum’s health insurance considering I’m chronically ill and it can turn at anytime for me and sadly I’m having a different surgery at least once a year, sometimes twice a year so idk how I’d be expected to afford that if I wasn’t living at home, with no job. He refuses to live with my family until we can save enough to buy a house because he hates my family and well understandably is struggling to even see a future with me like this but I feel like he’s in between a rock and a hard place with the fact that he does love me and how he doesn’t want to leave me cause I’m sick cause it’d be like leaving someone who’s got cancer which is an asshole thing to do. And it doesn’t help that I’m struggling with my mum’s new diagnosis. On top of everything else I personally am just really struggling with how beyond god damn emotional I am. Late last year I fell down some stairs causing me to be bed ridden for 2 and a half weeks and in turn has caused me to develop or severely worsen potential already undiagnosed OCD. I’ve never been diagnosed before with OCD because truly I don’t say out loud my thoughts and whatever I have disclosed or displayed gets pinned to my autism but since the fall I’ve been consumed with anxiety, depression, anger, guilt, agitation and panic with mess, things not being in a particular order (mainly MY way of order). I feel like a shell of who I once was I struggle to hide anything well, I cry almost daily and have just started to learn either cry to myself when no one is around or wait for my therapist. I don’t ever want to leave my house cause if I stay at my partner’s house, guarantee I’ll be a sobbing mess when I get back cause my mum and brother always make a mess and they never clean up after themselves which in turn triggers me more. I already am a pretty reserved person when it comes to my feelings cause I think it’ll come off over dramatic to others even though I know they’re valid but today I got proven why I think that because my partner asked me what was wrong when I got home and I spilt 1/4 of my thoughts and feelings and I got stopped with being told that “maybe you just like to make things more difficult for yourself than it has to be”. Potentially that’s true but also I don’t mean to, my brain just never shuts up which I’m realising with typing this that yes it most definitely doesn’t shut up. The sadder thing is there’s a lot more to my anxieties and why I can’t take it anymore and maybe I’ll just get a diary and deep clean till I can’t walk. I just want to be alone and lowkey sedated but I got an appointment in a couple days on an update to some scans and if I’ll need surgery or not which is obviously another anxiety. I frankly just feel a lot of pressure from my boyfriend and I feel pressure to look after and help my mum and if I don’t well no one will cause my brother and her partner are useless. I feel pressure on myself with my own mental and physical health, getting a job and what kind of job realistically would even be good for me, I feel temptation to go back into eating disorder tendencies or back into my addiction to smoking weed. I feel beyond insecure about my appearance which I know is a vanity and self esteem issues. I truly don’t know what to do because try and take it day by day but I clearly have some control issues. I’m frustrated cause I don’t want to die, but I also don’t want to be alive or at least conscious.  ",
    "subreddit": "TrueOffMyChest",
    "title": "I can’t really take it anymore",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j79hp6/i_cant_really_take_it_anymore/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 15:01:59 UTC",
    "id": "1j79fof",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 0,
    "secure_media": null,
    "selftext": "I'm using an ALT account because if I was ever discovered I think Id just die. I have been cheating on my girlfriend. There was this girl I meant while on a trip to Italy and we lost it for each other but I love my girlfriend she is my everything she has brought me so far every single time I think about this other girl I feel so much guilt and so much infatuation. I know I'm a bad person for this I know I'm horrid. If I ever admitted this to her I would lose her and I can't bear that. I don't know what to do.",
    "subreddit": "TrueOffMyChest",
    "title": "I'm a bad person I think",
    "upvote_ratio": 0.4,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j79fof/im_a_bad_person_i_think/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 14:50:04 UTC",
    "id": "1j796vy",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "I'm in my early 20s, and I've technically only had 2 relationships. I say technically because the first was so on-off that it didn't even count as one, plus she ended up cheating.\n\nBut what I've noticed since the that one is that I tend to be overcaring, sometimes clingy and think about whoever I have feelings for constantly, as if an image of her is burned into my mind no matter where I look or even if my eyes are closed.\n\nI've been through some brutal ones where a girl I met at university (a mate's mate but single) was so unbelievably beautiful, funny, well-mannered and smart that it was painful to keep thinking about her until I asked her out but she polited declined.\n\nThe other relationship was when I met an American girl studying here who actually liked me for who I am which was a surprise considering I believe myself to be the equivalent of Rocky Dennis in terms of looks, but with the way I was around and to her I realise now I was too overcaring right at the start treating her as an already long term girlfriend when we just started dating for 2 days.\n\nAnd then, after a while of dating she tells me something resulting in a glorious stab in the heart where she quite literally said \"over these past few weeks dating you has made me realise I miss my ex\" and proceeded to fly back to Murica (reddit won't let me say it properly for some reason) THE NEXT DAMN WEEK FFS so naturally I crashed out and drank a lot.\n\nSo referring to the title of this the one main thing as to why I don't want a relationship is that I don't want to lose her, ruin her life or make her detest me because of how I am with overcaring. I hate it but better to stay alone than to ruin someone's life.\n\nAnd for those of you who say work on changing yourself, trust me I've tried but it's pretty hard when you have little experience in the dating scene because you look like a damn goblin from clash of clans.",
    "subreddit": "TrueOffMyChest",
    "title": "I fear any possible future relationships for 1 particular reason.",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j796vy/i_fear_any_possible_future_relationships_for_1/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 14:40:06 UTC",
    "id": "1j78zph",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 2,
    "secure_media": null,
    "selftext": "Seriously, if I want to continue living in the past and reminisce over something I liked growing up and choose to prefer it over what's being provided for me now, I want to fucking do exactly that, goddamn it. I want to watch new movies that I'm interested in seeing in the theaters than at home on HD or 4K TV sets. I want to rent and/or own movies at a local video store or library than stream movies digitally. I want to play video games at the arcade than rely on consoles. I want to go to a concert venue or record/CD store to find new music to own. Seriously, if people are so insistent on letting people live their lives and letting them be, why am I considered an exception? All the time, whenever I come on this site, it's like people just want to do more things within the comfort of their home than go outside. I know people will say shit like \"Everything's so expensive\" or \"People don't know how to behave in public these days\", but you only live once, which is something I feel a lot of people tend to forget about themselves, and I'm not some \"boomer\" or an \"old man yelling at clouds\" for thinking this way. A homebody is sometimes not worth being when you got a whole life to live, you know.",
    "subreddit": "TrueOffMyChest",
    "title": "Why is it wrong for people to feel nostalgia about anything on this site?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j78zph/why_is_it_wrong_for_people_to_feel_nostalgia/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 14:02:11 UTC",
    "id": "1j789eo",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "I’m so lost. I know relationships are never easy, but I’m just starting to think that maybe we didn’t meet at the right time in each other’s lives. \nI have so many insecurities in regards to being included in outings. Her communication is really lacking and forgoes telling me how she feels about things. \n\nOur most recent disagreement has been in regards to travel - we can’t come to a compromise and find a balance between her travelling with her (and also my) friends with time for us to spend together. We promised we’d travel with each other after this year fell through for similar reasons. Instead, I had to leave it at she will go with her friends instead of me. I’m hurt because it feels like she doesn’t want to go away with me, but she’s hurt because I think that. \n\nShe’s promised to do better and apologised so many times for not communicating. I feel like our bad times are more frequent than the good. I want to push through because she is so loving, caring and sweet but I’ve got a massive piece missing rn and if I explain this to her, she breaks down and stops talking entirely. I’m stuck. \nI know I am so far from a bastion of perfection in this relationship, but I just can’t help but be frustrated and saddened by this.\n\nToday, I was sick and quite feverish, so I spent a while thinking back to a past relationship. While I’m absolutely over that girl, I just couldn’t help but reminisce about how that short relationship three years ago made me feel. I do hold it in very high regard because I was in the wilderness prior to it - alone and totally confused about my place in the world before she showed me, so I’m now quite nostalgic about what she was for me, especially now my needs just aren’t being met. That girl and I met in the wrong time and the wrong circumstances to last, but we ended very amicably. I know it’s horrible and so unfair for my gf as well as the previous girl to keep thinking like this. \n\nI love spontaneity and random, intimate things (and I have told her this) but never does she ask me to come over for a karaoke drive at midnight with the windows down. Never does she say she wants to spend the night with me somewhere random. I sometimes ask but it’s usually a no. I feel like I’m right back to where I was pre-previous relationship and I’m lost and so sad.\n\nI want to make things better, and I know constantly comparing my last relationship to my current is really poor. I know I’m focusing on the negative things she does. I know I could be better but I’m so fucking demotivated bc she just doesn’t talk and we just don’t go out to do things. Then a rift forms and I have to be the one to try and pull it back, and then she’s extremely upset and scared that I might leave her, or she thinks she’s a bad person. I can’t say how I really feel because of that. It takes days for our usual fun side to return and then there’s a couple weeks of good. Rinse and repeat. \n\nLong-term relationships are loads of battles to stay in love. Some are so much harder, but I do love her. Though, is it worth losing parts of who you are when I’m this age? I’m emotionally exhausted by the constant confusion and stress of slow and lacking communication as well as my physical needs just not being met. I’m 23, so I’m not looking to waste her or my time any longer if this just won’t work. I like solving things but this feels like it’s becoming bigger than me. ",
    "subreddit": "TrueOffMyChest",
    "title": "I think I’m falling out of love",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j789eo/i_think_im_falling_out_of_love/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 13:58:23 UTC",
    "id": "1j786on",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 0,
    "secure_media": null,
    "selftext": "Throwaway account because I feel terrible about this. \n\nWhen I was young (10 maybe) and I got an Ipod. I would love doing stuff on it. But then I got into fanfiction and thus I got into porn (I still love fanfiction to this day). I also was able to gain access to porn sites (Pornhub, Xvideoes, Spankbang, etc). My mom had to work long hours and my uncle mostly left me alone (we're both quiet), it got more convinent when I got old enough to become a lackey kid (14)\n\nBut that day, I was in the mood for porn every chapter (what I now know as PWP)\n\nSo I would type chapter 'large number' and then put tits or ass and then search. I was already seeing gross things I wasn't supposed to but then I found a website and it had adults engaging with minors. \n\nI was aware that sort of thing was bad, but this was written not visual. I knew the visual stuff was terrible and never looked for that sort of thing. But the written stuff?\n\nI just kept reading it, I justified it as it's only weird if I'm an adult. I never visualized ACTUAL real life children, I would think about other fictional characters, not sure if that's better but I did.\n\nBut now I'm an adult and I feel disgusting! I NEVER want to hurt a child in that way! I despise child molestors! And yet I still read this stuff. I stopped when I was about 18-19 (not sure spefically but I know I haven't read that stuff in the past three years and I remember not being able to find the sites anymore, which was good in the long run)\n\nLately, I've been feeling really gross. Like I'm disgusting and I should feel awful what I did! Which I should! It's gotten worse this past year, I didn't really think about it. I still read stuff where characters were underage but limited to just being in their teens (someone on AO3 who does a bunch of Harry Potter/crossover girls stuff and another one who had his own website and was registered on Literotica). I want to cut those people out of my reading too! I feel horrible for what I've done and read.\n\nMore context: I live with my mother (she knows about the video porn thing, but not the written stuff), I'm a college student, I can't drive (I rideshare everywhere). I WANT to get therapy but I don't want to spend money. My mom has actually taken me to therapy a few times (this problem hadn't affected me mentally yet for me to bring it up, plus most of the time my mother was in room, so I wouldn't have done so regardless), I actually got diagnosed with anxiety. But I assume the reason we don't make it a regular thing is because it's expensive. The best thing I feel I can do is go to hotlines. \n\nSometimes they do make me feel better. Once I watched some YT video about someone who hurt animals and I thought I could handle it, but the woman said this man also read stuff from one of the sites I found (I never liked that, I would avoid that if I saw it) and I FELT DESPECIBLE! The hotline got me a nice lady that told me some gentle things that made me calm down.\n\nBut then I read one of the guy's I mentioned work on Literotica, the characters were ACTUALLY OF LEGAL AGE and it felt like I relapsed! Then I watched porn on a specific website for specific kink of me, but when I was looking for something one of the videoes said 'teenage' and I began to spiral. Because of one hand, not all pornsites are trustworthy but on the other, 18 and 19 (legal adult age) could still be referred to as teenage so I was confused, so I called them and the lady didn't want to help me and she transferred me to a warmline (they were nice but they asked for my insurance which I wasn't expecting so I ended up feeling emotionally drained).\n\nIt came to a head when I woke up this morning and I was on my period and then I started feeling those thoughts that was disgusting while my body was in pain. I couldn't call because my mother was still asleep. So I texted my hotline and the woman said my problem wasn't something a hotline could fix, so she sent me all these links to porn addiction stuff. They either cost money or I felt they couldn't help me, because they talked about this happening to men. Alternatively, they could help but my mother was still in the house, so I still felt I couldn't do anything immediately. And it really felt like no one could help me. I even signed up for Betterhelp (though I remembered they had controversy and signed out before telling my problem). So I decided to post this on here.\n\nI really don't want to hurt anyone. I want to put that terrible part of my past behind me. But sometimes I can't help but think about it and feel disgusting.",
    "subreddit": "TrueOffMyChest",
    "title": "I (21 F) got addicted to porn and read disgusting stuff when I was a minor and now I feel gross and disgusting!",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j786on/i_21_f_got_addicted_to_porn_and_read_disgusting/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 13:40:00 UTC",
    "id": "1j77ugw",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 3,
    "secure_media": null,
    "selftext": "Okay so this might come across as a little sad and bleak, and I doubt that I will get any gentle responses... Might as well be ranting because I have found a haven in Reddit lately. \n\nI often wonder why anyone would like to be friends with me. I struggle a lot with anxiety and maintaining attention, and usually when I offer advice it is not that helpful (usually overly philosophical and impractical). Some people may like to engage in that kind of discussion I guess… \nI don’t have any interesting hobbies besides going to a cafe by myself and having a cigarette, browsing and looking for jobs to advance my career. I have a very niche sense of humour that can be overly sarcastic and easily offend. I try to pick up hobbies, but I end up wanting to escape my reality via watching too much TV, cleaning/decluttering and spending time with my partner, which I also don’t see why he would stay with me after the initial attraction wears off. I am probably extremely depressed as I grew up with a childhood trauma that I tried to address via therapy but it felt like the benefit wasn’t outweighing the expense and somehow it felt even more depressing as “my only only hope for getting better didn’t look that hopeful”. A few therapists seemed to make me feel like my system was in a kind of a deadlock. \nI find myself lately thinking often about why anyone would like to be friends with me, even though I don’t think less of myself - I am young (32F), attractive, fit and financially independent. I am well-educated and have a decent-paying job. I rarely lie, gossip and I like to support people by understanding their goals. I like to treat my friends every now and again, but I don’t like transactional relationships. I used to have creative ambitions but quit them and settled into a boring life when I saw nothing was really materializing. \nHow can I improve this sense of isolation helplessness, with years of therapy as a last resort? ",
    "subreddit": "TrueOffMyChest",
    "title": "Despite believing I am worthy, I don’t see any reason why anyone would care about me.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j77ugw/despite_believing_i_am_worthy_i_dont_see_any/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 13:30:08 UTC",
    "id": "1j77nu4",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 2,
    "score": 4,
    "secure_media": null,
    "selftext": "I think it's okey, I wasn't meant to be in first place. I'm really tried, everything, really everything I do only backfired. I feel horrible, I don't see any solution anymore. It's simply enough. Therapy? No progress. I'm still stuck in life. I'm still 0. What should I do now? Just acccept it and finally let go? I'm clueless, each day I feel like I'm drifting further and further away, just being left alone. So many days have passed and I still suffer. If not any by any chance a miracle happen soon, I'm just giving up.",
    "subreddit": "TrueOffMyChest",
    "title": "I think I let my depression finally win",
    "upvote_ratio": 0.76,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j77nu4/i_think_i_let_my_depression_finally_win/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 13:28:08 UTC",
    "id": "1j77mhi",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 3,
    "score": 1,
    "secure_media": null,
    "selftext": "I honestly don't know what else to say..i was supposed to die..i cant live on anymore and i wish the people who found me never had to send me there and fend for my own to leave me to pay my bills when im already having problems financially which is one of the many reasons why i wanted to end my life. im really tired and i just wish this nightmare will end..",
    "subreddit": "TrueOffMyChest",
    "title": "Was sent to the hospital for trying to end my life leaving me with more problems.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j77mhi/was_sent_to_the_hospital_for_trying_to_end_my/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 13:27:05 UTC",
    "id": "1j77lqr",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 3,
    "secure_media": null,
    "selftext": "I have my defects and my husband and I struggle with communication over stupid stuff sometimes. When it gets overwhelming for him he threatens to leave. This happens 90% of arguments, big and small. \n\nI have family but they’ve never been a source of comfort for me. I moved countries to be with him so my friendships are fairly new and I don’t want to go to her with my problems. \n\nI just want to feel loved. My whole life I’ve felt like if I could just not be me things would be better. I’ve worked incredibly hard at self improvement and I’m so proud of how far I’ve come. It just never feels like it’s enough. There’s always something else I need to fix. I’m tired. I just want a hug. ",
    "subreddit": "TrueOffMyChest",
    "title": "Whenever there’s a rift between my husband and I, I feel unlovable. I have no one, family or friend, that I can go to for comfort or solace. He goes to his mom. I hate my life.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j77lqr/whenever_theres_a_rift_between_my_husband_and_i_i/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 13:09:11 UTC",
    "id": "1j77a87",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 1,
    "secure_media": null,
    "selftext": "I recently moved into a house with some trees and shit in the backyard. When I tell you… I never knew or could have guessed how annoying and disruptive BIRDS could be. It is all kinds of bird sounds every single morning and it is LOUD. Our bedroom window is right next to a thick line of trees and it’s driving me insane. \n\n\n\nI was woken up at 6am, as i am every day, by birds. They hoot and holler for hours on end every morning before the sun is up. I don’t know how tf i’m supposed to get used to this, it’s been months as it is. My first thought upon waking shouldn’t be how bad i wanna shoot every damn bird in my backyard. I’m 27 and I don’t think i’ve ever heard birds make so much fucking noise. ",
    "subreddit": "TrueOffMyChest",
    "title": "I live in an aviary",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j77a87/i_live_in_an_aviary/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 13:04:29 UTC",
    "id": "1j777at",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "As title says, I (25m) feel dumb for how bad me and my partner have handled our money. We've been living in the same place for about 3 years and we were pretty fine for the first 2 but this last year we have just made every dumb decision possible with our money and now we are majorly behind on rent for the second time and I have no idea what to do. \nI used to work long hours with decent pay, but quit for mental health. When I did have money i burned through it. When I started making less, I didn't adjust and kept burning through it. First time we were behind, it was by about 3k and eventually we paid it. \nNow we're about 1500 behind and as I'm working still for very little, I don't really have a way to catch up quick and since it's the second time, our landlord whose kind of just a buddy wants us to pay by a certain date or leave (fair).\nDefinitely don't have money to move, definitely can't catch up just by working the way i am. Deeply scared to try and go back to working long hours. I have no formal training or schooling. Definitely have analyzed the past few years and have realized I'm mentally ill and unmedicated. \nIt's also so hard for me to get my head together because I feel like the country is going to shit and it feels so useless to try to do anything. \nI also recently stopped talking to my parents which was a good decision, but I didn't realize how much of a toll that would take on me. I just feel so stupid about everything. ",
    "subreddit": "TrueOffMyChest",
    "title": "I feel so stupid for how bad my finances have gotten",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j777at/i_feel_so_stupid_for_how_bad_my_finances_have/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 13:03:05 UTC",
    "id": "1j776fq",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "",
    "subreddit": "TrueOffMyChest",
    "title": "I hate the fact that I'm not a reader learner, I'm auditory and visual learner. I can't read and understand books, I have to watch videos to understand and retain the information. I hate this because I feel that I've done effort to get the info, I just got the knowledge the easy way.",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j776fq/i_hate_the_fact_that_im_not_a_reader_learner_im/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 12:59:24 UTC",
    "id": "1j773xl",
    "link_flair_text": null,
    "media": null,
    "num_comments": 67,
    "score": 705,
    "secure_media": null,
    "selftext": "Four years ago, I felt like I had achieved all goals, happiness, and was married to my best friend. For context, I (35f) and my husband (38m) have been married for 17 years. I met him as a teenager, we dated, and married promptly after my 18th birthday. I felt like we had really worked through a lot of issues to build a good marriage and life together. I don’t have a strong support system of people in my life, so it was just him and me against the world. Well, that changed, and I’ve been beating myself up about it for a while, and trying to navigate my feelings, or just ignoring them, idk. I started to have feelings for a co-worker (I know, typical). He has been a friend at work, and is married. There has been nothing romantic between us, and I don’t get any indication from him that he is interested in more. He has just been supportive as my co-worker and a friend, and that friendship doesn’t extend outside of work at all. I have no interest in pursuing a romantic relationship with him either. I don’t want to have infidelity in my marriage or try to convince someone else to be untrue. And breaking marriages for another person just means a worse marriage.\n\nThis has really led me to contemplate my life. Why, when everything was feeling so right, did I start catching feelings for someone else. I looked back at our relationship and started seeing all the negative. I questioned if I was just looking for reasons to justify how I felt. I came to the realization that our dating relationship was abusive (and early years of our marriage). More than just bad, or two stupid kids. He was very controlling, pushed sex on me before I was ready, and even used a sexual act two different times as “punishment” (that was painful). Anytime I’m alone with my thoughts, I think that so much of how I am today in my relationship with him was shaped by the bad times. He isn’t that person any more, he isn’t controlling, and treats me better overall. But, I don’t have friends, am scared to make him mad, scared to talk about my feelings, am super agreeable to avoid any conflicts. He has been explosive and mean in the past when he gets angry, although that hasn’t been too recently. (Nothing ever physical.) I still feel like a terrible person for thinking about another guy, and feel some blame for wallowing in the past. I think if I would do it all over, and there’s no way I would stay in the relationship if given a do over. If I had a daughter, I would teach her how to avoid this and reach out for help. \n\nI feel like my eyes have been opened to the truth of our past. I tried to bring it up with him by asking what he thought about our dating relationship. He said he doesn’t really think about it, and I said that I thought it was bad. I brought up some things, and he didn’t want to talk about it. He said he had apologized and I just hadn’t forgiven him for it. He got mad, and I got upset and cried. I remember him giving an apology several years ago, we both got drunk and he said he felt bad about things and I consoled him, but I’m just now realizing it was abusive. I wanted to get confirmation from him that he agreed it wasn’t a healthy relationship, just for healing. But there was nothing productive about it. \n\nI find myself lately being depressed and bottled up. I work full time and my husband hasn’t had a job for a few years now. I really don’t care if he works, but want him to contribute to our relationship in some way. Instead he spends a lot of time sitting around the house on his phone making a mess and spending excessive amounts of time on hobbies. And no, I don’t think there is any chance he is cheating. I think he is also depressed. My guilt and frustration are overwhelming. I love him and he loves me, but I’m spending too much time in my head not dealing with my feelings, just hoping things find their place and go back, even though I know that’s not likely. I know I could use counseling to work on past trauma and learn to be a better partner myself. So maybe I’ll finally do that. ",
    "subreddit": "TrueOffMyChest",
    "title": "I wouldn’t marry my husband of 17 years if given a do-over.",
    "upvote_ratio": 0.91,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j773xl/i_wouldnt_marry_my_husband_of_17_years_if_given_a/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 12:39:02 UTC",
    "id": "1j76rw2",
    "link_flair_text": null,
    "media": null,
    "num_comments": 13,
    "score": 5,
    "secure_media": null,
    "selftext": "He doesn’t want to date me seriously but wants me to date a guy like him?\n\nI’ve been casually seeing this guy for a couple months. He leaves to go to another state soon so feelings aside we’ve known there’s an “expiry” from the start. \n\nWell- actually I asked him if he wants to try long distance/take things further. He said I’m everything he wants in a girl but that he doesn’t want to have a girlfriend. Okay, fair enough. \n\nHowever something that bothers me is that he occasionally comments on my dating future. He’ll say things like “you should get back into hiking so you can meet another guy like me” (it’s how we met), or teaching me things “you can use to impress the next guy”, and then after telling me I deserve someone better than him he tells me that “when you do start seeing someone new, send me his instagram” so he can check it out??\n\nThis really confuses me because he says he does have some feelings towards me, but he’s very firm on not wanting to take things further. On the other hand for me I don’t even want to think about who he dates next- it’ll just make me sad and jealous. Why does he bring stuff like this up so much? ",
    "subreddit": "TrueOffMyChest",
    "title": "He doesn’t want me as his girlfriend but he wants me to date a guy like him",
    "upvote_ratio": 0.79,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j76rw2/he_doesnt_want_me_as_his_girlfriend_but_he_wants/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 12:24:08 UTC",
    "id": "1j76jal",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 4,
    "secure_media": null,
    "selftext": "I (27F) have been diagnosed with Borderline Personality Disorder, and after that all to puzzle pieces fell into place. All the emotions, the feeling of not fitting in anywhere, the emptiness and distortion of my self image. \n\nI have repeatedly done stuff that I knew would ruin my relationships, or sabotaged my self, thinking I could prove I was unlovable or unworthy. Because my logic was if that can’t handle me at my worst, they don’t deserve me at my best. Or that I wasn’t good enough for them and couldn’t understand why they cared about me. \n\nA month before my 15th birthday, I tried to end my life, and my boyfriend at the time had an ex that had ended her life a few years earlier. \nA week before he had told me he didn’t love me anymore, but wouldn’t break up with me at the time, bc “maybe the feelings will come back”. I knew ending my life would make him come to a decision, but that’s not why I did it. He did not come to visit me at the hospital, but his best friend did. A few days later I kissed a new guy and a week after that I started dating that guy. And so on and so forth. I often ended it with one guy, and started dating a new one a week or two after. This pattern lasted from 13 years old to 17 years old, when I got into a relationship with a guy who was 5 years older than me. \nIn my country you’re legal at the age of 16.\n\nOn my 18th birthday I moved in with him, and within 2 months I was pregnant with my son. We can call this guy Aaron. \nArron was a drug addicted, alcoholic and violent POS. He severely beat me, raped me and cut me off from my friends and family. I was a terrified pregnant 18 year old with no one to turn to. I left him almost two years after we moved in together. I called my mom after not talking to her or my dad for almost a year. And I asked if I could come visit. I moved back to their house a week after. \n\nAt the beginning of 2018 I moved from my hometown to a little island where I met my now husband (37M) and father to my two younger sons. I admit I tried repeatedly destroying this relationship, he never gave up, just kept on loving me through all of it. \nChristmas 2023 I had a mental breakdown, planning how to kill myself and writing letters to my family. But making my child cry while he was playing with his new toys, made me get some help. I was in the psych ward for 8 days, didn’t get to see my children other than FaceTime, and I celebrated new years alone. \nI was diagnosed with CPTSD, depression, anxiety and borderline personality disorder. I had a ADHD diagnosis from the age of 15.\n\nI started therapy February 2024, and DBT group September 2024. And I have finally started getting back to my feet, learning how to feel emotions again, and not look at myself with resentment and disgust. I have not had a big emotional breakdown or reaction since October 2024, and I am so proud of myself. I started ADHD medication for the first time in 13 years, and it has helped me keep up everything in the house, and following my kids closer. I’m so grateful that I didn’t go through with my plan, and I thank my children and husband every day for being “mine” and that I love them more than anything. \n\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "I have repeatedly tried to systematically ruin my own life",
    "upvote_ratio": 0.83,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j76jal/i_have_repeatedly_tried_to_systematically_ruin_my/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 11:40:02 UTC",
    "id": "1j75usy",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 3,
    "secure_media": null,
    "selftext": "Throwaway cuz she knows my account and follows this subreddit.\n\nI (M, late 20s) have been in a relationship with my gf (F, late 20s) for a bit over half a year. I can’t go into any details without her realizing its me and also why I’m not saying our exact ages.\n\nShe knows about my past. She knows I’ve had a toxic, manipulative and violent exes. She promised she wouldn’t be like them, even complained about her exes, but turns out, she’s repeating the exact manipulative patterns as my worst ex. She’s not violent, but I’m getting the feeling she just wants to see me suffer.\n\nThat’s it. No details, no need for sympathy. Just wanted somewhere I can freely vent. I don’t need advice, because I know I’ll just stay with her like with the previous ones.",
    "subreddit": "TrueOffMyChest",
    "title": "I’m once again in a toxic relationship",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j75usy/im_once_again_in_a_toxic_relationship/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 11:16:11 UTC",
    "id": "1j75irl",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 6,
    "secure_media": null,
    "selftext": "for context, the reason I have to wait till may is because my father got laid off of his job so until recently I've had terrible insurance. money is something I stress about so I never thought to spend it when I could just wait till he got a good job again. I never thought I'd need therepy until recently. (I've always needed therapy i just havent wanted to go) I have ADHD and depression +anxiety and have been un medicated.\n\n\nI want to talk to a professional because I cannot handle going to work. I hate working. I hate how my body aches and I'm forced to think and not be able to do anything acually GOOD to help me get out of it. I have to do tasks wile being trapped by my own mind. I suffer from some sort of gender dysphoria, I hate being a woman when someone reminds me that...I am... a woman. when i forget i am a girl. im okay. but, I have Tokophobia(fear of pregnancy) and it is effecting my day to day life. it hurts to live. I'm surrounded by men at work who can't even confront their own emotions I KNOW they can't handle mine, they have given up right in front of me. I have to stay sheltered and not speak my mind because it isn't about tacos (I work at taco bell) so I'm alone in my suffering\n\nthat is until I have my boyfriend or my best friend with me(we work together) my friend helps me by basically forcing me to talk for once(after hours during close) and I'll litteraly be there crying while working and the others look at me like \"wtf I'm staying out of this\". ITS EMBARRASSING but it's so nesssesary to my sanity\n\nI cry every day now. I feel so cursed in this body. \n\nI'm so lucky to have both my BFF and my boyfriend who support me 100. they just want me to be okay, but I can tell I'm not normal the way my thoughts race and crying when I'm alone. I kinda just want to be happy and not worry but my brain likes to attack me.",
    "subreddit": "TrueOffMyChest",
    "title": "I have to wait till May to get into therapy- and I'm just trying to stay okay.",
    "upvote_ratio": 0.81,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j75irl/i_have_to_wait_till_may_to_get_into_therapy_and/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 10:46:43 UTC",
    "id": "1j7547j",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 1,
    "secure_media": null,
    "selftext": "I (25F) have been in a long-distance relationship with this guy (23M) for the past 1.5 years. He was really sweet and caring in the beginning, and I talked to him for a considerable amount of time before starting a relationship with him. It's just that I think his behavior has changed compared to how it was during the talking stage and the first few months of the relationship. He says he's a fault-finder and that it's just a part of his personality.\n\nIn the beginning, he only used to praise my appearance, but over time, he started commenting on my facial features (nose, forehead, etc.) and many other things. I’ve had a bad case of acne throughout my adolescence due to sensitive skin and genetic factors, so it couldn’t be cured completely. While I don’t have cystic acne all over my face anymore, I still occasionally get breakouts. The skin on my body also gets inflamed easily after waxing.\n\nEarlier, he never said anything about it—in fact, he used to love and support me despite all of this. But eventually, he started telling me to use certain products to improve my skin. I’ve told him multiple times that this isn’t how things work (since I’ve undergone treatment for most of my life), but he gets irritated and says I don’t even want to try and that I lose hope too easily. Similarly, he made comments on my facial features and said I need to get plastic surgery. When I got upset, he claimed it was just a joke.\n\nI have a very chirpy, bubbly personality and get excited easily. We recently went to a concert, and everything was fine until we were walking back. As we were side by side with his arm around my neck, we reached a narrow space where only one of us could pass at a time. I was focused on our conversation, so I stood there for a second or two before moving. He got annoyed, removed his arm, grabbed me from behind, and pushed me through the space.\n\nAfter that, he started scolding me for being \"too dumb\" to stand there and not move immediately (which I don’t think is even a reason to fight). For the next hour, he kept verbally abusing me, asking if I was really dumb or just pretending to be around him. He even mocked my excitable personality, saying I get too excited to see him and then start acting dumb. He also said I don’t deserve anything he does for me (including the concert, which was my birthday present from him). He kept going on and on while we walked back for an entire hour. My head hung low, and I was holding back tears the entire time.\n\nWhen I had to catch the train to return home, he held my backpack tightly from behind and forced me to jump onto the moving train, even though I was scared and there was a huge risk involved in doing something like this, I mean, anything could have gone wrong! We had gotten late and almost missed it.\n\nJust two weeks ago, he \"faked\" breaking up with me to \"teach me a lesson\" because he thought that was the only way I would understand. He said he had fought with me multiple times over a single issue, and since I didn’t seem to get it, he had to do this. At first, I thought he was just angry and didn’t take it seriously. But the next day, he texted me dryly and told me it was final. I was heartbroken and broke down in tears, desperately trying to reach out to him.\n\nThat afternoon, I video-called him while crying hysterically, begging him to come back. He laughed in my face and told me not to cry, that everything would be fine in two to three months, and that I should just leave him. He was completely unemotional and unnecessarily cold. Each word hit me hard, and I kept wondering where all his love had gone.\n\nHe knows I’ve had traumatic experiences in my past relationships, yet he took advantage of my biggest emotional vulnerability. He knows I get anxious, overthink everything, and become inconsolable. Despite that, he played on my emotions. The very next day, he went on a five-day trip with his friends, which they had been planning since the previous week. He barely responded to my texts or calls while I was a crying mess, unable to eat, sleep, or work properly.\n\nWhen he came back, I decided to talk to him one last time because I was so hurt that I had finally made up my mind to end things. But when I called him, he acted as if nothing had happened. I lashed out and told him everything he had done wrong and how I felt all those days. After listening, he finally realized how horribly he had treated me and admitted that he thought we would reconcile. He had only pretended to break up with me so I would \"realize my mistake.\" It was never real. He thought we’d just talk and sort it out.\n\nI wasn’t in the right headspace, but I still gave him another chance.\n\nThere are other things that bother me, and I’ve told him a million times to work on them. I always get excited for the weekends because we’re busy all week, and I look forward to spending time together. I usually plan for us to watch a movie, and he always promises to be there at a certain time. But then, he keeps postponing because his roommates drag him along, saying he can’t stop them. He keeps pushing it forward until it’s too late, and I end up waiting. At the end of the night, I just say, \"I understand,\" and go to sleep. He apologizes, promises it won’t happen again, and then does it again the next weekend.\n\nAfter the \"breakup\" drama, we discussed this, and he promised to change. But that very day, he did it again. And then again this weekend.\n\nHe has also told me multiple times that if I don’t start making \"good money\" and move in with him soon, he might get attracted to someone else and leave me.\n\nHe constantly tries to make me jealous by talking about other girls, even saying he doesn’t want to waste the best years of his life in a long-distance relationship and wants to hook up with other girls. Later, he claims he’s just joking and doing it to \"motivate\" me to work harder, earn well, and move in with him.\n\nOn the other hand, I’ve never belittled him or made negative comments about his appearance or insecurities. He has acne scars and body dysmorphia, but I’ve always loved him as he is, making sure he feels comfortable in his own skin. I tell him he’s the most perfect guy for me and that he doesn’t need to change anything to feel good or deserving.\n\nBut he constantly criticizes me, mocks me when I express my struggles, and calls me \"weak\" whenever I try to talk about things that hurt me. He says he doesn’t like weak people who \"crib all the time,\" which makes me feel like I can’t even discuss my problems with him. If I do, he gets annoyed, fights with me, and tells me I’m playing the victim instead of being strong.\n\nHonestly, I’m just really confused. I love him and don’t want to leave, but I don’t know if he’s good for me.\n\n\nPS: The \"mistake\" he wanted me to realize was that he thinks I need to develop new skills to switch to a better job. My current job is hectic and low-paying, but I have to work hard throughout the week. With my parents' declining health, I can’t study every weekend. Sometimes, I slack off because I’m overwhelmed and need to cool off. He tells me I need to hurry up, and when I explain my situation, he fights with me, mocks me, and says I’ll never earn well or do anything in life because I’m not trying hard enough.\n\nEdit : Additionally, he has told me multiple times that other people’s opinions of him matter a lot. He wants to be \"likable\" to everyone. He said he used to get a lot of attention before developing acne, but things changed after that, which is why he constantly seeks validation from others. He gets upset when girls, in general, don’t give him attention. Whenever I ask why he seeks attention from other girls when I’ve always appreciated and motivated him, he simply says it’s because I’m his \"girlfriend,\" so my words don’t count. He also gets noticeably excited and happy whenever he finds out that a girl is interested in him, as it satisfies his need for validation. I've always brushed it off but idk if it's a concern or not.\n",
    "subreddit": "TrueOffMyChest",
    "title": "I feel like I'm ' stuck ' in a relationship and don't know what to do",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7547j/i_feel_like_im_stuck_in_a_relationship_and_dont/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 09:48:04 UTC",
    "id": "1j74b4s",
    "link_flair_text": null,
    "media": null,
    "num_comments": 11,
    "score": 1,
    "secure_media": null,
    "selftext": "This is the second time in two days this has happened. Sorry for any errors but I'm in the middle of the second one and it makes reading a real bitch.\n\nThe trigger is bright light. Up until two days ago if I looked at a bright light I'd just get this dark smudge in my vision which went away soon.\n\nWell, on Friday I looked at something bright. Don't even remember what it was, maybe the light reflecting off a car, it was sunny. I went into Maccas to pick up a burger for my mother and I had trouble reading past the black splotch. Ordered the burger, scrolled tumblr while I waited. \n\nThe black splotch soon disappeared but there was nothing where it had been. I was reading something about COVID and it was hard to read. I could see only the top third of the C and the bottom left of the O in COVID was also gone.\n\nAnd then I got this static that appeared. This flashing rainbow static. It started moving out across the left of my vision, and I could see directly in front of me but the blind spot was getting bigger and moving. If I held up my hands in front of me I couldn't see my left hand at all.\n\nI made it home OK but half an hour after it started the left of my peripheral vision was gone.\n\nLuckily in another half hour my peripheral vision was back, but augh, it just happened again. I looked at a candle and went to read a book, and oh shit, I can barely read again, and oh no there's the small flashing staticky crescent, and it went and spread across the left of my vision again. Like a ripple going outwards.\n\nMy peripheral vision on my left is gone again.\n\nI hope this isn't going to become a thing. I had a similar thing happen to me fifteen years ago, once, but this is twice in two days. Am I going to have to start making sure I don't look at bright lights now? What if it gets worse? I'm seeing my doctor about something unrelated on Monday but I often struggle to get taken seriously by doctors (yep, I'm a woman) and I'm tired of going to battle every time there's something wrong with me.",
    "subreddit": "TrueOffMyChest",
    "title": "My vision is getting weird and it's making me nervous.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j74b4s/my_vision_is_getting_weird_and_its_making_me/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 09:46:24 UTC",
    "id": "1j74aag",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 3,
    "secure_media": null,
    "selftext": "Any special occasion when I’m not in my hometown, my family will invite my ex boyfriend and his family that I broke up with 2 years ago. I understand my family can still like them but my ex is blocked on all of my social media because he sent me threatening and weird text messages trying to get me back. I’ve set the boundary with my mother and grandmother several times that I will go no contact the next time they hang out with him but guilt pulled me back in. Not this time. I moved 1,000 miles away to get away from them and their bullshit. I have a new boyfriend and it’s extremely disrespectful to me and my relationship to keep my ex around. I feel it’s borderline stalking because him and his family want to hear about my life. I think they’re waiting for an opportunity for him to get me back. I’m so hurt that my family is doing this especially because I’m an only child but I guess I will get more comfortable with my boyfriend’s family. I’ve felt bad that I haven’t been communicating with my family that much since I’ve moved out but the phone works both ways and they’ve been spending more time with people I told them not to spend time with. I feel like inviting my grandma’s ex husband and my dad’s ex wife to their next get together to see how they like it. I don’t know what will make them understand.",
    "subreddit": "TrueOffMyChest",
    "title": "My family spends time with my ex and his family when I’m not around",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j74aag/my_family_spends_time_with_my_ex_and_his_family/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 09:39:26 UTC",
    "id": "1j746t9",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 2,
    "secure_media": null,
    "selftext": "\nLet me start off by listing a few factors:\n\nI have terrible terrible insomnia. I can’t remember the last time I fell asleep before 4 AM. It doesn’t matter how exhausted I am, I end up getting most of my sleep in between classes.\n\nI’m in an expensive university in a first-world country, my tuition is being paid for by my rich parents. This comes with a weird kind of pressure. It’s like I’m living someone else’s dream.\n\nI have no idea if my university is worth it. The more time I spend here, the more I wonder if this place is actually good or if it’s just an overpriced scam for ppl who couldn’t get into A list schools, especially for an English degree? Idfk\n\nI have no friends. I’m extremely shy, and socializing feels like an impossible task, I had a girlfriend through most of my first year here who I met early but she left me out of boredom and since my entire social group consisted of her friends (since she grew up here) im now a extreme loner. I barely ever leave the house unless I have to go to class.\n\n**(No seriously how tf do I come from a family with so many degrees in prestigious top 100 universities and end up in this niche hellhole? Its mind boggling to me.)**\n\n\nIt is completely meaningless to me. I do not really learn anything, all I do is put the bare minimum effort in my classes to pass because they’re all extremely contrived. Instead of helping me develop knowledge and useful skills, it is making me extremely stressed, unconcentrated, feel empty, like I'm losing my identity and living the most meaningless life there is.\n\n\n**I was homeschooled for most of HS, I hated it but being here is honestly making me wish I could turn back time because at least I had my parents to talk to all the time and not over the phone?** now it’s a different type of lonely.\n\n\nSo what am I gonna do with my life? I have no clue. Anyways its 6:35 by the time im done posting this and still no sign of any tiredness. \n\n",
    "subreddit": "TrueOffMyChest",
    "title": "I (20M) have no clue what I’m doing with my life and I have no one to talk to about this, im desperate and lonely and frankly tired. I somehow wish I was living any other existence.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j746t9/i_20m_have_no_clue_what_im_doing_with_my_life_and/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 09:35:25 UTC",
    "id": "1j744xg",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 3,
    "secure_media": null,
    "selftext": "I swear, I've been thinking about going on a digital detox soon because I'm just getting so sick and tired of having to rely on the Internet for everything. Tired of social media and having it take over our lives and shit. Tired of having to see trolls and bots and reposts everywhere I go. I want to be les shy and more extroverted and read books again. I'm tired of having to carry a huge brick around me everywhere I go and would rather just redirect my dopamine releases to engage in social activities and life-fulfilling hobbies and conversate with others. I want to stop pulling all-nighters, prioritize my sleep, practice mindfulness, spend time in nature, manage my stress, regain my focus, minimize pornography and mindless YouTube videos, recharge my body and energize myself by incorporate exercises and eating healthier, implementing self-care (dental and skin) into my life and feel rejuvenated, and surround myself within an environment free of distractions. I've considered downgrading to a flip phone I'm so desperate, as stupid as that choice may sound to some. Like it's easy for people to say \"just uninstall apps you don't need\", but doing so would only temp me to reinstall it soon after.",
    "subreddit": "TrueOffMyChest",
    "title": "The Internet is slowly getting less and less fun each day for me",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j744xg/the_internet_is_slowly_getting_less_and_less_fun/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 09:20:06 UTC",
    "id": "1j73xj2",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 2,
    "secure_media": null,
    "selftext": "My brain knows that he’s not the person for me. I have qualities that I want my soulmate to have and he doesn’t have any of them. In fact, he has the qualities that I hate. He cares too much about what people think about him. He’s not affectionate. He’s not sweet. He doesn’t make me feel pretty. he doesn’t make me feel loved. He doesn’t make me feel wanted. He doesn’t make me feel good about myself. He doesn’t even make me feel like he cares about me. In fact I know he doesn’t care about me. He told me himself when we broke up that he didn’t mean it when he said he never wanted to be away from me. I honestly can’t think of a really amazing time or really romantic time that we have even had together. I can’t even think of one reason to miss him. He constantly chose other people (friends, girls) over me and put me last. I can’t think of anything positive about him when it comes to our past relationship. For some reason, I still think about him every day. I still think about the very few good moments that we had together. They play in my head over and over again. My head doesn’t want him but my heart does and i dont understand why. I just don’t get it. I know God has better for me and I know my real soulmate is out there but I know I won’t get him until I fully move past this. It was my fault the relationship ended and I learned my lesson so I don’t know what else this experience wants from me. I don’t know what else to get from it. I already learned my lesson so why can’t I just get over it and move on. I have been hurt and cried over this for too long and too many times while i know hes living his best life and having sex with other girls and probably even dating someone else by now. Its not fair. Its not fair. Im so tired of being hurt while the other person is ok. Im so fucking sick of this i feel like im being haunted by something that could never even make me fully happy. I wish I was enough to make him want to be the person i needed. If he loved me enough he wouldve done anything to make it work. He gave up so easily and didn’t even care. I wouldve done anything and changed anything about myself to make it work. Im so sick of my heart hurting ",
    "subreddit": "TrueOffMyChest",
    "title": "I still think about him",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j73xj2/i_still_think_about_him/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 09:12:41 UTC",
    "id": "1j73u2x",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "I know the title makes no sense but it's how I feel. I, 36f, have been living with the regret that I could never apologize to someone back from high school. To give some context to that. I was in a sort of common/uncommon situation back in high school. Being viciously bullied at school and abused outside of it. Lead me to be somewhat of a target. The only thing was girl bullies don't normally bully to your face they do everything, if not most behind your back, which lead me to blaming the only person who openly made fun of me but what he did wasn't even that bad. Example he would snicker to his friends where I could hear or throw snow balls at me. Chomp change in comparison to what I was going through at the time. Although it was enough for me to tell everyone I hated, loathed and despised him. For Years and only when I became an adult did I realize that what I was saying about him was somewhat the same as what I heard about myself. Hatred with no context. I've felt bad ever since and even though it's been 20 years I've always wanted to say \"I'm sorry\" but could never find him. Till tonight at 2am I found him and he's engaged and looks very happy. So I just wanted to get this off my chest, since I will stop looking now, I have no intention of trying anymore cuz he deserves to not have this random piece of knowledge. That's otherwise useless to his happy life and is more so for me. ",
    "subreddit": "TrueOffMyChest",
    "title": "To late to regret but happy",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j73u2x/to_late_to_regret_but_happy/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 09:04:59 UTC",
    "id": "1j73qfo",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 12,
    "secure_media": null,
    "selftext": "I apologize in advance for any grammar/spelling mistakes, english is not my first language.  \nFor context: me (27F) and my bf (25M) have been in a relationship for 5 years and living together in my father's house for 4 (in my country living costs are really high so it's pretty common to still stay with your parents beyond your 20's).  \nAt the end of last year my bf decided he needed a new phone for posting content (tiktok and reels) since his current phone's camera wasn't good and his career (gym instructor/ personal trainer) could use a boost from social media. While I agreed that a new phone with a better camera would help and I knew that he had saved some money, I asked him to wait a little longer (1 month or 2) before making any impulsive puchases since I was unemployed at the time and that money could be used for any emergencies.   \nWell, he disregarded everything I said and decided to buy the phone anyway, and to make a long story short, it was a scam in wich he lost almost $800. To say I was disappointed is an understatement because i told him before, that even though the money was his and he could use it any way he wanted, the shop was really suspicious and it was better to buy from an official store if he was going to spend that much in a phone.   \nIt was really frustrating but I tried to help him contact his bank to see if there was anything we could do and to my surprise they refund almost half of the money, but my happiness was short lived because the very next day he fell for another scam and lost both the recovered money plus $300 ($250 from his account and $50 from mine). I was livid at this point, the car had broken down (another $600 expense), we had no way to pay our share of the bills plus the repair costs and he had to ask for money from his mother (bless her) to solve everything, but we survived.  \nWell, now I'm employed and things were better until yesterday when he told me he was thinking again about buying the phone, to wich I told him: \"no way, not right now\", since we're not completely stable yet to spend that much money and I thought he would be at least a bit more mindful since we're still paying for his poor decisions from last year and we barely have money for bills, but he didn't want to listen to my reasoning, kept justifying why he needed it and I'm sure he'll buy it even though he knows that if he does that I'll have to cover his share of house expenses and I'm honestly mentally and emotionally exhausted, I feel like he isn't my partner anymore, just an oversized toddler and it's draining me.  \nFor additional context: he's been betting his money on soccer games and although he wins most of them, last week he almost lost all of the grocery money :)  \nOur currency is not USD, so those are all approximate values.  \nIf you survived my ranting, thank you for reading everything.",
    "subreddit": "TrueOffMyChest",
    "title": "My partner is completely irresponsible with money and I'm considering breaking up",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j73qfo/my_partner_is_completely_irresponsible_with_money/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 08:59:54 UTC",
    "id": "1j73nvx",
    "link_flair_text": null,
    "media": null,
    "num_comments": 11,
    "score": 5,
    "secure_media": null,
    "selftext": "I wish I knew what I was doing was not good. When I was younger, I used to pretend to commit suicide to get nudes from people who cared. I feel like the biggest piece of shit for doing shit like that. \nI was wrong for doing whatever I’ve done. \n\nI hope I turn out to be a better human being than that piece of shit from years ago. That is all I can wish for now. ",
    "subreddit": "TrueOffMyChest",
    "title": "I have been a shitty human being and I wish my existence was erased.",
    "upvote_ratio": 0.86,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j73nvx/i_have_been_a_shitty_human_being_and_i_wish_my/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 08:55:26 UTC",
    "id": "1j73ltg",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 6,
    "secure_media": null,
    "selftext": "I want it to go away so badly....I don't want to be looked at as a curse or a monster anymore. I swear I'm not bad I just want love too. I feel like somehow all the bad things that happened to me are my fault and I'm not lovable and that's on me too.\n\nI'm so sorry to anyone's life I made harder by being in it I'm so sorry I'm trying so hard to be good I swear I am...it's just really hard I'm sorry..",
    "subreddit": "TrueOffMyChest",
    "title": "I wish I could get rid of my BPD..",
    "upvote_ratio": 0.88,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j73ltg/i_wish_i_could_get_rid_of_my_bpd/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 08:47:29 UTC",
    "id": "1j73i5g",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I’m so tired. I just woke up from a dream (nightmare) where I was going back to a school dance that I left to get Wendy’s. I was really drunk and pulled in hard next to a black Charger. A few guys got out and were looking into my car and for some reason my pants were down. They opened my door and tried to take my key (I was on the passenger side for some reason), I fought back and they shot me 4 times. They then proceeded to start to rob me while I pleaded and said I would give them what they wanted. \n\nI have so many fucking dreams like this and it makes me terrified to fucking sleep. I feel everything when I’m in them and it’s so scary. I can never actually rest because of them, they feel like my regular life but I’m aware of a few differences but. It’s starting to get to the point that I’m too scared to sleep.\n\nAnd I have multiples of the same types of dreams. I usually end up shot and bleeding out, it’s been in the back of my head, my chest, my legs etc. Nobody takes it really serious cause they are dreams but it’s fucking traumatizing man. I die in 40% of them, and am working stressed in 25%. I can’t do this shit anymore. I don’t feel safe anymore, I have to be up in 4 hours but will likely not get anymore rest. \n\nH E L P ",
    "subreddit": "TrueOffMyChest",
    "title": "Dreams",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j73i5g/dreams/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 08:46:47 UTC",
    "id": "1j73hth",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "Me and my girlfriend have been having a lot of issues and this was the one I wanted to marry. But its gotten so bad that I don't have any energy left to give.\n\nLast night I had the most gut renching dream about her cheating on me and what made it so brutal is that in the dream when I confronted her about it...she used all the same conversational and argument tactics she does IRL. Avoiding the question, gaslighting me, talking over me when I tried to speak, flipping it around on me, trying to exit the conversation after saying her part only, not listening, insulting me, constant non-sequiturs, raising her voice to stop me from saying my part, saying everything I had to say was bullshit....I felt so voiceless. I wanted to demolish everything around me and then I woke up.\n\nSome people would say I should talk to my partner about this...but the issue is that the fundamental communication skills or at least the intellectual honesty to have a real conversation isn't there...I literally can't trust her words.\n\nI haven't had a nightmare like this in a long time but for those who believe in the other...there was a black cat in my dream (I have some gypsy in me) and I had it in the morning (I'm a Hindu).\n\nWhen I woke up...I was so fucking gutpunched and sick-feeling, that I realised this was the last straw. This nightmare has shown me the core issue which is that she cannot be trusted. \n\nIf I ever had to suspect her of cheating....the next level degree of how untrustworthy her mode of communication is...would leave me completely unsure forever.\n\nTrust is all. Communicatìon is all.",
    "subreddit": "TrueOffMyChest",
    "title": "The nightmare was the final straw.",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j73hth/the_nightmare_was_the_final_straw/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 08:38:30 UTC",
    "id": "1j73e1b",
    "link_flair_text": "CONTENT WARNING: ANIMAL ABUSE",
    "media": null,
    "num_comments": 1,
    "score": 0,
    "secure_media": null,
    "selftext": "A bit of backstory: I used to live in the countryside with an older relative and she had a habit of acquiring pets she was unable and unwilling to take care of, eventually we ended up with four dogs, two small and two large. The problem is that every time we would open the front gate to take the car out the dogs would run out into the brush and potentially put themselves in danger, so we’d lock them in a tiny cage for a few minutes while we drove out and then come back in and let them out into the yard. The two large dogs started to get too big and the relative refused to buy a new larger cage for them and told me to figure it out (it was my job to lock up the dogs and this relative could basically boss me around all she wanted.) eventually I started putting one of the smaller dogs in an open plastic barrel while the others stayed in the cage, but she learned to jump out, so I would put a lid on it for more than five minutes. I hate myself for it, but I am an extremely, almost medically, forgetful person. And one day, I simply forgot about the dogs, and went to work, truly believing that I had let them out as usual. I came back to find that the dog had suffocated in the covered barrel. I can’t explain the emotions I had in that day, but that happened when I was 16 and it still makes me nauseous to think about. I’ve had a very hard life, but for some reason I think that this day was the worst day. There was a lot of screaming and crying from both the relative and I and she made me wrap the dog in an old dog food bag and carry it to the car so that I could dump it far from our property, unceremoniously. It still fucking haunts me. Everyone tells me it was an accident, but I still have nightmares about it. All I can think about is how horrible it must be to be a tiny innocent thing suffocating in a plastic barrel on a hot day. It eats me alive. Everything makes me anxious, I don’t want to be responsible for something like that happening again, I want to have kids one day, but how can I knowing that there’s a possibility that they can meet a horrible end just because my mind is in the clouds. The only time I spoke of this event was the day it happened, to various online friends, and then I never spoke of it again since until now. I’m laying in bed and trying to sleep, and maybe it would help if someone knew. \n\nI’m sorry Lila, I didn’t mean to. ",
    "subreddit": "TrueOffMyChest",
    "title": "I killed my dog and it’s been haunting me for a long time now",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j73e1b/i_killed_my_dog_and_its_been_haunting_me_for_a/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 08:30:36 UTC",
    "id": "1j73abs",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I Ran Away from Home at 13 to Escape Abuse Now I'm Trying to Change My Life\n\nI don’t know if my story matters to anyone, but I feel like I need to let it out. Maybe someone out there understands what it’s like.\n\nI grew up with my grandmother when I was little, and she made me feel loved. She taught me kindness, humility, and the importance of sharing, even when you don’t have much. I still carry that with me today. But when I was five, she had to leave, and I was sent to live with my mom. She tried her best she worked abroad to support me. Eventually, I was left along with my half siblings to their grandmother, and that’s when everything changed.\n\nFrom the time I was six until I was thirteen, I was abused. Not just words physical beatings that left my skin red and bruised. My teachers saw the marks, but I told them I fell. What else was I supposed to say? No one would have believed me anyway. My only escape was watching TV dramas. I cried along with the characters because, for a moment, it felt like I wasn’t alone. I had no phone, no way to tell my mom, no one to vent to.\n\nI tried everything to please her. I got good grades. I cleaned the house. I did the dishes. Nothing was ever enough. Because in her eyes, I didn’t belong I wasn’t of her blood. No matter what I did, I was unwanted.\n\nSo one day, I left.\n\nI walked nearly 6 kilometers to my grandmother’s place. It wasn’t my first time running away I even did it once when I was six, but that time, I brought a school friend with me. Their grandmother was furious that I brought their grandchild along with me tbh I didn't know what I was thinking I was still a child that time in 2nd Grade. But this time, I was alone and determined. When I finally arrived, my grandmother wasn’t upset she was happy to see me. She took me in without question. It was only after the third time I ran away that she finally got mad and went straight to confront the woman who had abused me.\n\nThat was the moment I finally felt safe. My grandmother has been my safe space ever since.\n\nBut the past doesn’t just disappear. Even after escaping, I still struggled. In 7th grade, I got dengue and had to be hospitalized for a month. That’s when the doctors found other health issues, but I was never told what they were. No one ever explained anything to me. At least my stay was covered by PhilHealth, so it didn’t add to my problems.\n\nNow I’m 19, but I still feel stuck. I have trust issues. I struggle with self-worth. Sometimes, I wonder if I’m the problem, if I’ve just been blaming my childhood for everything. But I also know I want to break free from this cycle. I want to change.\n\nI want a better life. I want to help others like me. I want to leave an impact and make a difference. And if I want that, I have to keep going. ",
    "subreddit": "TrueOffMyChest",
    "title": "I Ran Away from Home at 13 to Escape Abuse Now I'm Trying to Change My Life",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j73abs/i_ran_away_from_home_at_13_to_escape_abuse_now_im/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 07:48:10 UTC",
    "id": "1j72pn4",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "Me 22F and my best friend 20M have been friends for going on 3 years now, we met in college and he was the only person who I stayed in contact with after we finished. I've always had trouble with maintaining relationships after things like that end, After finishing both primary and secondary school I quickly fell out of contact with all of my friends.I haven't had any friends since 2019. So when it came to college this happened again except for this one friend. We actually grew closer and became really good friends. But we live around an hours train rid away from each other so we rarely see each other in person. He is a very social person and has lots of friends (even though he'd say he doesn't), whereas I'm an extrovert with sever anxiety and autism. He talks about his friends, group chat, going on late night drives and drinking with people, and I just sit alone at home. I know it's not his fault but it's just killing me, I have been struggling with depression for a long time and it just keeps getting worse. I see him living the life I'd die for and I've been starting to hate him for it. I just want to have friend and people to talk to and hang out with. I just feel so alone. This jealousy has been getting worse and deeper recently and I'm scared it's going to ruin our friendship. I just don't know anymore. ",
    "subreddit": "TrueOffMyChest",
    "title": "I am starting to hate my best friend out of jealousy and its starting to destroy me and the relationship",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j72pn4/i_am_starting_to_hate_my_best_friend_out_of/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 07:47:16 UTC",
    "id": "1j72p6c",
    "link_flair_text": null,
    "media": null,
    "num_comments": 31,
    "score": 202,
    "secure_media": null,
    "selftext": "After returning home from an ayahuasca ceremony, I got a message from a friend of mine whom I considered a \"spiritual brother\". He wanted to meet up. I was still in that post-ceremony glow—full of energy despite the late hour—and I wanted to socialize.\n\nI live down a long dirt trail, a 15-minute walk from the nearest road. When I got there, he was waiting in his SUV. I was excited to talk with him. Right away, he offered me some hard liquor, saying, “This is what the indigenous people drink here! It’s very good for you.” But I had just returned from drinking ayahuasca, and he knew that. He wasn’t speaking clearly, but he started telling me stories about indigenous cosmology, which fascinated me—until the conversation took a turn.\n\nHe began talking about how husbands take other women and how normal it is. Then he told me he needed someone “spiritually on his level” so they could have a deeper connection than with their actual partners.\n\nI told him flat out I wasn’t interested. But I kept asking questions. *Does your wife know about these ‘practices’ you do?*\n\n“No, no,” he said, “but it’s better for her. Better for me too. And for our children.”\n\nHe started going on about how we don’t marry the people we are equal to—we marry the ones who are good for having kids. That real spiritual connection is with extramarital lovers. He kept inflating my ego, using spiritual talk to manipulate me. I asked if he had done this before.\n\n“I’ve done it many times,” he admitted. “With many different women.”\n\nThen he put his hand on my leg. I told him I was leaving. But I made the mistake of trying to stay friendly.\n\n“Let me just show you one thing before you go,” he said.\n\nHe stopped me behind the car and hugged me. That’s when I froze. Trauma hit me like a wave. This wasn’t the first time something like this had happened to me, and suddenly, I was simultaneously trapped in his arms and in my past.\n\nHe pulled me tightly against him, ran his hand down my back, onto my hindquarters. At the same time, he started kissing me—lightly, from my ear down to my collarbone. My stomach churned with nausea. I squirmed to get away. He let go. I was in full trauma response, barely able to hold back tears.\nThen he begged me not to tell his wife.\nI barely managed a goodbye before I ran back up the hill to my house, praying he wasn’t following me.\n\nA few days later, I saw his wife. Despite my own pain, I felt it was my duty to tell her the truth about her husband. Never mind my trauma—this was her husband. She deserved to know.\n\nAt first, she seemed to believe me. But later that day, I got a message from her. She repeated *all* his lies. He told her I subconsciously wanted to be with him. That based on our messages, I *must* have known it was going to be romantic.\n\nBut that couldn’t be further from the truth!!\n\nI was completely blindsided. Now, looking back, I understand things I didn’t back then. At the time, I was in a cult. I believed that everyone in it was a good person, incapable of this kind of thing. If it were me *now*, I’d know better. I’d understand that if a married man asks a woman to meet him at 2 AM, he’s not looking to talk about life. *Full stop.*\n\nToday, I saw both of them. \n\nSeeing him again brought everything back- how he lied, how he got away with it, how his wife believed him over me. The anger and pain hit me like a tidal wave. I wanted to punch his stupid mouth, to do something, to make him face the truth of what he did. I even had a thought of role-playing the situation in front of his wife-forcing her to see it so she would understand. But I know deep down, no matter what I do, she probably won't believe me. He has her wrapped in lies. And I'm the one left carrying all of this. I've been crying all day. I feel so much anger, hurt, and grief. I don't know how to process this.\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "I was in an aya cult. I told his wife and she didnt believe me.",
    "upvote_ratio": 0.91,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j72p6c/i_was_in_an_aya_cult_i_told_his_wife_and_she/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 07:42:28 UTC",
    "id": "1j72ms0",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 4,
    "score": 1,
    "secure_media": null,
    "selftext": "I 24f am fed up with my depression. I’m just done with finally having happiness and then boom a depressive episode happens.\n\nAll I want is to be normal and not have so many mental health issues. I also have ADHD, Autism and Anxiety as well as a language disorder. \n\nI don’t know how much more of these episodes I can handle. I just want to feel good and not fear having a depressive episode. \n\nI know the person who will affect the most if I do decide to end it is my mum. She went through hell with me as she wasn’t planning on having me and if she wakes up to the news I’m gone it may cause her stress. She’s a stroke patient and myself and my sister are what’s keeping her going.\n\nThis is what has stopped me the last few times I’ve wanted to end it all. But I’m lost. \n\nI just want to be happy and not feel like crap. But I guess I never will \n\n",
    "subreddit": "TrueOffMyChest",
    "title": "Currently debating on ending it all",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j72ms0/currently_debating_on_ending_it_all/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 07:39:12 UTC",
    "id": "1j72l6t",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "Guys I have to get this off my mind by saying after reading a bunch of Reddit topics like this it's good that I'm not the only one who does this and I hope you guys feel my pain on my concerns here it goes....\n\n\nHi I'm a 22M and for while now I have my own imaginary OC girlfriend that actually cares for me and is there when I need her to be (mentally) also I never had luck for girls nor did they find me attractive and I'm shy so IDGAF about them and for fun it all started back when I used to draw her as a gag thing when I was 17 I would draw what she looks like, act, hug, kiss like. It was all fun till eventually I started to actually have feelings to her because I would always talk about my personal life and struggles to her and she would say back to me while hugging me \"it's okay, everything's going to be all right, just note that I'm here for you when needed ♥️\" like seriously guys even while quoting what she would say to me I'm literally crying 😭 (I'm not effing joking) not only that she was also my comfort and coping zone as well for the $hit I go through in life. Even when I go to see I like to use my pillows to imagine it's her and I can hug and kiss her randomly as I pleased, other ways I like to imagine she's there for me is when I daydream about her (mostly) draw or write my stories with her (fun fact: I created her for my comic but my personal life, I want to publish it by doubt anyone read it so I just keep it to myself 🤣) journal about her in her ways for me and what we would do together! I know I'm weird but I'm not ashamed of it\n\nLike literally last night while I was walking around the neighborhood, right now I'm in the forest type of neighborhood so it's a lot of trees and hills here 😅 (also it was around 11ish night time 🌙) and I'll admit I was kind of scared and a little nervous to go to dark areas like that even the street lights wouldn't work so it made my nervous system 10 times worse, but while walking I could hear her tell me \"why so scared? I'm here with you! Just hold my hand and we'll walk together! Breathe and calm down\" (I would Literally hold the air or hold my own hand to think it's her) like it come for me so much that my heart for her couldn't take the fact that she's not real because mentally (to me) she is! As soon as I got back to my Airbnb I was literally crying a river for her! Even my own friend had to comfort  me to tell me everything's okay to not feel too down about it (he's real btw) so yeah I know which y'all thinking I'm a loser, weirdo, idiot for going out and crying for something that doesn't exists and your right I do! I just wish she was real she's my everything!!!  If it wasn't for her I probably be scared out of my mind or even worse....\n\n\nNote: I doubt anyone is reading this but if you are and if you're interested to know more about her I'll tell you more of her name and her information and another story if anyone's interested trust me I don't mind explain more about her I love my sweet bone 🦴😍💜💋\n\nBut seriously I would love some helping tips and other ways to cope with her! She really helped fixes my depression and suicidal mindset 😭 🥺",
    "subreddit": "TrueOffMyChest",
    "title": "i have a imaginary OC girlfriend that I love dearly and wish to be with forever 🫶😍🥺",
    "upvote_ratio": 0.25,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j72l6t/i_have_a_imaginary_oc_girlfriend_that_i_love/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 07:34:27 UTC",
    "id": "1j72irh",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "Okay, so I am going to try to keep this short, but I need advice. My ex (27F) and I (30F) first started seeing each other in February 2022. Very early on in the relationship she complained about one of her machines she uses for work, and it leads to me getting her a loan in my name, under my social, to be her new upgraded machine. The machine ended up being a 2.3k loan.\n\nTime goes by and we realize we are not right for each other. We were both super toxic during the relationship in our own ways. Her and her daughter moved out in the middle of June 2024 after us breaking up initially in the middle of May.\n\nEver since they moved out, she was constantly late on the payments, which caused her to make late payments every single time. Thankfully, this did not impact my credit by some miracle in this universe.\n\nOn 1/10/2025 of this year, after not paying since November, I went in and withdrew money from a mutual fund my dad gave me when he passed away. Not something I wanted to do but I had to because it was starting to impact my credit drastically.\n\nBefore this, on 11/25/2024, her daughter called me because she missed me. My ex wasn’t home, her mother (kid’s grandma) was. I said hi to her even and she didn’t say anything to me. When my ex got home the kiddo dropped the tablet she was using, and it disconnected.\n\nI ended up texting my ex asking her not to be mad at her kid when she just missed me like I missed her. We have a fight where we both said some intense things (and I did a lot of it). I have no excuses for the things I said, but I don’t regret it either.\n\nLong story short – she blocks me and deletes the calling app off her kiddos tablet so she can’t call me again.\n\nThe loan, in the beginning, was $2,299. When I paid it off, I paid $1,154.39. I paid 50.22% of this loan.\n\nDo I have grounds to get this back? How do I go about getting it back?\n\nAlso, do I have grounds to get my dog back? I let my ex take her when I was not in a good mental space because I couldn’t even take care of myself. Dog’s microchip is under my name and to my knowledge she didn’t update her vet records so the last person for her was me. In the dog space – I am this dog’s favorite person. I went over there one day and was talking to my ex and my dog freaked out for a solid 15 minutes over seeing me.\n\n \\*We live in Oklahoma in the USA\\*\n\nSo, should I just cut my losses and move on and try to save that money back up or should I text her from a different number or a friend’s phone to ask her to give it back since I paid half. Genuinely I have no idea what to do in this situation and I’ve gone back and forth for 2 months.",
    "subreddit": "TrueOffMyChest",
    "title": "My ex (27F) took out a loan under my (30F) name for a $2.3K machine but stopped making payments after we had a fight, leaving me to cover half the cost.",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j72irh/my_ex_27f_took_out_a_loan_under_my_30f_name_for_a/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 07:11:01 UTC",
    "id": "1j726r7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 3,
    "secure_media": null,
    "selftext": "My mom acts like a kid when she's sick... I'm currently argued with my mom, she's sick right now (bed sick) she can't get up, has a high fever etc. Anyway today I was looking for my cat and she was in my moms room, I was minding my own business getting my cat telling her she could get sick so I'll take her. She made a comment that is still bothering me, \"oh so you care more about the cat, but not about me, ok\", \"I'm sick and you don't bother checking in on me\". \n\nFor context my mom and I... we don't have the best relationship, growing up she was never the most loving, kind towards me, it was a very toxic environment, It is a lot better now compared to how she was before tho. Anyway, I really hate it when she says stupid shit like this, is not the first time. When I'm fkn sick, dying sick, she's not there for me, she's not the type to go out of her way to get me medicine, or make me a warm soup... I'm not the fkn mom, I'm in my 20s but to this day, at my grown age, it would be nice to have or feel the love of a pampering mother specially when you're sick. \n\nI got so mad I wanted to tell her off, \"why would you expect that from me? If I haven't experienced that myself?\" \"Do you think im your mother or something?\" \"What you sow you reap\"... so many things, but I kept my cool, \"yeah i do care a lot about my cat\" is all i said and went about my day.\n\nIt made me even more mad, because I am also fkn sick, I have a bad stomach bug that has been going on for 4 days now, and guess what??? She hasn't done sht for me, hasn't asked how I've been if I'm better or what... \"probably something you ate\" is all she said when I first told her, and off to work I went. Didn't bother to check in, didn't bother to ask how I was doing, if she could make me something to help me... and she has the audacity to say that sht to me?... and guess what, im hating myself for this but here goes. \n\nThe day before, she went to work fkn sick when I had told her the night before not to, because she was literally dying with a high fever. She still goes cause she's a workaholic, Anyway, it's 2pm and I see i have a missing call from this woman, I was showering getting ready to go out with my boyfriend. I call back i asked her what does she need, she tell me to go pick her up because she can't drive back home, that she feels weak... i tell her why I didn't answer when she called, this is what she says \"why didn't you shower earlier, you need to be more attentive\".... wtf??? Why would I pause my day for her? Does she want me to just sit there and wait around for her to get home or call me and finally function, for her? Wtf.\n\nLong story short, I call my boyfriend and let him know what happend, he ended up giving me a ride. So we rushed to get ready he ended up givin me a ride to her work place to pick her up and drive her back home. On the way back, she just kept going on about, why didn't I answer when she called, why am I not paying attention, why was I still sleeping late... I don't fkn know maybe cause I'm also sick and fkn tired from work???? No a thank you to me or my boyfriend, nothing. \n\nI did that sht just for her to be telling me \"you care more about the cat than me\"... but she's right, I don't care as much about her than i do about my cat, I don't love her, but I don't hate her, I see her as the person that gave birth to me, which gives her the mother title, but she is no mother to me emotionally.\n\nAnyway, i wanted to get this sht off my chest, so thank you of you took the time to read this! Have a good night 👍🏻",
    "subreddit": "TrueOffMyChest",
    "title": "My mom acts like a child",
    "upvote_ratio": 0.81,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j726r7/my_mom_acts_like_a_child/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 06:49:05 UTC",
    "id": "1j71v04",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 51,
    "secure_media": null,
    "selftext": "I'm extremely high and think about it. These guys get paid to travel the world and be overdramatic with electronics. The show is entertaining even though you think it's occasionally ridiculous. These guys got rich doing the bullshit we did when we were 12 years old 🤦‍♂️",
    "subreddit": "TrueOffMyChest",
    "title": "Dude I'm stoned watching Ghost Adventures. It's just people my age and older yelling at air.",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j71v04/dude_im_stoned_watching_ghost_adventures_its_just/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 06:36:32 UTC",
    "id": "1j71ogd",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 217,
    "score": 10409,
    "secure_media": null,
    "selftext": "We were close friends when I was younger,  between 20 - 25, he's 5yrs older. I trusted him. He raped me while I was drunk, unconcious. I didn't talk to him much after that, only at his fathers funeral, and my dads 70th birthday, trying to act normal. No one knows what he did 15 years ago, well I guess my dad knows now. \n\nMy dad called me on friday, letting me know he's not well and my parents and brother will visit him today,  one last time. Asking me if I wanted to join them, I said let me think about it. Yesterday I told my dad no, I will not be there because cousin did something I can't forgive. My dad's the best, I saw his face change but he didn't ask or press for info. He said he understood.\n\nIt did rip open an old wound. Honestly the guy's been dead to me for so long. I buried what happened in the back of my mind. Kind of blamed myself for being dumb enough to get so drunk and trusting someone to not take advantage. Now I realize this wasn't my fault. Today he will figure out I do not forgive him and never will. He will rot in the ground and I will spit on his grave.",
    "subreddit": "TrueOffMyChest",
    "title": "My cousin is dying and today he'll find out I do not forgive him.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j71ogd/my_cousin_is_dying_and_today_hell_find_out_i_do/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 06:23:27 UTC",
    "id": "1j71hhj",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 10,
    "secure_media": null,
    "selftext": "My parents adopted with my permission when I was 11. They took classes was placed on this list got the call took my siblings and adopted them. My brother was 3 when we got him and always treated him as sibling. They were never referred to as adopted growing up. Flash forward I’m 19 he’s 13. He becomes obsessed with me completely out of no where. Starts with cutting the back out of several pairs of jeans attempting to see me exposed. Then one day I noticed while using the restroom there’s small holes chiseled into the wall. Yep peep holes. Parents patch them. He creates more. Mind you he’s in extensive therapy they’re basically begging for help as to why he’s doing this. (Of course the state wants you to adopt and then ditches you when there’s a problem.) He then started exposing himself in weird places in the house so I would walk in on him. Then I worked all night was tired accidentally dozed off on the couch (still am pissed I fell asleep because maybe this part could have been avoided) and he touched me from my butt to my vagina in one quick movement. I wasn’t hardly asleep so I instantly woke up saw him walking away and he admitted to my parents that he did it. (I moved out 2 weeks later) Now flash forward again I’m 25 he’s 17. My parents obviously continue to raise him. there was no punishment because he was a minor (he was sent off for a year if you want to call that something) my parents have a relationship with him and I have a relationship with my parents. He talks about me to mom still which I find very odd. I have not said a single word to him since the incident. Being around him even this many years later physically makes me ill. I hate his guts and quite frankly wish terrible things upon him. I’m no where close to being healed from this and don’t know if I ever will be. He has a girlfriend that he’s been with for awhile she has no idea what he did and it just makes me sick because if that were me I’d want to know and I feel wrong by not telling her but I do not know her and the fight within my family it would cause ugh. I witnessed him today with the gf and he’s constantly in her face demanding affection and overly touchy. Just makes me sick for the girl and any future potential victim. sorry for the long post. I’m just really sad this happened to me. ",
    "subreddit": "TrueOffMyChest",
    "title": "SA still bothering me years later &amp; here’s why.",
    "upvote_ratio": 0.86,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j71hhj/sa_still_bothering_me_years_later_heres_why/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 06:23:15 UTC",
    "id": "1j71hd5",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 10,
    "secure_media": null,
    "selftext": "During some down time at work one time, a co worker and I were chatting about some recent purchases we had both made. \n\nKnick knacks for work and things like that. I pulled my phone out to show her some recent personalised items I had bought from Etsy. \n\nWhile trying to find my purchase history, I pulled up my search history. I had completely forgotten the things I had been looking at. One of the vendors I had purchased from also made sex toys and sex themed items, so as any normal person does I had a peruse through her wares.\n\nSo there plain as day to my colleague was all these sex toys, phallus and vagina shaped items. And the item I had actually purchased wasn't even any of those items! \n\nYep. I apologised and told her to forget she ever saw anything while she laughed.\n\nI don't even know how to delete etsy search history so no more showing my search history ever for me. ",
    "subreddit": "TrueOffMyChest",
    "title": "I accidentally showed a co worker my sex toy search history",
    "upvote_ratio": 0.79,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j71hd5/i_accidentally_showed_a_co_worker_my_sex_toy/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 06:12:40 UTC",
    "id": "1j71bqc",
    "link_flair_text": null,
    "media": null,
    "num_comments": 171,
    "score": 326,
    "secure_media": null,
    "selftext": "I (27F) married my husband (29M) when I was 22. At the time, it felt like the right thing to do — we were in love, everyone said we were perfect for each other. But lately, I can't shake the feeling that I missed out on my \"wild years.\" I see my friends traveling, going out, and living carefree lives, and I can't help but feel a little bitter. My husband is amazing, and I love him, but I wonder what my life would be like if I'd waited. I feel so guilty for even thinking this.",
    "subreddit": "TrueOffMyChest",
    "title": "I secretly regret getting married so young",
    "upvote_ratio": 0.78,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j71bqc/i_secretly_regret_getting_married_so_young/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 06:04:13 UTC",
    "id": "1j71736",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 5,
    "score": 9,
    "secure_media": null,
    "selftext": "I can't seem to catch a break.\n\nJust in the past month, my car has needed major repairs three times and was broken into once (there's nothing but trash inside so I don't know what they wanted), work got shittier in a dozen different ways, and my cat has been getting sick at least twice a week. And now, just today, my grandfather died. Over a thousand miles away. They think he caught the flu, and was septic before they could get him to the hospital. His blood pressure was bottomed out and his heart rate was almost 200. When they took him off of life support he didn't last ten minutes.\n\nI don't know what to do. I want to attend the funeral. I want to see my family. I want to comfort my dad. But there's nothing I can do. I can't afford a plane ticket and I have to work. My car wouldn't survive the trip if I tried to drive.\n\nI'm so tired. I've been drinking, so sorry if none of this makes sense. I just... want everything to stop. Just for a day. I just want a break.",
    "subreddit": "TrueOffMyChest",
    "title": "I wish things could just stop happening for a day.",
    "upvote_ratio": 0.82,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j71736/i_wish_things_could_just_stop_happening_for_a_day/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 05:58:15 UTC",
    "id": "1j713kl",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "",
    "subreddit": "TrueOffMyChest",
    "title": "I became more of a man, yet life grew bitter",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j713kl/i_became_more_of_a_man_yet_life_grew_bitter/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 05:51:44 UTC",
    "id": "1j70zu7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 22,
    "score": 37,
    "secure_media": null,
    "selftext": "I just bought a 6 pack of green apple white claws by accident for the third time and i hate whoever is behind this flavor. The first time, I picked them up and assumed they were lime because, green. My usual. Didn't even know the green apple flavor was a thing. I've just unwittingly bought another 6 pack at a different store that historically always had the lime flavor in a 6 pack and I don't know how I haven't learned my lesson about shopping for these by color by now. That is all.",
    "subreddit": "TrueOffMyChest",
    "title": "I keep accidentally buying green apple white claw and I cant help but think who tf asked for this flavor",
    "upvote_ratio": 0.85,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j70zu7/i_keep_accidentally_buying_green_apple_white_claw/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 05:38:02 UTC",
    "id": "1j70sdg",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "",
    "subreddit": "TrueOffMyChest",
    "title": "Opposition",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j70sdg/opposition/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 05:37:57 UTC",
    "id": "1j70sbw",
    "link_flair_text": null,
    "media": null,
    "num_comments": 8,
    "score": 2,
    "secure_media": null,
    "selftext": "I was between molecular/cell biology, integrative (human bio/ecology/basically everything else), math, and physics. I don't want to waste two years and the associated money only to find myself committed to a field of work I don't like. I'm a sophomore and I'll need to declare a major before I can enroll in next semester. I don't know if I could see myself doing molecular biology work my whole career, and the integrative bio is beginning to seem useless without grad school. I'm not sure it's worthwhile spending two years just studying advanced math like real analysis and algebraic topology, and I don't even if I could graduate in physics, the last class was too difficult for me. I don't really have a motivation to do any of these degrees so I expect I'll just leave after the semester ends.",
    "subreddit": "TrueOffMyChest",
    "title": "I'm about to drop out of college because I can't choose a major",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j70sbw/im_about_to_drop_out_of_college_because_i_cant/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 05:31:28 UTC",
    "id": "1j70oru",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 46,
    "secure_media": null,
    "selftext": "I just want to throw up. He started playing about three months before I gave birth and said he wanted to max his account to kill time while the baby was young. It turned into a full time habit. Dude doesn’t work. the fact that I stayed is a big part of the problem - I admit that. \n\nI just hate him at this point. I stayed through so many hard times with him and now I hate myself for it. He made friends with this girl on the game and I asked so many times if he had anything to tell me regarding their relationship. I found receipts tonight and honestly it’s as devastating as it is embarrassing. Two grown adults with children and both with partners telling each other they are shaking and crying over each other. Lamenting that they wished they had other lives where they could be together essentially. All the while I’m in the same house while these things are going on about each other. He’s adamant it didn’t go any further and he even turned down nudes (I know…very valiant). Obviously I am not really buying that.\n\nI’m just disgusted and this has been the turning stone for me. The true victim in this is our 8 month old son who has a stupid mother who allowed herself to be abused for years and now has a split family.",
    "subreddit": "TrueOffMyChest",
    "title": "My partner of 6 years is cheating on me on RuneScape while I’m 8 months post partum",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j70oru/my_partner_of_6_years_is_cheating_on_me_on/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 05:09:55 UTC",
    "id": "1j70c5v",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "Nice life, parents, friends, work, nice city. \n\nNo big problems but I want to explore new places and be in nature",
    "subreddit": "TrueOffMyChest",
    "title": "Want to leave my nice life",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j70c5v/want_to_leave_my_nice_life/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 05:01:10 UTC",
    "id": "1j706wr",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 23,
    "score": 157,
    "secure_media": null,
    "selftext": "Throwaway account because I don’t want anyone I know to see this. This is something I’ve only ever told one person and I feel deeply uncomfortable to even tell a therapist. \n\nFor context: I have never been a victim of sexual abuse physically, was raised in a super healthy home life, etc. Nothing traumatic has ever happened to me due to another person I personally knew. \n\n\nWhen I was younger, I purposely would go on a site called KidzChat. I knew that predators would be on that site, and would advertise myself as someone to talk to “F 12”. I was around the ages of 10-14 doing this. Older men would then message me super sexually explicit things. We would sext for a while and eventually trade Skypes to talk or videochat. The biggest instance that I remember was skyping an older man who wanted to show me his jumping jacks. He would jump for a while and then his pants would conveniently fall off.  For some reason that moment is engrained in my mind. I know I’m a victim fully, but I feel weird because I went out looking for it? I guess that’s the cost of unlimited Internet access. \n\nAnother entirely separate thing that bothers me severely, is that one day (aged 11) I had my family dog perform oral on me. The dog didn’t need any coaxing, it liked the smell and went up to it. I remember it feeling awful and I felt so intensely guilty afterward. I never did it again, but I realize that this has deeply affected me as an adult. I absolutely cannot receive oral from a man because it reminds me of what I did with my family dog. This fact genuinely haunts me as I know it was completely wrong and animal.\n\n I don’t even know how to cope with both of these facts as I was a victim and perpetrator. These things still affect me in my sexual life now manifesting as intense fear and guilt to commit certain normal sexual acts with people like being eaten out, sexting my boyfriend, etc. I know I don’t have the guts to tell a therapist either. ",
    "subreddit": "TrueOffMyChest",
    "title": "I was a sexual degenerate as a child and feel deeply ashamed and uncomfortable about it",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j706wr/i_was_a_sexual_degenerate_as_a_child_and_feel/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 04:58:11 UTC",
    "id": "1j7052g",
    "link_flair_text": null,
    "media": null,
    "num_comments": 11,
    "score": 12,
    "secure_media": null,
    "selftext": "I stabbed a dog. I was working as a delivery driver and I went to a house with a bunch of packages piled at the door meaning the homeowners were gone. All of a sudden a giant dog that looked like the beast from the sand lot, same breed, very large, came sprinting around the corner and latched on to my arm. I had a thick canvas work jacket on so the teeth barely broke the skin. I carry a folding knife as a habit since I was a kid in boyscouts. I stabbed the dog with my free hand after trying to punch the dog and it ran off back around the corner of the house. A woman and her teenage daughter came around the corner screaming at me and I told them what happened. Apparently they were neighbors there to take care of the dogs. It all happened on the front porch in front of a ring camera. I then left, called my boss and the cops but decided not to take legal action. I guess I felt bad for doing that to the dog. I don’t know what else to say it’s been a few months. I’m pretty sure the dog died and it probably would’ve been put down anyway. ",
    "subreddit": "TrueOffMyChest",
    "title": "Stabbed a dog",
    "upvote_ratio": 0.65,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7052g/stabbed_a_dog/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 04:56:32 UTC",
    "id": "1j7045l",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 0,
    "secure_media": null,
    "selftext": "[ Removed by Reddit on account of violating the [content policy](/help/contentpolicy). ]",
    "subreddit": "TrueOffMyChest",
    "title": "[ Removed by Reddit ]",
    "upvote_ratio": 0.06,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7045l/removed_by_reddit/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 04:37:52 UTC",
    "id": "1j6zt7g",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "I do what I can to be less triggered. ",
    "subreddit": "TrueOffMyChest",
    "title": "I start to care what people think day by day.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6zt7g/i_start_to_care_what_people_think_day_by_day/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 04:27:13 UTC",
    "id": "1j6zmot",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 2,
    "secure_media": null,
    "selftext": "I don't know what spurred this on our relationship was always seemingly good. \n\nI (35m) think my Brother (32m) hates me. \n\nI've been in a rough phase of my life, moved back in with my parents, had just a terrible string of events dovetailing with my business failing and the loss of my Father all in short period. He died suddenly. I'm still working through that, I  was the one who took him to the hospital a few times that week, but the last time it was a serious emergency and he didn't get out. He died a few weeks later after being in a coma for the time. \n\nThis sort of, at least in my opinion, galvanized us into having a closer bond.  Or so I thought.\n\nDad dying was only a few months ago. It hasn't been a year yet. But I'm still trying to pick up the pieces and start moving forward.  And it was like our relationship with each other improved over it. We were a very loving family before, but this hurt us and we leaned on each other more. \n\nThen I learned the other day my Mom brought the hypothetical prospect of me being homeless. \n\nI don't intend to be homeless. But she brought it up to him or he brought it up to her, and he flat out told her that if I ever end up homeless I am not going to be living in his and his wife's house. For the record, I didn't ever ask or mention this. But this conversation took place behind my back and he apparently said that I was never going to be allowed to live with them. \n\nThey have a very large house btw, essentially half the rooms are empty at any given day.\n\nThat shocked my Mother to hear that and she told me. \n\nAnd quite frankly, it shocked me too. I am not going to be homeless. But to hear someone you thought you could rely on if things ever went to total shit say that, it's sad. But what made me more sad was remembering a conversation I had with him a few months before. \n\nHe told me his wife (31 f)'s best friend (30 f) who has a kid and either got kicked out of her own house, or cheated, or something became a single mother. My brother told me he was actively considering moving her and the kid INTO their house. She, who has had numerous problems from heavy drug use, alcohol use, partying hard, who has seemingly reformed her ways - was welcome to live with them. It didn't end up happening because she QUICKLY found a new guy. \n\nBut that was a total shocker to me, that I, who has had no problems with drugs and alcohol, who helps take care of his kid, who buys her toys and plays with her, who has bought them gifts every holiday, is lower on the totem pole than the single mom best friend of the wife. It totally blindsided me, and I feel betrayed. I'm not at any risk of being homeless, but the conversation came up between my Mom and him and that's how it went. To think your own brother won't be there for you, but will be for some sketchy broad, is totally insane. And for me it's like I'm feeling just heartbreak, resentment, sadness, disappointment, all mixing together - I love him, I still do, but I feel like I just got betrayed... Betrayed over something that hasn't happened yet. But that he thinks so low of me is shocking really. I don't know what to do. \n\n",
    "subreddit": "TrueOffMyChest",
    "title": "I (35m) think my Brother (32m) hates me.",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6zmot/i_35m_think_my_brother_32m_hates_me/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 04:05:50 UTC",
    "id": "1j6z9id",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 0,
    "score": 5,
    "secure_media": null,
    "selftext": "Hey, Team! I've been feeling super duper down in the dumps lately and want to vent serious style without fear of personal societal repercussions! This is a throw away account n such. Not really curating this post just typing about whatever comes to mind. \n\nI've never really been the happiest of people. Even in my youth I remember being melancholic more than not. Didn't have the best upbringing (not the worst by a long shot either). My parents fought with each other all the time if I didn't have someone over. I remember hiding in my room hearing them arguing downstairs hoping against hope it wouldn't lead into my room with them competing for my favoritism. There were times either my mom or dad would try to drag me out of the house to stay at a hotel with them because the other parent was \"crazy and untrustworthy\". Events like this were common place (once or twice a month) in the house up until I was around 14 when it all kinda just died out. My parents stopped fighting daily, maybe once a month or so until not at all. They never even acknowledge the horrors they would put me through. They just tell me it wasn't as bad as I think but it totally fucking was. It was hell, not to mention how often they would remind me how abnormal of a human I am. \n\nI've been diagnosed either adhd and I highly suspect I have high-functioning autism. I never really managed to fit in around others as a kid, often doing things my own way. Friends were hard and socializing was harder. My parents would try with all their might to assimilate me into \"normal\" behavior. My mom didn't let me shop for my own clothes until I left the house. I bought some shirts with some cats on them with one of my first paychecks (maybe 16 yrs old). She took and hid them from me because she was afraid people would \"think I'm girly, or gay\" which blew my mind. My dad wasn't the most supportive of my interests either. I recall a time when i was in grade school I really liked filming and doing stop motion Lego things.. I probably just caught him at a bad time (wasn't very many good times).. forgot what I asked but I remember his reply was along the lines of \"it doesn't matter anyway, it won't go anywhere\" in regards to my short-lived hobby. I don't think I picked up that camera again after that. I wish I did. Can't blame myself there i guess.. I was young and impressionable.. I wonder often how things play out if he never said those words. Probably not much different but maybe..  instead I just spent most of my time online, hiding behind headphones blocking out the screaming. \n\nDidn't have many friends growing up. I'd typically just pick one person I liked and puppy dog around them. I was pretty shy and often to target of harassment from some of the meaner kids in school. I got used to being the butt of jokes and such pretty early. It didn't bother me much but it definitely scared me off from trying to form connections. That said I managed enough. I had a lunch table to sit at most of the time. I wasn't usually the star attraction but the folks there didn't seem to mind my presence. I recall once I didn't really feel comfortable sitting at any table so I sat at an empty one. This prompted the principal to come over and with good intentions have me sit at a table with a bunch of strangers I didn't really know. Horrifying experience. That said, I didn't really spend too much time hanging out with friends irl. I unfortunely found connections on the world wide web..\n\nDespite how strict my parents could be they let me have unfiltered internet access from the very get go when i got my first laptop at 12 or so. They never monitored my activity, or set restrictions on screen time or anything. Long-story short I end up in some unsavory online spaces. I met people who at the time I thought were nice friends, parental figures, people to talk to when I didn't have parents I could. It wasn't until a bit later in my life I realized how groomed I got. I never thought much about it at the time. It seemed like people finally enjoyed my company, wanted to invite me to chat and stuff. I didn't see the harm at the time at all. Just some text-based roleplays, maybe a picture or two without my face. Whags the harm? Now in my adulthood I feel like I'm able to see the effects more. My libido is so high yet the thinking about sex makes me extremely uncomfortable in a way that's hard to describe. I get jealous, disgusted, confused, lustful, etc etc etc whenever I see or am reminded of the mere concept of penetration. What's worse is I think it's effected my love language too. I feel I have a really difficult time feeling like I'm showing I love someone if I'm not having sex relatively often. I doubt myself, and if I'm able to provide and be a good partner. I know there's so much more to a relationship but my brain always defaults back to thoughts along these lines. I hate it but the nature of the issue causes me to love it. Its such a conflicting mess of sexual frustration. I have no idea how to do a segway here so... :3 \n\nAnxiety is a big thing in my life. It wasn't so bad when I was younger, mostly manifesting in social anxiety around new people or crowds. Nowadays I sometimes feel anxious just leaving my apartment. Going to the store is a massive panic attack and I have no reasons why. I desperately want to put myself out there, meet new people and enjoy this life I have but the exhaustion from the anxiety and depression just constantly kick my dick straight into the dirt.\n\nDepression is the worst. It's only gotten worse since I broke up with my seven year long partner (we were engaged too at the time). The break up is a long story with no heroes and only villains and victims. I don't want to dive into it here. I'm a bastard, theyre a bastard. Point is I'm a total bastard livid with regret over such minute details. I miss my ex... I care about them... but I don't trust them anymore and I loathe the mere memory of them. It's such a dissonance... I can't think back to the early days and not wonder if any of it was real at all. I'm sure there was true love between us sometime... I wonder when we lost it, and I fear they mightve never felt love for me like I did for them. We were young when we met. Stupid too, probably. Grew up and got distant yadayada... happens.. I still miss them.. their quirks and such. The way they talked and the way they ate. Even the things that annoyed me I miss... its wild how much I miss the things that pissed me off...\n\nAnyway, this post is going a bit long. It's bedtime for me. Thanks for reading my cool, epic post. Might post more vents like this. ",
    "subreddit": "TrueOffMyChest",
    "title": "General depression post I suppose (28m)",
    "upvote_ratio": 0.79,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6z9id/general_depression_post_i_suppose_28m/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 03:51:09 UTC",
    "id": "1j6z0ce",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 3,
    "secure_media": null,
    "selftext": "I adopted my cat back in September last year. She’s about 3, an absolute sweetheart, and loves to play, but lately I’ve felt like she hasn’t taken much of a liking to me. I don’t know what’s wrong.\n\nShe’s in my roommate’s room all the time. My bedroom is on the first floor, 4 roommates are upstairs (I have 5 roommates total). Unless she’s meowing at me to feed her, she’s up there. I hardly even see her much around the house anymore, and she doesn’t sleep on my bed with me like she used to. She’s always up there with one of my roommates. \n\nI play with her a lot, give her attention and treats, brush her and clip her nails, everything, but she still prefers my roommate over me. \n\nThis is probably a really silly thing to be sad about because at the end of the day she is still my cat, but I want to have a better bond with her and I don’t know what I could be doing wrong. \n\nFor the first couple months, she would always greet me at the door meowing and rubbing against my legs, sleep on my bed with me while purring like a train, all that good stuff. \n\nBut now she doesn’t anymore. Gradually less and less, staying upstairs and hardly coming near me. It’s feeling more like she’s my roommate’s cat now. \n\nI’m just repeating myself now, but I don’t know what to do. ",
    "subreddit": "TrueOffMyChest",
    "title": "I feel like my cat doesn’t like me",
    "upvote_ratio": 0.72,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6z0ce/i_feel_like_my_cat_doesnt_like_me/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 03:48:48 UTC",
    "id": "1j6yyw1",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 17,
    "score": 0,
    "secure_media": null,
    "selftext": "And it kinda did something for me...that's horrible to admit because I was still very much pregnant and I had bruises on me from it but I kind of liked it. ",
    "subreddit": "TrueOffMyChest",
    "title": "My husband shoved me into a dresser a few months ago while I was still pregnant....",
    "upvote_ratio": 0.2,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6yyw1/my_husband_shoved_me_into_a_dresser_a_few_months/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 03:38:28 UTC",
    "id": "1j6ysb5",
    "link_flair_text": null,
    "media": null,
    "num_comments": 32,
    "score": 1579,
    "secure_media": null,
    "selftext": "Hey so this will be my final update on everything as I believe the situation has finally come to an end and I’m in a really good place. \n\nI left off where I was in a shelter and had made a lot of friends. Well the girl who I was gonna move somewhere with she ended up going back to her Mom and step Dad, and so I was back to being stuck on what to do. That was until I got a message from my grandma that her mom (my great-grandma) needs someone to care for her, she said that her brother would be happy to have me stay with him as long as I care for my great grandma. I decided I have nothing left to lose and decided this would be a good gig till I find out what I wanna do. I arrived in Miami 3 days ago and have been enjoying it greatly so far. I never really knew my dad’s side as he wasn’t that close with his family and after he passed it was hard to keep contact. My great-uncle is very nice and very accommodating and his wife is really nice, they live in quite a nice part of Miami as well near the beach. \n\nI haven’t seen my great-grandma in over 10 years and she was so happy when she saw me. She can’t speak that much English as she only really speaks Spanish. I’m aware I said my dad was white, but that’s was only because I was scared of my identity being revealed and that wasn’t a 100% lie. My father was Cuban and was born and raised in Miami, however, he was most likely a descendant of Spaniards. Anyways, my great grandma has been teaching me Spanish and as well through the help of translating of my great uncle stories about my dad. She told me that he would fall asleep on her lap at family gatherings and how he would make the whole family laugh imitating her accent. It made me tear up seeing all the photos of him as a kid with his whole family. She told me that when he got on drugs and ran away from home, it left everyone in complete distraught. She claimed my grandma would cry everyday. \n\nMy Mom never had a relationship with them, and that was her choice they wanted to meet her actually. They told me that they weren’t shocked what happened to me as my Dad told them later on my mom would cheat on him all the time with other men. This made me furious as my mom always claimed my dad was her “soulmate.” \n\nI have not heard anything from my mom, however, my cousins wedding went ahead yesterday as my aunty posted it on Facebook. My mom was there and she seemed completely fine from the photos. The wedding looked boring anyways, my cousin is marrying his first cousin from Pakistan (in-laws side) and no one is smiling. It made me laugh actually seeing my mom with all these people who are deeply religious and conservative. Seeing my mom next to my grandma and other female relatives who wear scarfs and are deeply religious, compared to my mom who sleeps with anyone that gives her an ounce of attention really cracks me up.  \n\nAlso no word from my EX-husband, however, his sister sent me a text apologising on behalf of her and his parents. \n\nSo yeah that’s the end I believe I’m taking care of my great-grandma and will work out what I wanna do in the mean time. This will most likely (hopefully) be the final update as I believe I’m in a really good place. ",
    "subreddit": "TrueOffMyChest",
    "title": "*FINAL UPDATE* I 21F found out my husband 33M has been having an affair with my mother, and I don’t know where to go from here?",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6ysb5/final_update_i_21f_found_out_my_husband_33m_has/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 03:37:44 UTC",
    "id": "1j6yrtb",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "Using a new account as I have people on my original account who know me irl, and I don't want them to even come across this.\nAs the title says, I really feel stuck at this point in my life(I'm currently 27 and turning 28 next week). All of it started two years back, when me and my then girlfriend(let's call her M) of 5 years started having a ton of arguments. It was mainly regarding my admission process and my promise of hitting the gym. I had quit my cushy job towards the end of 2022 to focus on my exams and my application process. It was a frustrating time for me as I had a pretty good profile(or so I was told) and expected to get an admit from almost all the universities that I had applied to. As it later turned out, all my hopes got dashed as I only rejection after rejection.\nIn the middle of it, there was a family function for which I had to travel to a different city(this is also the city where I did my undergrad from and M also lived). To give a backstory, we had been together since my sophomore year of undergrad and our relationship was a long distance one(We only saw each other during classes when we were studying. After graduation I had moved to a different city for work, and went to my hometown when COVID hit us.). \nSo during the time of this family event, I planned to take out some time and planned a dinner with M(during which I specifically told her that I didn't want to discuss my application process and that I was taking this trip as sort of a break). Unfortunately our conversation ultimately went into that direction, and what I thought would be a warm evening ended up with me feeling helpless and ultimately crying in the restaurant. After the family event ended, I travelled back to my city, and then had a talk with her and we both decided we'll take a break and introspect why we were arguing almost on a daily basis(we specifically decided that we will not be seeing or planning to see anybody in that period, but work on this and figure things out).\n\nAlmost a month later, a mutual friend of ours(let's call her C) tells me that M actually went on a couple of dates to see people(C and M were very close friends), which broke the trust I had in the whole relationship and I told that my trust in us was broken and that we were done. I developed this feeling of being inadequate, and ended up getting addicted to porn to numb myself, instead of studying and working on projects.My whole routine was to hit the gym and work out till I felt pain in my body, return back to home and sleep.\n\nAbout a couple months later, I learnt that it was C who had actually convinced M to go on dates and \"meet\" other people. Furiously, I cut contact with C and stopped any form of communication. As far as things with M were concerned, I was still too attached to her, so we decided we can try to work on things.\n\nThings changed a bit and I got an admission in a good university and started my postgrad journey here. But during the winter of 2023, me and M again had some serious arguments and I decided to cut ties with her. We still chatted on and off and she still told me she loved me. Around 2 months from that time, we tried to get back together again, but ultimately I couldn't sustain it this time(the distance had become a pain. turns out in a different country, loneliness hits you like a truck). And this time we broke up, once and for all. I felt and I still feel immense guilt for breaking up and putting her through a lot of pain. I sank into a pretty low state, got hooked to porn, but studied enough to keep my grades up, ultimately leaving any opportunity of upskilling myself or studying, but kept sinking lower and lower.\n \nAround a month back I talked to a therapist, and told her about my guilt and that I had been in a state of \"feeling like I do not deserve anything nice because I hurt M\" and that I self sabotaged whenever anything good came in my life. She heard all of my story and did tell me a lot of times when I was emotinally scarred and somewhat even manipulated by her as well. Now that I see this, I feel helpless. I inflicted a lot of pain and self sabotage on myself, and my addiction to porn has turned me into a very lazy person. I know that deep down I have the potential to excel if I figure my shit out. The thing is, I am not able to. I feel burnt out(recently even failed an interview at a reputed big tech company). I hardly have energy to study, reversed all the progress I made in the gym, and somehow not able to shake off this addiction. It's tough to put on a brave face and fake a smile, telling my family that I'm alright, while I'm numb deep down. I want to cry and take some of the pent up emotions out, but I simply cannot cry and give anyone a hint that I'm not alright. My family is very supportive and I don't want them to feel helpless knowing that I'm not as good as I tell them.\n\nJust wanted to take this feeling out. Thank you so much for reading.",
    "subreddit": "TrueOffMyChest",
    "title": "I feel stuck and I don't know what to do",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6yrtb/i_feel_stuck_and_i_dont_know_what_to_do/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 03:34:46 UTC",
    "id": "1j6ypwv",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "I feel so talkative at work because when I get home I don't talk to anyone.... No one to share my day with, no one to really ask me how my day is going, no one to have dinner with. I really with I had a different life ...  But I guess I wasn't ment to have a person of my own ",
    "subreddit": "TrueOffMyChest",
    "title": "I get kinda sad when I think about why I am the way I am sometimes",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6ypwv/i_get_kinda_sad_when_i_think_about_why_i_am_the/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 03:29:14 UTC",
    "id": "1j6ymel",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 0,
    "secure_media": null,
    "selftext": "I hooked up with someone yesterday through the Grindr app. I wanted to wear a condom, but i have erectile dysfunction, so it couldn’t fit in the condom at all. So I attempted RAW and I went in a little but I couldn’t have sex at all because my penis wasn’t erect enough, and there was lots of lube but my penis just wasn’t erect enough to have full on sex but I’m still worried because it went in somewhat and we kissed, he gave me oral, and I ate his ass for a few seconds.\n\nThe next day (today) my throat hurts and I have back neck pain but idk if the throat pain is because I drank gingerale with lots of ice yesterday I’m so worried and scared that I caught HIV through this one experience. So I went to the urgent care today and explained everything and told them to give me PEP and they told me they were also going to give me other medications but now my pharmacy has EMTRICITAB only and I need both EMTRICITAB AND ISENTRESS but the Isentress won't come until Monday noon please I’m so scared what should I do I won’t be doing anything until I know the results but I’m so anxious and scared should I be OK if I’m going to take the EMTRICITAB because of the 72 hour window it’s only been 1 day.\n\nThey did blood tests on me and throat checks but isn’t it too early to tell if it’s HIV?? Please someone help",
    "subreddit": "TrueOffMyChest",
    "title": "Hooked up with a guy yesterday and now scared of HIV",
    "upvote_ratio": 0.47,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6ymel/hooked_up_with_a_guy_yesterday_and_now_scared_of/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 03:16:28 UTC",
    "id": "1j6yegx",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 0,
    "secure_media": null,
    "selftext": "another long post...\n\nfor context, my(f18) sister(17) and her best friend(f15, almost 16, let's call her Dana) have been friends for almost a decade, they've always spent a lot of time together because our moms were friends. the last few years have been very very rough for Dana, and we've always been here for her, especially my sister, and that made them even closer.\n\nso, today, during lunch, my sister came to my mom and asked her if she could go out for a party night with Dana and her friend group, BUT. \nhere in italy, there are two stages of the party: the first one is open to everyone, the second one is only 18+, and she wanted to go right to the second one, that begins around midnight. my mom immediately said \"no.\", and my sister started whining, saying that Dana went there too a few weeks ago, and guess how she did that? fake ID and some connections, and that surely didn't help to have a \"yes\" as an answer.\na few hours ago i was with my sister and Dana, just talking, until my sister asked my thought about going to that party at that hour, and i said: \"honestly i don't approve that, not because you're going there, but because you're gonna do it 'illegally'.\", and she got angry, saying that she wanted to do that experience because she's a teenager and blah blah blah, to which i replied: \"yeah, you're a teenager and have to do your experiences, but you can make them on the first half of the night, where you can go without any problem.\", and i think she expected me to be the \"cool older sister\" because she got angry, and it only got worse when my brother(21) also said he agreed with me. so she went upstairs and i stayed with Dana, so i started talking with her about all this. the conversation then went to my sister's general behaviour, and we went to my room to talk more liberally.\nafter a while, we were talking about how she (my sister) almost never wants to go out unless one of us has weed or cigarettes and stuff like that, and that's when i told her something i had forgot:\n\nlast august they both were at home, my best friend was there as well, and we were all chilling in the backyard, when Dana told my sister that she had to go to her(Dana's) place, that she promised that, but my sister was whining about it, saying she didn't feel like it, but not giving a reason to break the promise, so they came up with a deal:\nDana would have gone home, and my sister would go there about a half hour later, so Dana left. i stayed with my best friend and my sister, who started saying things like \"i don't wanna go\", \"i don't feel like it\", and i replied other things like \"why don't you tell her?\", \"if you stand her up without saying anything, i'll tell her.\", and she freaked out, saying that if i did i would be a bitch, and i just rolled my eyes. after a while, she left and went to her room, and i immediately gave my best friend a \"i know how this will end up\" look, but didn't say anything.\n\nalmost a hour later, Dana calls me and says: \"your sister isn't answering my texts and calls. where is she?\". i took a deep breath and face palmed mentally before answering: \"she's in her room, i'll go check on her.\", and so i did. i muted myself and went to my sister, who was awake, and told her: \"Dana's on the phone, what do i tell her?\", and she replies: \"tell her that i'm asleep.\". my heart dropped and i didn't know what to do, so i just played along, unmuted myself, and said: \"she's sleeping.\". Dana was so disappointed and told me to wake her up, so i started shaking my sister trying to \"wake her up\", but she just pretended to fall asleep again and again, and i heard Dana say: \"look, never mind, let her sleep.\". i asked her if she was sure, and she said \"yes\", and i just said: \"okay, then... bye love, i'm sorry.\", and hung up. i looked at my sister and said a few things like \"you're an asshole\", \"you're a shitty friend\".\n\nso, returning to two hours ago, i told Dana about it, even though i probably shouldn't have, but i just thought it was the right thing to do. \nher face dropped and she became visibly sad and disappointed, said something like \"i don't even know what to say\", \"i can't think or look at her the same\", and i felt kind of guilty, but still thought that she had the right to know. \n\nwe smoked two cigarettes and she went to sleep, saying that she would figure out what to do about all this, again, she's clearly disappointed and tired of my sister being disrespectful.\n\nit's currently 4am, and i'm sorry for ruining her mood, but also scared of my sister's reaction in case she finds out that Dana knows, i've already made a post about my sister and her behaviour:/\n\nenglish is not my first language, so, sorry for any mistakes and/or things like that, i just didn't want all this to eat me up.",
    "subreddit": "TrueOffMyChest",
    "title": "i think i ruined the friendship between my sister and her best friend",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6yegx/i_think_i_ruined_the_friendship_between_my_sister/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 02:55:52 UTC",
    "id": "1j6y144",
    "link_flair_text": "CONTENT WARNING: ANIMAL ABUSE",
    "media": null,
    "num_comments": 2,
    "score": 2,
    "secure_media": null,
    "selftext": "So almost 10 years ago my mother and my now ex stepfather got gifted two dogs. My mother never wanted them since she already had a lot on her plate but since my ex stepfather did, there really wasn’t much of a choice. \n\nMy ex stepfather began getting more and more abusive until we all finally left, and despite my mother knowing we didn’t have the best ability to take care of them, we took the dogs because they were also being abused by my ex stepfather. Then my grandfather began living with us and eventually one of the dogs became his while the other became my stepbrothers (who came with us when we left her father).\n\nA lot of stuff happened and my stepbrother left and took his dog with him, leaving the other to be my grandfathers completely as we somewhat moved into separate households. Well more stuff happened and my mother ended up having to take the dog back with her, living in a small camper on borrowed property. It hasn’t been ideal for her or the dog.\n\nThe dog has cancer and has occasional seizures and because of that and the unfortunate circumstances, my mother has been wanting to put the dog down for a while. She has some aggression issues after having pups, being shot, and being run over in a short span of time a few years back, so she has been unable to rehome her. Well it’s come down to it and because my grandfather is unable to take her, she is getting put down soon without his knowledge.\n\nI get she is a sick dog who isn’t living in an ideal situation by any means, but I still feel terrible that it’s going this way. I just had to get this out.",
    "subreddit": "TrueOffMyChest",
    "title": "My mother is putting my grandfathers dog down without his knowledge.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6y144/my_mother_is_putting_my_grandfathers_dog_down/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 02:43:48 UTC",
    "id": "1j6xt9p",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 6,
    "score": 1,
    "secure_media": null,
    "selftext": "( i'm going to try keep details to a minimum as i don't want anyone to recognise me from this post, so identifying details like genders, names, ect will be changed. i would also like to note that i do suffer from a form of neurodivergence that can make me incredibly naive at times) \n\nin the few months preceding this kidnapper event, i had a partner who i suffered quite a traumatic miscarriage with. he ended up cutting me off the day i was in the hospital - it was terrifying and incredibly lonely. \n\nat the time, a sibling of mine whom i live with had been having some friends over often, and naturally i started getting to know them and would hang out with their friends too. this was something i did often, as i was struggling heavily with the grief of losing both my pregnancy and essentially being broken up with and left to think about it alone. \n\nAfter hanging out with my siblings friends for a few weeks, Taylor (M32) started giving me gifts. I have quite an interest in sterling silver religious jewellery, and he had given me a few pieces during this time of us hanging out. (a silver chain with a saint pendant, a very dainty 14k gold bracelet, another small silver bracelet). I thought nothing of it, it's quite common amongst us here to exchange gifts often among friends and family so i didn't see it as anything more than that, as i myself have given people fine jewellery randomly before. \n\nOne day, he asked me if i wanted to go to his home to see his pets and just chill and do some art. I agreed, as he had some very unique reptiles which i was curious to see.\n\nAfter getting to his house, it was then that things took a really bad turn. \n\nHe sexually assaulted me on several occasions, I was not allowed to leave the house unless he was supervising me, and it would only be to his garden that i could go. I was also not allowed to wear any clothes in his home, he would take them from me under the guise of washing them and not return them unless he wanted me to go outside with him. He allowed me to return to my own home on two occasions, however he was present the entire time and would not let me out of his sight and would regularly complain about how we needed to leave back to his home. \n\nHe would regularly belittle my appearance, try to convince me that i would have to laser remove all of my tattoos as they looked disgusting, he told me that my earrings were disgusting and masculine and how he couldn't believe anyone would ever have had sex with me because of how gross they were. He would force me to stand on weighing scales when i didn't want to so he could know my weight, and then proclaim to me that 'we'll have to fix that'.\n\nI know that people will probably wonder where were my parents in this situation, and the reality is that they were on vacation. They left the family home for multiple months at a time, and whenever my mother would call me, he would answer the phone on my behalf and tell her how i was happy and i was okay and convinced her that i was his 'girlfriend' even though i was being held against my will and assaulted in his home. \n\nI asked on several occasions to go back home, and he would tell me 'maybe next week...' and next week would just never come. and even then, i had no clothes so i simply couldn't leave. \n\ni managed to escape because i had a large concert planned, and after arguing with him for days, he finally let me leave so i could go to the concert. as soon as i got home i messaged him and told him never to speak to me again or i would be calling the police. \n\nfor a few weeks after this, he harassed me on different platforms. he posted pictures of me he had taken against my will on social media saying for people to 'look at his girlfriend' , he would change his profile pictures to pictures of me or would make profiles in my name. \n\nin the end, i ended up blocking him and changing all of my social handles. \n\nthat brings us to now. \n\nits been about 10 months since this happened. i did not go to the police as i did not want to have to relive what happened to me. he also told me many stories of violence he had committed against women who had called the police on him in the past. \nwe also had no text conversations at all prior to me being harassed by him &amp; i truly just believe the case would get thrown out. \n\ni have had a reoccurring nightmare about him breaking into my house killing me almost every night for the past few weeks. i confessed this to my sibling who introduced me to him, and was told that he had been trying to contact my sibling. he was claiming to have purchased gifts for them, and sending them photos of the gifts he had bought and how much he had paid, and that this had been happening for weeks and my sibling had been simply ignoring his messages. \n\ni feel sick. why would he do this? why would he want to come back into my life? after the terror he put me through? he told me on several occasions that he, in his own words, felt like he was 'the predator' and that i was 'the prey' and it was 'his natural instinct to hunt me down'. he also told me how he had only been coming to hang out at my house because he had been fantasising about me. \n\ni don't know what to do in this situation. all i know is that i'm scared and i feel like i have no one to tell who can truly understand my story or my fears of him trying to pry his way back into my life and into my home. \n\n",
    "subreddit": "TrueOffMyChest",
    "title": "i (19F at the time) was kidnapped and raped by a siblings friend (32M) and now he's trying to come back into my life.",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6xt9p/i_19f_at_the_time_was_kidnapped_and_raped_by_a/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 02:37:19 UTC",
    "id": "1j6xp1k",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 2,
    "secure_media": null,
    "selftext": "Hi! Before anyone thinks this sounds ungrateful hear me out. I (14f) have always had a good relationship with my granny but she has always favoured my older sister (17f) and my 2 little cousins but the problem arose when my other cousin (15f) got a lamp for her birthday that cost 15 euro (price tag was left on) and 2 weeks later for her brothers birthday he got 100 euro.\n\nI'm turning 15 in a few days and my granny gave the same lamp but with 50 euro this time but my cousin (who got the same lamp as me) won't stfu about favouritism and this Godforsaken lamp like I'm okay with this lamp (found a good use for it) but bro won't stop yapping like that girl is my best friend but I'm just sick of her complaining ",
    "subreddit": "TrueOffMyChest",
    "title": "My granny plays such obvious favourites and atp it just annoys me",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6xp1k/my_granny_plays_such_obvious_favourites_and_atp/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 01:55:28 UTC",
    "id": "1j6wx3n",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 3,
    "secure_media": null,
    "selftext": "\nI'm getting really tired of my thoughts and I don't know what to do. For context, I don't mean to self diagnose, especially since I understand how dangerous that is, and how severe this mental illness can be, but I feel that I might have OCD and I'm scared. \n\nI feel like sometimes my thoughts get so bad that I can't tell of it's me or something else. I always feel guilty everytime these thoughts pop up, so I try to either pray my thoughts away or hit myself to alleviate those thoughts. Sometimes I feel so guilty that I want to do more than just hit myself. There was even sometimes in my college classes where I had to walk out of the classroom, because I couldn't even trust myself to hold a pencil without hurting myself.\n\nI feel like it's getting worse, I can't sleep, I'm starting to see things, and I'm starting to feel more aggressive. I'm scared and I don't know what to do.\n\nGood news for me, I'm finally going to see a therapist or something like that, but it's later next week.",
    "subreddit": "TrueOffMyChest",
    "title": "I'm tired and I think I need help",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6wx3n/im_tired_and_i_think_i_need_help/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 01:52:14 UTC",
    "id": "1j6wuwq",
    "link_flair_text": null,
    "media": null,
    "num_comments": 9,
    "score": 0,
    "secure_media": null,
    "selftext": "Two weeks ago I had sex with a girl and I’m really ashamed about it, and I haven’t told my friends about it. I tell my best friends every dumb decision I do but this time I’m really afraid of what I’ve done. Please help me",
    "subreddit": "TrueOffMyChest",
    "title": "I did something’s I regret",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6wuwq/i_did_somethings_i_regret/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 01:41:28 UTC",
    "id": "1j6wnuu",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "Teen Nightmare\n\nThis happened many years ago I don't want anyone to get in trouble or press charges I just need to finally be able to speak about what happened.  I was 17 at the time and I volunteered as a Sheriff explorer during this time I met a deputy who in the beginning was really nice to me. I had just graduated high-school but my 18th birthday wasnt until a few months later. I was scheduled to go on a ride along we were required to go on patrol at least once every three months or so and he volunteered to take me on this day. This first time went fine I was super shy but he got me to open up, he talked about himself and asked me about what my plans were after graduating. It wasn't until the second time I went on patrol with him around a month later that things took a turn, I knew he had a girlfriend she was only two years older me, but this time around he started talking about how things were rocky between them. I didn't think much of it I thought he was just venting and no harm done. However  he was being super touchy and was flirting and at that time I was too shy to say anything. He ended up kissing me out of nowhere and he just smiled and said he needed to know if I was attracted to him. I'm not going to lie I was, he was good looking but I asked him about his girlfriend he said she wouldn't care. He offered to take me home after the shift and he did but not before he ended up taking me to an abandoned field and said he just wanted to talk. We ended up making out in his car and i told him i didnt want to have sex that it was as far as i would go he said it was fine but kept pushing and pressuring for more. He said if i really had feelings for him i would be willing to go all the way. He took me home after about an hour and explicitedly told me that if i was asked by any other deputy to just say were friends. I liked how special he made me feel and the red flags were there but i honestly  thought he wouldnt force me to have sex with him since  at that point he did stop when i told  him to even if he continued to ask. From this point on whenever I would patrol with him things would go further. Until finally one day after my 18th birthday he said he would take me home but instead he  hopped on the freeway towards his apartment. I was scared but at that point I felt speaking up would get me abandoned somewhere unfamiliar or worse. We made it to his place and he gave me a beer and led me to his bedroom. I felt like I couldn't say no he told me to relax that I would like it that it was just my nerves. We ended having sex but I finally was able to tell him he needed to stop that he was hurting me but all he would say was just let me finish its OK you'll like it in a minute. No amount of pleading worked until he finally rolled off me. By then I was shaking and oddly felt numb about the whole thing. He took me home and again told me to say we were just friends. He would lose his job if anyone found out making me feel guilty. I ended up quitting the program a few months later and foud out he was being investigated for misconduct on a whole different issue. I regret keeping quiet but at the time I was confused and developed feelings for him. Other deputies became suspicious since they noticed he would go out of his way to talk to me but no one ever asked me personally if anything happened. I know this is long and confusing but it feels good to finally speak about it I've held this in for 16 years. I had posted and then deleted I freaked out a bit that it was shared but if it helps anyone else in a similar situation so they speak up then it is what it is. Also for clarity he was nine years older than me.",
    "subreddit": "TrueOffMyChest",
    "title": "Teen Nightmare",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6wnuu/teen_nightmare/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 01:33:45 UTC",
    "id": "1j6wish",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 5,
    "score": 32,
    "secure_media": null,
    "selftext": "Very long and emotional story short (or as short as I can get it):\n\n&gt;**0-13** \\- I grew up a daddy's girl. I love my father with my whole heart and cherish his presence. I am inherently anxious and suffer from undiagnosed AUDHD, anxiety disorder and depression, but it doesn't affect me as much because my family is loving and kind.\n\n&gt;\n\n&gt;**13** \\- My mother and I caught my father cheating on her. He told us he stopped and that he was sorry.\n\n&gt;\n\n&gt;**13-15** \\- I didn't talk to my father directly, as I felt betrayed and hurt. This was made worse when my mother kept trying to stand up for him. (I later learnt she was trying to stop the mistress from contacting my father so that she and him could work on their relationship)\n\n&gt;**14** \\- My mother is diagnosed with cancer, but they cant tell what kind or how far along it is.  My father grows even more distant from us, and the arguments increase.\n\n&gt;**15-16** \\- My mother is hospitalized and my father starts talking to this woman on his phone. I start to feel more anxious. My mother advocates for my father, but it just makes me more mad and hurt. They argue more now, and I find myself becoming emotionally distant from my father.\n\n&gt;**Late 16** \\- My mother dies and I shut down, as well as shut myself off from my family, friends and peers. I am angry at my father as he does not seem as affected and was also the cause of my mother's stress before she died. My older brother tries to soothe me and we traumabond. My father tries to relate to me, as his mother died a few months before mine, but he doesn't understand that it isn't the same.\n\n&gt;My father 'dates', moves in and then marries a woman I have never met in less than 8 months. His friends, my trusted adults, all support him, as well as his family and peers. I am hurt, but I pass it off as him just grieving differently. I was sure it was a phase and that they would break up/divorce soon enough. I later find out, its the same woman he cheated on my mother with, lied to us about, and then continued to talk to while my mother was battling cancer. I confront him about this and he says that he thought I knew who she was (despite us never being formally introduced to her. To this day, I know next to nothing about her. Only her first name, where her mother lives, and the name of one of her children.)\n\n&gt;Father's wife is emotionally and verbally abusive towards me and my brother, but I, being the younger and more emotional one, take it harder.\n\n&gt;She tells me that I'm *killing my father* by arguing with him, and that *he will end up dead, just like my mother*. I yell back at her to defend my father, as I take it very seriously when someone wishes death upon another (even indirectly), but my father takes her side and berates me for defending him.\n\n&gt;He does a myriad of other things; threatening to sell off my cats, locking them outside and causing one to die from the cold as punishment for me not agreeing with him, as well as pretending not to hear when his wife flat out threatens to kill me. He was right next to her when she said it, mind you.\n\n&gt;Under the advice of my older cousin from my moms side, I report the wife to the CPS but he denies hearing her threaten me to the social workers, which makes me look like an emotional teenage girl. We get placed into family therapy, but the therapist is borderline sexist and just wants us to be a family unit, regardless of the woman's blatant disregard for my safety.\n\n&gt;I ask my father why he's choosing his wife's needs over the safety of his biological children, whom he claims to adore, and he simply says that ***\"the Bible says wife before children\".*** I'd argue that doesn't apply to 'wife that you cheated on your children's mother with and who threatens you children', but okay, dad.\n\n&gt;I sleep with a knife under my pillow, just in case she tries to harm me. My anxiety and depression levels are through the roof.\n\n&gt;**17 - 19** \\- I cant remember much from these years, but it mostly involves me trying to bond with my father, as he's the last living parent I have. I go through 3 relationships, and have no one to talk to or seek comfort from when it goes downhill. My father thinks we're getting better because of him, and not because of the gigantic effort and emotional stuffing-down I'm doing as even being near his wife makes me anxious to the point of insomnia.  \nAs angry as I was before, I still love my father and want him in my life. I tell him that he can pick any other wife, just not her, and I would be genuinely happy with that. He doesn't care, and only treats me well when she's not there (away on vacation or at her mother's house). When she is around, though, he is more distant, and visibly more tense.\n\n&gt;**20** \\- My father announced that he wants to split our house physically (half of it is to go to me and my brother, as it was built when my mother was alive and she paid for and designed it). I tell him that I don't want him to do it, as it will just drive us further apart, but his reasoning revolves around his wife and her comfort. My brother and I have long assumed that his wife is just with him to benefit from his money, she doesn't treat him nicely, but he doesn't seem to notice.\n\nI know its childish and naïve, but I didn't want him to distance himself from me, even though he has hurt me so much for so long. I still cry (I've actually just stopped crying as I'm typing this) whenever I think about how far we've already drifted apart.\n\nOur relationship went from one of trust, smiles, secret fast-food lunch breaks and long hugs... to me not even being able to tell him about the girl that broke my heart, and how I would love to have one genuine dad-hug from him so that he can tell me its alright. I would love to have him at my wedding one day, but I don't know if that will ever happen.\n\nI don't want to grow up, not in a world where he dies alone and regretful, but it seems that that's the only way for me to not end up living my entire life clinging to his leg, begging him to look back and maybe love me the way he used to.\n\nSo ***I'm done***. I'm done wanting his love and I'm done waiting on him to realise he was wrong, and that I still needed him.\n\n*I'm* going to be *something*, and *I'm* going to *love someone* and *let them love me in return*.\n\n***I deserve better.***\n\n***TLDR:*** My father has hurt me with his actions and his words for too long. I'm going to learn how to live without him, no matter how much it will hurt to let him go.",
    "subreddit": "TrueOffMyChest",
    "title": "I'm done holding on to the scraps of relationship my father and I have left",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6wish/im_done_holding_on_to_the_scraps_of_relationship/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 01:22:15 UTC",
    "id": "1j6wb2h",
    "link_flair_text": null,
    "media": null,
    "num_comments": 35,
    "score": 541,
    "secure_media": null,
    "selftext": "Back when covid started, I had to use the food bank multiple times a month. Unfortionatly a lot of food I recieved were desserts and sugary stuff. Not wanting to be wasteful, I ate what I was given, not just to not be wasteful. But also cause i literally don't have any other food.And as such I gained over 100lbs.\n\nBut I've had to go to the food bank the last few months. I got a lot of fresh vegies and good selection of meat. But one of those meat rations I got was a bag of unseasoned pulled pork.\n\nI put it into the pot frozen and as I warmed up, I noticed that it was mostly fatty pieces with very gritty meat crumbs. I made the decision to throw it out because \"not wanting to waste\" is what got me so overweight. But I still feel guilty having to wast food I was given. ",
    "subreddit": "TrueOffMyChest",
    "title": "I feel really guilty, but I just had to throw away food i got from a foodbank.",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6wb2h/i_feel_really_guilty_but_i_just_had_to_throw_away/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 08:32:48 UTC",
    "id": "1j6cvlf",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "Sorry in advance for this being DENSE with context and a little bit nonsequential at the end but its necessary to me understand the gravity of this, I think.  \n  \nMy mother was raped by my grandfather when she was 26. He was 60, but strong. My brother and I were 5 and 8 at the time and we were in the house when it happened. I vaguely remember the screaming and having to be temporarily resituated at a friend's house until my mom found out where to go. Two of my uncles showed up, one kept grandpa restrained while the other spoke to the police. I think one of them threatened to kill him or something but regardless he never saw the inside of a cell for it. I still don't know why (more on that later). He has ZERO criminal record except for vehicular manslaughter (the young woman's underwear was found in a nearby field and she knew our family), for which he spent some time in a mental hospital. My mother told me he was observed to have had antisocial personality disorder but I'm not sure how she would know that because he would never tell her something like that. This is a man that says shit like \"I've never been depressed in my life, I don't even know what that is.\" Anyway, we moved somewhere so he couldn't find us. Problem there is Grandpa had a stalking habit so he found us after few months. You have to understand my brother and I were in no position to understand what happened, or at least that is reasonable enough of an assumption that mom didn't tell us what happened. All I knew was Grandpa wasn't around anymore and that I missed him (despite abuse of my brother and I up to this point, which I will get to). \n\nOnce he found us he would spoil my brother and I to gain favor and make it harder for my mom to keep him out of our lives, a pattern that would persist indefinitely. My mom saved up money during Move1, and we relocated to an \"aunt's\" house. She was a close friend of my mother's that was stalked by my grandfather prior to all of this. The \"aunt\" was also a pedophile. I was too young to understand that the teenagers she was messing around with were not adults. My mom was too traumatized to worry about anything other than feeding us, loving us, and killing the pain on her downtime with pills and partying. She balanced it well and her recreational activities never interfered with us beyond waking us up in the middle of the night for a taco bell run so we wouldn't be left alone in the house. Somewhere in there he found us again, because of the stalking bit.\n\nDuring this time he sank his claws deeper into my big brother and I. Christmases and birthdays were always huge to us both because, even though we were poor, we were spoiled senseless by grandpa *AND* by my mother's dogged determination to outshine his efforts. She had to spend every one of those Christmases and birthdays watching us thank and hug him in front of her, telling him we loved him.   \n  \nAfter a few years of living in that creepy shithole, my mom made enough to move again. She even wrangled us a stepdad for security. SPOILER he loved crack and bullying us. However he was young (27) and deeply troubled himself. He actually kind of kept grandpa at bay for a minute but we still LOVED grandpa so much. Our fathers never met us, between my brother and I, so there was a sort of role that needed fulfilling, which was another reason she was scared to tell us what happened. During this time my grandfather was abusing me by interrogating me about whether or not I was gay and forcing me in front of the mirror to pop my acne until I bled and the acne became infected. My pockmarks are much worse than they need to be and he reinforced a lifelong belief in my hideousness and I was made to go to therapy at the age of 10 to address my latent homosexual tendencies. What prompted his obsession, I do not know. I think he was scarred from when I wanted to be a girl for Halloween 3 years in a row from ages 3 to 6\n\nA few years after Move3 came Move4, but it at this point my mom considered losing contact with him to be futile. She would move further and further each time and he would constantly show up unannounced. At this point I'm in middle school, brother in high school. During this time my 15 year old brother kicked my stepfather out, so my grandfather was around much more often so he could pressure me intensely to be confirmed Catholic (our family is heavily Irish Catholic) This would eventually cause me to have a psychotic break later at 15 where I had religious delusions for a whole year.\n\nAround the time I finished high school my mom met my now stepmother and we moved 100 miles away. Which was perfect considering grandpa would have an accident that made it harder for him to want to drive on the highway ever again. The last time he saw my mother's face was at her wedding 15 years ago. I would say his presence tarnished it, but it was full of drag queens and LGBTQ+ folks so I like to think it was a difficult day for him (the man is a vicious bigot).\n\nThis is around when mom tells me about how he raped her when she was 26.  I'm 19 at this point and I have been conditioned to worship my grandfather. He was my father for all intents and purposes, more than any other man in my life. I was resistant and resentful. I was stupid. I buried what my mother told me and it created a rift between us that is since mended but it is one of my deepest regrets.\n\nMy *absolute deepest regret* is moving in with him. Move5 left me in a rural town with only a grocery store to work down the street and I had no car or license. TIP FOR YOUR KIDS: Do not let them get away with thinking they are better than working their way out of a situation, or that they won't be grateful to themselves for it. Anyway, I wanted to go to college and grandpa lived in Baltimore. He offered to let me stay and I told my mother I loved her but I couldn't get stuck in that town (I wasn't stuck, I was undisciplined and ignorant). I will never forget my mother's crying face as I left in *his* car. So I guess *that* is the last time he saw her. \n\nFrom 2012 onward I was living in Baltimore, going to school, working, partying and going on trips with friends. I was having a merry fucking time, and rent free to boot (undisciplined). Somewhere in the first 2 years I did mushrooms and I gained a bone-deep certainty of how awfully I had betrayed my mother. I called her and apologized for everything, begged for her forgiveness. I didn't have to, because she understood. Then she told me EVERYTHING EVERYTHING. Not just about her rape, but the vicious abuse of her 6 other siblings, the rape and physical assault of my grandmother, and the manslaughter. \n\n**Out of her 7 siblings, 2 brothers defended her (after the rape) initially. One said that grandpa was dead to him but reconnected only 3 years later. The other just plain acted like it didn't happen even though he was the one keeping grandpa at bay while we left the house. When my mom told her sisters, 2 were silent, one acknowledged that my mother was traumatized, and the one I hate the most said \"He must have been so lonely.\" The remaining 2 brothers kissed his feet like they always have without skipping a beat. They still do.**\n\n**My grandfather viciously beat every single one of his children. He beat and raped my grandmother, and put a gun to her head with his foot on her neck. An uncle tried to defend my grandmother with a bat, grandpa caught it mid-swing, and completely blackened my uncle's torso. He coerced a neighbor's wife to crawl across the floor to him to ask for a kiss in front of the neighborhood and *his own wife and children* at a party. He hit me and my brother for as long as he and I were too young to defend ourselves, at least until we acted like he wanted. He beat me for bleeding on the floor when I cut myself by mistake at age 3.  I was hit and screamed at if I cried. At age 5 I watched him choke my then 8 brother, like it was Bart and Homer, for correcting his math. He stalked my mother's friends and called them in the middle of the night to say disgusting shit. He then raped my mother for god knows fucking what when I was 5. I have no idea what else he's done to my aunts and uncles.**  \n  \nI'm suspicious that he did something to me too because I was absurdly sexually obsessive when I was 4 and 5. By obsessive I mean I cornered a girl when I was in kindergarten and tried to rip off her clothes while screaming \"You're mine\". Where did those instincts come from? How often do 5 year olds do that?  \n  \nSo I was drinking pretty heavily after what my mom told me, enough to keep me from being able to move out from my mom's rapist's house, and then I met my current partner in 2018. Like everyone I was with up til that point, I begged her not to be friendly with him and I told her why. She has some sort of hyperaltruistic reflex, plus her grandfather treats her like shit so she just made my grandpa her grandpa. After I begged her not to get close to him. He then exposed himself to her multiple times and whispered \"something disgusting\" into her ear that to this day she will not repeat. I know it wasn't age because when I confronted him on this, he never did it again. Between 2018 and 2023 I was basically killing myself with booze about this and a lot of things. 5 hospitalizations in 2023. \n\nMy mom confronted the one that said \"he must be so lonely\" and she said none of those things happened. My grandmother can corroborate however and has. \n\nI'm posting this, one, because apart from my partner, I have no one to talk to about it. I'm not looking for moral validation, I know how badly I hurt my mother and what it says about me. Grandpa is 91 now and I think it's fair to say most of who he was is gone. I don't forgive, I see it as irrelevant to who is now.  He's a scared husk that's been glued to a chair since 2008.  I tried so hard to be a changed person in sobriety got into the habit of hugging him and telling him I love him, but by the time I realized it makes me feel slimy, I couldn't afford to stop. My mom knows this and she is, according to her, at greater peace with everything than me.\n\nMy present disquiet comes from the constant thoughts like \"WHAT KIND OF BROTHERS AND SISTERS DON'T DO EVERYTHING IN THEIR POWER TO PROTECT THEIR SISTER? There were 7 of them and they left us for the wolf. There were 7 of them that never EVER let grandpop babysit their kids. WHY HUH? WHY CAN HE COME AROUND US AND NOT YOURS? Why are we the \"black sheep\"? Why did no one believe my mother after what they've been through?* I have an uncle that still tells me he has always loved me, he's my godfather and the sensible one and he has the fucking BALLS to ask me why mom doesn't talk to him anymore. \n\nLast year every single one of my mother's siblings gathered to celebrate his 90th birthday. *Two of my mother's sisters are sitting on his lap in a photo they took together.* The one that said \"he must have been so lonely\" is so pleased with herself in the photo. Recently she told me I was the favorite grandchild of his 9,000 grandchildren, and she looked like she's hated me for it for a while. I wasn't the *favorite*, I was a pressure point for a predator to make sure my mother could never get away.\n\nNone of these people have any idea that I know. Neither does grandpa. Neither do their children. They just think I'm a lazy alcoholic (part true). Been thinking about writing a book. But also I just needed this. If anyone can relate or just have some insight as to how in the fuck 7 siblings side with the incestuous predator and abuser. What's worse is how I've found this to be far less unique than I thought. I know more people than I would like that have relevant experience with men growing families as punching bags and sex objects. Every kid I see makes me worry for them, and I have a hard time seeing a father with their children and not have an immediate fear for the kids.\n\nTLDR; Seriously? Just kidding. Grandpa raped my mom and stalked her, my brother and I through life and I eventually ended up marooning myself in the same basement where he did all of the worst things you can do to a person while his children treat my mom with denial and even resentment.\n\nP.S.  \nMy mother is the strongest and happiest she's ever been and I love her and my stepmother so much. She has chronic illness and PTSD but she is creating all the time and excelling at her work. I've never been more proud of her. My brother is the same as he's always been, stoic and quiet about all of it in a way that scares me.\n\nP.P.S.  \nMy aunts and uncles have been snooping while I'm at work and leaving obvious signs they were in my fucking bedroom. Where I fucking sleep. If you are reading this, good. You should be fucking ashamed of yourself. You were all in your fucking thirties and were successful when you shielded her attacker. You had the resources to help your sister and put the man away. You chose her rapist over her. You're not the Christians you say you are, you're not good people, you're psychotic lowlifes whose kids don't really know them (some of them know, just not exactly *how* spineless and mindless *yet*). No wonder your daughter calls you by your first name like that. To the other, no wonder your daughter doesn't call you at all. For all of you, it is not close enough to karma that you have to literally wipe that man's ass now. You seemed like you would've jumped at the opportunity to *swallow* his shit at the rate you guys sided with him. Still thinking about that book.\n\nEDIT: For various grammatical/spelling errors and weird slashes. (I know still can't comma)",
    "subreddit": "TrueOffMyChest",
    "title": "I've been living with my abuser and my mother's rapist since 2012 and her 7 siblings protected him",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6cvlf/ive_been_living_with_my_abuser_and_my_mothers/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 01:10:16 UTC",
    "id": "1j6w2w8",
    "link_flair_text": null,
    "media": null,
    "num_comments": 20,
    "score": 158,
    "secure_media": null,
    "selftext": "He doesn't speak English very well, so communicating with him is a little challenging, but he's very sweet. For example, before we even started really interacting, he brought me napkins when I spilled something. Since then, we always say hello, how are you, etc. But I've always gotten the impression that he's self-conscious about... a lot of things. His scent is not ideal and, as I mentioned above, his English isn't great, and not everybody in the world is understanding about those things. \n\nToday, he seemed to feel more comfortable with me than ever before. He came over, said hello, and *sat down near me for the first time*. I tried to use Google Translate to communicate, but he needs glasses and couldn't read the text, so we just tried our best.\n\nIt was the most complex discussion we've had so far. We discussed politics! This is what he has to say on the current situation (I'm trying my best to remember precisely what he said):\n\n\"Politics... bad, bad things. Politics hurt people. Mexicans, woman, good people. Social Security? Medicaid?\" (I assume he was expressing worry about the continued existence of both programs.) \n\nI just wish I could speak Persian so we could understand each other better. It's clear that his life in America hasn't gone the way he must have hoped it would when he came here, and I'm extra worried about him now. \n\nAnyway, when he needed to leave, I gave him a big hug. I hope our interactions make him happy.",
    "subreddit": "TrueOffMyChest",
    "title": "I've formed a little bond with an elderly homeless man who frequents my favorite cafe",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6w2w8/ive_formed_a_little_bond_with_an_elderly_homeless/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 01:04:52 UTC",
    "id": "1j6vz7c",
    "link_flair_text": null,
    "media": null,
    "num_comments": 29,
    "score": 0,
    "secure_media": null,
    "selftext": "PERIOD BLOOD CONFESSIONS\n\nSo, I use a menstrual cup. I know I should be dumping the blood into the toilet and then rinsing the cup in the sink, but for some reason, my brain keeps going, Nah, let’s just pour it all straight down the sink.\n\nFast forward to me working on a group project at this guy’s house. I go to the bathroom, do my thing, and—shocker—the blood doesn’t just magically disappear down the drain. I’m guessing there were clots involved because suddenly, I’ve got a plumbing situation on my hands.\n\nCue me, hunched over his sink, desperately trying to shove my own blood down the drain like some kind of horror movie janitor. I must’ve been taking a while because I hear him call out, \"Everything okay?\" And I, covered in the sins of my uterus, just yell back, \"I’m fine! Thanks!\" while speedrunning my career as an emergency plumber.\n\nAfter what felt like an eternity, I finally got everything to go down, walked out, and casually told him, \"Sorry, I clogged your sink and had to fix it.\" He kind of laughs and goes, \"No worries, I'm just glad it was the sink and not the toilet!\"\n\nMeanwhile, I’m standing there, smiling, knowing full well that this man has no clue his sink was just fighting for its life against my period blood.",
    "subreddit": "TrueOffMyChest",
    "title": "Clogged this guy's toilet with my period blood 🩸",
    "upvote_ratio": 0.48,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6vz7c/clogged_this_guys_toilet_with_my_period_blood/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 01:00:02 UTC",
    "id": "1j6vvos",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "I have to get something off my chest, it's been bothering me for a while.\n\nDepartment of Children's Services (Australia) are the most incompetent, useless, stupid government agency I've ever had the displeasure of working with, whom I'm sure hire only the worst and dimmest of candidates and have fostered a culture of ineptitude and apathy throughout the system. \n\nI have nothing but complete and utter contempt for the department and their so called social workers, as I can say truthfully and without hyperbole or exaggeration that I have not seen them make a good call on a child or family situation in the 30 years I've been cursed with their association.\n\nI am a psych and behavioural analyst and run a disability and aged care support company in remote Queensland. I am involved with the department because I provide therapeutic placement for children with disabilities. My company, as best as I can tell, is one of the very few with capacity for kids with serious behaviours of concern, certainly the only one that I am aware of in my or any surrounding regions, judging by how far some kids come to be placed with us.\n\nThe ignorance on display from DoCs staff is breathtaking. They don't listen. They don't understand disability, which to be fair, I don't really expect them to, not really, but they just are not willing to learn. Somehow the decisions they make seem tailored to be cruel and hurtful to parents for no good reason and they are openly hostile and dismissive to families they have independently decided they don't like.\n\nVague examples for privacy:\n\nSingle mother with 5 month old baby. Has 2 other children in placement. Meetings for one occur in Town A. Meetings for the other occur in Town B. She lives in City C. The meetings are set for 8am for one, and 9am for the other.\nTown A is 90km (56mi) from City C, and Town B is 107km (66mi) from City C. Town B is 193km (119mi) from Town A.\nShe has no car, and relies entirely on public transport to get around. This is utterly impossible.\n\nThere is a department office 7 minutes from her house by bus.\nThey flat put refused to entertain the idea of having meetings at that office, or even just Zoom meetings. She had to attend in person. Every failure was used as evidence of inability to manage her time, and proof she shouldn't have her children.\n\nChild with serious behaviours of concern (violence, property destruction, suicide ideation) who was surrendered by family was placed with us on short notice because previous two placements claimed no capacity. (Probably because of the damages combined between the two of them). No behavioural plan was supplied, despite them having one and being requested for 7 weeks, in the end I had to go behind their backs and track down the practitioner that wrote it myself. DoCs *severely* downplayed the behaviours upon placement, and frankly if we weren't so good at our jobs and able to adjust so fast, serious harm absolutely could have happened due to the lack of accurate information provided. We got lucky those first few weeks.\n\nTheir sole focus is on reunification with the family. Their solution was to force them together every weekend. No support, no plan, just shove a violent individual in a house with a shellshocked family for 2 and a half days, the siblings of which actively (and with good reason) do not want them there, for a couple of days and hope for the best.\nWhen sexual assault claims were made by a sibling, DoCs *ignored it* and tried to push for the next weekend anyway. It took a call to Children's Safety who in turn made a stern call to DoCs for them to decide against that decision for a weekend.\n\nI sat with the case workers and supervisors and went through the complex disabilities and mental health issue for this individual and explained what realistically needed to happen for reunification. What to expect. A recommendation for steps to take moving forward. I thought it went well. A follow up meeting with the school a mere 2 hours later and the case worker said that a fidget spinner should keep them occupied for 4 hours and thus solve the school attendance issues.\nMoronic. No attention paid whatsoever. \n\nThey openly blame the parents, their lack of parenting for the issues. Stay at home dad, mum has a pretty unusual job that has her travel often but pays very well. They mock her in meetings, talking about how she's \"living her best life\" on \"holidays\" when she's away for a week, working.\n\nI am so frustrated. They are now looking at foster care options. Removal from a therapeutic placement where they have made real progress, (for example, nearly $100k in damages, zero school attendance between 2 placement over 3 months, compared to us where we have had maybe $500 in damages and school attendance every day at first with support and now independently between an hour and 4 hours and we have had them for 6 months) to be put with some unsuspecting and unqualified family for $700 a week. Absolute madness.\n\nI just want to scream into the void. The family is actively working with us, the school is actively working with us, but DoCs... DoCs don't give a shit. And they hold the cards. They claim they care, but when it comes to complex disability they actively ignore vital information and forge ahead like it was a typical kid, damn everyone else.\n\nSorry, I got a bit ranty. They just piss me off so much.",
    "subreddit": "TrueOffMyChest",
    "title": "I hate Children's Sevices",
    "upvote_ratio": 0.76,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6vvos/i_hate_childrens_sevices/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 00:54:53 UTC",
    "id": "1j6vs1y",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 1,
    "secure_media": null,
    "selftext": "basically what the title says. I've slowly lost sensitivity since we got married 4 years ago. I thought at first it was due to my depression, so I got therapy. Then, after overcoming depression, I was still experiencing very low/nonexistent libido, no sensitivity, nothing. It didn't matter if I was on my antidepressants or not, before, during, and after it was about the same. I used to be able to enjoy sex, and finish, but now I can't even remember the last time I finished at all. (No I'm not interested in masturbation, nor has that ever done anything to me). My husband has gotten mad at me over the years and accused me of being asexual or lesbian, which I don't think is the case because I KNOW I am sexually attracted to men and not women, and I've experienced normal sexual response cycles many times before, especially as a teen. I did save myself for marriage, if that makes any difference. I then thought, well maybe it's not my depression, maybe it's sexual trauma from seeing and hearing my parents doing it a lot after they always told me sex was bad? (religious upbringing) and so I went to a sex therapist, and she said she couldn't help me. I had another therapist after that who I really liked and helped with everything else in my life except my ability to enjoy sex/ have a sex repsonse cycle despite thoroughly discussing that topic and my traumatizing experiences as a child with my parents. I went to my primary care doctor and he basically told me there were no meds except one that costs $1000 a dose and only has a 10% chance of working. He did blood work on my hormone levels and those were all normal. so basically no one can help me and it leads to dissatisfaction on both sides of this relationship, and makes me so sad. I feel like I should just divorce my husband so he can find a functional woman who can have and enjoy sex with him :( ",
    "subreddit": "TrueOffMyChest",
    "title": "I (26f) can't feel sexual pleasure anymore and it's killing my relationship",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6vs1y/i_26f_cant_feel_sexual_pleasure_anymore_and_its/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 00:43:47 UTC",
    "id": "1j6vk3t",
    "link_flair_text": null,
    "media": null,
    "num_comments": 12,
    "score": 5,
    "secure_media": null,
    "selftext": "Like I do but like... Where do you go? What do you do? I'm extremely socially isolated and I really just don't know if that's ever gonna change. I don't know how to talk to people at all and it sounds simple but I dont even know how to be safe in public. I'm not expecting anything out of this I just want someone other than me or my parents to know I guess.",
    "subreddit": "TrueOffMyChest",
    "title": "I don't know how to leave the house",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6vk3t/i_dont_know_how_to_leave_the_house/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 00:39:59 UTC",
    "id": "1j6vhb2",
    "link_flair_text": null,
    "media": null,
    "num_comments": 10,
    "score": 3,
    "secure_media": null,
    "selftext": "I’m embarrassed to tell my loved ones about this guy bc I actually like him. Idk why. I’ve dated so many guys I didn’t really like and I pretended to like them and then I’d break up with them and everyone would be like what happened? And now that I just spent 6 hours with someone and I already want to see him again I don’t know how to tell anyone. I’m afraid I’ll jinx it or that they won’t believe me or that I won’t believe myself. I can’t even listen to music bc I feel like if I listen to a romantic song I’ll jinx it or talk myself out of it ",
    "subreddit": "TrueOffMyChest",
    "title": "I finally met someone I like and I don’t want to tell anyone",
    "upvote_ratio": 0.81,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6vhb2/i_finally_met_someone_i_like_and_i_dont_want_to/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 00:13:04 UTC",
    "id": "1j6uyfb",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "OK, so a bit of background. In college, I took a video journalism class as part of my major. As part of this, I got a tripod and a mobile phone mount for said tripod.\n\nFast-forward 4 years. I've graduated (December of 2022 to be exact) and am working full-time. I occasionally put my phone in the mount and set it on my bedside table to watch things in bed. this past week, the tripod mount broke. No problem, it's like $12. \n\nI ordered another one off Amazon. It was supposed to arrive yesterday. As you can probably guess from this post's title and the fact I'm even posting at all, it did not. It was delayed to Monday. I had it shipped to the rental office for my housing complex, which isn't open on weekends.\n\nNow, here's the thing, my friends: This alone wouldn't upset me enough to post this. It sucks, don't get me wrong, but these things do happen. However, Amazon showed that the package *was* out for delivery and the truck *was* in my neighborhood.\n\nJust needed to vent.",
    "subreddit": "TrueOffMyChest",
    "title": "The delivery for my mobile phone tripod mount got delayed.",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6uyfb/the_delivery_for_my_mobile_phone_tripod_mount_got/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 23:54:18 UTC",
    "id": "1j6ukus",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I don't even have any words to describe what's happening right now. I need advice ASAP.\n\nSo my friend (19F) is literally going in circles with same toxic people and she clearly doesn't see it! We have a friend group of five since high-school and she's always been the one who has the most other friends outside of the friend group, but we never minded. She has friends from other city and an on and off boyfriend (24M) who's literally the worst human I've ever seen. He's manipulative, controlling, alcoholic with anger issues and he controls who she is friends with, where is she, if she's drinking, etc. He constantly brings up her past before they met and holds it against her. When his friend started hitting on her he blamed HER!! They broke up two weeks ago and we literally celebrated because it felt final. She sent us a 13 minute recording, when they officially ended it, of him just cussing her out, screaming and calling her a slut who doesn't deserve love from anyone, even her parents. He also threatened to kill her dog. Her parents hated him (obviously) so he always talked bad about them.\n\nShe stopped texting us this week but we thought that she was just busy. But turns out she's BACK WITH HIM AGAIN AND THEY MOVED IN TOGETHER! What the hell!! I don't even know what to think. \n\nShe also forgave her ex (now current) best friend after she bad mouthed her and used her so she would buy her and their friends alcohol. Btw she's dating her boyfriends brother who's another jerk. It literally runs in their blood.\n\nI'm serious considering just going low contact with her because she clearly doesn't value our opinions on those horrible people and will ALWAYS choose them over us. I feel like crying from frustration every time I think about it. We have literally tried EVERYTHING to open her eyes. The worst part is that all of us others are at uni somewhere else and she's the only one who's living in our hometown so we can only call her (but she doesn't pick up often). And I'm so concerned and scared that she'll end up dead in the ditch. \n\nPlease I need advice. I'm at my wits end.",
    "subreddit": "TrueOffMyChest",
    "title": "I don't know how else to help by friend out of toxic environment, please give me advice.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6ukus/i_dont_know_how_else_to_help_by_friend_out_of/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 23:44:29 UTC",
    "id": "1j6udrx",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 3,
    "secure_media": null,
    "selftext": "I’ve been blocked since Thursday and I was finally getting some movement after taking laxatives. I took a half dump and flushed immediately afterwards TO AVOID GETTING THE TOILET CLOGGED. The toilet clogged and it’s been an hour and the plunger isn’t doing shit. I already broke one plunger too. The water is going down kind of but slowly. I’m trying dish soap, Warm water, baking soda. Idk what to do.",
    "subreddit": "TrueOffMyChest",
    "title": "Toilet is clogged and I broke a plunger. On my second one.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6udrx/toilet_is_clogged_and_i_broke_a_plunger_on_my/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 23:33:17 UTC",
    "id": "1j6u5dw",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 91,
    "score": 463,
    "secure_media": null,
    "selftext": "this is a throwaway because my family knows my main (also English isn't my 1st language so I apologize if there's any Spelling/grammar mistake)\n\ni genuinely don't know what to do or feel about this.i feel so alone and unsafe rn, im literally crying as I'm writing this. \n\nLast week, I woke up to my brother touching me inappropriately. We share the same room and bed, I felt his hands on me. I don't know why, but I stayed completely still. I could've stopped him, I could've yelled or pushed him away-but my brain just froze. I just lay there and took it.\n\nAfter about 5-10 minutes, I decided to \"fake waking up\" very slowly so he would stop. And he did.\n\nI felt disgusting. I wanted to tell my mom, but he's her favorite, and I was terrified she wouldn't believe me. So, I kept quiet and hoped it would never happen again.\n\ni decided not to and hopped he'd stop. I feel so gross whenever he would touch me during the day or even when he's in the same room as me. \nI just feel so icky about all of this.\n\nfor the next few days, nothing really happened, and I almost convinced myself it was over. But on the 3 days after that incident I felt it again. I woke up but didn't open my eyes, I felt numb and trapped. i wanted to cry, but I just lay there again, completely still, doing nothing to resist or stop him\n\nanyways,I went to school and was gonna told a friend about it but i got scared that they'll Tell everyone about it so i didn't. i didn't slept at my room that night (i slept at a friends house). i literally couldn't sleep that night, i remember my friend waking up because i was Crying and she asked me if im ok, i said yes and asked if we could watch a movie. i cried myself to sleep that night.\n\nSo nothing really happened after that and Really thought it was over. i was even sleeping in my room. \nI woke up to someone touching me again Today. So, 40 something minutes ago, i woke up to him touching me again. And just like before, I did nothing.\n\nI wanted to move, to scream, to do something. But my body wouldn’t listen. It was like my brain had shut down, leaving me frozen in place. so I just lay there, pretending to sleep, trying not to make a sound. and he eventually stopped.\n\nWhen he finally rolled over and pretended to sleep, I slowly turned away, pulling my blanket tighter around me. I wanted to cry, but the tears wouldn’t come. I just stared at the wall and stayed there for about 20mins and got up to write this. I don’t know what to do anymore. I don’t know how to make it stop.\nI just wish I could disappear. \n\nPLEASE give me advice on what to do. im literally crying rn because i couldn't defend myself. I just feel so icky about this\n\n\n\n\n\n**EDIT:**\nThank you so so much for the amount of advice you guys gave me and for reassuring me that freezing is a completely normal reaction to these kind of situations.\n\nim planning on asking my mom if i could maybe sleep in her room because im not \"comfortable w sleeping in the same room as my brother\" but im currently staying at my friends house to maybe just clear my thoughts about this whole situation.\n\nMany people are saying to \"Set up a camera and record the whole situation\" But im not gonna do that because i don't wanna experience that situation again.\n\nAlso just to clarify; no, i am not indian. i'm japanese. We live in a 2 bedroom apartment that's why me and my brother share the same room. My dad isn't with us anymore so it's just me, my mom and my little brother. the reason im scared to bring it up to her is because she always takes my little brother side and we just recently loss our father. i don't want to cause her even more pain by telling her my brother has been Groping me.\n\nI'll update you guys asap when i do finally bring it up to my mom. \nonce again, ty for the people who dm'd me and gave me advice on what to do. i really needed that ❤️",
    "subreddit": "TrueOffMyChest",
    "title": "I (15F) Woke up to my brother (13M) Touching me",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6u5dw/i_15f_woke_up_to_my_brother_13m_touching_me/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 23:21:26 UTC",
    "id": "1j6tw9e",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "hello! i hope im not going against any rules by posting this.   \ni intially wanted to post this to try and figure out how to turn this personal letter into an artistic creative thing that i can put out into the world, but for now, its just a letter that is true off my chest.\n\nthis is a letter i have sent a friend/lover that is very important to me. we have a weird, secretive relationship dynamic, somewhat of a situationship but much more communicative and relationshipy. its weird. the letter talks about it a little bit. the thing is, after he read it, he told me that the letter was personal, authentic, and very beautiful, that i should think about maybe doing something with it in the future-(creatively, he meant, we are both creative people, studied creative writing together, that’s how we met)  \n  \nanyways here’s the letter, keep in mind it is translated as it is originally in a different language:)\n\n”Hi \n\nthis letter contains things that are important to me that you know.\n\nEvery time I initiate a hang out with you to talk about things, I end up not saying everything I want to say, maybe because I forget, or feel better at that moment when I'm with you, and don't want to create a worse mood for either you or me again, /don't want to be a burden, so I end up not saying anything and end up regretting and getting upset when things don't work out between us.\n\nSo I want to take a moment here and write to you everything I can remember that I usually think and feel about us, and hope that with all the recoil you probably get from this letter, you can also take a moment of your time and read without too much pressure of responding quickly.\n\nI want to start by saying that you are a person who is very, very important to me. I have said it many times and I have no problem saying it again, simply because it is true: you are the first person that I have ever felt true, pure love. a feeling that I thought people invent in movies, that made me think it was not something that was even possible to feel. You made me feel it. It is real.\n\nYou know how sentimental and emotional I am, it is very easy for me to look at a picture of us from a month ago and feel nostalgic because I miss a specific day that I had a really nice time with you. Like for example on your birthday, when you invited me to sleep over at your place and told me that I was really cute and that you wanted to kiss me in front of everyone. These are things that are hard for me to forget and I hope I never forget because it makes my heart feel good. Sometimes I am completely reluctant to mention things like this or talk about it at all because the fact that I talk about it means that in moments like these have a lot of weight. It makes me very vulnerable and it's scary, I prefer not to mention any good moment we had, not to say I love you, not to say I miss something that happened two days ago, and that way if you don't say something nice back, I won't be offended by it, I won't think it's not mutual, I won't think I'm taking everything too personally and that for you I'm just another person to have fun with every now and then. even though i know if it was just fun it would have ended a long time ago for you. But I choose to say it anyway, because I want you to at least know how much good you can do, even if you don't mean to. I choose to get hurt a little every now and then.\n\nI think you are very talented You write in a way that is very impulsive, for better or worse. In the pieces you wrote, it is very clear that what you write comes from that moment deep inside, and it is not calculated, it is simply what is happening in your heart at that second, and you bring it out. Another talent you have is the way you get to know people. Something that I am very jealous of, but I feel I am lucky to experience it as a friend, and even learn from you. You ask bizarre questions that no one thinks to ask, go into strange depths, and we would sometimes laugh at you at that moment in class because it is really very funny that you ask things that no one thinks are interesting enough, but it is a trait that I appreciate very much. I think that I will move here in this letter between things that you might be flattered by and things that you have a chance of being offended by, It is important for me to point out that it is okay to be offended just as it is okay to be flattered by everything I write, but you should know that everything I write is things that I think and feel. There are no facts here. And there is not even a single intention to hurt.\n\nIf I could, I would write this in a letter and bring it to you physically, but right now we are after a not very pleasant interaction that was on through messages, as there is every now and then between us. And right now I am not in the mood to see you because I feel like I will cry and I will not be able to say anything coherent.\n\nMaybe I am too sensitive and take everything too hard. Maybe you love me but don't like me very much and sometimes try to hurt me. It could be both.\n\nSometimes I feel like you really want to hurt me. That you know exactly what combination of words will hurt me the most, and you choose them specifically. I don't think it's bad intentions. I think it's more of you trying to defend yourself. Maybe I say things that I think come out well, but they hurt you, and then you, who feel attacked, try to attack back, because that way you'll have the power, and you can hurt and leave. Sometimes we encounter a situation of unpleasant messages and at the peak you'll say something like you're gonna stop answering me, or something more cynical-passive aggressive to imply to me that you're not going to answer anymore no matter what I say. Sometimes I'm in a good mood, and after a conversation like that with you i get very sad in a restless way, like i have to talk it out. And when you cut off at the peak of this conversation, I have no way to explain anymore, no way to resolve, no way to do anything. All that's left for me is to sit with myself, with the feelings I have about myself, about how much I may have hurt you with the words I used incorrectly, about how much I want you to understand that I don't think such bad things about you. And to sit with myself, with the feelings I have for you, that with how much I love you, you are the person who most manages to hurt my most sensitive points.\n\nOnce in a conversation of this style, you managed to throw into the air that it would be better if we ended the relationship.\n\nAfter that, when we met and I mentioned it, you said that you said it in the heat of the moment, and that you didn't really mean it.\n\nI think you did mean it, just, at that moment. And then at some point when we managed to talk and get along again, you regretted meaning it. I think that both of these situations are correct, and that they don't necessarily contradict each other.\n\nSometimes I really have thoughts like, 'Wow, maybe I should really end this relationship.'\" Sometimes I feel like the relationship with you is doing me a lot more harm than good. Sometimes I feel like you hate me. Detest me. And maybe you stay in touch with me because it's easier than breaking up. And maybe that's true sometimes, I don't know. But I also don't think it necessarily contradicts other good feelings you might have for me sometimes. In any case, I can understand. There's not a single person in the world that I can say 100% that will never get on my nerves, accidentally hurt me, get tired of them. and I also told you, I think that if I spend enough time with anyone, at some point I'll want to not be around them. On the other hand, you're one of the only people I prioritize spending time with. And the only person I want to be around even if I'm very hurt and we're not at our best terms.\n\nI think something happened the day we started hooking up for the first time. That day I went out with you and a friend for a walk in the city, we went into your old school, the friend stayed outsid. we were left with just you, with the stories and experiences you had there, with all the nostalgia from there, and I was there, and listened to you, and I really enjoyed experiencing something sentimental with you. A big part of your life you spent there, and then I was there with you and somehow managed to be a small part of all of it. of you.\n\nLater that day, after we hooked up, when you walked me to the train, and we were both very nervous because we had arranged to meet the next day, but we were both afraid that suddenly we wouldn't want to meet again when the time came. Because we both had that similar problem. that weird avoidant way of dealing with life. And then the next day came, we still wanted to, and it happened, and it didn't exactly stop for a very long time.\n\nUsually when I want someone, as soon as they show interest in me back, I stop wanting them. It didn't happen with you. You shared your flaws with me and not only did I identify with a lot of them, but it only drew me in more. I really fell in love with a person, and not just an idea. I think that's why it's so easy for me to get hurt by you.\n\nI love you very much. The whole person that you are. I'm very attracted to you. Physically, emotionally, mentally. In just about every way.\n\nWhat you think of me, how you think of me, is very important to me. I really care about you and your opinions. Sometimes you say things about me, that you think I'm not intelligent, or things like that, I say very directly that these are things that hurt me. Insult me. You take it more lightly, and with a laugh, and with a certain detachment towards me and how I feel. I think you might have the feeling that you're above me in all sorts of ways. That you have more power over certain things. That your opinions are more important or true than mine. And that facts are perhaps more important or true than my feelings. Sometimes you are the most sensitive person in the world, looking for a hug, love, intimacy, making me laugh when I'm not feeling well. And sometimes you treat me as if you are a person who doesnt know how to be a friend. That you have no ability to understand or contain my difficulty, my feelings.\n\nI think a lot of it is also my fault. Every time I told you that you were crossing a certain line, that's all it was. I tell you that you're crossing a line, And that's it, there were no consequences beyond that. I say my piece, carry on as usual as always, and then it repeats itself. Again things are said, again I'm offended, again I don't want to talk to you again in my life, and then I come back to you the second there's a chance, because I want you in my life. It's like I'm giving up a lot of myself, so that I can feel good, sometimes, with you.\n\nI'll say something now that if it wasn't clear before, it can be very recoiling and disgusting to hear, at least for me- My relationship with you, and you, in general, is very addictive to me. I'm addicted to you. You feel like a drug to me and I can't find a better or worse way to say it, that's how it feels to me. When I'm with you and everything is good, everything is the best in the world. When it's bad, it's very bad.\n\nthere was another time, at some day, I was at your place I think a few days after we agreed not to sleep together anymore.- of course we met and slept together because how could we not): There was one moment, you put your head on my chest as if I were a pillow. we just sat like that in bed for an hour, cuddling, calm, comfortable, quiet, pleasant.\n\nWhy do I get so hung up on these moments?\n\nIt's like if I'm not bipolar enough on my own, there's another layer of bipolarity in our relationship.\n\nI remember especially at the beginning of this relationship, when I was at your place and I felt so nice and comfortable, I didn't want it to end simply because it was the peak of the day for me. The moment I had to go home, just being on the drive back home, alone, sleeping alone, suddenly that was the lowest point of my life.\n\nI've slept alone my whole life. Why does it feel so heavy now?\n\nIt's like craving you helped me survive a little longer, every time. And this is the most unhealthy thing I've ever experienced, and the most disgusting thing I've ever said. It's embarrassing to admit it at all, especially when I'm sure it's not mutual.\n\nFor a very long time I was emotionally dependent on you, like if you were in a good mood it would be great for me, but if you were feeling bad and would withdraw from the world, I could easily take it personally. Because when I'm in a bad mood, I still want to be near you. I still want to talk to you. And it's disgusting to me. Why is it different only with you? Why am I not interested in sleeping with anyone, except you? Why did I think for years that I wasn't interested in sex at all and that I could easily live without it, and then after I met you, I became a nymphomaniac? Why can I just say bye to people and leave without a hug, but with you this intimacy is so important to me? I don't even have one answer really I have no idea why it's like this\n\nOn the one hand I think, if I kept my distance from you, I would get used to being without you, it would have been hard at first, but little by little I would stop wanting anything like this with you, and then maybe I would be able to quit you. On the other hand, You're funny You love Why would I keep my distance just because it's a little hard sometimes?\n\nI'm in these dilemmas every now and then But I really don't want to lose touch with you\n\nSometimes I think you don't see or appreciate things I do for you, take me for granted. Why not, actually? you said so yourself, no matter when you text me, I will answer. if you need a favor, i will do it. if you want me to come to you and be with you, there will never be a situation in life where I will say no. I haven't given you a single reason to make you think that I'm not simply there whenever you need or want. So maybe it's my fault. Maybe I'm too accessible, not enough hard to get. and it's too convenient, it's easy to take it for granted, I don't know.\n\nMaybe you'll read all of this and think I'm a psycho, Tell me that you think it would be best and most worthwhile to end the relationship, and I'll understand from that, that you don't want anything to do with me, and I'll be offended, and we'll never talk again, and all that this relationship will be is some cute memories from time to time that are accompanied by a bad taste from how it ended.\n\nMaybe you'll read all of this and say nothing, pretend you never got it, maybe you'll even see that you got this letter, tell yourself wow this is really long I'll get to it someday, and forget about ever getting to it.\n\nMaybe you'll read this and tell me what you think and feel too. Share your side. Tell me that everything is okay, it's okay what I feel, it's okay that I'm an addicted psycho, and that I'm too important to you to lose touch with me over stupid things that can be solved in an instant with a little communication and the right mood.\n\nI don't know what you'll choose, but everything is legitimate and I'll understand in the end, even if not at that moment. I love you, I would be happy to talk whenever there is a problem, I just want us to really be able to talk.\n\nI am not here to apologize, and I do not demand any forgiveness from you, Whatever happened was. Do you want us to stay in touch? I would be very happy. Just please try to pay attention, appreciate me, respect boundaries. If situations arise where you feel that I am attacking you, that I am unpleasant, that I am unbearable, that I am repulsive, inconsiderate, offensive, - tell me. Let's talk about it. It doesn't have to be at that moment when you are at your wits' end, you can do it at any moment, but let's try to communicate more healthily and hug after that and be good please:)\n\ni love you”\n\nid like to know your thoughts about this. if it made anyone feel anything, or anythig like that.   \nafter he read this letter he has said that relates, understand, and he was the one to tell me to maybe do something creative about it in the future, i never even thought about it until he sais it, as it was a very personal thing that was meant for his eyes only.  \nthanks for reading:)",
    "subreddit": "TrueOffMyChest",
    "title": "i impulsively sent a personal letter to a situationship-friend. he told me i should do something with it?",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6tw9e/i_impulsively_sent_a_personal_letter_to_a/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 23:11:14 UTC",
    "id": "1j6toid",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 3,
    "secure_media": null,
    "selftext": "I try to connect with guys, and in the beginning, they act interested—texting me consistently, showing enthusiasm, and making me believe there's potential for something real. But after a while, they just stop responding, leaving me with no explanation. I’m tired of being ignored and blaming myself for their lack of accountability. If they’ve lost interest, why not just be upfront about it instead of leading me on and then vanishing without a word? Why even start a conversation, show interest, and build a connection if they never intended to follow through?\n\nI’m exhausted from meaningless situationships and the constant cycle of ghosting. It’s frustrating how people would rather disappear than have an honest conversation. A simple message saying, \"Hey, I don’t think this is working out,\" would take seconds, yet they choose to leave me confused and questioning what I did wrong. I’m done wasting my energy on people who don’t respect my time or feelings.\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "Why has ghosting become so normalized these days?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6toid/why_has_ghosting_become_so_normalized_these_days/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 23:08:21 UTC",
    "id": "1j6tmay",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 14,
    "secure_media": null,
    "selftext": "So I was diagnosed with Ovarian cancer in 2009. My life was pretty boring and the recession had just happened and couldn't seem to find a good job and I still lived at home. Boom I get cancer, such a surreal thing to have happen to you when you are a young adult out of college trying to make your way. Everyone and I mean EVERYONE came out of the woodwork giving me stuff, loving on me, etc and I adored staying in the hospital because I felt safe, taken care of, and honestly, other than the psychological stuff (losing all my hair) once I had the first surgery I wasn't in that much pain, tolerated chemo well, etc. I am in the middle after almost 16 years possibly facing the C word again but it isn't a for sure thing as there are other possibilities for my symptoms. I have seen my mother waste away and die from it so it isn't the cancer I want it is the break from life the permission to just be without guilt, time to bingewatch and get caught up on reading etc. Am I a bad person? I don't have Munchousens I would never do something to myself or fake an illness or even worse make someone else sick (by proxy) I just really need a break from life. ",
    "subreddit": "TrueOffMyChest",
    "title": "I feel guilty that I miss having cancer",
    "upvote_ratio": 0.9,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6tmay/i_feel_guilty_that_i_miss_having_cancer/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 22:51:36 UTC",
    "id": "1j6t9hf",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 3,
    "secure_media": null,
    "selftext": "I have a great memory of my past experiences, conversations, things I've read, etc, but I cannot for the life of my remember where I've physically placed keys, eye glasses, chapstick, that favorite shirt.  Sometimes I'll return from the grocery and 1 item (usually the one I needed the most) isn't in the bag!  It never ends.  \n\n A fantasy of mine about heaven is not about clouds, but that I'll be able to finally see where I lost those 500 items over my lifetime!  Last week I lost my car keys....in my house!  I have it on ring camera. ",
    "subreddit": "TrueOffMyChest",
    "title": "I lose more items around the house than any other human (daily)",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6t9hf/i_lose_more_items_around_the_house_than_any_other/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 22:46:17 UTC",
    "id": "1j6t5fl",
    "link_flair_text": null,
    "media": null,
    "num_comments": 27,
    "score": 18,
    "secure_media": null,
    "selftext": "My boyfriend and I have been together for 3months. Before we met he met a girl from a dating app; when we first met then he texted her information about us. Sometimes during dates he would text her constantly and tell me that she is lovey dovey with him saying “thank you for being the brother I never had.” She rejected him from dating app but suggested they be friends. I didn’t say anything initially but as we started getting serious I asked him to delete and stop talking to her. And he did. Fast forward to now, we have had some issues and almost broke up a couple of times. \n\nSome examples of problems include but not limited to incidences when we talk about the future plan and type of children we would have, he says they would have “chinky eyes” because it is a dominant gene. Or when I’m driving he always says “they are probably thinking why is that Chinese driving so terribly.” (I’m not even of Chinese descent btw). Or when I'm going to work and wearing a mask because I didn't want to get others sick, he would say that they would think “that Chinese is spreading covid” when confronted, he would say that he is only saying what the general population is thinking, and I shouldn't take it personally. \n\nRecently, I found that she texted him and they have been referring me as “chinita” (I’m Asian descent and they are Hispanic. Then they would talk about relationship life and sex life, as well as how her mother is doing (she is ill).\n\nWhen I confronted him why he kept saying “I don’t know why I texted back” and that there is nothing going on that is flirtatious. He is now crying profusely apologizing saying he loves me.\n\nIs this emotional cheating? \n\nUpdate 1: he keeps saying “I can’t lose you ur the love of my life I blocked her, and ur my wife”\n\nUpdate 2: he threatened to take his own life when I tried breaking up with him. ",
    "subreddit": "TrueOffMyChest",
    "title": "Emotional cheating?",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6t5fl/emotional_cheating/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 22:27:28 UTC",
    "id": "1j6sqzk",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I recently remembered an event from the past, and I haven’t been able to stop thinking about it. It happened a long time ago, so it’s possible that what I remember is not exactly what actually happened.\n\nA few years ago, in 2022, when I was 14, I was coming home from school with some friends when an idiot thought it would be funny to open my backpack and ring a doorbell without telling me. Immediately afterward, everyone started running. I quickly zipped up my backpack and, for some reason I don’t remember, I decided to cross the road to the other sidewalk instead of running forward. Maybe it was because there were too many people in front of me, making it difficult to run quickly—I don’t know. I really don’t remember.\n\nThe thing is, as soon as I stepped onto the road, an older man on a motorcycle appeared right in front of me, just a few meters away. I moved away as fast as I could and got back onto the sidewalk where I had been before. I think I remember the driver swerving a little when he got scared after seeing me (though I’m not entirely sure about this). I didn’t hear any noise that would suggest the man had fallen, nor did I hear a scream of pain—just a “¡Me cago en la madre!” (which roughly means “For f***’s sake!” in Spanish), which I believe means he kept driving (I think).\n\nThe problem is that I don’t know if I started running once I stepped back onto the sidewalk, which could have prevented me from noticing an accident if it happened. But it’s more likely that I stayed still after stepping away from the road—at least long enough that I would have noticed if anything had happened. I’m not sure what exactly happened in that moment. It all happened so fast, and it’s been a few years since then.\n\nWhen I saw the idiot who opened my backpack again, all he did was laugh. I guess he saw what happened in some way, and that’s why he made fun of me when we met again. Or maybe I told him about it, and then he started laughing—I don’t remember. I also seem to recall that I had two other friends behind me, on the other side of the road, and when they caught up with us, they were laughing too. If what I remember is correct, that would mean nothing actually happened.\n\nI got home feeling like an idiot, but at no point did I think I might have caused an accident. I’ve walked through that area dozens of times since then, and while I wasn’t specifically looking, I never noticed any signs that an accident had happened. I also searched online for news from that year in my city, and I didn’t find anything similar to what I experienced. I never heard anyone mention that day again, which reinforces my belief that nothing actually happened.\n\nI recently remembered this incident, and I think I’m becoming paranoid. I’m scared by the possibility that the man could have had a serious accident or that someone nearby might have been hurt, since it was a very busy area at that time, with lots of cars and many kids coming back from school. I’ve been really worried for the past few days, and I honestly feel bad about it.\n\nDo you think I’m just being paranoid? I need someone to reassure me—I’m a bit scared.",
    "subreddit": "TrueOffMyChest",
    "title": "Years ago, I had a close call with a motorcyclist. Now I can't stop worrying about it. Am I overthinking?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6sqzk/years_ago_i_had_a_close_call_with_a_motorcyclist/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 22:26:37 UTC",
    "id": "1j6sqct",
    "link_flair_text": null,
    "media": null,
    "num_comments": 9,
    "score": 17,
    "secure_media": null,
    "selftext": "People always say to “find a job you love” but honestly I think I just want a job that pays the bills and lets me enjoy my life outside of work. I don’t want to be obsessed with my career. I don’t want my identity to be tied to what I do for money. I just want to work, go home, and not think about it.\n\nIs that really so bad?",
    "subreddit": "TrueOffMyChest",
    "title": "I don’t think I actually want a dream job",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6sqct/i_dont_think_i_actually_want_a_dream_job/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 22:26:01 UTC",
    "id": "1j6spwd",
    "link_flair_text": null,
    "media": null,
    "num_comments": 13,
    "score": 54,
    "secure_media": null,
    "selftext": "It's been a while since I was on here. On Reddit . \nI had a pretty rough start of the years. \nBoyfriend cheated \nRoomate left our place without telling me. \nLost my friends \nHad to cut off some of my family.  \n\nSo I feel pretty isolated in all this. Anyway I received some good news. \n\nI was approved to follow a work/studies program. Which will allow me to go back to school while still being able to provide for my son and I. \nHe's almost 3 and I just want a better life for us mostly for him. I want to be a special need educator which allows me to work with kids having intellectual deficiencies. It's pretty common in my reservation and I wanna be able to help my community. \nI'll be graduating in a year\nAnd will be off to university by 2026-2027\nI'll be the first in my family to graduate university \nAll whole still being a mom.\n\nI was also approved for an apartment closer to school a d my son's daycare. I won't have to wake up at 4 am get my son ready and be out the door at 5:30. \nAnd hopefully get to work by 7. I take the bus in the morning sometimes I can't help but be late to work cause a bus is late or cancelled. \nI'll be able to do everything by walking.  \nThe landlord lowered the rent for me so instead of 1800$ I'll be paying around 1300$ per month.\n\nI am going to therapy this summer. \nMy older sister will be caring for my son for a whilee month while I work on myself. I went to therapy before but it wasn't as long and intense as the one I'll be going to.  It's 28 days in nature which I like. Everything will be paid off by the government. \n\nI am 21 years old. \nI've been on my own since I was 17. \nI felt like my life was going nowhere till I decided what I wanted to do. \nI can't wait for this new chapter of my life. One I can be proud of. One where my son and I will live struggle free. I am proud of myself. ",
    "subreddit": "TrueOffMyChest",
    "title": "I got good news but no friends to tell.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6spwd/i_got_good_news_but_no_friends_to_tell/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 22:23:31 UTC",
    "id": "1j6snyp",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 4,
    "score": 1,
    "secure_media": null,
    "selftext": "I’m a woman in my 60s who for the bulk of my adult life has been able to keep and cultivate good relationships with friends, family, and coworkers. I have suffered off and on with depression and anxiety that I felt was bad enough to seek treatment for since my mid 40s. I had no shame in admitting this as it was a difficult time for me given perimenopause, a stressful job, kids heading off to college, etc. \n\nThings really began unraveling for me about a year ago. I had gained a bunch of weight, felt like crap, was facing some unexpected backlash from my two adult kids whom I had raised alone and were each facing their own separate personal crises simultaneously, was helping my widowed, aging mother navigate life alone, and a second new and stronger wave of “ideology” was evolving.\n\nI started therapy for the first time in my life and leaned heavily into journaling out my feelings, as I have a love of writing and my therapist felt it would be helpful for me. I dove right in to a shadow work journal with writing prompts that ask you to relate negative thoughts and feelings you are having now to your childhood, in order to heal your inner child. I have written at length on my memories from early childhood and nothing came forward that I hadn’t pondered before, so no big revelations this time… except for my anger.\n\nAfter a year of processing these events, poking at my anger, examining every piece of it through the lens of this tired and wounded old woman, and having the entire world bursting into flames exponentially more every day, I am at my breaking point. In the past year I have lost my 3 friends to the above mentioned “ideology”, then most of my family, and now, because I am so sad and really suffering from the effects of anger about not only the abuse and neglect I experienced in my past, but the trauma of the problems my entire continent is facing, I’ve got my mother in my face telling me she doesn’t like how it makes her feel that consequences are happening as a result of her actions. Nobody is blaming her for anything, merely mentioning they are losing their job. Or that they are struggling mentally. Or that they’re boycotting hyper consumerism. Or that they’re scared. Or that they feel compelled now to join this movement or become anti-whatever to make a statement and support people who’ve been hurt. She doesn’t like feeling that feeling that comes up when she has to wonder if people actually know her leanings, and maybe even think her actions are causing harm to them. It’s her own thought process guilting her, and outing her at the same time. \n\nIt’s so hard telling this without using certain words that are crucial to the story, but hopefully I’ve avoided the flags that will get this story banned. \n\nNow, I find myself on the verge of lashing out at my 84 year old mother the next time she berates me (I see it coming) because I don’t know if I’ll be able to bite my tongue. I carried for 60 years the memory of her attempted suicide in front of me as a 3 year old, where just before losing consciousness, instructed me how to use a telephone to call for help. She doesn’t think I remember. I protected my mother from her own shame of her daughter carrying this secret knowledge all her life, while enduring beatings from her 2nd husband, repeated emotional betrayals from her, being called a slut every day of my teen life. I was shamed mercilessly for my own emotional problems growing up, and was told I’m not good enough constantly. My own suicidal thoughts at 13 were claimed by her as embarrassing, and would make her look bad. I was never allowed to feel my anger and it caused me to make some really poor choices regarding relationships in my life. \n\nWell that rage has come to life and I think if I express it the way it deserved to be expressed all along, it might kill her. \n\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "I am so close to unleashing on my elderly mother.",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6snyp/i_am_so_close_to_unleashing_on_my_elderly_mother/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 22:18:45 UTC",
    "id": "1j6skca",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I was raised by my grandma with my twin brother and I really only feel a connection with my brother, I’m always so short and bothered with my other family who is trying hard to be a part of my life but I hate to say it I feel like I don’t need them so I simply don’t think about them or want to be around them, even my grandma. My twin is the only one I care about and they can all tell, I know it breaks my moms heart when I’m so short and insincere but at this point that is my natural reaction and thought process. I don’t even think about my dad lmao. ",
    "subreddit": "TrueOffMyChest",
    "title": "I’m terrible to my mom",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6skca/im_terrible_to_my_mom/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 22:13:27 UTC",
    "id": "1j6sg52",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "(my english is not good please adjust) \nWhen I was 12,Actually i had a beautiful family, so I have been always grateful to God for my father and mother and I had a huge respect on my father but sometimes he use to be alcoholic but I didn't know that in that time. I loved my father more than anything and one day, usually me and my mother sleep on the bed and my dad and my brother sleeps on the floor, but on that day my dad was drunk , so he slept on the bed beside me and I was very asleep, in the midnight that's the time he put his hand inside my panties and touched the private part😭 i was just 12..I don't know what's happening then i wokeup because of the uncomfortable feeling and I started to ask for mom...and my mom asked me what happened but I never told her. I don't know what to do! I have never shared this incident with anyone. Is being drunk can be a valid excuse for his actions? Is he was in the sense and knows what he was actually doing? Because I have never consumed alcohol so I'm so confused. Anyone tell me please. And do you know what's even more worse? My parents are divorced now and my mother abandoned us and me and brother are growing with my father. It's really traumatic to me but after that day he never reapeated that. I'm so confused. I cannot talk to him properly give me a solution.",
    "subreddit": "TrueOffMyChest",
    "title": "MY DAD TOUCHED MY INAPPROPRIATELY WHEN I WAS A CHILD",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6sg52/my_dad_touched_my_inappropriately_when_i_was_a/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 22:10:19 UTC",
    "id": "1j6sdqy",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 4,
    "secure_media": null,
    "selftext": "Me (21M) and my girlfriend (22F) have been together for 4 months now. After the first 2 months I started to notice and understand better all the things she has to deal with in her head, bad experiences in past relationships that affected her deeply and left her with traumas that are now being reflected in me just because we are in a long distance relationship and we can't see each other 24/7 and know what the other is doing or know entirely what is happening to us. Although she never saw a specialist or therapist to treat these problems (which she admitted to me was out of fear or pride), I always try to explain to her that right now it is impossible for me to be devotedly aware of her every second of the day, with my career, my activities, my friends and my own life in general. Every day I talk to her to accompany her in the little free time I have during the day and when I return home exhausted I also make sure to communicate with her and ask her about her day and if she would like to talk about something with me, in which most of the time her answers are \"I have nothing interesting to tell\". There are also times when a harmless joke I make unleashes hell where she gets offended at me and I need to reassure her of how much she means to me and how much i really love her, I apologize for upsetting her with something I said, to which she (apparently) accepts my apologies and (also apparently) everything is resolved. Last night I even went out with my guy friends to a bar after a hard week and all day long I let her know who I was with and what our plans were for the night, to which she ended up responding, as a way of throwing it in my face, that I will never be able to understand her and solve all the damage she suffered with me with a simple forgiveness, and acussed me of not caring about her and not being able to see things the way she sees them. That made me feel like like I'm worth absolutely nothing, like all the sincerely unconditional love I give her when we're together isn't worth it even in the slightest, that all the moments in which I was there to listen to her and understand her also meant nothing. I need honest and direct opinions on this. ",
    "subreddit": "TrueOffMyChest",
    "title": "My girlfriend's mental health struggles are draining me",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6sdqy/my_girlfriends_mental_health_struggles_are/"
  }
]