[
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 07:48:10 UTC",
    "id": "1j72pn4",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "Me 22F and my best friend 20M have been friends for going on 3 years now, we met in college and he was the only person who I stayed in contact with after we finished. I've always had trouble with maintaining relationships after things like that end, After finishing both primary and secondary school I quickly fell out of contact with all of my friends.I haven't had any friends since 2019. So when it came to college this happened again except for this one friend. We actually grew closer and became really good friends. But we live around an hours train rid away from each other so we rarely see each other in person. He is a very social person and has lots of friends (even though he'd say he doesn't), whereas I'm an extrovert with sever anxiety and autism. He talks about his friends, group chat, going on late night drives and drinking with people, and I just sit alone at home. I know it's not his fault but it's just killing me, I have been struggling with depression for a long time and it just keeps getting worse. I see him living the life I'd die for and I've been starting to hate him for it. I just want to have friend and people to talk to and hang out with. I just feel so alone. This jealousy has been getting worse and deeper recently and I'm scared it's going to ruin our friendship. I just don't know anymore. ",
    "subreddit": "TrueOffMyChest",
    "title": "I am starting to hate my best friend out of jealousy and its starting to destroy me and the relationship",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j72pn4/i_am_starting_to_hate_my_best_friend_out_of/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 07:42:28 UTC",
    "id": "1j72ms0",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 4,
    "score": 1,
    "secure_media": null,
    "selftext": "I 24f am fed up with my depression. I’m just done with finally having happiness and then boom a depressive episode happens.\n\nAll I want is to be normal and not have so many mental health issues. I also have ADHD, Autism and Anxiety as well as a language disorder. \n\nI don’t know how much more of these episodes I can handle. I just want to feel good and not fear having a depressive episode. \n\nI know the person who will affect the most if I do decide to end it is my mum. She went through hell with me as she wasn’t planning on having me and if she wakes up to the news I’m gone it may cause her stress. She’s a stroke patient and myself and my sister are what’s keeping her going.\n\nThis is what has stopped me the last few times I’ve wanted to end it all. But I’m lost. \n\nI just want to be happy and not feel like crap. But I guess I never will \n\n",
    "subreddit": "TrueOffMyChest",
    "title": "Currently debating on ending it all",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j72ms0/currently_debating_on_ending_it_all/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 07:39:12 UTC",
    "id": "1j72l6t",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "Guys I have to get this off my mind by saying after reading a bunch of Reddit topics like this it's good that I'm not the only one who does this and I hope you guys feel my pain on my concerns here it goes....\n\n\nHi I'm a 22M and for while now I have my own imaginary OC girlfriend that actually cares for me and is there when I need her to be (mentally) also I never had luck for girls nor did they find me attractive and I'm shy so IDGAF about them and for fun it all started back when I used to draw her as a gag thing when I was 17 I would draw what she looks like, act, hug, kiss like. It was all fun till eventually I started to actually have feelings to her because I would always talk about my personal life and struggles to her and she would say back to me while hugging me \"it's okay, everything's going to be all right, just note that I'm here for you when needed ♥️\" like seriously guys even while quoting what she would say to me I'm literally crying 😭 (I'm not effing joking) not only that she was also my comfort and coping zone as well for the $hit I go through in life. Even when I go to see I like to use my pillows to imagine it's her and I can hug and kiss her randomly as I pleased, other ways I like to imagine she's there for me is when I daydream about her (mostly) draw or write my stories with her (fun fact: I created her for my comic but my personal life, I want to publish it by doubt anyone read it so I just keep it to myself 🤣) journal about her in her ways for me and what we would do together! I know I'm weird but I'm not ashamed of it\n\nLike literally last night while I was walking around the neighborhood, right now I'm in the forest type of neighborhood so it's a lot of trees and hills here 😅 (also it was around 11ish night time 🌙) and I'll admit I was kind of scared and a little nervous to go to dark areas like that even the street lights wouldn't work so it made my nervous system 10 times worse, but while walking I could hear her tell me \"why so scared? I'm here with you! Just hold my hand and we'll walk together! Breathe and calm down\" (I would Literally hold the air or hold my own hand to think it's her) like it come for me so much that my heart for her couldn't take the fact that she's not real because mentally (to me) she is! As soon as I got back to my Airbnb I was literally crying a river for her! Even my own friend had to comfort  me to tell me everything's okay to not feel too down about it (he's real btw) so yeah I know which y'all thinking I'm a loser, weirdo, idiot for going out and crying for something that doesn't exists and your right I do! I just wish she was real she's my everything!!!  If it wasn't for her I probably be scared out of my mind or even worse....\n\n\nNote: I doubt anyone is reading this but if you are and if you're interested to know more about her I'll tell you more of her name and her information and another story if anyone's interested trust me I don't mind explain more about her I love my sweet bone 🦴😍💜💋\n\nBut seriously I would love some helping tips and other ways to cope with her! She really helped fixes my depression and suicidal mindset 😭 🥺",
    "subreddit": "TrueOffMyChest",
    "title": "i have a imaginary OC girlfriend that I love dearly and wish to be with forever 🫶😍🥺",
    "upvote_ratio": 0.25,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j72l6t/i_have_a_imaginary_oc_girlfriend_that_i_love/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 07:34:27 UTC",
    "id": "1j72irh",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "Okay, so I am going to try to keep this short, but I need advice. My ex (27F) and I (30F) first started seeing each other in February 2022. Very early on in the relationship she complained about one of her machines she uses for work, and it leads to me getting her a loan in my name, under my social, to be her new upgraded machine. The machine ended up being a 2.3k loan.\n\nTime goes by and we realize we are not right for each other. We were both super toxic during the relationship in our own ways. Her and her daughter moved out in the middle of June 2024 after us breaking up initially in the middle of May.\n\nEver since they moved out, she was constantly late on the payments, which caused her to make late payments every single time. Thankfully, this did not impact my credit by some miracle in this universe.\n\nOn 1/10/2025 of this year, after not paying since November, I went in and withdrew money from a mutual fund my dad gave me when he passed away. Not something I wanted to do but I had to because it was starting to impact my credit drastically.\n\nBefore this, on 11/25/2024, her daughter called me because she missed me. My ex wasn’t home, her mother (kid’s grandma) was. I said hi to her even and she didn’t say anything to me. When my ex got home the kiddo dropped the tablet she was using, and it disconnected.\n\nI ended up texting my ex asking her not to be mad at her kid when she just missed me like I missed her. We have a fight where we both said some intense things (and I did a lot of it). I have no excuses for the things I said, but I don’t regret it either.\n\nLong story short – she blocks me and deletes the calling app off her kiddos tablet so she can’t call me again.\n\nThe loan, in the beginning, was $2,299. When I paid it off, I paid $1,154.39. I paid 50.22% of this loan.\n\nDo I have grounds to get this back? How do I go about getting it back?\n\nAlso, do I have grounds to get my dog back? I let my ex take her when I was not in a good mental space because I couldn’t even take care of myself. Dog’s microchip is under my name and to my knowledge she didn’t update her vet records so the last person for her was me. In the dog space – I am this dog’s favorite person. I went over there one day and was talking to my ex and my dog freaked out for a solid 15 minutes over seeing me.\n\n \\*We live in Oklahoma in the USA\\*\n\nSo, should I just cut my losses and move on and try to save that money back up or should I text her from a different number or a friend’s phone to ask her to give it back since I paid half. Genuinely I have no idea what to do in this situation and I’ve gone back and forth for 2 months.",
    "subreddit": "TrueOffMyChest",
    "title": "My ex (27F) took out a loan under my (30F) name for a $2.3K machine but stopped making payments after we had a fight, leaving me to cover half the cost.",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j72irh/my_ex_27f_took_out_a_loan_under_my_30f_name_for_a/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 07:11:01 UTC",
    "id": "1j726r7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 3,
    "secure_media": null,
    "selftext": "My mom acts like a kid when she's sick... I'm currently argued with my mom, she's sick right now (bed sick) she can't get up, has a high fever etc. Anyway today I was looking for my cat and she was in my moms room, I was minding my own business getting my cat telling her she could get sick so I'll take her. She made a comment that is still bothering me, \"oh so you care more about the cat, but not about me, ok\", \"I'm sick and you don't bother checking in on me\". \n\nFor context my mom and I... we don't have the best relationship, growing up she was never the most loving, kind towards me, it was a very toxic environment, It is a lot better now compared to how she was before tho. Anyway, I really hate it when she says stupid shit like this, is not the first time. When I'm fkn sick, dying sick, she's not there for me, she's not the type to go out of her way to get me medicine, or make me a warm soup... I'm not the fkn mom, I'm in my 20s but to this day, at my grown age, it would be nice to have or feel the love of a pampering mother specially when you're sick. \n\nI got so mad I wanted to tell her off, \"why would you expect that from me? If I haven't experienced that myself?\" \"Do you think im your mother or something?\" \"What you sow you reap\"... so many things, but I kept my cool, \"yeah i do care a lot about my cat\" is all i said and went about my day.\n\nIt made me even more mad, because I am also fkn sick, I have a bad stomach bug that has been going on for 4 days now, and guess what??? She hasn't done sht for me, hasn't asked how I've been if I'm better or what... \"probably something you ate\" is all she said when I first told her, and off to work I went. Didn't bother to check in, didn't bother to ask how I was doing, if she could make me something to help me... and she has the audacity to say that sht to me?... and guess what, im hating myself for this but here goes. \n\nThe day before, she went to work fkn sick when I had told her the night before not to, because she was literally dying with a high fever. She still goes cause she's a workaholic, Anyway, it's 2pm and I see i have a missing call from this woman, I was showering getting ready to go out with my boyfriend. I call back i asked her what does she need, she tell me to go pick her up because she can't drive back home, that she feels weak... i tell her why I didn't answer when she called, this is what she says \"why didn't you shower earlier, you need to be more attentive\".... wtf??? Why would I pause my day for her? Does she want me to just sit there and wait around for her to get home or call me and finally function, for her? Wtf.\n\nLong story short, I call my boyfriend and let him know what happend, he ended up giving me a ride. So we rushed to get ready he ended up givin me a ride to her work place to pick her up and drive her back home. On the way back, she just kept going on about, why didn't I answer when she called, why am I not paying attention, why was I still sleeping late... I don't fkn know maybe cause I'm also sick and fkn tired from work???? No a thank you to me or my boyfriend, nothing. \n\nI did that sht just for her to be telling me \"you care more about the cat than me\"... but she's right, I don't care as much about her than i do about my cat, I don't love her, but I don't hate her, I see her as the person that gave birth to me, which gives her the mother title, but she is no mother to me emotionally.\n\nAnyway, i wanted to get this sht off my chest, so thank you of you took the time to read this! Have a good night 👍🏻",
    "subreddit": "TrueOffMyChest",
    "title": "My mom acts like a child",
    "upvote_ratio": 0.81,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j726r7/my_mom_acts_like_a_child/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 06:49:05 UTC",
    "id": "1j71v04",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 49,
    "secure_media": null,
    "selftext": "I'm extremely high and think about it. These guys get paid to travel the world and be overdramatic with electronics. The show is entertaining even though you think it's occasionally ridiculous. These guys got rich doing the bullshit we did when we were 12 years old 🤦‍♂️",
    "subreddit": "TrueOffMyChest",
    "title": "Dude I'm stoned watching Ghost Adventures. It's just people my age and older yelling at air.",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j71v04/dude_im_stoned_watching_ghost_adventures_its_just/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 06:36:32 UTC",
    "id": "1j71ogd",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 226,
    "score": 10819,
    "secure_media": null,
    "selftext": "We were close friends when I was younger,  between 20 - 25, he's 5yrs older. I trusted him. He raped me while I was drunk, unconcious. I didn't talk to him much after that, only at his fathers funeral, and my dads 70th birthday, trying to act normal. No one knows what he did 15 years ago, well I guess my dad knows now. \n\nMy dad called me on friday, letting me know he's not well and my parents and brother will visit him today,  one last time. Asking me if I wanted to join them, I said let me think about it. Yesterday I told my dad no, I will not be there because cousin did something I can't forgive. My dad's the best, I saw his face change but he didn't ask or press for info. He said he understood.\n\nIt did rip open an old wound. Honestly the guy's been dead to me for so long. I buried what happened in the back of my mind. Kind of blamed myself for being dumb enough to get so drunk and trusting someone to not take advantage. Now I realize this wasn't my fault. Today he will figure out I do not forgive him and never will. He will rot in the ground and I will spit on his grave.\n\nEdit, stahp you guys.\n\nThe support, kindness, shared experiences, sadness and anger and laughter is a lot to handle.\n\nI applaud your creativity and devotion.\n\nAlso very sorry for the people who know and thank you for sharing.\n\n\nI haven't had this much support in all my life and I love you all.\n",
    "subreddit": "TrueOffMyChest",
    "title": "My cousin is dying and today he'll find out I do not forgive him.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j71ogd/my_cousin_is_dying_and_today_hell_find_out_i_do/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 06:23:27 UTC",
    "id": "1j71hhj",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 9,
    "secure_media": null,
    "selftext": "My parents adopted with my permission when I was 11. They took classes was placed on this list got the call took my siblings and adopted them. My brother was 3 when we got him and always treated him as sibling. They were never referred to as adopted growing up. Flash forward I’m 19 he’s 13. He becomes obsessed with me completely out of no where. Starts with cutting the back out of several pairs of jeans attempting to see me exposed. Then one day I noticed while using the restroom there’s small holes chiseled into the wall. Yep peep holes. Parents patch them. He creates more. Mind you he’s in extensive therapy they’re basically begging for help as to why he’s doing this. (Of course the state wants you to adopt and then ditches you when there’s a problem.) He then started exposing himself in weird places in the house so I would walk in on him. Then I worked all night was tired accidentally dozed off on the couch (still am pissed I fell asleep because maybe this part could have been avoided) and he touched me from my butt to my vagina in one quick movement. I wasn’t hardly asleep so I instantly woke up saw him walking away and he admitted to my parents that he did it. (I moved out 2 weeks later) Now flash forward again I’m 25 he’s 17. My parents obviously continue to raise him. there was no punishment because he was a minor (he was sent off for a year if you want to call that something) my parents have a relationship with him and I have a relationship with my parents. He talks about me to mom still which I find very odd. I have not said a single word to him since the incident. Being around him even this many years later physically makes me ill. I hate his guts and quite frankly wish terrible things upon him. I’m no where close to being healed from this and don’t know if I ever will be. He has a girlfriend that he’s been with for awhile she has no idea what he did and it just makes me sick because if that were me I’d want to know and I feel wrong by not telling her but I do not know her and the fight within my family it would cause ugh. I witnessed him today with the gf and he’s constantly in her face demanding affection and overly touchy. Just makes me sick for the girl and any future potential victim. sorry for the long post. I’m just really sad this happened to me. ",
    "subreddit": "TrueOffMyChest",
    "title": "SA still bothering me years later &amp; here’s why.",
    "upvote_ratio": 0.81,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j71hhj/sa_still_bothering_me_years_later_heres_why/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 06:23:15 UTC",
    "id": "1j71hd5",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 11,
    "secure_media": null,
    "selftext": "During some down time at work one time, a co worker and I were chatting about some recent purchases we had both made. \n\nKnick knacks for work and things like that. I pulled my phone out to show her some recent personalised items I had bought from Etsy. \n\nWhile trying to find my purchase history, I pulled up my search history. I had completely forgotten the things I had been looking at. One of the vendors I had purchased from also made sex toys and sex themed items, so as any normal person does I had a peruse through her wares.\n\nSo there plain as day to my colleague was all these sex toys, phallus and vagina shaped items. And the item I had actually purchased wasn't even any of those items! \n\nYep. I apologised and told her to forget she ever saw anything while she laughed.\n\nI don't even know how to delete etsy search history so no more showing my search history ever for me. ",
    "subreddit": "TrueOffMyChest",
    "title": "I accidentally showed a co worker my sex toy search history",
    "upvote_ratio": 0.83,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j71hd5/i_accidentally_showed_a_co_worker_my_sex_toy/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 06:12:40 UTC",
    "id": "1j71bqc",
    "link_flair_text": null,
    "media": null,
    "num_comments": 171,
    "score": 328,
    "secure_media": null,
    "selftext": "I (27F) married my husband (29M) when I was 22. At the time, it felt like the right thing to do — we were in love, everyone said we were perfect for each other. But lately, I can't shake the feeling that I missed out on my \"wild years.\" I see my friends traveling, going out, and living carefree lives, and I can't help but feel a little bitter. My husband is amazing, and I love him, but I wonder what my life would be like if I'd waited. I feel so guilty for even thinking this.",
    "subreddit": "TrueOffMyChest",
    "title": "I secretly regret getting married so young",
    "upvote_ratio": 0.78,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j71bqc/i_secretly_regret_getting_married_so_young/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 06:04:13 UTC",
    "id": "1j71736",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 5,
    "score": 7,
    "secure_media": null,
    "selftext": "I can't seem to catch a break.\n\nJust in the past month, my car has needed major repairs three times and was broken into once (there's nothing but trash inside so I don't know what they wanted), work got shittier in a dozen different ways, and my cat has been getting sick at least twice a week. And now, just today, my grandfather died. Over a thousand miles away. They think he caught the flu, and was septic before they could get him to the hospital. His blood pressure was bottomed out and his heart rate was almost 200. When they took him off of life support he didn't last ten minutes.\n\nI don't know what to do. I want to attend the funeral. I want to see my family. I want to comfort my dad. But there's nothing I can do. I can't afford a plane ticket and I have to work. My car wouldn't survive the trip if I tried to drive.\n\nI'm so tired. I've been drinking, so sorry if none of this makes sense. I just... want everything to stop. Just for a day. I just want a break.",
    "subreddit": "TrueOffMyChest",
    "title": "I wish things could just stop happening for a day.",
    "upvote_ratio": 0.79,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j71736/i_wish_things_could_just_stop_happening_for_a_day/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 05:58:15 UTC",
    "id": "1j713kl",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "",
    "subreddit": "TrueOffMyChest",
    "title": "I became more of a man, yet life grew bitter",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j713kl/i_became_more_of_a_man_yet_life_grew_bitter/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 05:51:44 UTC",
    "id": "1j70zu7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 22,
    "score": 37,
    "secure_media": null,
    "selftext": "I just bought a 6 pack of green apple white claws by accident for the third time and i hate whoever is behind this flavor. The first time, I picked them up and assumed they were lime because, green. My usual. Didn't even know the green apple flavor was a thing. I've just unwittingly bought another 6 pack at a different store that historically always had the lime flavor in a 6 pack and I don't know how I haven't learned my lesson about shopping for these by color by now. That is all.",
    "subreddit": "TrueOffMyChest",
    "title": "I keep accidentally buying green apple white claw and I cant help but think who tf asked for this flavor",
    "upvote_ratio": 0.85,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j70zu7/i_keep_accidentally_buying_green_apple_white_claw/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 05:38:02 UTC",
    "id": "1j70sdg",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "",
    "subreddit": "TrueOffMyChest",
    "title": "Opposition",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j70sdg/opposition/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 05:37:57 UTC",
    "id": "1j70sbw",
    "link_flair_text": null,
    "media": null,
    "num_comments": 8,
    "score": 2,
    "secure_media": null,
    "selftext": "I was between molecular/cell biology, integrative (human bio/ecology/basically everything else), math, and physics. I don't want to waste two years and the associated money only to find myself committed to a field of work I don't like. I'm a sophomore and I'll need to declare a major before I can enroll in next semester. I don't know if I could see myself doing molecular biology work my whole career, and the integrative bio is beginning to seem useless without grad school. I'm not sure it's worthwhile spending two years just studying advanced math like real analysis and algebraic topology, and I don't even if I could graduate in physics, the last class was too difficult for me. I don't really have a motivation to do any of these degrees so I expect I'll just leave after the semester ends.",
    "subreddit": "TrueOffMyChest",
    "title": "I'm about to drop out of college because I can't choose a major",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j70sbw/im_about_to_drop_out_of_college_because_i_cant/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 05:31:28 UTC",
    "id": "1j70oru",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 50,
    "secure_media": null,
    "selftext": "I just want to throw up. He started playing about three months before I gave birth and said he wanted to max his account to kill time while the baby was young. It turned into a full time habit. Dude doesn’t work. the fact that I stayed is a big part of the problem - I admit that. \n\nI just hate him at this point. I stayed through so many hard times with him and now I hate myself for it. He made friends with this girl on the game and I asked so many times if he had anything to tell me regarding their relationship. I found receipts tonight and honestly it’s as devastating as it is embarrassing. Two grown adults with children and both with partners telling each other they are shaking and crying over each other. Lamenting that they wished they had other lives where they could be together essentially. All the while I’m in the same house while these things are going on about each other. He’s adamant it didn’t go any further and he even turned down nudes (I know…very valiant). Obviously I am not really buying that.\n\nI’m just disgusted and this has been the turning stone for me. The true victim in this is our 8 month old son who has a stupid mother who allowed herself to be abused for years and now has a split family.",
    "subreddit": "TrueOffMyChest",
    "title": "My partner of 6 years is cheating on me on RuneScape while I’m 8 months post partum",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j70oru/my_partner_of_6_years_is_cheating_on_me_on/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 05:09:55 UTC",
    "id": "1j70c5v",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "Nice life, parents, friends, work, nice city. \n\nNo big problems but I want to explore new places and be in nature",
    "subreddit": "TrueOffMyChest",
    "title": "Want to leave my nice life",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j70c5v/want_to_leave_my_nice_life/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 05:01:10 UTC",
    "id": "1j706wr",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 23,
    "score": 156,
    "secure_media": null,
    "selftext": "Throwaway account because I don’t want anyone I know to see this. This is something I’ve only ever told one person and I feel deeply uncomfortable to even tell a therapist. \n\nFor context: I have never been a victim of sexual abuse physically, was raised in a super healthy home life, etc. Nothing traumatic has ever happened to me due to another person I personally knew. \n\n\nWhen I was younger, I purposely would go on a site called KidzChat. I knew that predators would be on that site, and would advertise myself as someone to talk to “F 12”. I was around the ages of 10-14 doing this. Older men would then message me super sexually explicit things. We would sext for a while and eventually trade Skypes to talk or videochat. The biggest instance that I remember was skyping an older man who wanted to show me his jumping jacks. He would jump for a while and then his pants would conveniently fall off.  For some reason that moment is engrained in my mind. I know I’m a victim fully, but I feel weird because I went out looking for it? I guess that’s the cost of unlimited Internet access. \n\nAnother entirely separate thing that bothers me severely, is that one day (aged 11) I had my family dog perform oral on me. The dog didn’t need any coaxing, it liked the smell and went up to it. I remember it feeling awful and I felt so intensely guilty afterward. I never did it again, but I realize that this has deeply affected me as an adult. I absolutely cannot receive oral from a man because it reminds me of what I did with my family dog. This fact genuinely haunts me as I know it was completely wrong and animal.\n\n I don’t even know how to cope with both of these facts as I was a victim and perpetrator. These things still affect me in my sexual life now manifesting as intense fear and guilt to commit certain normal sexual acts with people like being eaten out, sexting my boyfriend, etc. I know I don’t have the guts to tell a therapist either. ",
    "subreddit": "TrueOffMyChest",
    "title": "I was a sexual degenerate as a child and feel deeply ashamed and uncomfortable about it",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j706wr/i_was_a_sexual_degenerate_as_a_child_and_feel/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 04:58:11 UTC",
    "id": "1j7052g",
    "link_flair_text": null,
    "media": null,
    "num_comments": 11,
    "score": 11,
    "secure_media": null,
    "selftext": "I stabbed a dog. I was working as a delivery driver and I went to a house with a bunch of packages piled at the door meaning the homeowners were gone. All of a sudden a giant dog that looked like the beast from the sand lot, same breed, very large, came sprinting around the corner and latched on to my arm. I had a thick canvas work jacket on so the teeth barely broke the skin. I carry a folding knife as a habit since I was a kid in boyscouts. I stabbed the dog with my free hand after trying to punch the dog and it ran off back around the corner of the house. A woman and her teenage daughter came around the corner screaming at me and I told them what happened. Apparently they were neighbors there to take care of the dogs. It all happened on the front porch in front of a ring camera. I then left, called my boss and the cops but decided not to take legal action. I guess I felt bad for doing that to the dog. I don’t know what else to say it’s been a few months. I’m pretty sure the dog died and it probably would’ve been put down anyway. ",
    "subreddit": "TrueOffMyChest",
    "title": "Stabbed a dog",
    "upvote_ratio": 0.65,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7052g/stabbed_a_dog/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 04:37:52 UTC",
    "id": "1j6zt7g",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "I do what I can to be less triggered. ",
    "subreddit": "TrueOffMyChest",
    "title": "I start to care what people think day by day.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6zt7g/i_start_to_care_what_people_think_day_by_day/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 04:27:13 UTC",
    "id": "1j6zmot",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 2,
    "secure_media": null,
    "selftext": "I don't know what spurred this on our relationship was always seemingly good. \n\nI (35m) think my Brother (32m) hates me. \n\nI've been in a rough phase of my life, moved back in with my parents, had just a terrible string of events dovetailing with my business failing and the loss of my Father all in short period. He died suddenly. I'm still working through that, I  was the one who took him to the hospital a few times that week, but the last time it was a serious emergency and he didn't get out. He died a few weeks later after being in a coma for the time. \n\nThis sort of, at least in my opinion, galvanized us into having a closer bond.  Or so I thought.\n\nDad dying was only a few months ago. It hasn't been a year yet. But I'm still trying to pick up the pieces and start moving forward.  And it was like our relationship with each other improved over it. We were a very loving family before, but this hurt us and we leaned on each other more. \n\nThen I learned the other day my Mom brought the hypothetical prospect of me being homeless. \n\nI don't intend to be homeless. But she brought it up to him or he brought it up to her, and he flat out told her that if I ever end up homeless I am not going to be living in his and his wife's house. For the record, I didn't ever ask or mention this. But this conversation took place behind my back and he apparently said that I was never going to be allowed to live with them. \n\nThey have a very large house btw, essentially half the rooms are empty at any given day.\n\nThat shocked my Mother to hear that and she told me. \n\nAnd quite frankly, it shocked me too. I am not going to be homeless. But to hear someone you thought you could rely on if things ever went to total shit say that, it's sad. But what made me more sad was remembering a conversation I had with him a few months before. \n\nHe told me his wife (31 f)'s best friend (30 f) who has a kid and either got kicked out of her own house, or cheated, or something became a single mother. My brother told me he was actively considering moving her and the kid INTO their house. She, who has had numerous problems from heavy drug use, alcohol use, partying hard, who has seemingly reformed her ways - was welcome to live with them. It didn't end up happening because she QUICKLY found a new guy. \n\nBut that was a total shocker to me, that I, who has had no problems with drugs and alcohol, who helps take care of his kid, who buys her toys and plays with her, who has bought them gifts every holiday, is lower on the totem pole than the single mom best friend of the wife. It totally blindsided me, and I feel betrayed. I'm not at any risk of being homeless, but the conversation came up between my Mom and him and that's how it went. To think your own brother won't be there for you, but will be for some sketchy broad, is totally insane. And for me it's like I'm feeling just heartbreak, resentment, sadness, disappointment, all mixing together - I love him, I still do, but I feel like I just got betrayed... Betrayed over something that hasn't happened yet. But that he thinks so low of me is shocking really. I don't know what to do. \n\n",
    "subreddit": "TrueOffMyChest",
    "title": "I (35m) think my Brother (32m) hates me.",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6zmot/i_35m_think_my_brother_32m_hates_me/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 04:05:50 UTC",
    "id": "1j6z9id",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 0,
    "score": 5,
    "secure_media": null,
    "selftext": "Hey, Team! I've been feeling super duper down in the dumps lately and want to vent serious style without fear of personal societal repercussions! This is a throw away account n such. Not really curating this post just typing about whatever comes to mind. \n\nI've never really been the happiest of people. Even in my youth I remember being melancholic more than not. Didn't have the best upbringing (not the worst by a long shot either). My parents fought with each other all the time if I didn't have someone over. I remember hiding in my room hearing them arguing downstairs hoping against hope it wouldn't lead into my room with them competing for my favoritism. There were times either my mom or dad would try to drag me out of the house to stay at a hotel with them because the other parent was \"crazy and untrustworthy\". Events like this were common place (once or twice a month) in the house up until I was around 14 when it all kinda just died out. My parents stopped fighting daily, maybe once a month or so until not at all. They never even acknowledge the horrors they would put me through. They just tell me it wasn't as bad as I think but it totally fucking was. It was hell, not to mention how often they would remind me how abnormal of a human I am. \n\nI've been diagnosed either adhd and I highly suspect I have high-functioning autism. I never really managed to fit in around others as a kid, often doing things my own way. Friends were hard and socializing was harder. My parents would try with all their might to assimilate me into \"normal\" behavior. My mom didn't let me shop for my own clothes until I left the house. I bought some shirts with some cats on them with one of my first paychecks (maybe 16 yrs old). She took and hid them from me because she was afraid people would \"think I'm girly, or gay\" which blew my mind. My dad wasn't the most supportive of my interests either. I recall a time when i was in grade school I really liked filming and doing stop motion Lego things.. I probably just caught him at a bad time (wasn't very many good times).. forgot what I asked but I remember his reply was along the lines of \"it doesn't matter anyway, it won't go anywhere\" in regards to my short-lived hobby. I don't think I picked up that camera again after that. I wish I did. Can't blame myself there i guess.. I was young and impressionable.. I wonder often how things play out if he never said those words. Probably not much different but maybe..  instead I just spent most of my time online, hiding behind headphones blocking out the screaming. \n\nDidn't have many friends growing up. I'd typically just pick one person I liked and puppy dog around them. I was pretty shy and often to target of harassment from some of the meaner kids in school. I got used to being the butt of jokes and such pretty early. It didn't bother me much but it definitely scared me off from trying to form connections. That said I managed enough. I had a lunch table to sit at most of the time. I wasn't usually the star attraction but the folks there didn't seem to mind my presence. I recall once I didn't really feel comfortable sitting at any table so I sat at an empty one. This prompted the principal to come over and with good intentions have me sit at a table with a bunch of strangers I didn't really know. Horrifying experience. That said, I didn't really spend too much time hanging out with friends irl. I unfortunely found connections on the world wide web..\n\nDespite how strict my parents could be they let me have unfiltered internet access from the very get go when i got my first laptop at 12 or so. They never monitored my activity, or set restrictions on screen time or anything. Long-story short I end up in some unsavory online spaces. I met people who at the time I thought were nice friends, parental figures, people to talk to when I didn't have parents I could. It wasn't until a bit later in my life I realized how groomed I got. I never thought much about it at the time. It seemed like people finally enjoyed my company, wanted to invite me to chat and stuff. I didn't see the harm at the time at all. Just some text-based roleplays, maybe a picture or two without my face. Whags the harm? Now in my adulthood I feel like I'm able to see the effects more. My libido is so high yet the thinking about sex makes me extremely uncomfortable in a way that's hard to describe. I get jealous, disgusted, confused, lustful, etc etc etc whenever I see or am reminded of the mere concept of penetration. What's worse is I think it's effected my love language too. I feel I have a really difficult time feeling like I'm showing I love someone if I'm not having sex relatively often. I doubt myself, and if I'm able to provide and be a good partner. I know there's so much more to a relationship but my brain always defaults back to thoughts along these lines. I hate it but the nature of the issue causes me to love it. Its such a conflicting mess of sexual frustration. I have no idea how to do a segway here so... :3 \n\nAnxiety is a big thing in my life. It wasn't so bad when I was younger, mostly manifesting in social anxiety around new people or crowds. Nowadays I sometimes feel anxious just leaving my apartment. Going to the store is a massive panic attack and I have no reasons why. I desperately want to put myself out there, meet new people and enjoy this life I have but the exhaustion from the anxiety and depression just constantly kick my dick straight into the dirt.\n\nDepression is the worst. It's only gotten worse since I broke up with my seven year long partner (we were engaged too at the time). The break up is a long story with no heroes and only villains and victims. I don't want to dive into it here. I'm a bastard, theyre a bastard. Point is I'm a total bastard livid with regret over such minute details. I miss my ex... I care about them... but I don't trust them anymore and I loathe the mere memory of them. It's such a dissonance... I can't think back to the early days and not wonder if any of it was real at all. I'm sure there was true love between us sometime... I wonder when we lost it, and I fear they mightve never felt love for me like I did for them. We were young when we met. Stupid too, probably. Grew up and got distant yadayada... happens.. I still miss them.. their quirks and such. The way they talked and the way they ate. Even the things that annoyed me I miss... its wild how much I miss the things that pissed me off...\n\nAnyway, this post is going a bit long. It's bedtime for me. Thanks for reading my cool, epic post. Might post more vents like this. ",
    "subreddit": "TrueOffMyChest",
    "title": "General depression post I suppose (28m)",
    "upvote_ratio": 0.86,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6z9id/general_depression_post_i_suppose_28m/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 03:51:09 UTC",
    "id": "1j6z0ce",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 6,
    "secure_media": null,
    "selftext": "I adopted my cat back in September last year. She’s about 3, an absolute sweetheart, and loves to play, but lately I’ve felt like she hasn’t taken much of a liking to me. I don’t know what’s wrong.\n\nShe’s in my roommate’s room all the time. My bedroom is on the first floor, 4 roommates are upstairs (I have 5 roommates total). Unless she’s meowing at me to feed her, she’s up there. I hardly even see her much around the house anymore, and she doesn’t sleep on my bed with me like she used to. She’s always up there with one of my roommates. \n\nI play with her a lot, give her attention and treats, brush her and clip her nails, everything, but she still prefers my roommate over me. \n\nThis is probably a really silly thing to be sad about because at the end of the day she is still my cat, but I want to have a better bond with her and I don’t know what I could be doing wrong. \n\nFor the first couple months, she would always greet me at the door meowing and rubbing against my legs, sleep on my bed with me while purring like a train, all that good stuff. \n\nBut now she doesn’t anymore. Gradually less and less, staying upstairs and hardly coming near me. It’s feeling more like she’s my roommate’s cat now. \n\nI’m just repeating myself now, but I don’t know what to do. ",
    "subreddit": "TrueOffMyChest",
    "title": "I feel like my cat doesn’t like me",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6z0ce/i_feel_like_my_cat_doesnt_like_me/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 03:48:48 UTC",
    "id": "1j6yyw1",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 17,
    "score": 0,
    "secure_media": null,
    "selftext": "And it kinda did something for me...that's horrible to admit because I was still very much pregnant and I had bruises on me from it but I kind of liked it. ",
    "subreddit": "TrueOffMyChest",
    "title": "My husband shoved me into a dresser a few months ago while I was still pregnant....",
    "upvote_ratio": 0.2,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6yyw1/my_husband_shoved_me_into_a_dresser_a_few_months/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 03:38:28 UTC",
    "id": "1j6ysb5",
    "link_flair_text": null,
    "media": null,
    "num_comments": 33,
    "score": 1586,
    "secure_media": null,
    "selftext": "Hey so this will be my final update on everything as I believe the situation has finally come to an end and I’m in a really good place. \n\nI left off where I was in a shelter and had made a lot of friends. Well the girl who I was gonna move somewhere with she ended up going back to her Mom and step Dad, and so I was back to being stuck on what to do. That was until I got a message from my grandma that her mom (my great-grandma) needs someone to care for her, she said that her brother would be happy to have me stay with him as long as I care for my great grandma. I decided I have nothing left to lose and decided this would be a good gig till I find out what I wanna do. I arrived in Miami 3 days ago and have been enjoying it greatly so far. I never really knew my dad’s side as he wasn’t that close with his family and after he passed it was hard to keep contact. My great-uncle is very nice and very accommodating and his wife is really nice, they live in quite a nice part of Miami as well near the beach. \n\nI haven’t seen my great-grandma in over 10 years and she was so happy when she saw me. She can’t speak that much English as she only really speaks Spanish. I’m aware I said my dad was white, but that’s was only because I was scared of my identity being revealed and that wasn’t a 100% lie. My father was Cuban and was born and raised in Miami, however, he was most likely a descendant of Spaniards. Anyways, my great grandma has been teaching me Spanish and as well through the help of translating of my great uncle stories about my dad. She told me that he would fall asleep on her lap at family gatherings and how he would make the whole family laugh imitating her accent. It made me tear up seeing all the photos of him as a kid with his whole family. She told me that when he got on drugs and ran away from home, it left everyone in complete distraught. She claimed my grandma would cry everyday. \n\nMy Mom never had a relationship with them, and that was her choice they wanted to meet her actually. They told me that they weren’t shocked what happened to me as my Dad told them later on my mom would cheat on him all the time with other men. This made me furious as my mom always claimed my dad was her “soulmate.” \n\nI have not heard anything from my mom, however, my cousins wedding went ahead yesterday as my aunty posted it on Facebook. My mom was there and she seemed completely fine from the photos. The wedding looked boring anyways, my cousin is marrying his first cousin from Pakistan (in-laws side) and no one is smiling. It made me laugh actually seeing my mom with all these people who are deeply religious and conservative. Seeing my mom next to my grandma and other female relatives who wear scarfs and are deeply religious, compared to my mom who sleeps with anyone that gives her an ounce of attention really cracks me up.  \n\nAlso no word from my EX-husband, however, his sister sent me a text apologising on behalf of her and his parents. \n\nSo yeah that’s the end I believe I’m taking care of my great-grandma and will work out what I wanna do in the mean time. This will most likely (hopefully) be the final update as I believe I’m in a really good place. ",
    "subreddit": "TrueOffMyChest",
    "title": "*FINAL UPDATE* I 21F found out my husband 33M has been having an affair with my mother, and I don’t know where to go from here?",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6ysb5/final_update_i_21f_found_out_my_husband_33m_has/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 03:37:44 UTC",
    "id": "1j6yrtb",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "Using a new account as I have people on my original account who know me irl, and I don't want them to even come across this.\nAs the title says, I really feel stuck at this point in my life(I'm currently 27 and turning 28 next week). All of it started two years back, when me and my then girlfriend(let's call her M) of 5 years started having a ton of arguments. It was mainly regarding my admission process and my promise of hitting the gym. I had quit my cushy job towards the end of 2022 to focus on my exams and my application process. It was a frustrating time for me as I had a pretty good profile(or so I was told) and expected to get an admit from almost all the universities that I had applied to. As it later turned out, all my hopes got dashed as I only rejection after rejection.\nIn the middle of it, there was a family function for which I had to travel to a different city(this is also the city where I did my undergrad from and M also lived). To give a backstory, we had been together since my sophomore year of undergrad and our relationship was a long distance one(We only saw each other during classes when we were studying. After graduation I had moved to a different city for work, and went to my hometown when COVID hit us.). \nSo during the time of this family event, I planned to take out some time and planned a dinner with M(during which I specifically told her that I didn't want to discuss my application process and that I was taking this trip as sort of a break). Unfortunately our conversation ultimately went into that direction, and what I thought would be a warm evening ended up with me feeling helpless and ultimately crying in the restaurant. After the family event ended, I travelled back to my city, and then had a talk with her and we both decided we'll take a break and introspect why we were arguing almost on a daily basis(we specifically decided that we will not be seeing or planning to see anybody in that period, but work on this and figure things out).\n\nAlmost a month later, a mutual friend of ours(let's call her C) tells me that M actually went on a couple of dates to see people(C and M were very close friends), which broke the trust I had in the whole relationship and I told that my trust in us was broken and that we were done. I developed this feeling of being inadequate, and ended up getting addicted to porn to numb myself, instead of studying and working on projects.My whole routine was to hit the gym and work out till I felt pain in my body, return back to home and sleep.\n\nAbout a couple months later, I learnt that it was C who had actually convinced M to go on dates and \"meet\" other people. Furiously, I cut contact with C and stopped any form of communication. As far as things with M were concerned, I was still too attached to her, so we decided we can try to work on things.\n\nThings changed a bit and I got an admission in a good university and started my postgrad journey here. But during the winter of 2023, me and M again had some serious arguments and I decided to cut ties with her. We still chatted on and off and she still told me she loved me. Around 2 months from that time, we tried to get back together again, but ultimately I couldn't sustain it this time(the distance had become a pain. turns out in a different country, loneliness hits you like a truck). And this time we broke up, once and for all. I felt and I still feel immense guilt for breaking up and putting her through a lot of pain. I sank into a pretty low state, got hooked to porn, but studied enough to keep my grades up, ultimately leaving any opportunity of upskilling myself or studying, but kept sinking lower and lower.\n \nAround a month back I talked to a therapist, and told her about my guilt and that I had been in a state of \"feeling like I do not deserve anything nice because I hurt M\" and that I self sabotaged whenever anything good came in my life. She heard all of my story and did tell me a lot of times when I was emotinally scarred and somewhat even manipulated by her as well. Now that I see this, I feel helpless. I inflicted a lot of pain and self sabotage on myself, and my addiction to porn has turned me into a very lazy person. I know that deep down I have the potential to excel if I figure my shit out. The thing is, I am not able to. I feel burnt out(recently even failed an interview at a reputed big tech company). I hardly have energy to study, reversed all the progress I made in the gym, and somehow not able to shake off this addiction. It's tough to put on a brave face and fake a smile, telling my family that I'm alright, while I'm numb deep down. I want to cry and take some of the pent up emotions out, but I simply cannot cry and give anyone a hint that I'm not alright. My family is very supportive and I don't want them to feel helpless knowing that I'm not as good as I tell them.\n\nJust wanted to take this feeling out. Thank you so much for reading.",
    "subreddit": "TrueOffMyChest",
    "title": "I feel stuck and I don't know what to do",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6yrtb/i_feel_stuck_and_i_dont_know_what_to_do/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 03:34:46 UTC",
    "id": "1j6ypwv",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "I feel so talkative at work because when I get home I don't talk to anyone.... No one to share my day with, no one to really ask me how my day is going, no one to have dinner with. I really with I had a different life ...  But I guess I wasn't ment to have a person of my own ",
    "subreddit": "TrueOffMyChest",
    "title": "I get kinda sad when I think about why I am the way I am sometimes",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6ypwv/i_get_kinda_sad_when_i_think_about_why_i_am_the/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 03:29:14 UTC",
    "id": "1j6ymel",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 0,
    "secure_media": null,
    "selftext": "I hooked up with someone yesterday through the Grindr app. I wanted to wear a condom, but i have erectile dysfunction, so it couldn’t fit in the condom at all. So I attempted RAW and I went in a little but I couldn’t have sex at all because my penis wasn’t erect enough, and there was lots of lube but my penis just wasn’t erect enough to have full on sex but I’m still worried because it went in somewhat and we kissed, he gave me oral, and I ate his ass for a few seconds.\n\nThe next day (today) my throat hurts and I have back neck pain but idk if the throat pain is because I drank gingerale with lots of ice yesterday I’m so worried and scared that I caught HIV through this one experience. So I went to the urgent care today and explained everything and told them to give me PEP and they told me they were also going to give me other medications but now my pharmacy has EMTRICITAB only and I need both EMTRICITAB AND ISENTRESS but the Isentress won't come until Monday noon please I’m so scared what should I do I won’t be doing anything until I know the results but I’m so anxious and scared should I be OK if I’m going to take the EMTRICITAB because of the 72 hour window it’s only been 1 day.\n\nThey did blood tests on me and throat checks but isn’t it too early to tell if it’s HIV?? Please someone help",
    "subreddit": "TrueOffMyChest",
    "title": "Hooked up with a guy yesterday and now scared of HIV",
    "upvote_ratio": 0.41,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6ymel/hooked_up_with_a_guy_yesterday_and_now_scared_of/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 03:16:28 UTC",
    "id": "1j6yegx",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 0,
    "secure_media": null,
    "selftext": "another long post...\n\nfor context, my(f18) sister(17) and her best friend(f15, almost 16, let's call her Dana) have been friends for almost a decade, they've always spent a lot of time together because our moms were friends. the last few years have been very very rough for Dana, and we've always been here for her, especially my sister, and that made them even closer.\n\nso, today, during lunch, my sister came to my mom and asked her if she could go out for a party night with Dana and her friend group, BUT. \nhere in italy, there are two stages of the party: the first one is open to everyone, the second one is only 18+, and she wanted to go right to the second one, that begins around midnight. my mom immediately said \"no.\", and my sister started whining, saying that Dana went there too a few weeks ago, and guess how she did that? fake ID and some connections, and that surely didn't help to have a \"yes\" as an answer.\na few hours ago i was with my sister and Dana, just talking, until my sister asked my thought about going to that party at that hour, and i said: \"honestly i don't approve that, not because you're going there, but because you're gonna do it 'illegally'.\", and she got angry, saying that she wanted to do that experience because she's a teenager and blah blah blah, to which i replied: \"yeah, you're a teenager and have to do your experiences, but you can make them on the first half of the night, where you can go without any problem.\", and i think she expected me to be the \"cool older sister\" because she got angry, and it only got worse when my brother(21) also said he agreed with me. so she went upstairs and i stayed with Dana, so i started talking with her about all this. the conversation then went to my sister's general behaviour, and we went to my room to talk more liberally.\nafter a while, we were talking about how she (my sister) almost never wants to go out unless one of us has weed or cigarettes and stuff like that, and that's when i told her something i had forgot:\n\nlast august they both were at home, my best friend was there as well, and we were all chilling in the backyard, when Dana told my sister that she had to go to her(Dana's) place, that she promised that, but my sister was whining about it, saying she didn't feel like it, but not giving a reason to break the promise, so they came up with a deal:\nDana would have gone home, and my sister would go there about a half hour later, so Dana left. i stayed with my best friend and my sister, who started saying things like \"i don't wanna go\", \"i don't feel like it\", and i replied other things like \"why don't you tell her?\", \"if you stand her up without saying anything, i'll tell her.\", and she freaked out, saying that if i did i would be a bitch, and i just rolled my eyes. after a while, she left and went to her room, and i immediately gave my best friend a \"i know how this will end up\" look, but didn't say anything.\n\nalmost a hour later, Dana calls me and says: \"your sister isn't answering my texts and calls. where is she?\". i took a deep breath and face palmed mentally before answering: \"she's in her room, i'll go check on her.\", and so i did. i muted myself and went to my sister, who was awake, and told her: \"Dana's on the phone, what do i tell her?\", and she replies: \"tell her that i'm asleep.\". my heart dropped and i didn't know what to do, so i just played along, unmuted myself, and said: \"she's sleeping.\". Dana was so disappointed and told me to wake her up, so i started shaking my sister trying to \"wake her up\", but she just pretended to fall asleep again and again, and i heard Dana say: \"look, never mind, let her sleep.\". i asked her if she was sure, and she said \"yes\", and i just said: \"okay, then... bye love, i'm sorry.\", and hung up. i looked at my sister and said a few things like \"you're an asshole\", \"you're a shitty friend\".\n\nso, returning to two hours ago, i told Dana about it, even though i probably shouldn't have, but i just thought it was the right thing to do. \nher face dropped and she became visibly sad and disappointed, said something like \"i don't even know what to say\", \"i can't think or look at her the same\", and i felt kind of guilty, but still thought that she had the right to know. \n\nwe smoked two cigarettes and she went to sleep, saying that she would figure out what to do about all this, again, she's clearly disappointed and tired of my sister being disrespectful.\n\nit's currently 4am, and i'm sorry for ruining her mood, but also scared of my sister's reaction in case she finds out that Dana knows, i've already made a post about my sister and her behaviour:/\n\nenglish is not my first language, so, sorry for any mistakes and/or things like that, i just didn't want all this to eat me up.",
    "subreddit": "TrueOffMyChest",
    "title": "i think i ruined the friendship between my sister and her best friend",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6yegx/i_think_i_ruined_the_friendship_between_my_sister/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 02:55:52 UTC",
    "id": "1j6y144",
    "link_flair_text": "CONTENT WARNING: ANIMAL ABUSE",
    "media": null,
    "num_comments": 2,
    "score": 2,
    "secure_media": null,
    "selftext": "So almost 10 years ago my mother and my now ex stepfather got gifted two dogs. My mother never wanted them since she already had a lot on her plate but since my ex stepfather did, there really wasn’t much of a choice. \n\nMy ex stepfather began getting more and more abusive until we all finally left, and despite my mother knowing we didn’t have the best ability to take care of them, we took the dogs because they were also being abused by my ex stepfather. Then my grandfather began living with us and eventually one of the dogs became his while the other became my stepbrothers (who came with us when we left her father).\n\nA lot of stuff happened and my stepbrother left and took his dog with him, leaving the other to be my grandfathers completely as we somewhat moved into separate households. Well more stuff happened and my mother ended up having to take the dog back with her, living in a small camper on borrowed property. It hasn’t been ideal for her or the dog.\n\nThe dog has cancer and has occasional seizures and because of that and the unfortunate circumstances, my mother has been wanting to put the dog down for a while. She has some aggression issues after having pups, being shot, and being run over in a short span of time a few years back, so she has been unable to rehome her. Well it’s come down to it and because my grandfather is unable to take her, she is getting put down soon without his knowledge.\n\nI get she is a sick dog who isn’t living in an ideal situation by any means, but I still feel terrible that it’s going this way. I just had to get this out.",
    "subreddit": "TrueOffMyChest",
    "title": "My mother is putting my grandfathers dog down without his knowledge.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6y144/my_mother_is_putting_my_grandfathers_dog_down/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 02:43:48 UTC",
    "id": "1j6xt9p",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 6,
    "score": 1,
    "secure_media": null,
    "selftext": "( i'm going to try keep details to a minimum as i don't want anyone to recognise me from this post, so identifying details like genders, names, ect will be changed. i would also like to note that i do suffer from a form of neurodivergence that can make me incredibly naive at times) \n\nin the few months preceding this kidnapper event, i had a partner who i suffered quite a traumatic miscarriage with. he ended up cutting me off the day i was in the hospital - it was terrifying and incredibly lonely. \n\nat the time, a sibling of mine whom i live with had been having some friends over often, and naturally i started getting to know them and would hang out with their friends too. this was something i did often, as i was struggling heavily with the grief of losing both my pregnancy and essentially being broken up with and left to think about it alone. \n\nAfter hanging out with my siblings friends for a few weeks, Taylor (M32) started giving me gifts. I have quite an interest in sterling silver religious jewellery, and he had given me a few pieces during this time of us hanging out. (a silver chain with a saint pendant, a very dainty 14k gold bracelet, another small silver bracelet). I thought nothing of it, it's quite common amongst us here to exchange gifts often among friends and family so i didn't see it as anything more than that, as i myself have given people fine jewellery randomly before. \n\nOne day, he asked me if i wanted to go to his home to see his pets and just chill and do some art. I agreed, as he had some very unique reptiles which i was curious to see.\n\nAfter getting to his house, it was then that things took a really bad turn. \n\nHe sexually assaulted me on several occasions, I was not allowed to leave the house unless he was supervising me, and it would only be to his garden that i could go. I was also not allowed to wear any clothes in his home, he would take them from me under the guise of washing them and not return them unless he wanted me to go outside with him. He allowed me to return to my own home on two occasions, however he was present the entire time and would not let me out of his sight and would regularly complain about how we needed to leave back to his home. \n\nHe would regularly belittle my appearance, try to convince me that i would have to laser remove all of my tattoos as they looked disgusting, he told me that my earrings were disgusting and masculine and how he couldn't believe anyone would ever have had sex with me because of how gross they were. He would force me to stand on weighing scales when i didn't want to so he could know my weight, and then proclaim to me that 'we'll have to fix that'.\n\nI know that people will probably wonder where were my parents in this situation, and the reality is that they were on vacation. They left the family home for multiple months at a time, and whenever my mother would call me, he would answer the phone on my behalf and tell her how i was happy and i was okay and convinced her that i was his 'girlfriend' even though i was being held against my will and assaulted in his home. \n\nI asked on several occasions to go back home, and he would tell me 'maybe next week...' and next week would just never come. and even then, i had no clothes so i simply couldn't leave. \n\ni managed to escape because i had a large concert planned, and after arguing with him for days, he finally let me leave so i could go to the concert. as soon as i got home i messaged him and told him never to speak to me again or i would be calling the police. \n\nfor a few weeks after this, he harassed me on different platforms. he posted pictures of me he had taken against my will on social media saying for people to 'look at his girlfriend' , he would change his profile pictures to pictures of me or would make profiles in my name. \n\nin the end, i ended up blocking him and changing all of my social handles. \n\nthat brings us to now. \n\nits been about 10 months since this happened. i did not go to the police as i did not want to have to relive what happened to me. he also told me many stories of violence he had committed against women who had called the police on him in the past. \nwe also had no text conversations at all prior to me being harassed by him &amp; i truly just believe the case would get thrown out. \n\ni have had a reoccurring nightmare about him breaking into my house killing me almost every night for the past few weeks. i confessed this to my sibling who introduced me to him, and was told that he had been trying to contact my sibling. he was claiming to have purchased gifts for them, and sending them photos of the gifts he had bought and how much he had paid, and that this had been happening for weeks and my sibling had been simply ignoring his messages. \n\ni feel sick. why would he do this? why would he want to come back into my life? after the terror he put me through? he told me on several occasions that he, in his own words, felt like he was 'the predator' and that i was 'the prey' and it was 'his natural instinct to hunt me down'. he also told me how he had only been coming to hang out at my house because he had been fantasising about me. \n\ni don't know what to do in this situation. all i know is that i'm scared and i feel like i have no one to tell who can truly understand my story or my fears of him trying to pry his way back into my life and into my home. \n\n",
    "subreddit": "TrueOffMyChest",
    "title": "i (19F at the time) was kidnapped and raped by a siblings friend (32M) and now he's trying to come back into my life.",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6xt9p/i_19f_at_the_time_was_kidnapped_and_raped_by_a/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 02:37:19 UTC",
    "id": "1j6xp1k",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 2,
    "secure_media": null,
    "selftext": "Hi! Before anyone thinks this sounds ungrateful hear me out. I (14f) have always had a good relationship with my granny but she has always favoured my older sister (17f) and my 2 little cousins but the problem arose when my other cousin (15f) got a lamp for her birthday that cost 15 euro (price tag was left on) and 2 weeks later for her brothers birthday he got 100 euro.\n\nI'm turning 15 in a few days and my granny gave the same lamp but with 50 euro this time but my cousin (who got the same lamp as me) won't stfu about favouritism and this Godforsaken lamp like I'm okay with this lamp (found a good use for it) but bro won't stop yapping like that girl is my best friend but I'm just sick of her complaining ",
    "subreddit": "TrueOffMyChest",
    "title": "My granny plays such obvious favourites and atp it just annoys me",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6xp1k/my_granny_plays_such_obvious_favourites_and_atp/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 01:55:28 UTC",
    "id": "1j6wx3n",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 3,
    "secure_media": null,
    "selftext": "\nI'm getting really tired of my thoughts and I don't know what to do. For context, I don't mean to self diagnose, especially since I understand how dangerous that is, and how severe this mental illness can be, but I feel that I might have OCD and I'm scared. \n\nI feel like sometimes my thoughts get so bad that I can't tell of it's me or something else. I always feel guilty everytime these thoughts pop up, so I try to either pray my thoughts away or hit myself to alleviate those thoughts. Sometimes I feel so guilty that I want to do more than just hit myself. There was even sometimes in my college classes where I had to walk out of the classroom, because I couldn't even trust myself to hold a pencil without hurting myself.\n\nI feel like it's getting worse, I can't sleep, I'm starting to see things, and I'm starting to feel more aggressive. I'm scared and I don't know what to do.\n\nGood news for me, I'm finally going to see a therapist or something like that, but it's later next week.",
    "subreddit": "TrueOffMyChest",
    "title": "I'm tired and I think I need help",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6wx3n/im_tired_and_i_think_i_need_help/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 01:52:14 UTC",
    "id": "1j6wuwq",
    "link_flair_text": null,
    "media": null,
    "num_comments": 9,
    "score": 0,
    "secure_media": null,
    "selftext": "Two weeks ago I had sex with a girl and I’m really ashamed about it, and I haven’t told my friends about it. I tell my best friends every dumb decision I do but this time I’m really afraid of what I’ve done. Please help me",
    "subreddit": "TrueOffMyChest",
    "title": "I did something’s I regret",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6wuwq/i_did_somethings_i_regret/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 01:41:28 UTC",
    "id": "1j6wnuu",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "Teen Nightmare\n\nThis happened many years ago I don't want anyone to get in trouble or press charges I just need to finally be able to speak about what happened.  I was 17 at the time and I volunteered as a Sheriff explorer during this time I met a deputy who in the beginning was really nice to me. I had just graduated high-school but my 18th birthday wasnt until a few months later. I was scheduled to go on a ride along we were required to go on patrol at least once every three months or so and he volunteered to take me on this day. This first time went fine I was super shy but he got me to open up, he talked about himself and asked me about what my plans were after graduating. It wasn't until the second time I went on patrol with him around a month later that things took a turn, I knew he had a girlfriend she was only two years older me, but this time around he started talking about how things were rocky between them. I didn't think much of it I thought he was just venting and no harm done. However  he was being super touchy and was flirting and at that time I was too shy to say anything. He ended up kissing me out of nowhere and he just smiled and said he needed to know if I was attracted to him. I'm not going to lie I was, he was good looking but I asked him about his girlfriend he said she wouldn't care. He offered to take me home after the shift and he did but not before he ended up taking me to an abandoned field and said he just wanted to talk. We ended up making out in his car and i told him i didnt want to have sex that it was as far as i would go he said it was fine but kept pushing and pressuring for more. He said if i really had feelings for him i would be willing to go all the way. He took me home after about an hour and explicitedly told me that if i was asked by any other deputy to just say were friends. I liked how special he made me feel and the red flags were there but i honestly  thought he wouldnt force me to have sex with him since  at that point he did stop when i told  him to even if he continued to ask. From this point on whenever I would patrol with him things would go further. Until finally one day after my 18th birthday he said he would take me home but instead he  hopped on the freeway towards his apartment. I was scared but at that point I felt speaking up would get me abandoned somewhere unfamiliar or worse. We made it to his place and he gave me a beer and led me to his bedroom. I felt like I couldn't say no he told me to relax that I would like it that it was just my nerves. We ended having sex but I finally was able to tell him he needed to stop that he was hurting me but all he would say was just let me finish its OK you'll like it in a minute. No amount of pleading worked until he finally rolled off me. By then I was shaking and oddly felt numb about the whole thing. He took me home and again told me to say we were just friends. He would lose his job if anyone found out making me feel guilty. I ended up quitting the program a few months later and foud out he was being investigated for misconduct on a whole different issue. I regret keeping quiet but at the time I was confused and developed feelings for him. Other deputies became suspicious since they noticed he would go out of his way to talk to me but no one ever asked me personally if anything happened. I know this is long and confusing but it feels good to finally speak about it I've held this in for 16 years. I had posted and then deleted I freaked out a bit that it was shared but if it helps anyone else in a similar situation so they speak up then it is what it is. Also for clarity he was nine years older than me.",
    "subreddit": "TrueOffMyChest",
    "title": "Teen Nightmare",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6wnuu/teen_nightmare/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 01:33:45 UTC",
    "id": "1j6wish",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 5,
    "score": 33,
    "secure_media": null,
    "selftext": "Very long and emotional story short (or as short as I can get it):\n\n&gt;**0-13** \\- I grew up a daddy's girl. I love my father with my whole heart and cherish his presence. I am inherently anxious and suffer from undiagnosed AUDHD, anxiety disorder and depression, but it doesn't affect me as much because my family is loving and kind.\n\n&gt;\n\n&gt;**13** \\- My mother and I caught my father cheating on her. He told us he stopped and that he was sorry.\n\n&gt;\n\n&gt;**13-15** \\- I didn't talk to my father directly, as I felt betrayed and hurt. This was made worse when my mother kept trying to stand up for him. (I later learnt she was trying to stop the mistress from contacting my father so that she and him could work on their relationship)\n\n&gt;**14** \\- My mother is diagnosed with cancer, but they cant tell what kind or how far along it is.  My father grows even more distant from us, and the arguments increase.\n\n&gt;**15-16** \\- My mother is hospitalized and my father starts talking to this woman on his phone. I start to feel more anxious. My mother advocates for my father, but it just makes me more mad and hurt. They argue more now, and I find myself becoming emotionally distant from my father.\n\n&gt;**Late 16** \\- My mother dies and I shut down, as well as shut myself off from my family, friends and peers. I am angry at my father as he does not seem as affected and was also the cause of my mother's stress before she died. My older brother tries to soothe me and we traumabond. My father tries to relate to me, as his mother died a few months before mine, but he doesn't understand that it isn't the same.\n\n&gt;My father 'dates', moves in and then marries a woman I have never met in less than 8 months. His friends, my trusted adults, all support him, as well as his family and peers. I am hurt, but I pass it off as him just grieving differently. I was sure it was a phase and that they would break up/divorce soon enough. I later find out, its the same woman he cheated on my mother with, lied to us about, and then continued to talk to while my mother was battling cancer. I confront him about this and he says that he thought I knew who she was (despite us never being formally introduced to her. To this day, I know next to nothing about her. Only her first name, where her mother lives, and the name of one of her children.)\n\n&gt;Father's wife is emotionally and verbally abusive towards me and my brother, but I, being the younger and more emotional one, take it harder.\n\n&gt;She tells me that I'm *killing my father* by arguing with him, and that *he will end up dead, just like my mother*. I yell back at her to defend my father, as I take it very seriously when someone wishes death upon another (even indirectly), but my father takes her side and berates me for defending him.\n\n&gt;He does a myriad of other things; threatening to sell off my cats, locking them outside and causing one to die from the cold as punishment for me not agreeing with him, as well as pretending not to hear when his wife flat out threatens to kill me. He was right next to her when she said it, mind you.\n\n&gt;Under the advice of my older cousin from my moms side, I report the wife to the CPS but he denies hearing her threaten me to the social workers, which makes me look like an emotional teenage girl. We get placed into family therapy, but the therapist is borderline sexist and just wants us to be a family unit, regardless of the woman's blatant disregard for my safety.\n\n&gt;I ask my father why he's choosing his wife's needs over the safety of his biological children, whom he claims to adore, and he simply says that ***\"the Bible says wife before children\".*** I'd argue that doesn't apply to 'wife that you cheated on your children's mother with and who threatens you children', but okay, dad.\n\n&gt;I sleep with a knife under my pillow, just in case she tries to harm me. My anxiety and depression levels are through the roof.\n\n&gt;**17 - 19** \\- I cant remember much from these years, but it mostly involves me trying to bond with my father, as he's the last living parent I have. I go through 3 relationships, and have no one to talk to or seek comfort from when it goes downhill. My father thinks we're getting better because of him, and not because of the gigantic effort and emotional stuffing-down I'm doing as even being near his wife makes me anxious to the point of insomnia.  \nAs angry as I was before, I still love my father and want him in my life. I tell him that he can pick any other wife, just not her, and I would be genuinely happy with that. He doesn't care, and only treats me well when she's not there (away on vacation or at her mother's house). When she is around, though, he is more distant, and visibly more tense.\n\n&gt;**20** \\- My father announced that he wants to split our house physically (half of it is to go to me and my brother, as it was built when my mother was alive and she paid for and designed it). I tell him that I don't want him to do it, as it will just drive us further apart, but his reasoning revolves around his wife and her comfort. My brother and I have long assumed that his wife is just with him to benefit from his money, she doesn't treat him nicely, but he doesn't seem to notice.\n\nI know its childish and naïve, but I didn't want him to distance himself from me, even though he has hurt me so much for so long. I still cry (I've actually just stopped crying as I'm typing this) whenever I think about how far we've already drifted apart.\n\nOur relationship went from one of trust, smiles, secret fast-food lunch breaks and long hugs... to me not even being able to tell him about the girl that broke my heart, and how I would love to have one genuine dad-hug from him so that he can tell me its alright. I would love to have him at my wedding one day, but I don't know if that will ever happen.\n\nI don't want to grow up, not in a world where he dies alone and regretful, but it seems that that's the only way for me to not end up living my entire life clinging to his leg, begging him to look back and maybe love me the way he used to.\n\nSo ***I'm done***. I'm done wanting his love and I'm done waiting on him to realise he was wrong, and that I still needed him.\n\n*I'm* going to be *something*, and *I'm* going to *love someone* and *let them love me in return*.\n\n***I deserve better.***\n\n***TLDR:*** My father has hurt me with his actions and his words for too long. I'm going to learn how to live without him, no matter how much it will hurt to let him go.",
    "subreddit": "TrueOffMyChest",
    "title": "I'm done holding on to the scraps of relationship my father and I have left",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6wish/im_done_holding_on_to_the_scraps_of_relationship/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 01:22:15 UTC",
    "id": "1j6wb2h",
    "link_flair_text": null,
    "media": null,
    "num_comments": 35,
    "score": 542,
    "secure_media": null,
    "selftext": "Back when covid started, I had to use the food bank multiple times a month. Unfortionatly a lot of food I recieved were desserts and sugary stuff. Not wanting to be wasteful, I ate what I was given, not just to not be wasteful. But also cause i literally don't have any other food.And as such I gained over 100lbs.\n\nBut I've had to go to the food bank the last few months. I got a lot of fresh vegies and good selection of meat. But one of those meat rations I got was a bag of unseasoned pulled pork.\n\nI put it into the pot frozen and as I warmed up, I noticed that it was mostly fatty pieces with very gritty meat crumbs. I made the decision to throw it out because \"not wanting to waste\" is what got me so overweight. But I still feel guilty having to wast food I was given. ",
    "subreddit": "TrueOffMyChest",
    "title": "I feel really guilty, but I just had to throw away food i got from a foodbank.",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6wb2h/i_feel_really_guilty_but_i_just_had_to_throw_away/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 08:32:48 UTC",
    "id": "1j6cvlf",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "Sorry in advance for this being DENSE with context and a little bit nonsequential at the end but its necessary to me understand the gravity of this, I think.  \n  \nMy mother was raped by my grandfather when she was 26. He was 60, but strong. My brother and I were 5 and 8 at the time and we were in the house when it happened. I vaguely remember the screaming and having to be temporarily resituated at a friend's house until my mom found out where to go. Two of my uncles showed up, one kept grandpa restrained while the other spoke to the police. I think one of them threatened to kill him or something but regardless he never saw the inside of a cell for it. I still don't know why (more on that later). He has ZERO criminal record except for vehicular manslaughter (the young woman's underwear was found in a nearby field and she knew our family), for which he spent some time in a mental hospital. My mother told me he was observed to have had antisocial personality disorder but I'm not sure how she would know that because he would never tell her something like that. This is a man that says shit like \"I've never been depressed in my life, I don't even know what that is.\" Anyway, we moved somewhere so he couldn't find us. Problem there is Grandpa had a stalking habit so he found us after few months. You have to understand my brother and I were in no position to understand what happened, or at least that is reasonable enough of an assumption that mom didn't tell us what happened. All I knew was Grandpa wasn't around anymore and that I missed him (despite abuse of my brother and I up to this point, which I will get to). \n\nOnce he found us he would spoil my brother and I to gain favor and make it harder for my mom to keep him out of our lives, a pattern that would persist indefinitely. My mom saved up money during Move1, and we relocated to an \"aunt's\" house. She was a close friend of my mother's that was stalked by my grandfather prior to all of this. The \"aunt\" was also a pedophile. I was too young to understand that the teenagers she was messing around with were not adults. My mom was too traumatized to worry about anything other than feeding us, loving us, and killing the pain on her downtime with pills and partying. She balanced it well and her recreational activities never interfered with us beyond waking us up in the middle of the night for a taco bell run so we wouldn't be left alone in the house. Somewhere in there he found us again, because of the stalking bit.\n\nDuring this time he sank his claws deeper into my big brother and I. Christmases and birthdays were always huge to us both because, even though we were poor, we were spoiled senseless by grandpa *AND* by my mother's dogged determination to outshine his efforts. She had to spend every one of those Christmases and birthdays watching us thank and hug him in front of her, telling him we loved him.   \n  \nAfter a few years of living in that creepy shithole, my mom made enough to move again. She even wrangled us a stepdad for security. SPOILER he loved crack and bullying us. However he was young (27) and deeply troubled himself. He actually kind of kept grandpa at bay for a minute but we still LOVED grandpa so much. Our fathers never met us, between my brother and I, so there was a sort of role that needed fulfilling, which was another reason she was scared to tell us what happened. During this time my grandfather was abusing me by interrogating me about whether or not I was gay and forcing me in front of the mirror to pop my acne until I bled and the acne became infected. My pockmarks are much worse than they need to be and he reinforced a lifelong belief in my hideousness and I was made to go to therapy at the age of 10 to address my latent homosexual tendencies. What prompted his obsession, I do not know. I think he was scarred from when I wanted to be a girl for Halloween 3 years in a row from ages 3 to 6\n\nA few years after Move3 came Move4, but it at this point my mom considered losing contact with him to be futile. She would move further and further each time and he would constantly show up unannounced. At this point I'm in middle school, brother in high school. During this time my 15 year old brother kicked my stepfather out, so my grandfather was around much more often so he could pressure me intensely to be confirmed Catholic (our family is heavily Irish Catholic) This would eventually cause me to have a psychotic break later at 15 where I had religious delusions for a whole year.\n\nAround the time I finished high school my mom met my now stepmother and we moved 100 miles away. Which was perfect considering grandpa would have an accident that made it harder for him to want to drive on the highway ever again. The last time he saw my mother's face was at her wedding 15 years ago. I would say his presence tarnished it, but it was full of drag queens and LGBTQ+ folks so I like to think it was a difficult day for him (the man is a vicious bigot).\n\nThis is around when mom tells me about how he raped her when she was 26.  I'm 19 at this point and I have been conditioned to worship my grandfather. He was my father for all intents and purposes, more than any other man in my life. I was resistant and resentful. I was stupid. I buried what my mother told me and it created a rift between us that is since mended but it is one of my deepest regrets.\n\nMy *absolute deepest regret* is moving in with him. Move5 left me in a rural town with only a grocery store to work down the street and I had no car or license. TIP FOR YOUR KIDS: Do not let them get away with thinking they are better than working their way out of a situation, or that they won't be grateful to themselves for it. Anyway, I wanted to go to college and grandpa lived in Baltimore. He offered to let me stay and I told my mother I loved her but I couldn't get stuck in that town (I wasn't stuck, I was undisciplined and ignorant). I will never forget my mother's crying face as I left in *his* car. So I guess *that* is the last time he saw her. \n\nFrom 2012 onward I was living in Baltimore, going to school, working, partying and going on trips with friends. I was having a merry fucking time, and rent free to boot (undisciplined). Somewhere in the first 2 years I did mushrooms and I gained a bone-deep certainty of how awfully I had betrayed my mother. I called her and apologized for everything, begged for her forgiveness. I didn't have to, because she understood. Then she told me EVERYTHING EVERYTHING. Not just about her rape, but the vicious abuse of her 6 other siblings, the rape and physical assault of my grandmother, and the manslaughter. \n\n**Out of her 7 siblings, 2 brothers defended her (after the rape) initially. One said that grandpa was dead to him but reconnected only 3 years later. The other just plain acted like it didn't happen even though he was the one keeping grandpa at bay while we left the house. When my mom told her sisters, 2 were silent, one acknowledged that my mother was traumatized, and the one I hate the most said \"He must have been so lonely.\" The remaining 2 brothers kissed his feet like they always have without skipping a beat. They still do.**\n\n**My grandfather viciously beat every single one of his children. He beat and raped my grandmother, and put a gun to her head with his foot on her neck. An uncle tried to defend my grandmother with a bat, grandpa caught it mid-swing, and completely blackened my uncle's torso. He coerced a neighbor's wife to crawl across the floor to him to ask for a kiss in front of the neighborhood and *his own wife and children* at a party. He hit me and my brother for as long as he and I were too young to defend ourselves, at least until we acted like he wanted. He beat me for bleeding on the floor when I cut myself by mistake at age 3.  I was hit and screamed at if I cried. At age 5 I watched him choke my then 8 brother, like it was Bart and Homer, for correcting his math. He stalked my mother's friends and called them in the middle of the night to say disgusting shit. He then raped my mother for god knows fucking what when I was 5. I have no idea what else he's done to my aunts and uncles.**  \n  \nI'm suspicious that he did something to me too because I was absurdly sexually obsessive when I was 4 and 5. By obsessive I mean I cornered a girl when I was in kindergarten and tried to rip off her clothes while screaming \"You're mine\". Where did those instincts come from? How often do 5 year olds do that?  \n  \nSo I was drinking pretty heavily after what my mom told me, enough to keep me from being able to move out from my mom's rapist's house, and then I met my current partner in 2018. Like everyone I was with up til that point, I begged her not to be friendly with him and I told her why. She has some sort of hyperaltruistic reflex, plus her grandfather treats her like shit so she just made my grandpa her grandpa. After I begged her not to get close to him. He then exposed himself to her multiple times and whispered \"something disgusting\" into her ear that to this day she will not repeat. I know it wasn't age because when I confronted him on this, he never did it again. Between 2018 and 2023 I was basically killing myself with booze about this and a lot of things. 5 hospitalizations in 2023. \n\nMy mom confronted the one that said \"he must be so lonely\" and she said none of those things happened. My grandmother can corroborate however and has. \n\nI'm posting this, one, because apart from my partner, I have no one to talk to about it. I'm not looking for moral validation, I know how badly I hurt my mother and what it says about me. Grandpa is 91 now and I think it's fair to say most of who he was is gone. I don't forgive, I see it as irrelevant to who is now.  He's a scared husk that's been glued to a chair since 2008.  I tried so hard to be a changed person in sobriety got into the habit of hugging him and telling him I love him, but by the time I realized it makes me feel slimy, I couldn't afford to stop. My mom knows this and she is, according to her, at greater peace with everything than me.\n\nMy present disquiet comes from the constant thoughts like \"WHAT KIND OF BROTHERS AND SISTERS DON'T DO EVERYTHING IN THEIR POWER TO PROTECT THEIR SISTER? There were 7 of them and they left us for the wolf. There were 7 of them that never EVER let grandpop babysit their kids. WHY HUH? WHY CAN HE COME AROUND US AND NOT YOURS? Why are we the \"black sheep\"? Why did no one believe my mother after what they've been through?* I have an uncle that still tells me he has always loved me, he's my godfather and the sensible one and he has the fucking BALLS to ask me why mom doesn't talk to him anymore. \n\nLast year every single one of my mother's siblings gathered to celebrate his 90th birthday. *Two of my mother's sisters are sitting on his lap in a photo they took together.* The one that said \"he must have been so lonely\" is so pleased with herself in the photo. Recently she told me I was the favorite grandchild of his 9,000 grandchildren, and she looked like she's hated me for it for a while. I wasn't the *favorite*, I was a pressure point for a predator to make sure my mother could never get away.\n\nNone of these people have any idea that I know. Neither does grandpa. Neither do their children. They just think I'm a lazy alcoholic (part true). Been thinking about writing a book. But also I just needed this. If anyone can relate or just have some insight as to how in the fuck 7 siblings side with the incestuous predator and abuser. What's worse is how I've found this to be far less unique than I thought. I know more people than I would like that have relevant experience with men growing families as punching bags and sex objects. Every kid I see makes me worry for them, and I have a hard time seeing a father with their children and not have an immediate fear for the kids.\n\nTLDR; Seriously? Just kidding. Grandpa raped my mom and stalked her, my brother and I through life and I eventually ended up marooning myself in the same basement where he did all of the worst things you can do to a person while his children treat my mom with denial and even resentment.\n\nP.S.  \nMy mother is the strongest and happiest she's ever been and I love her and my stepmother so much. She has chronic illness and PTSD but she is creating all the time and excelling at her work. I've never been more proud of her. My brother is the same as he's always been, stoic and quiet about all of it in a way that scares me.\n\nP.P.S.  \nMy aunts and uncles have been snooping while I'm at work and leaving obvious signs they were in my fucking bedroom. Where I fucking sleep. If you are reading this, good. You should be fucking ashamed of yourself. You were all in your fucking thirties and were successful when you shielded her attacker. You had the resources to help your sister and put the man away. You chose her rapist over her. You're not the Christians you say you are, you're not good people, you're psychotic lowlifes whose kids don't really know them (some of them know, just not exactly *how* spineless and mindless *yet*). No wonder your daughter calls you by your first name like that. To the other, no wonder your daughter doesn't call you at all. For all of you, it is not close enough to karma that you have to literally wipe that man's ass now. You seemed like you would've jumped at the opportunity to *swallow* his shit at the rate you guys sided with him. Still thinking about that book.\n\nEDIT: For various grammatical/spelling errors and weird slashes. (I know still can't comma)",
    "subreddit": "TrueOffMyChest",
    "title": "I've been living with my abuser and my mother's rapist since 2012 and her 7 siblings protected him",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6cvlf/ive_been_living_with_my_abuser_and_my_mothers/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 01:10:16 UTC",
    "id": "1j6w2w8",
    "link_flair_text": null,
    "media": null,
    "num_comments": 20,
    "score": 158,
    "secure_media": null,
    "selftext": "He doesn't speak English very well, so communicating with him is a little challenging, but he's very sweet. For example, before we even started really interacting, he brought me napkins when I spilled something. Since then, we always say hello, how are you, etc. But I've always gotten the impression that he's self-conscious about... a lot of things. His scent is not ideal and, as I mentioned above, his English isn't great, and not everybody in the world is understanding about those things. \n\nToday, he seemed to feel more comfortable with me than ever before. He came over, said hello, and *sat down near me for the first time*. I tried to use Google Translate to communicate, but he needs glasses and couldn't read the text, so we just tried our best.\n\nIt was the most complex discussion we've had so far. We discussed politics! This is what he has to say on the current situation (I'm trying my best to remember precisely what he said):\n\n\"Politics... bad, bad things. Politics hurt people. Mexicans, woman, good people. Social Security? Medicaid?\" (I assume he was expressing worry about the continued existence of both programs.) \n\nI just wish I could speak Persian so we could understand each other better. It's clear that his life in America hasn't gone the way he must have hoped it would when he came here, and I'm extra worried about him now. \n\nAnyway, when he needed to leave, I gave him a big hug. I hope our interactions make him happy.",
    "subreddit": "TrueOffMyChest",
    "title": "I've formed a little bond with an elderly homeless man who frequents my favorite cafe",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6w2w8/ive_formed_a_little_bond_with_an_elderly_homeless/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 01:04:52 UTC",
    "id": "1j6vz7c",
    "link_flair_text": null,
    "media": null,
    "num_comments": 29,
    "score": 0,
    "secure_media": null,
    "selftext": "PERIOD BLOOD CONFESSIONS\n\nSo, I use a menstrual cup. I know I should be dumping the blood into the toilet and then rinsing the cup in the sink, but for some reason, my brain keeps going, Nah, let’s just pour it all straight down the sink.\n\nFast forward to me working on a group project at this guy’s house. I go to the bathroom, do my thing, and—shocker—the blood doesn’t just magically disappear down the drain. I’m guessing there were clots involved because suddenly, I’ve got a plumbing situation on my hands.\n\nCue me, hunched over his sink, desperately trying to shove my own blood down the drain like some kind of horror movie janitor. I must’ve been taking a while because I hear him call out, \"Everything okay?\" And I, covered in the sins of my uterus, just yell back, \"I’m fine! Thanks!\" while speedrunning my career as an emergency plumber.\n\nAfter what felt like an eternity, I finally got everything to go down, walked out, and casually told him, \"Sorry, I clogged your sink and had to fix it.\" He kind of laughs and goes, \"No worries, I'm just glad it was the sink and not the toilet!\"\n\nMeanwhile, I’m standing there, smiling, knowing full well that this man has no clue his sink was just fighting for its life against my period blood.",
    "subreddit": "TrueOffMyChest",
    "title": "Clogged this guy's toilet with my period blood 🩸",
    "upvote_ratio": 0.46,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6vz7c/clogged_this_guys_toilet_with_my_period_blood/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 01:00:02 UTC",
    "id": "1j6vvos",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "I have to get something off my chest, it's been bothering me for a while.\n\nDepartment of Children's Services (Australia) are the most incompetent, useless, stupid government agency I've ever had the displeasure of working with, whom I'm sure hire only the worst and dimmest of candidates and have fostered a culture of ineptitude and apathy throughout the system. \n\nI have nothing but complete and utter contempt for the department and their so called social workers, as I can say truthfully and without hyperbole or exaggeration that I have not seen them make a good call on a child or family situation in the 30 years I've been cursed with their association.\n\nI am a psych and behavioural analyst and run a disability and aged care support company in remote Queensland. I am involved with the department because I provide therapeutic placement for children with disabilities. My company, as best as I can tell, is one of the very few with capacity for kids with serious behaviours of concern, certainly the only one that I am aware of in my or any surrounding regions, judging by how far some kids come to be placed with us.\n\nThe ignorance on display from DoCs staff is breathtaking. They don't listen. They don't understand disability, which to be fair, I don't really expect them to, not really, but they just are not willing to learn. Somehow the decisions they make seem tailored to be cruel and hurtful to parents for no good reason and they are openly hostile and dismissive to families they have independently decided they don't like.\n\nVague examples for privacy:\n\nSingle mother with 5 month old baby. Has 2 other children in placement. Meetings for one occur in Town A. Meetings for the other occur in Town B. She lives in City C. The meetings are set for 8am for one, and 9am for the other.\nTown A is 90km (56mi) from City C, and Town B is 107km (66mi) from City C. Town B is 193km (119mi) from Town A.\nShe has no car, and relies entirely on public transport to get around. This is utterly impossible.\n\nThere is a department office 7 minutes from her house by bus.\nThey flat put refused to entertain the idea of having meetings at that office, or even just Zoom meetings. She had to attend in person. Every failure was used as evidence of inability to manage her time, and proof she shouldn't have her children.\n\nChild with serious behaviours of concern (violence, property destruction, suicide ideation) who was surrendered by family was placed with us on short notice because previous two placements claimed no capacity. (Probably because of the damages combined between the two of them). No behavioural plan was supplied, despite them having one and being requested for 7 weeks, in the end I had to go behind their backs and track down the practitioner that wrote it myself. DoCs *severely* downplayed the behaviours upon placement, and frankly if we weren't so good at our jobs and able to adjust so fast, serious harm absolutely could have happened due to the lack of accurate information provided. We got lucky those first few weeks.\n\nTheir sole focus is on reunification with the family. Their solution was to force them together every weekend. No support, no plan, just shove a violent individual in a house with a shellshocked family for 2 and a half days, the siblings of which actively (and with good reason) do not want them there, for a couple of days and hope for the best.\nWhen sexual assault claims were made by a sibling, DoCs *ignored it* and tried to push for the next weekend anyway. It took a call to Children's Safety who in turn made a stern call to DoCs for them to decide against that decision for a weekend.\n\nI sat with the case workers and supervisors and went through the complex disabilities and mental health issue for this individual and explained what realistically needed to happen for reunification. What to expect. A recommendation for steps to take moving forward. I thought it went well. A follow up meeting with the school a mere 2 hours later and the case worker said that a fidget spinner should keep them occupied for 4 hours and thus solve the school attendance issues.\nMoronic. No attention paid whatsoever. \n\nThey openly blame the parents, their lack of parenting for the issues. Stay at home dad, mum has a pretty unusual job that has her travel often but pays very well. They mock her in meetings, talking about how she's \"living her best life\" on \"holidays\" when she's away for a week, working.\n\nI am so frustrated. They are now looking at foster care options. Removal from a therapeutic placement where they have made real progress, (for example, nearly $100k in damages, zero school attendance between 2 placement over 3 months, compared to us where we have had maybe $500 in damages and school attendance every day at first with support and now independently between an hour and 4 hours and we have had them for 6 months) to be put with some unsuspecting and unqualified family for $700 a week. Absolute madness.\n\nI just want to scream into the void. The family is actively working with us, the school is actively working with us, but DoCs... DoCs don't give a shit. And they hold the cards. They claim they care, but when it comes to complex disability they actively ignore vital information and forge ahead like it was a typical kid, damn everyone else.\n\nSorry, I got a bit ranty. They just piss me off so much.",
    "subreddit": "TrueOffMyChest",
    "title": "I hate Children's Sevices",
    "upvote_ratio": 0.76,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6vvos/i_hate_childrens_sevices/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 00:54:53 UTC",
    "id": "1j6vs1y",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 1,
    "secure_media": null,
    "selftext": "basically what the title says. I've slowly lost sensitivity since we got married 4 years ago. I thought at first it was due to my depression, so I got therapy. Then, after overcoming depression, I was still experiencing very low/nonexistent libido, no sensitivity, nothing. It didn't matter if I was on my antidepressants or not, before, during, and after it was about the same. I used to be able to enjoy sex, and finish, but now I can't even remember the last time I finished at all. (No I'm not interested in masturbation, nor has that ever done anything to me). My husband has gotten mad at me over the years and accused me of being asexual or lesbian, which I don't think is the case because I KNOW I am sexually attracted to men and not women, and I've experienced normal sexual response cycles many times before, especially as a teen. I did save myself for marriage, if that makes any difference. I then thought, well maybe it's not my depression, maybe it's sexual trauma from seeing and hearing my parents doing it a lot after they always told me sex was bad? (religious upbringing) and so I went to a sex therapist, and she said she couldn't help me. I had another therapist after that who I really liked and helped with everything else in my life except my ability to enjoy sex/ have a sex repsonse cycle despite thoroughly discussing that topic and my traumatizing experiences as a child with my parents. I went to my primary care doctor and he basically told me there were no meds except one that costs $1000 a dose and only has a 10% chance of working. He did blood work on my hormone levels and those were all normal. so basically no one can help me and it leads to dissatisfaction on both sides of this relationship, and makes me so sad. I feel like I should just divorce my husband so he can find a functional woman who can have and enjoy sex with him :( ",
    "subreddit": "TrueOffMyChest",
    "title": "I (26f) can't feel sexual pleasure anymore and it's killing my relationship",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6vs1y/i_26f_cant_feel_sexual_pleasure_anymore_and_its/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 00:43:47 UTC",
    "id": "1j6vk3t",
    "link_flair_text": null,
    "media": null,
    "num_comments": 12,
    "score": 5,
    "secure_media": null,
    "selftext": "Like I do but like... Where do you go? What do you do? I'm extremely socially isolated and I really just don't know if that's ever gonna change. I don't know how to talk to people at all and it sounds simple but I dont even know how to be safe in public. I'm not expecting anything out of this I just want someone other than me or my parents to know I guess.",
    "subreddit": "TrueOffMyChest",
    "title": "I don't know how to leave the house",
    "upvote_ratio": 0.79,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6vk3t/i_dont_know_how_to_leave_the_house/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 00:39:59 UTC",
    "id": "1j6vhb2",
    "link_flair_text": null,
    "media": null,
    "num_comments": 10,
    "score": 3,
    "secure_media": null,
    "selftext": "I’m embarrassed to tell my loved ones about this guy bc I actually like him. Idk why. I’ve dated so many guys I didn’t really like and I pretended to like them and then I’d break up with them and everyone would be like what happened? And now that I just spent 6 hours with someone and I already want to see him again I don’t know how to tell anyone. I’m afraid I’ll jinx it or that they won’t believe me or that I won’t believe myself. I can’t even listen to music bc I feel like if I listen to a romantic song I’ll jinx it or talk myself out of it ",
    "subreddit": "TrueOffMyChest",
    "title": "I finally met someone I like and I don’t want to tell anyone",
    "upvote_ratio": 0.81,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6vhb2/i_finally_met_someone_i_like_and_i_dont_want_to/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-09 00:13:04 UTC",
    "id": "1j6uyfb",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "OK, so a bit of background. In college, I took a video journalism class as part of my major. As part of this, I got a tripod and a mobile phone mount for said tripod.\n\nFast-forward 4 years. I've graduated (December of 2022 to be exact) and am working full-time. I occasionally put my phone in the mount and set it on my bedside table to watch things in bed. this past week, the tripod mount broke. No problem, it's like $12. \n\nI ordered another one off Amazon. It was supposed to arrive yesterday. As you can probably guess from this post's title and the fact I'm even posting at all, it did not. It was delayed to Monday. I had it shipped to the rental office for my housing complex, which isn't open on weekends.\n\nNow, here's the thing, my friends: This alone wouldn't upset me enough to post this. It sucks, don't get me wrong, but these things do happen. However, Amazon showed that the package *was* out for delivery and the truck *was* in my neighborhood.\n\nJust needed to vent.",
    "subreddit": "TrueOffMyChest",
    "title": "The delivery for my mobile phone tripod mount got delayed.",
    "upvote_ratio": 0.2,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6uyfb/the_delivery_for_my_mobile_phone_tripod_mount_got/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 23:54:18 UTC",
    "id": "1j6ukus",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I don't even have any words to describe what's happening right now. I need advice ASAP.\n\nSo my friend (19F) is literally going in circles with same toxic people and she clearly doesn't see it! We have a friend group of five since high-school and she's always been the one who has the most other friends outside of the friend group, but we never minded. She has friends from other city and an on and off boyfriend (24M) who's literally the worst human I've ever seen. He's manipulative, controlling, alcoholic with anger issues and he controls who she is friends with, where is she, if she's drinking, etc. He constantly brings up her past before they met and holds it against her. When his friend started hitting on her he blamed HER!! They broke up two weeks ago and we literally celebrated because it felt final. She sent us a 13 minute recording, when they officially ended it, of him just cussing her out, screaming and calling her a slut who doesn't deserve love from anyone, even her parents. He also threatened to kill her dog. Her parents hated him (obviously) so he always talked bad about them.\n\nShe stopped texting us this week but we thought that she was just busy. But turns out she's BACK WITH HIM AGAIN AND THEY MOVED IN TOGETHER! What the hell!! I don't even know what to think. \n\nShe also forgave her ex (now current) best friend after she bad mouthed her and used her so she would buy her and their friends alcohol. Btw she's dating her boyfriends brother who's another jerk. It literally runs in their blood.\n\nI'm serious considering just going low contact with her because she clearly doesn't value our opinions on those horrible people and will ALWAYS choose them over us. I feel like crying from frustration every time I think about it. We have literally tried EVERYTHING to open her eyes. The worst part is that all of us others are at uni somewhere else and she's the only one who's living in our hometown so we can only call her (but she doesn't pick up often). And I'm so concerned and scared that she'll end up dead in the ditch. \n\nPlease I need advice. I'm at my wits end.",
    "subreddit": "TrueOffMyChest",
    "title": "I don't know how else to help by friend out of toxic environment, please give me advice.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6ukus/i_dont_know_how_else_to_help_by_friend_out_of/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 23:33:17 UTC",
    "id": "1j6u5dw",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 91,
    "score": 471,
    "secure_media": null,
    "selftext": "this is a throwaway because my family knows my main (also English isn't my 1st language so I apologize if there's any Spelling/grammar mistake)\n\ni genuinely don't know what to do or feel about this.i feel so alone and unsafe rn, im literally crying as I'm writing this. \n\nLast week, I woke up to my brother touching me inappropriately. We share the same room and bed, I felt his hands on me. I don't know why, but I stayed completely still. I could've stopped him, I could've yelled or pushed him away-but my brain just froze. I just lay there and took it.\n\nAfter about 5-10 minutes, I decided to \"fake waking up\" very slowly so he would stop. And he did.\n\nI felt disgusting. I wanted to tell my mom, but he's her favorite, and I was terrified she wouldn't believe me. So, I kept quiet and hoped it would never happen again.\n\ni decided not to and hopped he'd stop. I feel so gross whenever he would touch me during the day or even when he's in the same room as me. \nI just feel so icky about all of this.\n\nfor the next few days, nothing really happened, and I almost convinced myself it was over. But on the 3 days after that incident I felt it again. I woke up but didn't open my eyes, I felt numb and trapped. i wanted to cry, but I just lay there again, completely still, doing nothing to resist or stop him\n\nanyways,I went to school and was gonna told a friend about it but i got scared that they'll Tell everyone about it so i didn't. i didn't slept at my room that night (i slept at a friends house). i literally couldn't sleep that night, i remember my friend waking up because i was Crying and she asked me if im ok, i said yes and asked if we could watch a movie. i cried myself to sleep that night.\n\nSo nothing really happened after that and Really thought it was over. i was even sleeping in my room. \nI woke up to someone touching me again Today. So, 40 something minutes ago, i woke up to him touching me again. And just like before, I did nothing.\n\nI wanted to move, to scream, to do something. But my body wouldn’t listen. It was like my brain had shut down, leaving me frozen in place. so I just lay there, pretending to sleep, trying not to make a sound. and he eventually stopped.\n\nWhen he finally rolled over and pretended to sleep, I slowly turned away, pulling my blanket tighter around me. I wanted to cry, but the tears wouldn’t come. I just stared at the wall and stayed there for about 20mins and got up to write this. I don’t know what to do anymore. I don’t know how to make it stop.\nI just wish I could disappear. \n\nPLEASE give me advice on what to do. im literally crying rn because i couldn't defend myself. I just feel so icky about this\n\n\n\n\n\n**EDIT:**\nThank you so so much for the amount of advice you guys gave me and for reassuring me that freezing is a completely normal reaction to these kind of situations.\n\nim planning on asking my mom if i could maybe sleep in her room because im not \"comfortable w sleeping in the same room as my brother\" but im currently staying at my friends house to maybe just clear my thoughts about this whole situation.\n\nMany people are saying to \"Set up a camera and record the whole situation\" But im not gonna do that because i don't wanna experience that situation again.\n\nAlso just to clarify; no, i am not indian. i'm japanese. We live in a 2 bedroom apartment that's why me and my brother share the same room. My dad isn't with us anymore so it's just me, my mom and my little brother. the reason im scared to bring it up to her is because she always takes my little brother side and we just recently loss our father. i don't want to cause her even more pain by telling her my brother has been Groping me.\n\nI'll update you guys asap when i do finally bring it up to my mom. \nonce again, ty for the people who dm'd me and gave me advice on what to do. i really needed that ❤️",
    "subreddit": "TrueOffMyChest",
    "title": "I (15F) Woke up to my brother (13M) Touching me",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6u5dw/i_15f_woke_up_to_my_brother_13m_touching_me/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 23:21:26 UTC",
    "id": "1j6tw9e",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "hello! i hope im not going against any rules by posting this.   \ni intially wanted to post this to try and figure out how to turn this personal letter into an artistic creative thing that i can put out into the world, but for now, its just a letter that is true off my chest.\n\nthis is a letter i have sent a friend/lover that is very important to me. we have a weird, secretive relationship dynamic, somewhat of a situationship but much more communicative and relationshipy. its weird. the letter talks about it a little bit. the thing is, after he read it, he told me that the letter was personal, authentic, and very beautiful, that i should think about maybe doing something with it in the future-(creatively, he meant, we are both creative people, studied creative writing together, that’s how we met)  \n  \nanyways here’s the letter, keep in mind it is translated as it is originally in a different language:)\n\n”Hi \n\nthis letter contains things that are important to me that you know.\n\nEvery time I initiate a hang out with you to talk about things, I end up not saying everything I want to say, maybe because I forget, or feel better at that moment when I'm with you, and don't want to create a worse mood for either you or me again, /don't want to be a burden, so I end up not saying anything and end up regretting and getting upset when things don't work out between us.\n\nSo I want to take a moment here and write to you everything I can remember that I usually think and feel about us, and hope that with all the recoil you probably get from this letter, you can also take a moment of your time and read without too much pressure of responding quickly.\n\nI want to start by saying that you are a person who is very, very important to me. I have said it many times and I have no problem saying it again, simply because it is true: you are the first person that I have ever felt true, pure love. a feeling that I thought people invent in movies, that made me think it was not something that was even possible to feel. You made me feel it. It is real.\n\nYou know how sentimental and emotional I am, it is very easy for me to look at a picture of us from a month ago and feel nostalgic because I miss a specific day that I had a really nice time with you. Like for example on your birthday, when you invited me to sleep over at your place and told me that I was really cute and that you wanted to kiss me in front of everyone. These are things that are hard for me to forget and I hope I never forget because it makes my heart feel good. Sometimes I am completely reluctant to mention things like this or talk about it at all because the fact that I talk about it means that in moments like these have a lot of weight. It makes me very vulnerable and it's scary, I prefer not to mention any good moment we had, not to say I love you, not to say I miss something that happened two days ago, and that way if you don't say something nice back, I won't be offended by it, I won't think it's not mutual, I won't think I'm taking everything too personally and that for you I'm just another person to have fun with every now and then. even though i know if it was just fun it would have ended a long time ago for you. But I choose to say it anyway, because I want you to at least know how much good you can do, even if you don't mean to. I choose to get hurt a little every now and then.\n\nI think you are very talented You write in a way that is very impulsive, for better or worse. In the pieces you wrote, it is very clear that what you write comes from that moment deep inside, and it is not calculated, it is simply what is happening in your heart at that second, and you bring it out. Another talent you have is the way you get to know people. Something that I am very jealous of, but I feel I am lucky to experience it as a friend, and even learn from you. You ask bizarre questions that no one thinks to ask, go into strange depths, and we would sometimes laugh at you at that moment in class because it is really very funny that you ask things that no one thinks are interesting enough, but it is a trait that I appreciate very much. I think that I will move here in this letter between things that you might be flattered by and things that you have a chance of being offended by, It is important for me to point out that it is okay to be offended just as it is okay to be flattered by everything I write, but you should know that everything I write is things that I think and feel. There are no facts here. And there is not even a single intention to hurt.\n\nIf I could, I would write this in a letter and bring it to you physically, but right now we are after a not very pleasant interaction that was on through messages, as there is every now and then between us. And right now I am not in the mood to see you because I feel like I will cry and I will not be able to say anything coherent.\n\nMaybe I am too sensitive and take everything too hard. Maybe you love me but don't like me very much and sometimes try to hurt me. It could be both.\n\nSometimes I feel like you really want to hurt me. That you know exactly what combination of words will hurt me the most, and you choose them specifically. I don't think it's bad intentions. I think it's more of you trying to defend yourself. Maybe I say things that I think come out well, but they hurt you, and then you, who feel attacked, try to attack back, because that way you'll have the power, and you can hurt and leave. Sometimes we encounter a situation of unpleasant messages and at the peak you'll say something like you're gonna stop answering me, or something more cynical-passive aggressive to imply to me that you're not going to answer anymore no matter what I say. Sometimes I'm in a good mood, and after a conversation like that with you i get very sad in a restless way, like i have to talk it out. And when you cut off at the peak of this conversation, I have no way to explain anymore, no way to resolve, no way to do anything. All that's left for me is to sit with myself, with the feelings I have about myself, about how much I may have hurt you with the words I used incorrectly, about how much I want you to understand that I don't think such bad things about you. And to sit with myself, with the feelings I have for you, that with how much I love you, you are the person who most manages to hurt my most sensitive points.\n\nOnce in a conversation of this style, you managed to throw into the air that it would be better if we ended the relationship.\n\nAfter that, when we met and I mentioned it, you said that you said it in the heat of the moment, and that you didn't really mean it.\n\nI think you did mean it, just, at that moment. And then at some point when we managed to talk and get along again, you regretted meaning it. I think that both of these situations are correct, and that they don't necessarily contradict each other.\n\nSometimes I really have thoughts like, 'Wow, maybe I should really end this relationship.'\" Sometimes I feel like the relationship with you is doing me a lot more harm than good. Sometimes I feel like you hate me. Detest me. And maybe you stay in touch with me because it's easier than breaking up. And maybe that's true sometimes, I don't know. But I also don't think it necessarily contradicts other good feelings you might have for me sometimes. In any case, I can understand. There's not a single person in the world that I can say 100% that will never get on my nerves, accidentally hurt me, get tired of them. and I also told you, I think that if I spend enough time with anyone, at some point I'll want to not be around them. On the other hand, you're one of the only people I prioritize spending time with. And the only person I want to be around even if I'm very hurt and we're not at our best terms.\n\nI think something happened the day we started hooking up for the first time. That day I went out with you and a friend for a walk in the city, we went into your old school, the friend stayed outsid. we were left with just you, with the stories and experiences you had there, with all the nostalgia from there, and I was there, and listened to you, and I really enjoyed experiencing something sentimental with you. A big part of your life you spent there, and then I was there with you and somehow managed to be a small part of all of it. of you.\n\nLater that day, after we hooked up, when you walked me to the train, and we were both very nervous because we had arranged to meet the next day, but we were both afraid that suddenly we wouldn't want to meet again when the time came. Because we both had that similar problem. that weird avoidant way of dealing with life. And then the next day came, we still wanted to, and it happened, and it didn't exactly stop for a very long time.\n\nUsually when I want someone, as soon as they show interest in me back, I stop wanting them. It didn't happen with you. You shared your flaws with me and not only did I identify with a lot of them, but it only drew me in more. I really fell in love with a person, and not just an idea. I think that's why it's so easy for me to get hurt by you.\n\nI love you very much. The whole person that you are. I'm very attracted to you. Physically, emotionally, mentally. In just about every way.\n\nWhat you think of me, how you think of me, is very important to me. I really care about you and your opinions. Sometimes you say things about me, that you think I'm not intelligent, or things like that, I say very directly that these are things that hurt me. Insult me. You take it more lightly, and with a laugh, and with a certain detachment towards me and how I feel. I think you might have the feeling that you're above me in all sorts of ways. That you have more power over certain things. That your opinions are more important or true than mine. And that facts are perhaps more important or true than my feelings. Sometimes you are the most sensitive person in the world, looking for a hug, love, intimacy, making me laugh when I'm not feeling well. And sometimes you treat me as if you are a person who doesnt know how to be a friend. That you have no ability to understand or contain my difficulty, my feelings.\n\nI think a lot of it is also my fault. Every time I told you that you were crossing a certain line, that's all it was. I tell you that you're crossing a line, And that's it, there were no consequences beyond that. I say my piece, carry on as usual as always, and then it repeats itself. Again things are said, again I'm offended, again I don't want to talk to you again in my life, and then I come back to you the second there's a chance, because I want you in my life. It's like I'm giving up a lot of myself, so that I can feel good, sometimes, with you.\n\nI'll say something now that if it wasn't clear before, it can be very recoiling and disgusting to hear, at least for me- My relationship with you, and you, in general, is very addictive to me. I'm addicted to you. You feel like a drug to me and I can't find a better or worse way to say it, that's how it feels to me. When I'm with you and everything is good, everything is the best in the world. When it's bad, it's very bad.\n\nthere was another time, at some day, I was at your place I think a few days after we agreed not to sleep together anymore.- of course we met and slept together because how could we not): There was one moment, you put your head on my chest as if I were a pillow. we just sat like that in bed for an hour, cuddling, calm, comfortable, quiet, pleasant.\n\nWhy do I get so hung up on these moments?\n\nIt's like if I'm not bipolar enough on my own, there's another layer of bipolarity in our relationship.\n\nI remember especially at the beginning of this relationship, when I was at your place and I felt so nice and comfortable, I didn't want it to end simply because it was the peak of the day for me. The moment I had to go home, just being on the drive back home, alone, sleeping alone, suddenly that was the lowest point of my life.\n\nI've slept alone my whole life. Why does it feel so heavy now?\n\nIt's like craving you helped me survive a little longer, every time. And this is the most unhealthy thing I've ever experienced, and the most disgusting thing I've ever said. It's embarrassing to admit it at all, especially when I'm sure it's not mutual.\n\nFor a very long time I was emotionally dependent on you, like if you were in a good mood it would be great for me, but if you were feeling bad and would withdraw from the world, I could easily take it personally. Because when I'm in a bad mood, I still want to be near you. I still want to talk to you. And it's disgusting to me. Why is it different only with you? Why am I not interested in sleeping with anyone, except you? Why did I think for years that I wasn't interested in sex at all and that I could easily live without it, and then after I met you, I became a nymphomaniac? Why can I just say bye to people and leave without a hug, but with you this intimacy is so important to me? I don't even have one answer really I have no idea why it's like this\n\nOn the one hand I think, if I kept my distance from you, I would get used to being without you, it would have been hard at first, but little by little I would stop wanting anything like this with you, and then maybe I would be able to quit you. On the other hand, You're funny You love Why would I keep my distance just because it's a little hard sometimes?\n\nI'm in these dilemmas every now and then But I really don't want to lose touch with you\n\nSometimes I think you don't see or appreciate things I do for you, take me for granted. Why not, actually? you said so yourself, no matter when you text me, I will answer. if you need a favor, i will do it. if you want me to come to you and be with you, there will never be a situation in life where I will say no. I haven't given you a single reason to make you think that I'm not simply there whenever you need or want. So maybe it's my fault. Maybe I'm too accessible, not enough hard to get. and it's too convenient, it's easy to take it for granted, I don't know.\n\nMaybe you'll read all of this and think I'm a psycho, Tell me that you think it would be best and most worthwhile to end the relationship, and I'll understand from that, that you don't want anything to do with me, and I'll be offended, and we'll never talk again, and all that this relationship will be is some cute memories from time to time that are accompanied by a bad taste from how it ended.\n\nMaybe you'll read all of this and say nothing, pretend you never got it, maybe you'll even see that you got this letter, tell yourself wow this is really long I'll get to it someday, and forget about ever getting to it.\n\nMaybe you'll read this and tell me what you think and feel too. Share your side. Tell me that everything is okay, it's okay what I feel, it's okay that I'm an addicted psycho, and that I'm too important to you to lose touch with me over stupid things that can be solved in an instant with a little communication and the right mood.\n\nI don't know what you'll choose, but everything is legitimate and I'll understand in the end, even if not at that moment. I love you, I would be happy to talk whenever there is a problem, I just want us to really be able to talk.\n\nI am not here to apologize, and I do not demand any forgiveness from you, Whatever happened was. Do you want us to stay in touch? I would be very happy. Just please try to pay attention, appreciate me, respect boundaries. If situations arise where you feel that I am attacking you, that I am unpleasant, that I am unbearable, that I am repulsive, inconsiderate, offensive, - tell me. Let's talk about it. It doesn't have to be at that moment when you are at your wits' end, you can do it at any moment, but let's try to communicate more healthily and hug after that and be good please:)\n\ni love you”\n\nid like to know your thoughts about this. if it made anyone feel anything, or anythig like that.   \nafter he read this letter he has said that relates, understand, and he was the one to tell me to maybe do something creative about it in the future, i never even thought about it until he sais it, as it was a very personal thing that was meant for his eyes only.  \nthanks for reading:)",
    "subreddit": "TrueOffMyChest",
    "title": "i impulsively sent a personal letter to a situationship-friend. he told me i should do something with it?",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6tw9e/i_impulsively_sent_a_personal_letter_to_a/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 23:11:14 UTC",
    "id": "1j6toid",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 5,
    "secure_media": null,
    "selftext": "I try to connect with guys, and in the beginning, they act interested—texting me consistently, showing enthusiasm, and making me believe there's potential for something real. But after a while, they just stop responding, leaving me with no explanation. I’m tired of being ignored and blaming myself for their lack of accountability. If they’ve lost interest, why not just be upfront about it instead of leading me on and then vanishing without a word? Why even start a conversation, show interest, and build a connection if they never intended to follow through?\n\nI’m exhausted from meaningless situationships and the constant cycle of ghosting. It’s frustrating how people would rather disappear than have an honest conversation. A simple message saying, \"Hey, I don’t think this is working out,\" would take seconds, yet they choose to leave me confused and questioning what I did wrong. I’m done wasting my energy on people who don’t respect my time or feelings.\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "Why has ghosting become so normalized these days?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6toid/why_has_ghosting_become_so_normalized_these_days/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 23:08:21 UTC",
    "id": "1j6tmay",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 13,
    "secure_media": null,
    "selftext": "So I was diagnosed with Ovarian cancer in 2009. My life was pretty boring and the recession had just happened and couldn't seem to find a good job and I still lived at home. Boom I get cancer, such a surreal thing to have happen to you when you are a young adult out of college trying to make your way. Everyone and I mean EVERYONE came out of the woodwork giving me stuff, loving on me, etc and I adored staying in the hospital because I felt safe, taken care of, and honestly, other than the psychological stuff (losing all my hair) once I had the first surgery I wasn't in that much pain, tolerated chemo well, etc. I am in the middle after almost 16 years possibly facing the C word again but it isn't a for sure thing as there are other possibilities for my symptoms. I have seen my mother waste away and die from it so it isn't the cancer I want it is the break from life the permission to just be without guilt, time to bingewatch and get caught up on reading etc. Am I a bad person? I don't have Munchousens I would never do something to myself or fake an illness or even worse make someone else sick (by proxy) I just really need a break from life. ",
    "subreddit": "TrueOffMyChest",
    "title": "I feel guilty that I miss having cancer",
    "upvote_ratio": 0.86,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6tmay/i_feel_guilty_that_i_miss_having_cancer/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 22:51:36 UTC",
    "id": "1j6t9hf",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 3,
    "secure_media": null,
    "selftext": "I have a great memory of my past experiences, conversations, things I've read, etc, but I cannot for the life of my remember where I've physically placed keys, eye glasses, chapstick, that favorite shirt.  Sometimes I'll return from the grocery and 1 item (usually the one I needed the most) isn't in the bag!  It never ends.  \n\n A fantasy of mine about heaven is not about clouds, but that I'll be able to finally see where I lost those 500 items over my lifetime!  Last week I lost my car keys....in my house!  I have it on ring camera. ",
    "subreddit": "TrueOffMyChest",
    "title": "I lose more items around the house than any other human (daily)",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6t9hf/i_lose_more_items_around_the_house_than_any_other/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 22:46:17 UTC",
    "id": "1j6t5fl",
    "link_flair_text": null,
    "media": null,
    "num_comments": 28,
    "score": 15,
    "secure_media": null,
    "selftext": "My boyfriend and I have been together for 3months. Before we met he met a girl from a dating app; when we first met then he texted her information about us. Sometimes during dates he would text her constantly and tell me that she is lovey dovey with him saying “thank you for being the brother I never had.” She rejected him from dating app but suggested they be friends. I didn’t say anything initially but as we started getting serious I asked him to delete and stop talking to her. And he did. Fast forward to now, we have had some issues and almost broke up a couple of times. \n\nSome examples of problems include but not limited to incidences when we talk about the future plan and type of children we would have, he says they would have “chinky eyes” because it is a dominant gene. Or when I’m driving he always says “they are probably thinking why is that Chinese driving so terribly.” (I’m not even of Chinese descent btw). Or when I'm going to work and wearing a mask because I didn't want to get others sick, he would say that they would think “that Chinese is spreading covid” when confronted, he would say that he is only saying what the general population is thinking, and I shouldn't take it personally. \n\nRecently, I found that she texted him and they have been referring me as “chinita” (I’m Asian descent and they are Hispanic. Then they would talk about relationship life and sex life, as well as how her mother is doing (she is ill).\n\nWhen I confronted him why he kept saying “I don’t know why I texted back” and that there is nothing going on that is flirtatious. He is now crying profusely apologizing saying he loves me.\n\nIs this emotional cheating? \n\nUpdate 1: he keeps saying “I can’t lose you ur the love of my life I blocked her, and ur my wife”\n\nUpdate 2: he threatened to take his own life when I tried breaking up with him. ",
    "subreddit": "TrueOffMyChest",
    "title": "Emotional cheating?",
    "upvote_ratio": 0.85,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6t5fl/emotional_cheating/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 22:27:28 UTC",
    "id": "1j6sqzk",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I recently remembered an event from the past, and I haven’t been able to stop thinking about it. It happened a long time ago, so it’s possible that what I remember is not exactly what actually happened.\n\nA few years ago, in 2022, when I was 14, I was coming home from school with some friends when an idiot thought it would be funny to open my backpack and ring a doorbell without telling me. Immediately afterward, everyone started running. I quickly zipped up my backpack and, for some reason I don’t remember, I decided to cross the road to the other sidewalk instead of running forward. Maybe it was because there were too many people in front of me, making it difficult to run quickly—I don’t know. I really don’t remember.\n\nThe thing is, as soon as I stepped onto the road, an older man on a motorcycle appeared right in front of me, just a few meters away. I moved away as fast as I could and got back onto the sidewalk where I had been before. I think I remember the driver swerving a little when he got scared after seeing me (though I’m not entirely sure about this). I didn’t hear any noise that would suggest the man had fallen, nor did I hear a scream of pain—just a “¡Me cago en la madre!” (which roughly means “For f***’s sake!” in Spanish), which I believe means he kept driving (I think).\n\nThe problem is that I don’t know if I started running once I stepped back onto the sidewalk, which could have prevented me from noticing an accident if it happened. But it’s more likely that I stayed still after stepping away from the road—at least long enough that I would have noticed if anything had happened. I’m not sure what exactly happened in that moment. It all happened so fast, and it’s been a few years since then.\n\nWhen I saw the idiot who opened my backpack again, all he did was laugh. I guess he saw what happened in some way, and that’s why he made fun of me when we met again. Or maybe I told him about it, and then he started laughing—I don’t remember. I also seem to recall that I had two other friends behind me, on the other side of the road, and when they caught up with us, they were laughing too. If what I remember is correct, that would mean nothing actually happened.\n\nI got home feeling like an idiot, but at no point did I think I might have caused an accident. I’ve walked through that area dozens of times since then, and while I wasn’t specifically looking, I never noticed any signs that an accident had happened. I also searched online for news from that year in my city, and I didn’t find anything similar to what I experienced. I never heard anyone mention that day again, which reinforces my belief that nothing actually happened.\n\nI recently remembered this incident, and I think I’m becoming paranoid. I’m scared by the possibility that the man could have had a serious accident or that someone nearby might have been hurt, since it was a very busy area at that time, with lots of cars and many kids coming back from school. I’ve been really worried for the past few days, and I honestly feel bad about it.\n\nDo you think I’m just being paranoid? I need someone to reassure me—I’m a bit scared.",
    "subreddit": "TrueOffMyChest",
    "title": "Years ago, I had a close call with a motorcyclist. Now I can't stop worrying about it. Am I overthinking?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6sqzk/years_ago_i_had_a_close_call_with_a_motorcyclist/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 22:26:37 UTC",
    "id": "1j6sqct",
    "link_flair_text": null,
    "media": null,
    "num_comments": 9,
    "score": 16,
    "secure_media": null,
    "selftext": "People always say to “find a job you love” but honestly I think I just want a job that pays the bills and lets me enjoy my life outside of work. I don’t want to be obsessed with my career. I don’t want my identity to be tied to what I do for money. I just want to work, go home, and not think about it.\n\nIs that really so bad?",
    "subreddit": "TrueOffMyChest",
    "title": "I don’t think I actually want a dream job",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6sqct/i_dont_think_i_actually_want_a_dream_job/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 22:26:01 UTC",
    "id": "1j6spwd",
    "link_flair_text": null,
    "media": null,
    "num_comments": 13,
    "score": 51,
    "secure_media": null,
    "selftext": "It's been a while since I was on here. On Reddit . \nI had a pretty rough start of the years. \nBoyfriend cheated \nRoomate left our place without telling me. \nLost my friends \nHad to cut off some of my family.  \n\nSo I feel pretty isolated in all this. Anyway I received some good news. \n\nI was approved to follow a work/studies program. Which will allow me to go back to school while still being able to provide for my son and I. \nHe's almost 3 and I just want a better life for us mostly for him. I want to be a special need educator which allows me to work with kids having intellectual deficiencies. It's pretty common in my reservation and I wanna be able to help my community. \nI'll be graduating in a year\nAnd will be off to university by 2026-2027\nI'll be the first in my family to graduate university \nAll whole still being a mom.\n\nI was also approved for an apartment closer to school a d my son's daycare. I won't have to wake up at 4 am get my son ready and be out the door at 5:30. \nAnd hopefully get to work by 7. I take the bus in the morning sometimes I can't help but be late to work cause a bus is late or cancelled. \nI'll be able to do everything by walking.  \nThe landlord lowered the rent for me so instead of 1800$ I'll be paying around 1300$ per month.\n\nI am going to therapy this summer. \nMy older sister will be caring for my son for a whilee month while I work on myself. I went to therapy before but it wasn't as long and intense as the one I'll be going to.  It's 28 days in nature which I like. Everything will be paid off by the government. \n\nI am 21 years old. \nI've been on my own since I was 17. \nI felt like my life was going nowhere till I decided what I wanted to do. \nI can't wait for this new chapter of my life. One I can be proud of. One where my son and I will live struggle free. I am proud of myself. ",
    "subreddit": "TrueOffMyChest",
    "title": "I got good news but no friends to tell.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6spwd/i_got_good_news_but_no_friends_to_tell/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 22:23:31 UTC",
    "id": "1j6snyp",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 4,
    "score": 1,
    "secure_media": null,
    "selftext": "I’m a woman in my 60s who for the bulk of my adult life has been able to keep and cultivate good relationships with friends, family, and coworkers. I have suffered off and on with depression and anxiety that I felt was bad enough to seek treatment for since my mid 40s. I had no shame in admitting this as it was a difficult time for me given perimenopause, a stressful job, kids heading off to college, etc. \n\nThings really began unraveling for me about a year ago. I had gained a bunch of weight, felt like crap, was facing some unexpected backlash from my two adult kids whom I had raised alone and were each facing their own separate personal crises simultaneously, was helping my widowed, aging mother navigate life alone, and a second new and stronger wave of “ideology” was evolving.\n\nI started therapy for the first time in my life and leaned heavily into journaling out my feelings, as I have a love of writing and my therapist felt it would be helpful for me. I dove right in to a shadow work journal with writing prompts that ask you to relate negative thoughts and feelings you are having now to your childhood, in order to heal your inner child. I have written at length on my memories from early childhood and nothing came forward that I hadn’t pondered before, so no big revelations this time… except for my anger.\n\nAfter a year of processing these events, poking at my anger, examining every piece of it through the lens of this tired and wounded old woman, and having the entire world bursting into flames exponentially more every day, I am at my breaking point. In the past year I have lost my 3 friends to the above mentioned “ideology”, then most of my family, and now, because I am so sad and really suffering from the effects of anger about not only the abuse and neglect I experienced in my past, but the trauma of the problems my entire continent is facing, I’ve got my mother in my face telling me she doesn’t like how it makes her feel that consequences are happening as a result of her actions. Nobody is blaming her for anything, merely mentioning they are losing their job. Or that they are struggling mentally. Or that they’re boycotting hyper consumerism. Or that they’re scared. Or that they feel compelled now to join this movement or become anti-whatever to make a statement and support people who’ve been hurt. She doesn’t like feeling that feeling that comes up when she has to wonder if people actually know her leanings, and maybe even think her actions are causing harm to them. It’s her own thought process guilting her, and outing her at the same time. \n\nIt’s so hard telling this without using certain words that are crucial to the story, but hopefully I’ve avoided the flags that will get this story banned. \n\nNow, I find myself on the verge of lashing out at my 84 year old mother the next time she berates me (I see it coming) because I don’t know if I’ll be able to bite my tongue. I carried for 60 years the memory of her attempted suicide in front of me as a 3 year old, where just before losing consciousness, instructed me how to use a telephone to call for help. She doesn’t think I remember. I protected my mother from her own shame of her daughter carrying this secret knowledge all her life, while enduring beatings from her 2nd husband, repeated emotional betrayals from her, being called a slut every day of my teen life. I was shamed mercilessly for my own emotional problems growing up, and was told I’m not good enough constantly. My own suicidal thoughts at 13 were claimed by her as embarrassing, and would make her look bad. I was never allowed to feel my anger and it caused me to make some really poor choices regarding relationships in my life. \n\nWell that rage has come to life and I think if I express it the way it deserved to be expressed all along, it might kill her. \n\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "I am so close to unleashing on my elderly mother.",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6snyp/i_am_so_close_to_unleashing_on_my_elderly_mother/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 22:18:45 UTC",
    "id": "1j6skca",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I was raised by my grandma with my twin brother and I really only feel a connection with my brother, I’m always so short and bothered with my other family who is trying hard to be a part of my life but I hate to say it I feel like I don’t need them so I simply don’t think about them or want to be around them, even my grandma. My twin is the only one I care about and they can all tell, I know it breaks my moms heart when I’m so short and insincere but at this point that is my natural reaction and thought process. I don’t even think about my dad lmao. ",
    "subreddit": "TrueOffMyChest",
    "title": "I’m terrible to my mom",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6skca/im_terrible_to_my_mom/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 22:13:27 UTC",
    "id": "1j6sg52",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "(my english is not good please adjust) \nWhen I was 12,Actually i had a beautiful family, so I have been always grateful to God for my father and mother and I had a huge respect on my father but sometimes he use to be alcoholic but I didn't know that in that time. I loved my father more than anything and one day, usually me and my mother sleep on the bed and my dad and my brother sleeps on the floor, but on that day my dad was drunk , so he slept on the bed beside me and I was very asleep, in the midnight that's the time he put his hand inside my panties and touched the private part😭 i was just 12..I don't know what's happening then i wokeup because of the uncomfortable feeling and I started to ask for mom...and my mom asked me what happened but I never told her. I don't know what to do! I have never shared this incident with anyone. Is being drunk can be a valid excuse for his actions? Is he was in the sense and knows what he was actually doing? Because I have never consumed alcohol so I'm so confused. Anyone tell me please. And do you know what's even more worse? My parents are divorced now and my mother abandoned us and me and brother are growing with my father. It's really traumatic to me but after that day he never reapeated that. I'm so confused. I cannot talk to him properly give me a solution.\nMy mom abandoned us and my dad is an emotionaly unavailable dad, I feel very lonely please anyone reply🥺",
    "subreddit": "TrueOffMyChest",
    "title": "MY DAD TOUCHED MY INAPPROPRIATELY WHEN I WAS A CHILD",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6sg52/my_dad_touched_my_inappropriately_when_i_was_a/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 22:10:19 UTC",
    "id": "1j6sdqy",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 4,
    "secure_media": null,
    "selftext": "Me (21M) and my girlfriend (22F) have been together for 4 months now. After the first 2 months I started to notice and understand better all the things she has to deal with in her head, bad experiences in past relationships that affected her deeply and left her with traumas that are now being reflected in me just because we are in a long distance relationship and we can't see each other 24/7 and know what the other is doing or know entirely what is happening to us. Although she never saw a specialist or therapist to treat these problems (which she admitted to me was out of fear or pride), I always try to explain to her that right now it is impossible for me to be devotedly aware of her every second of the day, with my career, my activities, my friends and my own life in general. Every day I talk to her to accompany her in the little free time I have during the day and when I return home exhausted I also make sure to communicate with her and ask her about her day and if she would like to talk about something with me, in which most of the time her answers are \"I have nothing interesting to tell\". There are also times when a harmless joke I make unleashes hell where she gets offended at me and I need to reassure her of how much she means to me and how much i really love her, I apologize for upsetting her with something I said, to which she (apparently) accepts my apologies and (also apparently) everything is resolved. Last night I even went out with my guy friends to a bar after a hard week and all day long I let her know who I was with and what our plans were for the night, to which she ended up responding, as a way of throwing it in my face, that I will never be able to understand her and solve all the damage she suffered with me with a simple forgiveness, and acussed me of not caring about her and not being able to see things the way she sees them. That made me feel like like I'm worth absolutely nothing, like all the sincerely unconditional love I give her when we're together isn't worth it even in the slightest, that all the moments in which I was there to listen to her and understand her also meant nothing. I need honest and direct opinions on this. ",
    "subreddit": "TrueOffMyChest",
    "title": "My girlfriend's mental health struggles are draining me",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6sdqy/my_girlfriends_mental_health_struggles_are/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 22:02:55 UTC",
    "id": "1j6s7xk",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "Hi all, as the title says I feel like I'm stuck in a rutt recently having split with the ex in may of last year and now just constantly working and dealing with mental shit and I just rate need to just find a way to get out of it.",
    "subreddit": "TrueOffMyChest",
    "title": "Feel like I'm stuck in a rutt",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6s7xk/feel_like_im_stuck_in_a_rutt/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 21:46:33 UTC",
    "id": "1j6ruyf",
    "link_flair_text": null,
    "media": null,
    "num_comments": 10,
    "score": 15,
    "secure_media": null,
    "selftext": "He was 3 years old. Just a regular morning, nothing out of the ordinary. Come noon he started vomiting. I call the doctor immediately and he tells me I have nothing to worry about. I called every one hour when his symptoms got worse and he told me not to worry. My dog couldnt move, and he told me that catatonia is normal when facing such an infection, and that he should be up and about in the morning. 30 minutes later I watched him choke in front of my bare eyes and there was nothing I could do. Me and my gf rushed him to the hospital immediately and disregarded the orders from the vet, but it was too late. I dont know what to do, I dont know how to move on. I feel so numb. So Im over here on Reddit for advice, how does one learn to cope with such a loss? What helped you fellow redditors overcome this feeling of hopelessness? Any advice is welcome, please help me…",
    "subreddit": "TrueOffMyChest",
    "title": "My dog just died",
    "upvote_ratio": 0.8,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6ruyf/my_dog_just_died/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 21:38:14 UTC",
    "id": "1j6roh8",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "I’ve been thinking a lot about how cultural assimilation impacts opportunities, especially in the workplace. I was raised in a predominantly Caucasian church group in the Midwest/South, where my mom worked multiple jobs, and members of the church helped babysit me. Because of that environment, I never learned Spanish, and I became a native English speaker without an accent. My name and skin color make it obvious that I’m Hispanic, but everything else like my speech, my interests, even the way I present myself is very much in line with mainstream American culture.\n\nI never really thought much about this until I started noticing a pattern in my jobs. I’ve had no issue moving up. I’ve always been recognized for my abilities, and promotions have come naturally. But people I know people who are just as educated and capable tell me they’re being overlooked for management positions or even treated differently at work. Most of them have thick Hispanic accents, and many were raised in predominantly Hispanic communities, even if they were born here.\n\nI live in a primarily Caucasian area, and it’s become clear to me that how you present as Hispanic plays a massive role in workplace opportunities. Whitewashed Hispanics, whether they grew up like me or are half Hispanic with “white” first names, seem to have a much easier time getting ahead than first-generation or immigrant Hispanics who retain strong cultural ties.\n\nI don’t think this is talked about enough. People love to say that discrimination is just about race, but I think it’s also about how comfortable people feel with you. If you fit the dominant culture and don’t challenge their perception of what’s “normal,” you get a pass. If you don’t, you hit a wall.\n\nHas anyone else noticed this?",
    "subreddit": "TrueOffMyChest",
    "title": "I’m a culturally assimilated Hispanic, and I see more people struggling because they aren’t. Does assimilation really offer an advantage?",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6roh8/im_a_culturally_assimilated_hispanic_and_i_see/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 21:34:05 UTC",
    "id": "1j6rl5a",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "I (27) father of three lives alone with my three children. Thanksgiving month of last year the mother and I got into a heated argument which led to a back and forth (physically) the most I did was push her to get some space to walk away, because I truly don’t believe in hitting women( unless it’s life or death). Before that even happened, two days prior to this she was already putting her hands on me which led to a big bruise on my back. And a long scar going from my neck down to my back. Once I pushed her away from me she instantly called the cops and said I was the one being belligerent and she wanted me removed from the house. The police arrive and she!! Yes she showed them the camera footage of what had been going on and ofc she was deemed the main aggressor and was taken to jail. Once she got out “apparently” she has a court order to stay off of the property and to have no contact with me. Her name is still on the lease so she helps out by paying her half of the rent and once a week will ask if the kids need anything( she has a friend that reaches out for her). She currently has no where to live but she stays with a friend and still has her job as a nurse and is in school during the day. She gave me the option of getting a hotel room to get the kids because it’s going on four months since she has seen or talked to any of them. I thought the hotel option was a good idea and I even offered to pay for half the expenses. But it never happens because she either to busy with school and work. I would like too take her to court so she can at least help me by getting them and keeping them for a week. I have managed to do what I can with childcare and anything else the kids need so I can work my self and I have managed to do this alone. What do I need to do to get her to court so we can have our time with the kids individually? I understand she is in a situation but I shouldn’t have to suffer because of it. I hope this doesn’t sound bitter on my end but we are not together anymore so she is going to have to start riding her storms out alone now. Im not complaining about taking care of my kids because I love them dearly and I don’t find anything manly about complaining about something you helped bring into this world but I need a break some times and I’m only asking for a week.",
    "subreddit": "TrueOffMyChest",
    "title": "I don’t know what to do!! And I need advice",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6rl5a/i_dont_know_what_to_do_and_i_need_advice/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 21:19:11 UTC",
    "id": "1j6r9ab",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "     I was heavily bullied via social ostracism as a kid. It also didn’t help that I am very likely autistic and I have a very hard time picking up on unspoken social cues. I also grew up in a bit of a turbulent environment where speaking my mind often ended in punishment. Therefore, my own communication habits are not the healthiest - I tend to bottle things up for months and then crash and bedrot for days on end when it all becomes too much. But I have a best friend who I finally felt comfortable attempting more immediate, healthy communication with, and it’s blown up so badly that I’m almost wishing I’d just kept my mouth shut instead.\n\n     They’ve been getting really into a TV show for about 5 months now - which is great, and I’m truly happy for them. A lot of the time they’d send me voice notes about it, or we’d call and they’d end up talking about it to the point of apologizing for “overtaking the conversation,” and I’d always say they had nothing to be sorry for, because I love listening to my friends be happy about stuff. Genuinely, I do, and it was literally all fine up until last week.\n\n     After months of searching due to unemployment, I had a job interview lined up for the next day. Of course, I immediately texted my best friend, and they congratulated me and said they’d send me messages of encouragement before the interview. I thanked them, and then they immediately proceeded to talk about the show again. I didn’t think much of it and listened as always, because I enjoy it. \n\n     The interview day comes the next day, and it’s HECTIC - I was so busy that I was literally going from 5:30am to 5:30pm, and by the time I got home I was ready to crash. My interview was scheduled at 4, and they’d been texting me about the show prior to it, so I figured I’d get my messages soon. Well, long story short, they never came - I got home at about 5:30, immediately crashed and took a 2 hour nap, and then woke up to chat with them only to have another conversation about the show. Admittedly I didn’t feel great about it, but I thought it was just the lack of food and sleep talking, so I brushed it off.\n\n     Over the next few days, though, I noticed that sometimes the things I’d send them would just get liked and immediately moved on from in favor of talking about the show - eventually I realized that this wasn’t making me feel great, so I decided to ask them if we could maybe tone down the conversations about this show and explain how it made me feel. Sounds like a healthy way to communicate, right? Wrong.\n\n     As soon as I sent the message I realized how badly I fucked up. They were (rightfully) upset that I’d waited a week to tell them this and didn’t give them the opportunity to correct themselves in the moment, and for that I apologized - I genuinely thought a week wasn’t that much time, and it wasn’t something I was even mad at, just mildly upset. But then the whole conversation kept spiraling, and I literally feel sick at the way I made them feel. \n\n   I thought that I was avoiding bottling it up and actually doing the right thing because I was communicating a relatively minor (on my end) issue early on, but it turns out that by not saying anything immediately, I’ve basically reinforced their worst fears about themself. They’re now scared to talk too much to anyone about anything, and now any mention of the show makes them feel sick. They said they feel like a bad friend, and part of them feels lied to because I always said it was alright how much they talked about it - but it wasn’t a lie. It really was alright, the job interview was literally the only incident that made me feel not great about it. I kept apologizing because I never wanted them to feel like that around me, but they’re still really hurt and now we’ve been taking some space from each other for about four days now.\n\n     I feel sick. I feel like I ruined the one friendship where both of us felt safe to be ourselves. Even if we manage to move on from this, I know it’ll never be the same, and it’s all my fault - they’ll never talk to me again without worrying that they’re being “too much,” and that’s the one thing I never wanted them to worry about with me, because I know what it’s like to be “too much” for the people around you. \n\n     I wish I’d kept my stupid mouth shut. It was never even that big of a deal, I could’ve just dealt with it and bit my tongue, but of course the one time I feel like communicating is the right thing it just ruins everything. I hurt my best friend so bad and I didn’t even mean to, and now there’s nothing I can say or do to fix it. I thought I was finally doing things right, but it all just went wrong anyway, and now one of the people I care about the most is hurting because of me. The guilt is eating me alive, I’ve been crying ever since it all went down, and now I wish I’d never even said anything. ",
    "subreddit": "TrueOffMyChest",
    "title": "My one attempt at healthy communication ended horribly and I feel like the worst friend ever",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6r9ab/my_one_attempt_at_healthy_communication_ended/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 21:03:59 UTC",
    "id": "1j6qxcs",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "I can’t get over the guy I was in love with 3 god damn years ago and it makes me sick. \n\nSo I was never really in a relationship with this person, we actually never even hang out together. We met in 2022 and we had a friendship that you wish on everyone, but the friendship got stronger and so did our feelings. At first he started getting feelings, at the time it was not appropriate because I was still in a relationship. I broke things off so I could be with him, but when that happened he didn’t have the same feelings anymore and everything went downhill. I’m not gonna explain everything that happened in those 6 months, but I can say that nothing went back to how it was. \n\nBecause I was still in love with him when he basically ghosted me at the time, I never got the closure I needed (I think). And I begged him to let me stay in his live as friends, and now that I’m hearing myself I sound so stupid. After everything that happened in those 6 months we kissed etc. for like 2 more times and that made it even worse to get over him. \n\nLike I said we stayed friends and talk like 3 times a year (new years, birthdays and holidays). I even got a new amazing boyfriend whom I’ve been together with for almost 2 years, and who I really love and could see myself marrying one day. But I still think about him (the ex). \nLast week he even responded on a story I posted on Snapchat and we exchanged maybe 10 sentences. I wake up the next day and he deleted me from snap. I would like to think his new gf made him do it, because it would honestly hurt more if he did it himself. \n\nSo now 1 week later and everyday I’m thinking about it and everything that happened almost 3 fk years ago. \n\nSo my question Reddit users is why can’t I get over him? Why can’t I get over the memories that we made? Why not after everything this person has put me through?\n\nEnglish is not my first language so I’m sorry for my grammar. \n\nSide note, 1,5 years ago he moved to another city so I haven’t seen him in 1 year. And I see him maybe once I year now. I was supposed to see him last week, but he couldn’t come…",
    "subreddit": "TrueOffMyChest",
    "title": "I can’t get over my ex",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6qxcs/i_cant_get_over_my_ex/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 20:57:18 UTC",
    "id": "1j6qs0c",
    "link_flair_text": null,
    "media": null,
    "num_comments": 8,
    "score": 66,
    "secure_media": null,
    "selftext": "I was born in the very early 90's so I got to experience the internet from like ~2001 and on. I grew up as a teenager on the internet in the mid 2000-2010 and I fucking miss it.  \n\n\nJumping on the home computer to go on the internet used to be like a little adventure. You never knew what you'd see. Sites like Newgrounds were full of creative, fun, and dirty content that you had to look over your shoulder to make sure mom wasn't coming up the stairs.   \n \n\n\nBest of all, people made creative content for fun/community/respect not just for money. Sure clickbait existed back then, but not EVERYTHING was a thinly veiled perverted attempt to extract money or data from you. \n\n\nBest of all, the internet didn't follow you around everywhere. When you left the computer, you left the internet.   \n\n\nI loved the lawlessness. I loved the freedom. I miss forums, and while they still exist in some niches, they've been annihilated by Facebook groups. ",
    "subreddit": "TrueOffMyChest",
    "title": "I miss the old internet, pre-Facebook",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6qs0c/i_miss_the_old_internet_prefacebook/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 20:54:39 UTC",
    "id": "1j6qpyr",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 5,
    "secure_media": null,
    "selftext": "",
    "subreddit": "TrueOffMyChest",
    "title": "I want to be judged, based on my past actions and faults",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6qpyr/i_want_to_be_judged_based_on_my_past_actions_and/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 20:54:35 UTC",
    "id": "1j6qpxd",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "I've been going through a really tough time lately. My dad is sick, my brother is still in college, and we're drowning in debt. I’ve been trying to support them as best as I can, but recently, I lost my job. Now, I’m struggling to find another one, and everything feels like it’s falling apart. \n\nBills are piling up, food is running low that could last only for 3 days, and I can’t see a way out. It feels like I’m carrying the weight of it all, and my anxiety and depression are getting worse. Sometimes, I just feel like running away, changing my name, and starting fresh somewhere far away where none of this can follow me. But at the same time, I love my family, and I feel guilty even thinking like this. 😭\n\nWe tried asking for help to our local government but our letter was set aside due to other “important events” I don’t know what to do anymore. I just feel so trapped and exhausted. I’m avoiding negative thoughts as much as possible but my body and soul is really tired of this all. ",
    "subreddit": "TrueOffMyChest",
    "title": "Feeling Overwhelmed and Wanting to Run Away",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6qpxd/feeling_overwhelmed_and_wanting_to_run_away/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 20:47:15 UTC",
    "id": "1j6qkav",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 6,
    "secure_media": null,
    "selftext": "Hello everyone. I am writing this in hopes to get it off my chest no matter how familiar or boring the subject may be. \n\nI am a 24yo woman, I am a student, currently unemployed and I live with my boyfriend. I consider myself a normal person, nothing out of the ordinary in my life or in my character. I am healthy, i have hobbies, i have friends and normal healthy relationships, and nothing in my life is out of line. \n\nI am giving this info because the story concerns my father’s behaviour towards me basically since i was 11yo. \n\nHe has always been the provider for our family ( my mom, sister, dad and i ). \nThe problem in my story is his character and his behaviour towards everyone in his life ( i mean family and close ones ). \nSince I was a little girl he has always used derogatory language with me and my mom. He has fits of rage every day and shouts at us and mostly her because i do not live there anymore. Name calling of all sorts for no reason. \n\nI will give an example - once i was going out for a walk and i took a bottle of water with me (1L), small bottle nothing insane. He saw it and started screaming at me every offensive word you can think of. He said no person in his right mind takes water outside on a walk. \nAnother example - he screamed at my mom and the didn’t speak to her a whole week because HE forgot his lunch on his way out. Apparently she needs to be there every second and remind him to even blink. \n\nHe is the same with my sister and his parents( my grandparents). \n\nNo one in my family has ever talked to him about this and they are enablers to his behaviour. \n\nFor the years that I spent living with them, when he would get home from work I would stay in my room and not even go to the bathroom for hours even if i needed to just because to get to the bathroom you have to go through the living room and that is where he watched tv and spent the evenings. \n\nOver the years i developed severe anxiety, low self esteem, binge eating disorder and many more characteristics and conditions that make my life miserable. \n\nThe binge eating disorder came because all my life he would call me fat and huge and enormously big ( I have always been 50-55kg at 1.65cm height, i work out at the gym and have been a runner for a few years, so yeah I am slim and have even been very skinny for some time ) \n\nSo, this person with his insane behaviour has long ago lost my respect and fondness of him. Although until now i have been silent.\n\nToday, at dinner i couldn’t take it anymore. For months i’ve been having dreams of him screaming at me and while asleep I felt the hatred in my heart. So today, he started to insult me again and I didn’t stay silent this time. I told him that respect has to be earned and he doesn’t have mine because of all the years of name calling and treating me like garbage. He was stunt and said that i don’t have a father anymore. To be honest, i’ve felt like that since i was 11. \n\nEven though it hurt him, he can’t begin to imagine the pain i’ve been feeling for years.\n\nI can’t stop crying because of the words I said but I know I had to say them at some point in my life to free myself and defend myself. \nI feel pity for him and nothing else. I am sorry that he is the way he is because it can only end badly for him. \n\nI am proud I defended myself for the first time but I will always be in pain because he’s been brought up to be the person he is. He is incapable of change and I am sorry for him. \n",
    "subreddit": "TrueOffMyChest",
    "title": "I stood up to my father who treats me like garbage.",
    "upvote_ratio": 0.88,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6qkav/i_stood_up_to_my_father_who_treats_me_like_garbage/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 20:34:52 UTC",
    "id": "1j6qas5",
    "link_flair_text": null,
    "media": null,
    "num_comments": 22,
    "score": 43,
    "secure_media": null,
    "selftext": "Basically title. My cousin lost his fight with cancer this week and the funeral was this morning. His side of the family is very religious and I tend to work best when religion and I give each other a wide berth. I understand that for religious people there is comfort in hearing scripture at a funeral and I am fine with some readings. Unfortunately the pastor for my cousins funeral saw it as an opportunity to give a full fire and brimstone sermon and a similar thing happened at my grand father’s funeral last year. It was a full blown transphobic rant at my grandpas funeral. I’m tired of funerals in general and there’s been too much death in my family the last few years so that’s probably a contributing factor to my annoyance. Anyway rant over just had to get that out. ",
    "subreddit": "TrueOffMyChest",
    "title": "I’m so tired of preachers using funerals as opportunities to convert people.",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6qas5/im_so_tired_of_preachers_using_funerals_as/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 20:30:45 UTC",
    "id": "1j6q7k9",
    "link_flair_text": null,
    "media": null,
    "num_comments": 8,
    "score": 0,
    "secure_media": null,
    "selftext": "I hate when someone is describing someone’s bad situation and they say, “imagine if you were in their position” as a way of getting sympathy. I wouldn’t put myself in a bad situation in the first place. You see this with single moms a lot. A single mom will talk about how bad her life is and how she’s works all the time and it’s never enough money. Well, she put her self in that situation. No one forced her to have kids. Or you see this with people who work undesirable jobs. They chose that life in one way or another. ",
    "subreddit": "TrueOffMyChest",
    "title": "Saying “what if you were in their position” hoping to get sympathy about someone’s bad situation is invalid",
    "upvote_ratio": 0.23,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6q7k9/saying_what_if_you_were_in_their_position_hoping/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 20:19:25 UTC",
    "id": "1j6pyo0",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 10,
    "score": 10,
    "secure_media": null,
    "selftext": "I was walking home from school, this was the 90s so we were all just walking around freely for miles, and passed by the same neighborhoods I always passed. There was this one small house on the left side of the road and coming up on it, I could hear splitting noises like someone was being hit but I think I couldn't believe it until I actually got close enough. There was this guy, 20s maybe both of them, standing over his wife or girlfriend on the front lawn, she was lying down on her side and had her arm stretched out. Then as I walked by slowly, unable to stop for some reason, he started beating and slapping her and grabbing her by the hair and yanking her towards the house. He also kicked her multiple times. I think he might have called her Alicia. But the eerie thing was that she was surprisingly quiet about it, not like crazy screaming, but just like, please stop! You would think she'd be screaming and crying out for help or something. I remember that I was just walking in horror, the guy didn't seem to notice me or if he did, he didn't care. I couldn't stop and I couldn't stop looking at them. I think I was trying to figure out what street I was on but I had never thought to memorize the alley way streets so I didn't know. The whole scene moved in slow motion but I still remember the entire beating, the sounds, the sounds of grass scraping, the shape of his hands. Just broad daylight at 3pm on a weekday, front lawn, no one else on the street but them and me, springtime.\n\nI ran home in tears and told my mom who just told me not to get involved. When I tried to tell her that I think he was going to kill her, she asked me what street and address this happened because if we report it, I'll have to know all these things. I had no idea, so again, she told me to mind my own business.\n\nI was 10 or so when this happened and I'm in my 30s now. I still have the exact same fantasy memory of having gone back in time and instead of walking away and running away from the scene, I get in between them and save her somehow. If not save, but at least make such a fuss that someone calls the cops. It's always the same thing - that I don't care if I get hurt in the process, I would have done the brave thing. Instead of what I actually did... just run away in literal horror. I feel so haunted by this scene. I don't think I'll ever forget it for the rest of my life, honestly.",
    "subreddit": "TrueOffMyChest",
    "title": "I witnessed domestic violence and didn't do anything about it",
    "upvote_ratio": 0.86,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6pyo0/i_witnessed_domestic_violence_and_didnt_do/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 20:16:48 UTC",
    "id": "1j6pwmy",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 94,
    "score": 290,
    "secure_media": null,
    "selftext": "Recently my sister got engaged, and she asked me to be a part of her bridal party. Initially I was very excited to have a role in her wedding, kind of still am, but now I'm feeling iffy because she invited our brother, who I don’t have a positive relationship with.\n\nFor context, I’m the youngest out of the three of us and we were raised by a single mother who worked a lot. Because of this, my sister took a lot of responsibility over us when our mother couldn’t. She’s like a second mother to me and my brother even though she shouldn’t have been. My brother, on the other hand, was kind of a weirdo growing up. He dressed alternatively and had “nerdy” interests, something that younger-me at the time thought was really cool, and was all around awkward.\n\nI was maybe 8 and he was 14 when he started getting curious with his body, and that eventually led to him sexually assaulting me. It didn’t happen for long, thank god, but the experience left a disgusting stain on me. Eventually I realized that what had happened to me was wrong, and it wasn't until I was 13 that I finally had the chance and courage to talk to someone.\n\nI was removed from my home and placed in a children’s psych unit, and my case was being handled by a social worker. Of course, they informed my mother, who then told a few others, my sister included. I didn’t know this at the time, but some of the adults around her pressured her into convincing me to recant my statement. So when she visited me, she asked me to do just that. I was obviously so betrayed and angry, she was my role model and the one person I relied on the most at the time. I can’t recall the rest of our conversation, I just remember leaving the visitation area and completely losing it in my room.\n\nBut I was young, impressional, and ruminating a lot at this time, so I did end up recanting my statement. My case worker didn’t agree with my decision but respected it anyway. For the sake of procedure, my case was still investigated, but without the victim’s statement it fell through. It didn’t erase anything that happened to me, but it felt like it did with how everyone else around me went about their lives like nothing happened. It was jarring and fucked with my head, and I slowly started believing that I made the whole thing up for attention. My memory wasn’t the best, and it could’ve just been a messed up dream I had. I started feeling disgusted and I couldn’t trust myself anymore, and I began spiraling.\n\nFastward to when I was 17, I was hospitalized for almost taking my life. For some reason, this was much more serious than before. I was finally put on medication and was put into a program for other at-risk teens. It was through group therapy I started thinking about getting closure for myself, so after a lot of mental and emotional preparation, I confronted my brother. At the last minute I decided to record the conversation without him knowing, and I actually got a confession. I went to my social worker, and after a few days he was removed from the house.\n\nAfter that, I was both relieved and stressed by the events that came next. To be honest I didn’t follow too closely with the court proceedings, I couldn’t bring myself to care what happened to him, all I remember was being interviewed by SVU and getting monthly check ups by social services. But the whole ordeal was mentally and emotionally draining for me and my family. My mom couldn’t believe it at first, and briefly experienced religious psychosis, but no one took it harder than my sister. I guess she felt guilty, because 1) such a serious thing happened between two of her siblings right under her nose, and 2) she didn’t have my back when I first came forward about it. I don’t blame her, or anyone really, for not noticing what was happening. I can’t bring myself to blame anyone, no one wants to believe that someone you love is capable of something as horrible as sexual assault.\n\nA few years have passed since then, and I’ve been working on improving my mental health. My sister was my rock throughout the process, the most understanding of me and my circumstances, and after a while I thought I had made peace with the whole situation, until her wedding. My sister’s decision to invite our brother, after years of no-contact between the two of us, kind of blindsided me. Not because I didn’t expect her to, but because she didn’t tell me. Now here’s the thing, I would never ask my sister to choose between me or our brother. I understand that she loves the both of us despite what had happened, so to ask her to do that wouldn’t be fair. But I would’ve liked a heads-up. I had to ask her myself if he was coming, and I’m glad I did. The thought of walking into the venue and seeing him in the crowd without warning would’ve sent me into a panic.\n\nAnd because of this I started to rethink my relationship with her. She’s done a lot for me, and I’ll go as far as to say that she has a bigger impact on me than our mother does. I want to give her some grace for this, but I still feel so uncomfortable with his presence. He’s also still in good standing with our extended family, who don’t know of the situation, so the possibility of them joking around and having fun with him without knowing what he’s done doesn’t sit right with me.\n\nI most likely won’t do anything regarding my sister’s wedding because I don’t want to ruin her big day, but it’ll probably change the way I see her. Like I said, I won’t ask her to choose between me or him, but that doesn’t mean I can’t. It’s a scary realization that my relationship with my sister can change, I really don’t want it to, but I can’t ignore how she’s willing to look past what our brother has done to me when I haven’t. I want to start by having a proper conversation with her about this first though, after the wedding. I want to fully understand her side of the story and her perspective before making this big decision.\n\nI honestly don’t know what to expect or hope for, but I feel like if I don’t do something then all the improvement I’ve made will come undone and I don’t think I’ll recover this time.\n",
    "subreddit": "TrueOffMyChest",
    "title": "My sister invited our brother to her wedding, even though she knows how I feel about him",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6pwmy/my_sister_invited_our_brother_to_her_wedding_even/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 20:00:55 UTC",
    "id": "1j6pk4i",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 2,
    "score": 6,
    "secure_media": null,
    "selftext": "My (F20) oldest brother (OB, M31) is an abusive misogynist. He genuinely thinks that women - his girlfriend, his wife, his mom, doesn't matter - should be beaten and/or be physically intimidated when he has any (even the smallest) disagreement. He was kicked out of the military for beating his wife (he somehow got honorable discharge from what my mom says). My mom also has video evidence on OB practically dragging his girlfriends down the stairs in front of her children (my brother *only* went after single moms)\n\nWith that said, let's get into the main reason I'm scared for this child. I recently found out my OB is a child predator and that the reason OB was kicked out at ~14 (almost 15) wasn't because of no reason. It was because my mom walked in on us with our pants down in my closet when I was 4. 3 years later, OB got my name tattooed on his arm. I don't really remember it that well because I had pushed the memory deep down in the back of my mind because I thought it was my fault. I remember thinking \"all I have to do is push it all the way back, behind the wall, into my subconscious\" because I heard that's how other's got rid of the bad feelings or bad memories (I think it's because I heard that there was 2 sides of the brain). I remember thinking, \"Why didn't I just say 'no'?\".\n\nIt wasn't until years later (OB had moved back into our house) when I noticed weird things OB would do (like how I mentioned he only goes after single moms or moms who recently left an abusive relationship,  only for them to leave OB because \"I never wanted my children to be put back into that situation, luckily the Girlfriend he practically dragged down the stairs has a new boyfriend who said \"I'll make sure he doesn't goes anywhere near my family again\"). I would notice things like how OB treated me like OB would his girlfriends or how OB would stare at my chest or at me in a weird way like a dog would a squirrel (or almost like how they describe jaws eyes) but I thought I was just being crazy. Then OB offered my underaged friend alcohol if she got into his car and went on a drive with OB (to nowhere is particular). \n\nAfter a couple of years, OB was kicked out again for trying to beat my dad for telling OB to stop yelling at my mom about how *OB* crashed his car while drunk and the entire time, the way OB was talking to her it sounded like he was trying to blame her or the mechanic who fixed his car (my mom said the next day OB went back to the mechanic and yelled at him, then OB got upset that *the best mechanic who worked there wouldn't fix his car and told him to go somewhere else*). And, then as soon as she raised her voice above him to get him to stop screaming and yelling, he immediately started the crocodile tears. The story OB told us was actually ridiculous, OB apparently hit a boulder in the middle of the road and swerved (?) off the road into a ditch.\n\nMy parents visited the crash site of where the supposed boulder was, and all they found were swerve marks to a ditch. As for the road, it looked completely fine for a road that had a boulder land on it a couple hour prior (we live in a part of America where the roads don't get that much maintenance and when we do, it's noticeable and definitely lasts longer than a day)\n\nAfter a little while, the whole p diddy thing came out, and something about it made me snap, and I kept thinking about predators and how they are disgusting creatures. (At the time, I had recently bought some shrooms bars from a local store.) The more I thought of the p diddy situation, the more the memories of my own molestation started coming back. I started getting angry a lot, and eventually, I told my mom. \n\nShe said that when she found us, she didn't think anything had happened yet and that OB was just about to do something. I asked her why she didn't call the police because OB would have still attempted to molested a 4 year old child. She said it was because of my dad's crazy ex-wife. \n\nSometimes, I wish I could go back in time and stop it. I was littarly just playing with my toys before OB came home from school and immediately ran to me like I was present under a christmas tree. I still remember the conversation we had.\n\nOB: (he said something along the lines of) \"we should take off our pants or something about a game\" (I wasn't really paying attention when he initially walked in because I was focused on my toys)\n\nMe: \"But, why?\"\n\nOB: \"Because I want to show you something.\"\n\nMe: starts to take off pants\n\nOB: \"If you kiss mine, I'll kiss yours\"\n\nMe: (senses something is off and starting to get scared): \"but why? I don't want to\"\n\nOB: \"it's not scary, see.\" (does what you think he said he would, I genuinely feel sick thinking about it)\nThen I geuss he heard my mom or he had locked the door. \n\nOB: \"You need to get your pants on, she's not supposed to see us\"\n\nThen my mom walked in and stopped when she ws my still trying to button and zip up my pants\nMom: \".......... what.... what..the Fuck.... (then she started yelling at OB) WHAT THE FUCK WERE YOU DOING TO HER (then, she grabbed him and pulled him out of the room)\n\nI don't really remember much after that, but I do remember the couple of times I would think about it and get a disgusting feeling or like shame before I had successfully pushed it down. Now, I don't know what to do, it's not exactly like I can go to the police and get justice when it was a long time ago and there is no actual proof the court would listen to. My family has cut him off though, which is good because I was scared of what OB would do if OB moved in with my nana and papa (they're 80 and my aunts have mobility problems, the only person who would be able to defend them is my uncle, who isn't exactly the athletic type and is much older than OB)\n\nEdit: I fixed the spelling and grammar mistakes \n",
    "subreddit": "TrueOffMyChest",
    "title": "I recently found out my abusive brother might have a baby",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6pk4i/i_recently_found_out_my_abusive_brother_might/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 19:43:01 UTC",
    "id": "1j6p60o",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "I used to talk to myself a lot, especially when I was a kid. If I wasn’t talking that meant something was wrong, but I’d usually go back to talking. \n\nSomething awful happened that was entirely my fault and since that point I don’t speak much anymore. I don’t want to. I only speak if I can’t figure out how to stay silent. It’s been like this for almost two weeks now. I don’t see any signs I’ll start talking  like I used to again. \n\nAs I’m writing this I haven’t spoken in nearly 24 hours. It’s actually harder to speak now. I was quiet to begin with but it’s gotten worse. To be completely honest I don’t care about it all that much. People find others who talk to themselves to be weird or crazy anyways so honestly this is an improvement. \n\nI wonder if I’ll lose my voice completely and then I really can’t talk anymore. That would be both interesting and scary. I wonder if that’ll happen with my face too. I stopped looking at my reflection along with not talking. Idk why, I just did. I actually like it. Everything feels like a first person game. \n",
    "subreddit": "TrueOffMyChest",
    "title": "I don’t like talking anymore",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6p60o/i_dont_like_talking_anymore/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 19:42:50 UTC",
    "id": "1j6p5vd",
    "link_flair_text": null,
    "media": null,
    "num_comments": 9,
    "score": 8,
    "secure_media": null,
    "selftext": "Hello. I just came to get this off my chest because I can't take it anymore. English is not my first language.\n\nThree years ago, I adopted a stray puppy. After having him at home for five days, I realized he had parvovirus, so I had to hospitalize him for ten days. It was a miracle that he survived, and after that, he had to stay home for two months without going outside, as recommended by the vet.\n\nThe first time I took him out, I noticed he was terrified of absolutely everything—noises, cars, other animals, people, but especially men. It took a lot of effort to get him comfortable going on walks. We took it slowly, and after a year, I managed to take him to the dog park.\n\nNow, my dog is three years old, and for the past three months, his condition has worsened. He only wants to go to the bathroom once a day, around midnight, when no one is on the street. I live in the city center, which is always busy and noisy (for various reasons I just can't afford to move to the country side). Every day is a struggle. He prefers to go inside the house to avoid going outside. He trembles and cries. If visitors come over, he hides and shakes the entire time. The only time he is happy is when it's just me, my partner, and him at home.\n\nSeeing him like this breaks my heart, and on top of that, no one wants to take care of him—not even paid services or dog daycare centers because of his condition. I took him to a specialist ethologist, tried medications, relaxants, and behavioral exercises, but nothing has improved.\n\nSometimes, I think about giving him to someone with a huge field where he could run and be happy, but at the same time, I don’t want to let him go. It feels wrong—no one will take care of him like I do, no one will love him like I do. What if he misses me? What if he feels abandoned?\n\nEvery day, I suffer for him and blame myself for not being a better owner.\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "I want to give away my dog and it kills me",
    "upvote_ratio": 0.83,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6p5vd/i_want_to_give_away_my_dog_and_it_kills_me/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 19:31:21 UTC",
    "id": "1j6owam",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 5,
    "secure_media": null,
    "selftext": "**Me and the Past: A Meeting with My Old Self**\n\nI turned on my old device from 11 years ago and listened to my old voice recordings. I broke down crying. I miss myself. I used to be cheerful and innocent.\n\nNow, I’ve been depressed for so long. I’ve lived through terrible things.\n\nI keep picturing that girl from 11 years ago—the one who used to sing in different languages, record rap songs, and create all kinds of things.\n\nIt feels like I lost her. I cried as if I lost a loved one. As if that girl died, and I’ll never see her again.\n\nI lost myself. I lost my teenage years.\nI lost my laughter.\nI lost my creativity.\nI lost me.\n\nI miss her.\nI used to love myself, admire myself.\nI was confident.\nI was innocent.\nI was creative.\n\nAnd now? Panic attacks, anxiety, problems, responsibilities, endless worries.\n\nI feel like I’ve been dead for a long time. Like I’m just wandering among the living in some kind of dream. I feel disconnected from life, like a lifeless soul drifting through a world that keeps moving.\n\nWhy do I feel like I died a long time ago, and I’m just living these years backstage, trying to figure out the cause of my death?\n\nWhy does my life now feel like an illusion, while my past felt real?\n\nGod, I’m so tired of myself. Why do I miss the past so much? Why do I long for my old self?\n\nShe was strong and kind, despite her young age.\nThe older I get, the more scared I become. And the more I need her.\n\nShe was wise, creative, confident. Her soul was light and gentle, like a breeze. Everyone loved her. She was mischievous, but even her mischief was innocent. Despite being quiet at times, she was still well-known because she left a soft, lasting impact. Even if she caused a little trouble, it was never harmful—just the kind of mischief that made people laugh later.\n\nI admire her. I love her. I miss her the same way I mourn the people I’ve lost in my life.\n\nI’m grieving myself. Because I died.\n\nI’m nothing more than a body without a soul.",
    "subreddit": "TrueOffMyChest",
    "title": "Mourning Myself",
    "upvote_ratio": 0.86,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6owam/mourning_myself/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 19:28:01 UTC",
    "id": "1j6otjq",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 9,
    "score": 4,
    "secure_media": null,
    "selftext": "Flair clarification: I never attempted, only have extreme frequent thoughts of it.\n\nI (23M) feel like I'm still alive just to exist. I know that I'm young and I have still a lot to grow to and that my life isn't all that bad. But life still seems pointless. I never really had big interests/hobby's. I have a job, I can save money for later. But I don't know what I want in life, I never really had a goal in life. I recently found out I'm aroace too, so love is not a goal, I dont want to live alone because I'm not really independent due to autism.\n\nTLDR: I have no goals in my life and it all seems pointless.",
    "subreddit": "TrueOffMyChest",
    "title": "I feel like life is a pointless waste of time.",
    "upvote_ratio": 0.84,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6otjq/i_feel_like_life_is_a_pointless_waste_of_time/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 19:23:46 UTC",
    "id": "1j6oq5f",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "I've seen a lot of these posts on here and didn't really expect to be making one myself, but here I am. I'm currently living for my mom who loves me. She has dealt with a lot in her life and we get along very well and it would really hurt her if I offed myself, so I'm going to try to keep playing this game called life until at least she passes away. My life has had it's ups and downs, mostly downs but there have been some amazing and beautiful moments, but I just don't have anything I truly want to live for anymore aside from my mom. I've lost a couple of loved ones over the last few years and the thought of dying brings me a lot of peace and I'm looking forward to it.",
    "subreddit": "TrueOffMyChest",
    "title": "I'm looking forward to dying",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6oq5f/im_looking_forward_to_dying/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 19:17:14 UTC",
    "id": "1j6ol0l",
    "link_flair_text": null,
    "media": null,
    "num_comments": 28,
    "score": 567,
    "secure_media": null,
    "selftext": "I worked for Child Protective Services in a metropolitan area of the US for 12 years. I did both long term case management and later investigations that led to the removals of children. With about a decade of time and reflection, I’ve come to realize the following:\n\n- I was a young woman with lots of privilege who did not understand the lives or needs of the people over whose lives I made decisions for.  This now causes me great pain. \n- Turns out I was dissociating through most of it due to secondary trauma and moral injury. The ability to dissociate (although we just saw it as toughing through back then) was seen as showing that you were a great worker and could “get shit done”. \n- I wanted to do good in the world and I wanted to help children. And I did. But I also caused harm because I had too many cases, not enough supervision and no real self-awareness.\n- It took years of therapy to understand and grieve the harm I had caused and the harm caused to me. I don’t even remember the first few years of my children’s lives because I was so dissociated. I often have to look at a photos to remember events with them. \n- I still get flashbacks of things I was exposed to and am swapped with pain. \n\nSometimes it all comes back. Just this week, I was contacted by a former colleague and a child who was on my caseload many years ago. \n\n- The colleague reminded me of a child death case we worked on. It was particularly searing because we both had children that were about the same age as the child who died. \n- She also reminded me about the death of another colleague (through an aneurism) and the suicide of a couple others. Yes, our work had a death count. \n- The girl, now an adult, reached out to me to say she is doing well and to thank me for helping her find an adoptive home. \n\nIt’s a mixed bag. And these memories reinforce in me the idea that nothing in life is guaranteed and I’m just trying to do the best I can each day. I screw up and I repair where I can. I put kindness and compassion into everything I do, but that isn’t always enough. \n\nI don’t really have a purpose for this post. Just wanted to get it off my chest. ",
    "subreddit": "TrueOffMyChest",
    "title": "The work I did for CPS still haunts/revisits me (10 years later).",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6ol0l/the_work_i_did_for_cps_still_hauntsrevisits_me_10/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 19:12:29 UTC",
    "id": "1j6oh7n",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 1,
    "secure_media": null,
    "selftext": "I have an exam in a few hours in a subject I'm shitty at my sister has an assignment due tomorrow ( she's older than me ) I offered to help cause it's in something I could help in she refused had that look like u can't even help ( I could've easily) \nSo I was studying and she barged in and wanted me to help her I said no I have an exam worth 20% of my grade she was guilt tripping me into helping her and I said please just let me study or I'll fail tomorrow \nI went to my mom she said something to the meaning of you're so annoying just shut up go stay at your aunt's house I don't care \nEdit : I offered to help a couple of days ago ",
    "subreddit": "TrueOffMyChest",
    "title": "I'm so hurt",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6oh7n/im_so_hurt/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 19:06:07 UTC",
    "id": "1j6oc5w",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 2,
    "secure_media": null,
    "selftext": "Feeling Confused and conflicted \n\nI’m a 29 female, never been married and no kids. I've been thinking a lot about my past relationships lately, and I have to admit, it's been a tough journey. My last serious relationship ended in a painful breakup, and it's taken me a while to process my emotions.\n\nAs I reflect on what went wrong, I realize that I was blind to some major red flags. I ignored my intuition and stayed in the relationship longer than I should have.\n\nBut despite the heartache, l've learned so much about myself and what I want in a relationship. I'm taking the time to focus on myself, my friendships, and my community.\n\nI spend a lot of time getting to know God more. He has helped me through the years to achieve a forgiven heart and renewed my spirit of a fun filled life. Being single increases my loneliness but only those who have gone through this same pain would understand how scary it is to give love another chance.\n\nI'd love to connect with serious minded people and hear about your experiences. Have you ever gone through a tough breakup? How did you heal and move forward?",
    "subreddit": "TrueOffMyChest",
    "title": "Feeling Confused and conflicted",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6oc5w/feeling_confused_and_conflicted/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 18:53:10 UTC",
    "id": "1j6o1h7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "I’ve been struggling a lot since I got back from my tour, and I don’t really talk about it, but it’s been tough. Everything I saw and went through—it doesn’t just go away. My body feels wrecked, my mind’s exhausted, and some days I don’t know how to deal with it.\n\nWhat made it even harder was coming home and being met with yelling and awful things being said to me. It felt like I was a kid again, coming home from school and getting yelled at. I was already carrying so much, and instead of support, it felt like I was just being attacked.\n\nIt might sound silly, but it felt like everyone else got the care and support for their service, but not me. Like I didn’t matter the same way.\n\nI’ve always felt like others got that kind of support from their parents—getting called sweet things like “my marine” and having that care. It’s hard not to notice the difference, especially since I’m a girl. ",
    "subreddit": "TrueOffMyChest",
    "title": "Home?",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6o1h7/home/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 18:43:49 UTC",
    "id": "1j6nu3m",
    "link_flair_text": null,
    "media": null,
    "num_comments": 76,
    "score": 1335,
    "secure_media": null,
    "selftext": "My (23F) and my friend group had a very eventful senior year. We had a friend “Charlie” who had been dating this boy “Max” since freshman year. We met during 10th grade and they had already been dating a year so she had already met his family and such. She would make these comments like “Max’s dad is so hot” or “Max looks just like his dad and they’re both so attractive”, it was kinda funny at first, then she said “Max’s dad said if we were the same age, we’d be dating”, and that’s when we knew Max’s dad was a creep but she kept dating the boy and we couldn’t do anything.\n\nFast forward to senior year, Max decides he wants to date other people so they break up. Charlie was distraught, barely even speaking to us, dragging her feet around school, the usual teenage break up shit, til eventually they get back together. And this is where things got interesting for us.\n\nCovid hits, we’re out of school and hanging out at Charlie’s when she tells us she slept with one of Max’s family members but wouldn’t specify who. We thought it could’ve been his younger brother who’s 2 years younger than us, she said it wasn’t him, we said his dad, she claimed she wouldn’t say. We didn’t have to wait long tho, Max somehow finds out, we still don’t know how, that she in fact fucked his father and all hell broke loose.\n\nHis father denied and denied, Max and his brother stopped speaking to their father and Charlie, we never heard anything about his mom but I can only imagine she was drawing up divorce papers. Oh, and the reason she didn’t wanna specify it was him? They had sex in January, her 18th birthday was February…\n\nWe haven’t talked to Charlie in years, but before she stopped talking to us, she made a comment in a text like “My man is taking me on vacation” and when we asked who her “man” was, she just sent a smiling emoji and basically never talked to us again. Recently, we discovered through FaceBook that apparently, Charlie and Max’s dad are still together, Max and his brother don’t talk him, he and his wife divorced and he hardly ever sees their youngest daughter who’s maybe 8 now. \n\n",
    "subreddit": "TrueOffMyChest",
    "title": "My former high school friend fucked her ex’s dad",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6nu3m/my_former_high_school_friend_fucked_her_exs_dad/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 18:27:18 UTC",
    "id": "1j6ngo1",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 12,
    "secure_media": null,
    "selftext": "I’ve had this pattern in my life since childhood, and now at 30, it still hasn’t changed. I always feel like I’m never anyone’s favorite—like I’m not a priority or important to the people around me, whether it’s friends or the men I’m interested in. With men, they seem interested at first, but then they either ghost me or choose someone else.\n\nI can’t help but wonder—what’s wrong with me? I feel so desperate, lonely, and depressed. It really hurts. Please help.",
    "subreddit": "TrueOffMyChest",
    "title": "Why I’m not anyone’s favourite?",
    "upvote_ratio": 0.74,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6ngo1/why_im_not_anyones_favourite/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 18:13:46 UTC",
    "id": "1j6n57z",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 9,
    "secure_media": null,
    "selftext": "i’m not a good writer anymore. it’s strange - i never used to think these two things were connected. now I see that ever since my pet died, i haven’t been able to sit with my emotions anymore. i still smile, still laugh, still enjoy things, but the grief has left something hollow inside me - and something else, too big to be named, that keeps my words from making it past my throat.\n\nmaybe people can tell. maybe i’m just that strange person who loved her dog more than most humans, and who became a little less human when he went.\n\nhe was funny, mischievous, sweet. awkward, too. he wouldn’t know what to do with the way i’ve been crying over him. he was always terrible with tears. he would sit with me so i wouldn’t be alone, but always at a distance—watching me, or sometimes even turning his back. i used to get mad about it, like, aren’t most dogs supposed to be cuddly and affectionate? but it’s funny too, because that’s how i am when someone i love cries. i hover nearby, silent, unsure if my presence is enough. i wonder if he ever thought the same thing about me.\n\npeople say dogs take after their owners, and i take it as proof that he loved me the way i loved him. i tend to repeat this as gospel - he got better for a while when i came back. we played, we ran, he jumped up on the bed with me to curl up, he stole my sweets, even though he couldn't even stand a week before - and pretend it even slightly makes up for the knowledge of knowing i will never see him do these things again.\n\nis the pain of shattered hope worth the way that hope felt? sometimes, yes. today, no. maybe, in some way i don’t yet understand, he’s still sitting at a distance, watching and loving me the way he always did, just out of my reach. \n",
    "subreddit": "TrueOffMyChest",
    "title": "it’s going to be two years since my dog died. as i sat crying, i realised i haven’t had anything to say of depth for a while.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6n57z/its_going_to_be_two_years_since_my_dog_died_as_i/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 18:03:11 UTC",
    "id": "1j6mwnr",
    "link_flair_text": null,
    "media": null,
    "num_comments": 34,
    "score": 0,
    "secure_media": null,
    "selftext": "I was reading a post from an autistic man complaining about being constantly rejected by women because of his quirkness/weirdness, even though he claims to be a non-misoginistic stand up guy.\n\nThe replys? You guessed it! \"You're not owed sex, you entitled incel!\"\n\nWell, no shit Sherlock!\n\nOf course he is not owed sex, but wouldn't it also be appropriate to have a conversation about dating preferences and how they're often based on various forms of discrimination, like racism, classism, ableism and toxic masculinity?\n\nWhy isn't anyone advocating for people to question their dating preferences when so many of them are rooted in several forms of discrimination them themselves claim to be against?\n\nYes, if after further reflection you still feel you can't let go of your preferences, by all means chase them, even if they're not exactly based on positive traits, because you really don't owe anyone your affection or your private parts.\n\nJust don't use that excuse to not have to do some introspection about your preferences, their roots and how that's affecting you and also keeping some great people from finding love.",
    "subreddit": "TrueOffMyChest",
    "title": "The phrase \"you're not owed sex/companionship\" is being used as a shield from criticism for discriminatory dating preferences.",
    "upvote_ratio": 0.37,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6mwnr/the_phrase_youre_not_owed_sexcompanionship_is/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 18:02:51 UTC",
    "id": "1j6mwea",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 2,
    "secure_media": null,
    "selftext": "I always hear a lot of critique about how the western world is too individualist. Well, I feel like I completely understand why now. I’m in Canada for reference.\n\nI have been at my current job almost 3 years now. I have been on contract that entire time. I’ve been fighting to get permanent but no positive movement yet. Anyway, the last position I got was a 2 year contract-which comes to an end this summer. I feel I’ve been a positive addition to the team. The team was short staffed (*is* short staffed, even now) and I was able to help out with the work load. I’m a quick learner and pretty efficient, and I’ve definitely shown that on our extremely busy days, or days where extremely short staffed (we often have people falling ill or someone is on vacation). With my contract end coming up I asked my boss if there was a future for me. I have also been looking for work-with no luck-in preparation.\n\nWell, this week she told me the chances of me being kept on were slim to none. I cried at my lunch break. Hell, I had panic attacks and cried before all this. I have been trying to find work and it’s rejection after rejection or just not hearing back at all. Even jobs I’m more than qualified for aren’t responding.\n\nWhat has really hurt and frustrated me, is the apathy of those around me. Friends, coworkers I thought liked me, even family to an extent, could all care less. “Oh damn that sucks. Anyway.” \n\nAnd I 100% understand why. Why would *anyone*, even people who like me, give two shits about me? They have their own partners, families, finances, etc. to worry about. People don’t give two shits what happens to anyone around them when they have their own lives. Someone they know could go homeless and it’d just be a “damn how tragic! They were a nice person. Anyway, what’s for dinner?” \n\nI’ve been bullied at jobs to the point of being suicidal. People saw-and looked the other way. Dont want to involve themselves. I’ve complained to bosses/supervisors about workplace bullies only to go ignored. I’ve been chastised for speaking up. Damned if you do, damned if you don’t. No one cares-they can like you, but they’re there to get their bag and go home. \n\nI see this a lot in Canada with the housing crisis. People who own their homes have a “fuck you, I got mine” attitude. They don’t care about the rest of us, especially younger folk, who will never be able to afford even a modest apartment. They got their house, they got their family, fuck everyone else. The homeless are just an inconvenience/nuisance to them.\n\nI’ve tried in my life to have a community mindset with helping others, caring, I always would send fitting job postings to unemployed friends who were looking to try and help out, tried to be there for others. No more. Never again. Not a single person around me would give a fuck if I died tomorrow because understandably, they have their own shit to worry about. Only people I can see caring about me being gone are my mom and dad.\n\nI have fought my entire life to try and be better. Grew up with abusive step parents. Didn’t grow up wealthy. Pretty much everything I did after 18 was my own-rent, schooling (with help of loans, which I am also paying off solo), finding jobs, figuring shit out, etc. \n\nI’m done. My hope for finding work in time before my contract ends is extremely low. Even with experience and schooling, companies dont want to hire, or they want to pay you minimum wage for skilled work. And if they can’t get a canadian to go that low they’ll find a TFW who will take below minimum wage (story for another time). Idk what will happen to me but I know that I will not care about anyone else again. Im gonna worry about me only. Good luck to everyone else.\n",
    "subreddit": "TrueOffMyChest",
    "title": "I understand why people in the west operate on individualism TW: su*cide mention",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6mwea/i_understand_why_people_in_the_west_operate_on/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 17:47:21 UTC",
    "id": "1j6mjmy",
    "link_flair_text": null,
    "media": null,
    "num_comments": 12,
    "score": 6,
    "secure_media": null,
    "selftext": "Today is my 30th birthday and I am supposed to go see the LOTR symphony at 2pm. I have been up since 1am this morning with extreme diarrhea and can barely get off the toilet.\n\nHave taken pepto bismol a few times already and it is not helping. Trying to stay positive that I can leave in 2hrs to make it, but I’m not hopeful. \n\nHappy birthday to me 😭",
    "subreddit": "TrueOffMyChest",
    "title": "30th birthday off to a bad start",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6mjmy/30th_birthday_off_to_a_bad_start/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 17:38:27 UTC",
    "id": "1j6mcdn",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 0,
    "secure_media": null,
    "selftext": "\nI (18M) dated a girl for a year and a half and broke up with her last year. This was a time before I was saved, so I engaged in fornication with her (she claimed she was saved as well), but I never had intercourse. We went through a lot of problems in the later half of the relationship, and had minimal contact after it ended. A week after she broke up with me, she dated a new person. Today I just found out that after nine months, she’s still with the rebound. \n\nI want nothing, absolutely nothing to do with this person. I want to make that abundantly clear. But the idea that after a 1.5 year relationship that she moved on so quickly and ended up having a successful relationship with someone else really does hurt me, considering that I myself haven’t been so lucky to find someone. This might also be TMI, but I also think about how she lost her virginity to someone who wasn’t me.\n\nI feel like God wants me to focus on my walk with him as opposed to finding someone else, but it really does get lonely. And my ex is always in the back of my mind when it gets too quiet. ",
    "subreddit": "TrueOffMyChest",
    "title": "Ex Is Still With Her Rebound",
    "upvote_ratio": 0.45,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6mcdn/ex_is_still_with_her_rebound/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 17:33:07 UTC",
    "id": "1j6m88b",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 4,
    "secure_media": null,
    "selftext": "I (19M) am an outgoing person usually, happy to talk to anyone about anything. But I have a very big social problem.\n\nWhenever a bad incident happens, especially in the family, for example fights, arguments, grief etc., I feel strong anxiety and I need to go to the furthest, loneliest point in the building so I do not participate in the incident, not even hear it. And I feel so useless that I cannot support the people around me that need my help or help deescalate conflicts, but I start shaking very bad , my brain goes numb and my only thought is to get as far as possible. My brain cannot process staying even near the area of the bad incident. And I feel like the worst human possible because my severe anxiety that gets triggered by this doesnt even let me go talk about it after the incident, not even hugging anybody. I just ignore it as good as I can.\n\nWhat should I do?",
    "subreddit": "TrueOffMyChest",
    "title": "I feel so useless",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6m88b/i_feel_so_useless/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 17:24:22 UTC",
    "id": "1j6m1bk",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 4,
    "secure_media": null,
    "selftext": "My mom hit me hard a little while ago because I didn't want to share my chips with my little brother who is about 9 years old after he tried to take them from me by force. I shouted at her not to hit me whenever she gets angry because I am not an animal , she smiled as if I had told a funny joke and then sat as if nothing happened, but I feel angry. Is this normal or am I overreacting?",
    "subreddit": "TrueOffMyChest",
    "title": "Did I overreact?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6m1bk/did_i_overreact/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 17:21:54 UTC",
    "id": "1j6lzc5",
    "link_flair_text": null,
    "media": null,
    "num_comments": 17,
    "score": 0,
    "secure_media": null,
    "selftext": "I have two toddlers. We live in Florida, so we take them Disney. Initially we wanted to wait until they were old enough, but it became hard to find places to go on vacation or long weekends that had facilities for children.\n\nToday we were at one on the parks — and at a slower ride intended for all ages (toddler friendly), when our youngest threw a tantrum (1.5M). It was close 30 minutes until nap time, and he’s been teething.  We decided to come celebrate my eldest’s birthday (3M), and especially since the recent passing of my father left him very sad and aggressive toward others at daycare (he cried seeing photos of my dad and asking where he was). \n\nWe apologized to the two women next to us, as my youngest threw things on the ground near them. They started off saying that it’s OK. Then they proceeded to let us know that they never came to the parks before a certain age, and that my kids would be better “just by the pool or something.” Keep in mind, we are in the Disney Junior area. And that drowning is a common cause of death in young children, and I know at least three families that have experienced that loss. I tried to keep it nice and then I finally said “you know, they usually do well with travel, they’re just tired today.” And said goodbye. \n\nWas biting my tongue the whole time and wanted to remind them that this is a ride meant for younger children, and not adults in their 20’s-60’s (the two women were mother and daughter). I never understand the idea “children must be seen and not heard.” At a children’s ride in a theme park that is centered and based on children’s cartoons and film. I don’t care if adults show to the parks, but it’s insane that adults want to also keep children acting like children from children’s spaces. ",
    "subreddit": "TrueOffMyChest",
    "title": "I think adults unaccompanied by children that judge at Disney are ridiculous",
    "upvote_ratio": 0.41,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6lzc5/i_think_adults_unaccompanied_by_children_that/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 17:04:52 UTC",
    "id": "1j6llo1",
    "link_flair_text": null,
    "media": null,
    "num_comments": 8,
    "score": 22,
    "secure_media": null,
    "selftext": "I ordered prescription glasses and a boatload of yarn from two different online stores 2 weeks ago. By a boatload of yarn, I mean enough that it's in two packages. Last weekend, all 3 packages reached a hub near Seattle, which is less than 30 miles from my home. So I got excited. For new glasses and to start on my crochet projects. They were in Seattle on Monday. By Wednesday all three were in Coppell Texas. Now? One pack of yarn is in LA, the other yarn is in Denver and the glasses, they're in frickin Houston. So a week ago they were close enough that I could have driven to pick them up. Now they're all over. I'm so annoyed ",
    "subreddit": "TrueOffMyChest",
    "title": "My USPS packages were SO close. Now they are all over",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6llo1/my_usps_packages_were_so_close_now_they_are_all/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 16:48:45 UTC",
    "id": "1j6l8oo",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 2,
    "secure_media": null,
    "selftext": "I'm an introverted person and prefer small gatherings to large gettogethers. But ever since I've joined college, I've not been able to find a friend group. I was close friends with one of my roommates but since I have shifted to off campus accommodation, I've not seen much of her as I used to and she seems to have adjusted well without me. And my mental and physical health got fucked because of severe lack of sleep, partly because of stress and because of my other roommate refusing to switch off the lights. I have fully recovered from my sickness, but am still struggling despite my parents finding a place nearby to stay with me. It seems like nobody except my parents and school friends value me, and even they live such fulfilling lives and are not struggling to make social connections like me. I feel there is something wrong with me because friendly conversations with people in class never progress further into a full fledged friendships, it's as if I'm invisible in people's eyes until I talk to them, and then they go back to their friends and ignore me like usual. I know this isn't the worst situation to be crying about, but it feels awfully isolating. And I was so absorbed in my own mental health struggles that I forgot to check on my best friend, and I feel bad for that as well. But it felt like she had moved on frm our friendship as we hardly saw each other and she would not attend our weekly calls (with her and another of my best friends). It seems like everyone has better friends than me and is having fun with friends but I don't have people like that.",
    "subreddit": "TrueOffMyChest",
    "title": "Friendless in college",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6l8oo/friendless_in_college/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 16:45:46 UTC",
    "id": "1j6l6b8",
    "link_flair_text": null,
    "media": null,
    "num_comments": 8,
    "score": 13,
    "secure_media": null,
    "selftext": "Mother and I didn't have the best relationship. There are a lot of reasons why, but that's personal business. Her obituary doesn't mention me. If you read it, you would think she had no child. I reached out to have it changed. They wouldn't because I'm not the original author of the obituary. We may have had our differences, but that feels awful. \n\nThere is a girl I don't know posting about her being some amazing person. She is grieving her death more than I am. I'm sure my mom was great to her. She was good at being kind to anyone but me. Why didn't she love me as much as she loved that girl? ",
    "subreddit": "TrueOffMyChest",
    "title": "I wasn't include in my mother's obituary",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6l6b8/i_wasnt_include_in_my_mothers_obituary/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 16:36:37 UTC",
    "id": "1j6kz1f",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "hi, this post is going to sound insane but im tired &amp; ive had like three hours of sleep over the last two days\n\nim 15 and my mum was sick for the entirety of last year. long story short, she lost a LOT of weight and she needs to put on weight. other then that shes fine, shes able to do stuff &amp; she has energy but im still very very worried that if she loses weight she'll become critically ill. we've been to multiple doctors and theyve reassured her shes fine but she needs to put on weight, it still worries me. shes gained weight but shes gaining it veeeery slowly\n\nthe problem is that we had a cyclone recently &amp; she was under a LOT of stress. we're not at home rn so she cant weigh herself but i am so so fucking stressed &amp; i cant help but wonder if shes lost even more weight. i dont have a dad or any support, im just on my own.\n\nit feels like everytime i make any progress or my life seems to get even slightly better it all comes crashing down again. its been like this for years &amp; i am EXHAUSTED.\n\ni really dont have the strength to do this anymore. this has been going on for an entire year &amp; it feels like every day is blending together and it keeps getting worse and worse. it feels like im losing my mind. i just want her to be healthy &amp; get better, im so so exhausted of this. its horrible but im so so worried shes just gonna drop dead. i dont know what to do anymore, i really dont",
    "subreddit": "TrueOffMyChest",
    "title": "im so exhausted",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6kz1f/im_so_exhausted/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 16:17:49 UTC",
    "id": "1j6kk2o",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 4,
    "secure_media": null,
    "selftext": "I just need to vent. Seek advice. I’ve been seeing this guy for a little over a year. I’ve fallen completely head over heals for this man. I have expressed these emotions to him. I have told him. How I feel. Each and every time I’ve beeen met with the fact that he’s not ready for anything serious. Mind you this man chased me first. He wanted me first….Flash forward we have had so many ups and downs. Where he pulls away and disappears on me. I have asked him upfront if he’s seeing or having sex with anyone else. He tells me each time that no. He just has a low sex drive. I promise you me and this man have only been intimate a handful of times. Mind you just last week he was posted here. Nothing bad was said about him. But it only confirmed my suspicions. That he was infact seeing other woman. Yet i can’t let this man go. I know i need too. I know it’s only hurting me. Well…..Now I’m laying next to him as we speak. His back turned to me. After we have done the dead…. So to speak… i haven’t been at his place for a little over 5 months. First thing i noticed when I walked in… squishmellow. A valentines one at that…. He explained he bought it….. overall i know what I need todo. I just neeeded a place to say it. To vent.",
    "subreddit": "TrueOffMyChest",
    "title": "I feel numb",
    "upvote_ratio": 0.83,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6kk2o/i_feel_numb/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 16:09:01 UTC",
    "id": "1j6kd1t",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 18,
    "score": 0,
    "secure_media": null,
    "selftext": "I was in a long distance relationship with this girl, since last august. She took me at my worse, at the time I was alcoholic, had no job, had social anxiety over the roof. Was single for years since my first relationship cheated on me 20 times or more, since then, I couldn't trust any woman and I was a bit broken. But life was going on anyway.\n\nDuring those months together. I've had multiple relapse of alcohol and would send dumbs drunk messages to her. Nothing to serious. But it happened quite a bit. Just forgave me and understood my alcoholism, if I definitely stopped drinking.\n\nThat what I did. For the last 15 days, I was sober. I didn't told her but it was really really harsh, sweating, mood swing, shaking. But I was determined to not disappoint her.\n\nLast Sunday. She sent a friend of her to message me on Instagram. I told her I was in couple. But then, I liked a photo of her in bikini, and told her we could flirt. \n\nShe had few followers, only one photo, for me it was pretty much a fake and I was messing around.\n\nI would never have gone said that if I knew it was someone real, nor gone any further.\n\nI am french and here, I've been asking friends and most of them tell me it was dumb, and a bit disrespectful, but not cheating, that our love must go above this mistake.\n\nFor her, friends and family all tell her I'm disgusting, it's unforgivable, and she told me you can't repair a broken glass... She never forgave cheating, and won't.\n\nShe is now ghosting me, blocked me everywhere because I have been spamming her to talk to me at least. I didn't realised at that time it was cheating and I feel miserable.\n\nI've been sleeping for weeks, I've had found a job that I left the day after she broke with me, I even booked a flight and then canceled it, losing money in the process.\n\nIt's been one weeks and I desperately need her help, she was the one goal of my life, the only one I've ever been able to love again, I feel like killing myself everyday and I am not even joking, I know it will go wrong for me, i physically cannot live my life without her, not for a mistake I didn't realised... I never ever cheat, and I would never ever, I guess our boundaries are different and it's a miscommunication.\n\nI have nothing to ask, my chest is empty, my life is empty, I just wanna kill myself now, and I have no way to contact her to explain her my point of view...\n\nTLDR : Sorry if I failed you, I don't know how much longer I can endure this. I love you more than anything. Sorry. Sorry. Sorry...\n\nEdit : The worse part is she never let me a chance to explain myself, to even say goodbye, she just disappeared like I am nothing. I can't express how much pain I am going through right now, I just cant keep living this life without her.",
    "subreddit": "TrueOffMyChest",
    "title": "I (M30) lost the love of my life (23F) and I'm about to kill myself",
    "upvote_ratio": 0.38,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6kd1t/i_m30_lost_the_love_of_my_life_23f_and_im_about/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-08 15:24:20 UTC",
    "id": "1j6jf69",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "Okay, so I’ve been feeling some type of way about this for a hot minute, and I just need to rant. Idk if I’m overthinking or if I’m actually onto something, so here goes.\n\nI have these two friends, right? They’ve been besties since nursery, and I joined them in 7th grade. And listen, I never had an issue with that—I knew their bond was stronger, and that was fine. But recently, it’s been feeling like I’m just... there. Like, I’m included, but not really included, y’know?\n\nOne of them is dating this guy, and their relationship has been a damn rollercoaster. Long story short, dude was dramatic as hell, dumped her over some misunderstanding, then ran around spreading shit that made her look bad. Back then, our whole group was like, “Nah, he’s trash, you deserve better.” Fast forward a few months, and suddenly they’re treating him like he’s some god-tier boyfriend. Now he’s “so sweet,” “so caring,” “such a gentleman.” Like girl, be so for real.\n\nNow, I’m also dating someone, and every time I bring him up, I get the driest reactions possible. “Oh, he’s nice.” Thanks??? That’s it??? Meanwhile, they’re out here writing a whole PhD thesis about how amazing her man is, even after he did her dirty?? The math is NOT mathing.\n\nAnd it’s not just that. Even when I ask them basic questions, they either leave me on seen or reply two days later with the most half-assed response ever. But somehow, they have the time to be active af on Instagram, sending me reels??? Calls? LMAO, those don’t even exist anymore. And yeah, they’ve never been big on calling, but even when they promise they’ll call, they never do. And before anyone says “Maybe they’re just busy with college?”—nah, they have time for our other friends, just not me.\n\nAnd yeah, I’ve tried bringing it up before. The problem? They’ll act normal for like, a week, and then go right back to the same cycle. Atp, I don’t even see the point in saying anything anymore.\n\nOh, and the cherry on top? I recently got a pink rose from my boyfriend, and I was so happy because I genuinely prefer pink roses over red ones. I shared it with them, and the reaction was so bland. Like, no hype, no excitement—just a casual “Oh, that’s nice.” I know if it were one of them, the energy would’ve been completely different.\n\nIdk, am I tripping, or does this sound off to anyone else? Cuz it’s kinda giving “you’re an option, not a priority” energy, and I don’t know how to feel about that.\n\n\n(Your opinions are welcome, and if you have any recommendations on how to handle this (or just anything in general), I’d love to hear them.)",
    "subreddit": "TrueOffMyChest",
    "title": "Feeling like a second-tier friend, and I don’t know what to do about it.",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j6jf69/feeling_like_a_secondtier_friend_and_i_dont_know/"
  }
]