[
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 23:44:03 UTC",
    "id": "1j95b0t",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "im struggling a lot. \n\nfor a lot of my life, i can never bring myself to do things. If i was reading or watching something while another important thing was pending, i'd never get up. The constant nagging inside me to finish that work would eat me up from the inside. If i did focus on something, it would be too much, if my folks weren't around to remind me, i'd forget to eat or sleep until that thing i focused on was done. I was called lazy, and irregular.\n\nnow, i'm in high school. this is probably the most important thing of my life, the set factor to tell if i'll even make it to college. i look at my grades and i feel something inside me die. for a lot of my life, i was an average student. i would never do homework because i'd forget/something would distract me, but my tests and quizzes would bring me up to at least a b average. i'd never pay attention in class either, since i was too busy daydreaming or something, i would just figure things out along the way. \n\nnow as someone whos learning more advanced things in my school, its harder to keep up. to be honest, i don't think i ever learned to study. i even got up to the advanced classes in my school and theyre just kicking my ass. (one of my teachers even talked to me today about moving down to a lower level. it was humiliating.) sometimes i feel like wanting to cry while getting ready for school since i know i'l fail and fail and fail again and again. it doesnt help that i go to a really good school, which seems contradictory, but everyone's so smart here. i watch my friends who bawl their eyes out over having gpas of 4s and 4.5s, while i can barely get mine to stay in the 3 range. \n\ni just feel like ive let my family down. as an oldest sibling, i have to set a good example for my younger siblings, but i cant. my parents worked their asses off to get to where they are now only to have a kid who is failing school. \n\ni dont know whats wrong with me. am i stupid? sometimes id talk to close friends (not mentioning my grades because im so ashamed) and the way they react makes me think that they have an easier time learning stuff and focusing. what do they have that i don't? its like im slower than them and i still cant get myself to do the slightest bit better. ",
    "subreddit": "TrueOffMyChest",
    "title": "im slowly failing school",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j95b0t/im_slowly_failing_school/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 23:43:22 UTC",
    "id": "1j95aiy",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I forgot my phone once and sobbing (it was in the lost and found i saw it but the place was locked up), I saw two dog run full sprint (small corgis maybe?). My dad (he was driving) pulled out as they are yelling at are car. I thought they where lost but my dad said that it may be alert dogs. We drove pass them to see if they when to one house. We drove to the house and I went down the drive (dad stayed by the road for owner running after them/make sure they don't run into the road). The drive was steep and the dog circled me as I descended. The was a lot of trash bags and trash all around. The was like five square feet and it piled up three feet. The house looked abandoned and I saw a window broken only the screen left. A third dog inside screaming it's head off. The was a large plant in a pot on the porch that difficult to move around.  The door was  open not enough to see a sliver inside but just enough to push it open with no real force. I repeatedly thought about tapping it and the door creaking open to see a rotting body. As I slowly bring my hand to the door, moments before I touching it a woman run out of the back yard thanking us for getting her dog back home stating that one dog was not hers. I still feel odd about her say one wasn't hers. Not the rotting house of bile and filth but the one sentence she said to us.",
    "subreddit": "TrueOffMyChest",
    "title": "Fast pups",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j95aiy/fast_pups/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 23:31:45 UTC",
    "id": "1j95139",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "He keeps saying things to our kids about me. Stuff that I feel like he should be talking to me about if he has issues with. For example: he wants me to make a phone call about something, which since he’s off for a week, he could also call too!! I’m a SAHM and I also home school our children. I’m also the one that is in charge of making all of the kids appointments etc. (another problem I have, he always makes me call when he could call too but his excuse is “I don’t have their insurance information, you do.” When clearly he doesn’t need it to schedule an appointment with their pediatrician or dentist that they always go to) anyways sorry I’m kind of off topic. He’ll talk bad about me to our kids and get them to agree. Saying things like “your Mom needs to be calling these people instead of expecting me to do it, right?” So of course my kids feel like they have no choice but to agree. My oldest tells me the things he says. I want to confront him but she doesn’t want him knowing she told me but at the same time I don’t care anymore. I remember a long time ago I would vent to my parents about him and he would get upset telling me to stop and to just talk to him about it… here we go, now he’s doing the same except it’s to our own children and to his family members who also don’t like me too much. I love him but there’s a lot of issues we’re facing atm. I have no one to talk to so I guess, here I am. I always feel comfortable being able to let everything out here. ",
    "subreddit": "TrueOffMyChest",
    "title": "My husband keeps talking bad about me to our kids!",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j95139/my_husband_keeps_talking_bad_about_me_to_our_kids/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 23:31:37 UTC",
    "id": "1j950z5",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "hi, i am freshly 20 years old. my life hasnt been the greatest, but it also hasnt been the worst. i have anxiety, depression, eating disorder, and most likely a lot of undiagnosed shit. i am in college, i have a bf, i have many siblings, i have goals and aspirations, i want to be a mom, i want to have a cat and a dog, i want to live life and see the amazing things it has to offer but i just cant handle this uncontrollable sadness.\n\ni have tried just going day by day, medication, therapy. my family, bf, friends, no one knows how intense my depression is. i cant talk about my feelings, i feel alone 24/7, my mind never stops, and idk how to be normal.\n\ni dont know what to do, i am sad no mater how good or bad my life may be. i am in the best stage of my life rn and all i want to do is die. there is no motive or reason, its just how i have felt for years. there is nothing i can do to make this pit go away. I have been suicidal for years, and my attempts have failed in the past. im just so tired of crying and being alone.\n\ni am a nice person, i am pretty on my good days, i do things for people when they wouldnt do the same for me. i am a good person but its getting harder and harder to just get up everyday.\n\nis there an easy way to do it? i will be leaving behind grieving family but i dont even care at this point. \n\nplease, someone just tell me what to do or how to do it or just talk to me.\n\nim so lost, and im afraid and im so so tired.",
    "subreddit": "TrueOffMyChest",
    "title": "I don't want to die but i want it all to stop. suicide has been on my mind",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j950z5/i_dont_want_to_die_but_i_want_it_all_to_stop/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 23:26:28 UTC",
    "id": "1j94wqs",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "i don’t want to see your face. i do not care how good you think you look. ",
    "subreddit": "TrueOffMyChest",
    "title": "i hate it when people send me unsolicited selfies. immediate turn off. i do not want to talk to you for a bit.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j94wqs/i_hate_it_when_people_send_me_unsolicited_selfies/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 23:13:18 UTC",
    "id": "1j94lu7",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "I definitely need to see a therapist about this one :\n(TW: CA, SA, and self-harm)\n\nI (21F) had this life-altering experience when I was around 15 or 16, during high school. At the time, the friend group was fairly large and a friend of mine started dating a new student, we all had gotten close pretty quick since we all hung out together and that was the dynamic then.\n\nDuring class one day he sent me a Snapchat asking if I could step out to talk about my friend—his girlfriend. Thinking something was wrong, I asked the teacher if I could be excused (which she allowed because we were just making valentine’s day cards and class would be over shortly.) What started as an innocent conversation about childish relationship drama suddenly shifted.\n\n(TW) I was choked to the point where I lost focus in my eyes, and what felt like blood circulation being cut off, I’d been sa’d and I froze... while I was panicking internally I kept thinking it wouldn’t go any farther knowing we were LITERALLY in a main hallway with a camera right above us. So it felt impossible that something like this could be happening in such a visible place... clearly i was wrong and naive.\n\nAt the time, I didn’t fully understand what had happened, but the bell had rung and our friend group met as usual, walking each other to our next period. That’s when I had a panic attack. A friend noticed and as I’m trying to explain what happened she notices our vice principal, of course my friend tells her, to which I’m immediately sent to the principal’s office.\n\nI explained everything. They told me they would “conduct an investigation” and sent me home. I was never given the opportunity to write a report. I ended up missing a month+ of school with no updates on the situation. My parents would constantly call the school wondering when I’ll be able to go back, how i’m going to catch up on my work etc. we eventually were called in for a meeting. Most of the meeting now is a blur, besides the infamous hurtful quote of all time “It seems like you wanted to,”  my heart drops and I shut down, I remember the same unable to breathe  feeling and was in complete shock as my parents scolded me. \n\nI was still sent home after this as they would figure out our next steps. From when the situation first began to the conclusion we’d gotten (TW) I endured physical, verbal, and emotional abuse from my parents. Over time, I started believing it was my fault—something I still struggle with today. That belief led to years of severe self exiting ideations and harm.\n\n(Note the both of us were eventually allowed back in school, but I had be isolated in a office and he’d been in ISD (in school detention, eventually he moved))\n\nFast forward to years of no contact, he reached out with an apology. By then, I had already let go and forgiven the situation. If I’m honest, I hold far more resentment toward my parents than him—at least he apologized….\n\nMore recently, we crossed paths on social media. We caught up through texts, he would apologized again, I’d make dark humor jokes out of it, called, etc., it felt like the old friends we were before the bad. And for a moment, I thought he had changed. I felt relieved—happy even—to know he had grown into a better person. As time passed I stopped hearing from him… and out of curiosity I ask his roommate if everything was okay with him.\n\nI found out he had been arrested.\n(TW) Domestic assault and battery plus Domestic assault and battery by strangulation.\n(Note: He’s now released and there were no charges from the plaintiff)\n\nGuys — It feels like I’m subconsciously reliving that nightmare that once was. I don’t know why, and I can’t shake it. The scariest part is I can’t stop thinking about the woman he hurt… I don’t even know her, but I’m fixated on her. And for him… I don’t know where to begin on how I feel.. I feel stupid, guilt, naive to thinking he was a good person… I feel empathy, concern, and curiosity… I feel angry, condemnation, and to shame him… I feel like I need to do something but I don’t know what to do.\n\nWhat is wrong with me?! Why is this effecting me so heavily?!?!",
    "subreddit": "TrueOffMyChest",
    "title": "am i protecting a criminal?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j94lu7/am_i_protecting_a_criminal/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 23:04:47 UTC",
    "id": "1j94ete",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "So many things are going wrong guys. I got diagnosed with a ton of health issues that have cut my life short. Because of these health problems my business has greatly suffered. I’m $175k in the whole because of many things - bad business partners, theft, etc. I have a wonderful wife that I love more than anything in this world but I’m going to cause her to lose everything. \n\nI think it’s just best for me to put a gun in my mouth and let he collect my meager life insurance policy. At this point I physically can’t work, so I can’t make that money back at all. I wish someone could just fucking save me.  ",
    "subreddit": "TrueOffMyChest",
    "title": "Last Moment on Earth",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j94ete/last_moment_on_earth/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 22:46:47 UTC",
    "id": "1j9401h",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 0,
    "secure_media": null,
    "selftext": "26 male never had a girlfriend before I try to talk to women but it never goes any further than just friends I have pretty much lost all hope and this ever happening. I am the only one out of 5 siblings That's unmarried and doesn't have kids. Even all of my friends from school are married and have kids now I honestly feel like there's not a bigger loser out there than me",
    "subreddit": "TrueOffMyChest",
    "title": "I have no social skills",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j9401h/i_have_no_social_skills/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 22:37:52 UTC",
    "id": "1j93swn",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "(Mobile User, idk if that still matters lol)\n\nOkay so, I (19nb afab) am in love with my best friend, let’s call him Eren (18m afab). \nMe and Eren met in college when we were both 16 and have been practically inseparable for the past year, he’s funny, honest, kind, thoughtful and absolutely everything wonderful that a person can be and as I’ve said, we are closer than ever. \n\nNow Eren has a fun habit of playfully, platonically flirting with me it’s always been our dynamic, he jokingly flirts with me, I jokingly flirt back and we’ve always found it funny. However, for the past few months I’ve been finding myself growing more and more flustered by his flirting, but in a good way? To the point where I’m starting to overcompensate by making it very VERY clear that it’s all in good fun, afraid of him finding out I like him. I don’t want to ruin our friendship with this, I can’t lose him. \n\nAnother thing is, I’m fully not his type. He loves tall, masculine, strong men, and I’m none of that. I’m 5’2, not strong and feminine leaning in my appearance, I’m the complete opposite of his type and it kills me to know that. \n\nI’m just so lost, I want to tell him how I feel, but I don’t want to ruin things. I’m trying so hard to be there for him as a friend, but my heart shatters every time he talks about some guy he’s talking to and knowing I will never be that person. \n\nBut yeah, that it all, any advice would be appreciated but isn’t expected, thank you for reading.\n\nTLDR: I’m in love with my best friend but I’m not his type and I don’t want to ruin our friendship by telling him how I feel. ",
    "subreddit": "TrueOffMyChest",
    "title": "I’m in love with my best friend and I don’t know what to do",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j93swn/im_in_love_with_my_best_friend_and_i_dont_know/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 22:37:18 UTC",
    "id": "1j93sgi",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 18,
    "secure_media": null,
    "selftext": "It’s just something I (36M) can’t reliably share with anyone in my usual circle without coming off like a creep or a bother or something, might as well be the big online where I get lost in the traffic. It’s not *just* lust, but rather, everything she (38F) does makes me want her so badly and in so many ways. We have two kids. We’ve been building a life together for sixteen years now, going on seventeen in May.\n\nShe’s a supermom. And a superwife. And a superwoman with published works to her name. And a number of other superthings.\nThing is, she gets so busy and overwhelmed herself, I’ve learned not to encumber her further if I can help it. Helping out with whatever I can once I’m home from work, and whatnot. I just feel like dumping all this on her would help neither of us at this point in life, but I just NEED to get it out somewhere before I get back to being a Supportive Husband Without Sideways Hassle Just So Things Can Get Somewhat Quiet For One Damn Minute.\n\nShe’s the hottest thing I’ve ever seen. This sentiment has been building up for years. And I’ve seen some awe-inspiring things in my time. She contains them all and eats them for breakfast at the same time. She might be nothing special to your run-off-the-mill Chad, with her stretch marks and mom-bod and all. But she’s everything to me, and that’s inevitable. I just can’t let her know right now, but instead I feel the world needs to know. I’m that selfish.\nI love her mind and her gentleness at the same time that I cherish her body. They’re inseparable to me. I crave to make love to her personality and her tired smile, and I wish to be able to do even more for her than I already do. She’s so dedicated to our children and to myself, I wish upon the fucking star there was some way I could let her feel exactly how immense her beneficial impact is on me as well as the kids. I wish I could mind-meld with her so I won’t struggle this much to express it.\n\nShe is the love of my life. And I can’t tell her right now the way I want to, because she’s finally asleep. So have at it. I’ve said it. Maybe I’ll cope once I’ve gotten at least a part of it out.",
    "subreddit": "TrueOffMyChest",
    "title": "My appreciation for my wife is overwhelming",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j93sgi/my_appreciation_for_my_wife_is_overwhelming/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 22:25:36 UTC",
    "id": "1j93ivd",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 2,
    "score": 13,
    "secure_media": null,
    "selftext": "My best friend since we were in middle school has had a rough few years since he knocked up his girlfriend. Mostly about money. They went in debt for a shot gun wedding, and they went into debt to get a mortgage, and it's been gradually getting worse over the last 4 years. \n\n He's been in panic mode about it for a while, and he's overwhelmed having to work 60-hour weeks on top of child care, errands, and housework. His wife also has a spending problem that he just can't seem to shake because she gets what she wants. \n\n They just got their tax money, and he was saying that all of it needed to go to debt or they'd start having collections come. His wife wanted to go to Florida for her friends wedding. He protested, but ultimately, he agreed to go for the weekend. He told me he didn't really have the PTO or money, but they can't go on vacation this year otherwise, so it's something. \n\n They got down there and did the wedding, and instead of coming back, they decided to go to Disney World for two weeks. I didn't even bother asking about the money or anything. I just told him to have fun. This immediately worried me because he's been talking a lot lately about suicidal feelings and he refuses to seek help because he \"don't have the time or money\" and insist he'd never do anything, just saying hoping he dies in a accident so his family would be taken care of. \n\n Everyone has heard of those Disney trips that are before divorce, abandonment, or suicide and I'm really worried that's what this is. His debt is well over 6 figures, not including his mortgage, and he's suddenly spending like there is no tomorrow and not worried about it not worried about it He seems extremely happy but I'm worried about him. I asked about his situation, and he left me on read. I hope he won the lottery or something down there. ",
    "subreddit": "TrueOffMyChest",
    "title": "I think my friend went to Disney World to do something drastic",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j93ivd/i_think_my_friend_went_to_disney_world_to_do/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 22:19:20 UTC",
    "id": "1j93dsf",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 0,
    "secure_media": null,
    "selftext": "I like myself as an individual, but I also frequently feel guilty for being male. I know this way of thinking isn’t healthy, but I’m a male and I know how other men are. It’s hard not to think this way.\n\nI’ve never feared for my safety around a woman. Only men. I’ve never been almost jumped by a group of women. Only men. A woman has never stole my things. Only men. The worst thing a woman has done to me is hurt my feelings. The worst thing a man has done to me is literally try to kill me.\n\nNo wonder women don’t wanna date men. They’re fucking unpredictable and terrifying. Bad men ruin the experience of life for literally everyone.\n\nI know I’m not the only man who feels this way. My entire male friend group feels the same way.",
    "subreddit": "TrueOffMyChest",
    "title": "I feel guilty for being a man because so many men are genuinely awful.",
    "upvote_ratio": 0.35,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j93dsf/i_feel_guilty_for_being_a_man_because_so_many_men/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 22:03:57 UTC",
    "id": "1j930zt",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 42,
    "score": 33,
    "secure_media": null,
    "selftext": "Sorry I just wanted to get a second opinion on this (English isn't my first language so sorry)\n\nMy (24M) Therapist, thinks I was sexually harassed by my aunts as a child, but I feel like he might be over exaggerating\n\nEssentially when I was young, my aunts and other female family members would always be touching me, usually pinching my cheeks or butt, and trying to kiss me on the lips, because \"I was just too cute and they couldn't help it\". It mostly stopped when I was around 10 I think.\n\nI hated it all, but I didn't really say or do anything, because I guess it was harmless?\n\nAny ways I'm a pretty hands-off person now, and don't do a lot of physical touch with anyone, and my therapist thinks that's how it started.\n\nI can believe that, but he keeps calling it \"sexual assault/harassment\" which I feel is too far a stretch as it wasn't sexual, and that's a very serious conviction.\n\nThey tried to argue what if my uncles did that to my sister? But I don't think those are comparable things\n\nIdk I just don't think its as bad as he's making it, like I hated it, but I survived and am fine now. I may not see this therapist anymore, I'm not sure.\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "Therapist keeps saying I was \"sexually harassed\", I don't know if I agree",
    "upvote_ratio": 0.86,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j930zt/therapist_keeps_saying_i_was_sexually_harassed_i/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 22:00:46 UTC",
    "id": "1j92y8w",
    "link_flair_text": "CONTENT WARNING: ANIMAL ABUSE",
    "media": null,
    "num_comments": 0,
    "score": 3,
    "secure_media": null,
    "selftext": "TW: MENTION OF DR*G USE. \n\n\n\n\n\nI spent years, from 18 to 31, almost my entire adult life being manipulated and abused by my ex. Who I knew was an alcoholic but I didn't realize was a drug addict. (meth and cocaine, apparently)\n Boy, that was a doozy when I figured that out. So naive on my part. \n\n Until therapy. Therapy was great for me. I didn't even know I was being abused until my therapist was basically like, \"Hey. None of this is normal. This is not okay.\" Even though my family and friends were worried for me and tried to get me to see it, I continued to stand up for my ex and cover for them until therapy. \n\nWherever you are Therapist Jas, you helped me start to save myself. \n\nWhen I decided I wanted out, all i wanted were my things and my dogs. No smear campaign. No fights. Just my items and to disappear into the void. Things did not work out like that, actually. \n\nThey didn't allow me to take most of my things, most of which were given to me by my great grandma and grandma.\n\n I left with two duffel bags and a tote. \n\nOn the day they were \"nice enough\" to let me get more of my things, all i ended up with was my great grandmas table (which was a win to me) and some lovely boxes of actual garbage can trash that they put together for me. Including but not limited to old food wrappers, contents from multiple ash trays, a sex toy I'd never seen, and most of my photos ripped into tiny shreds. They would not let me have my dogs. \n\nLike a buffoon, for weeks I attempted to get my dogs back. They couldn't afford to feed the dogs much less themselves so I offered to buy the food, cover upcoming vet bills, allow visits.\n \nThey kept my dogs. I never got to see them again. I never even got to go inside the home and say goodbye. \n\nIt's been a few years but I found out recently that my ex lost their house. And then another. So satisfying for me to hear honestly, But what threw me off the most was when I found out what happened to my dogs, thanks to One of my exes family members. \n\nOne \"ran away\". This particular dog never left the yard. Never left my side. She was a very good girl. In the 10 years I'd had her, not once was she ever lost or missing. \n\nOne \"we don't know\" what happened. So a dog just disappeared into thin air. Got it. \n\nAnd the last one...\n\nWas neglected and malnourished and treated so badly he went blind. He was so bad that by the time one of my \"exes friends\" took him to the vet there was nothing they could do but put him down. \n\nThe family member said it wasn't two weeks later and the ex got a new dog. \n\nI was devastated. That particular family member no longer has dealings of any kind with my ex, but found me to let me know about what happened. I appreciated that, even though I was heartbroken. He knew i fought hard for those babies and I would have kept fighting but i couldn't because I ended up getting a well deserved order of protection for a multitude of other reasons. \n\nIt's been a few years. I'm married and a mom now. I live a very safe, comfortable, happy life with a man that is extremely good to me. I'm still working to rewire my brain from the years of chaos and abuse. I'm still pretty triggered by certain things and I still have nightmares from time to time. \n\n\nBut most of all, I'm still grieving my dogs. I wanted to save them. I wanted to fight for them. I wanted them with me. To live happy, free lives. I miss them. And I hope they didn't think they did anything wrong when I left. I hope they know I cry everytime their pictures come up on my photo memories. I hope they know I did my best and I never forgot them. I hope they knew I loved them and that I still do. \n\n\nAnd I hope that my ex never has a moment of peace or fortune or anything close to good for what they did to my dogs. Not even what they did to me. But to my innocent, sweet, loyal, amazing dogs. ",
    "subreddit": "TrueOffMyChest",
    "title": "I hope my ex never finds a moment of peace",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j92y8w/i_hope_my_ex_never_finds_a_moment_of_peace/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 21:58:38 UTC",
    "id": "1j92wdu",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 7,
    "secure_media": null,
    "selftext": "I’ve been disabled since I was 15. I’m 39 now and, while I try to be grateful for what I have, (food in my belly, clothes on my back, a roof over my head) I want so much more that I know I can never have. I want children and a husband and a dog. I want to climb Mount Everest and swim in the ocean. I want to learn ballroom dancing. It hurts that I can’t have any of those things ",
    "subreddit": "TrueOffMyChest",
    "title": "I envy healthy people so much",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j92wdu/i_envy_healthy_people_so_much/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 21:58:02 UTC",
    "id": "1j92vv7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 2,
    "secure_media": null,
    "selftext": "tw for rape/abuse/controlling behaviour\n\nhi guys i am very nervous to post this as it is my first post on reddit and i couldn't figure out how to go anonymous without making a new email but here it is. \n\ni (f19) have known my boyfriend (m19) since april 2023 and have been with him officially since june 2023, he previously had a girlfriend 'polly' (f19) from january 2021 to around december 2022, she broke up with him at this point but he said that after a few weeks of her ignoring him they rekindled but issues were still arising so they officially split in march 2023 and he hasn't been in contact with her since.\n\nhe has expressed to me that she had issues with her mother and often stayed at his house for extended periods of time, was a big smoker at the time and would often steal from his older brother when she had no money, and that she was depressed/depressive throughout the relationship and was also prescribed medication towards the end of their relationship which he said was changing her behaviour and attitude negatively, he believes this is why she left him in december 2022 because of their differing views. he also told me that she has history of making accusations, before she had reported him i was asking him questions about her and their relationship and he said that in the beginning he got a message from a boy who had been previously accused of rape by her saying that she was a liar, he obviously believed her as they were together but in hindsight this should've been a red flag he also said that they didn't have much of a sexual relationship and she was very paranoid with protection which obviously would make sense if she was a victim of rape so i guess that's how he thought of it but later on down the line she denied that she was raped and said that it was consensual.\n\nin september 2023 his ex accused him of coercive and controlling behaviour (we didnt know when she first filed the report until months later) and he was taken into police custody in october 2023 for a few hours. initially she had reported that he was abusive towards her but quickly dropped the gbh charges, i assume she didn't have enough evidence - his solicitor stated that the evidence she saw for the gbh charges consisted of 2 photos of grazes and bruises she had. she initially said that he had punched her 100 times in one period of time, also in one of her statements she said that she had taken photos of bruises on her arm that he had given her as she was sat in his bed next to him this alone is baffling to me as if he was 'so controlling' i don't believe he would let her do this especially if he was the cause.\n\ni completely believe him when he says that he did not do it as i have been with him for about the same amount of time they were together and have had none of the same issues with him, also i have read/heard multiple of her and her family's claims and the written ones just don't match up - for example, her brother said he saw my boyfriend strangling her and her face was purple and her mother said that on the same day and time he only had her pinned on the bed. this instantly gives me red flags.\n\nmy first thought was obviously that since they broke up and got back together multiple times throughout their relationship she was hoping that the same would happen but he met me and moved on instead (her friend had messaged her when she was not speaking to him and told her that 'polly' had advised him to move on). also it is very possible that she was aware that he was with me and not just having time to himself as his mother frequently posts on facebook and had made a post in july 2023 that she was picking him up from the city that i live in and mentioned me in the post, my boyfriend's mother has proof that she has been frequenting her profile as she accidentally requested to be her friend one day. the only piece of evidence that i have seen that i am aware she has kept (evidence she had of bruises from an injury have been thrown out with the gbh charge) is a clipped screenshot of him texting her saying 'i'll find another girl to abuse' obviously i have defended this as a retaliation to her emotional manipulation/abuse his solicitor also requested that the police access her phone to retrieve all of their iMessage conversation for context. personally i believe that him saying that is not an omission but an inappropriate joke of some sort.\n\nshe claimed that while they were together he would tell her what she could and couldn't wear, wouldn't let her see her friends or family, wouldn't let her take her pills, wouldn't let her attend school, etc. i have seen photos of her in his phone of them together with his friends, i also met his friends and they brought her up casually before he knew she had reported him so no mal intent there in my opinion, i have also seen photos of her school work.\n\ni do not believe a word that she said in her statements she said that she was so badly affected by him that she cannot sleep comfortably, walk for long periods, sit comfortably in a car or travel by airplane but she continues to post herself at clubs in the city that i live in (him and her don't), she has gone on multiple holidays since reporting him, one she showed on instagram just shy of 2 months after she made her original report, etc.\n\nof course when they were together he was also between the ages of 15 and 17 so i am honestly surprised that it is even been taken to crown court and gone of for so long it seems so menial to me.\n\ni am just nervous as it seems that in court he will be judged by a jury and i know they are to be unbiased but it is still nerve wracking to know that his fate lies in the hands of strangers, he has made it known to me that he would like a restraining order to be put in place, i would prefer a protection order as from what i know they are longer lasting, i think that he could also charge her with deformation of character as she was telling his friends that he was abusive to her during the first summer that we were together (june/july 2023). \n\nplease don't suggest that i leave him often when i share this with friends they say i should just leave him to avoid the stress but it is not about me, i love him and want to be there and support him the best that i can but i honestly don't know what i would do if he was found guilty and sentenced for a long period of time, we having been talking about saving up for a deposit on a house, getting married and having a baby in the coming years.\n\ni don't really know what i'm expecting from this in all honesty but just wanted to share without feeling like a burden, i'm sure there is more information that i have missed as this is just a late night rant of sorts so i may make some edits at a different time but feel free to ask any questions or give any advice.",
    "subreddit": "TrueOffMyChest",
    "title": "my boyfriend's ex is accusing him of abuse",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j92vv7/my_boyfriends_ex_is_accusing_him_of_abuse/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 21:57:40 UTC",
    "id": "1j92vjt",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "I know everyone says “life isn’t a race,” but it’s hard not to feel like I’m behind. I see people my age getting degrees, starting businesses, traveling the world, or just seeming like they have it all figured out. Meanwhile, I feel like I’m stuck, unsure of what I’m doing or where I’m going. I try not to compare, but it’s tough. Does anyone else feel like this? How do you deal with it?",
    "subreddit": "TrueOffMyChest",
    "title": "I feel like I’m falling behind in life, and I hate comparing myself to others.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j92vjt/i_feel_like_im_falling_behind_in_life_and_i_hate/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 21:45:22 UTC",
    "id": "1j92kue",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 51,
    "secure_media": null,
    "selftext": "I (26F) had been feeling like a caretaker for most of my relationship with my ex-partner (39M) who is an alcoholic. He would be sober for a long time, and then relapse. The more I thought about the relapses, the timing seemed way too convenient. He would relapse during times, when I went to see family, when I got a new job, when I got my graduate school qualifying exams, when I went to travel abroad alone for the first time in several years. It started feeling like he was punishing me for having a life of my own.\n\nThroughout the relationship, I had financially supported him. Even when he was sober, it was not uncommon that rent was late, he was in medical debt because of avoiding to get a good insurance plan, he never paid taxes, etc. I was always \"borrowing\" him money that I ended up realizing I will never get back. \n\nEnough was enough.\n\nHe asked me to quit my job and move to a new location with him, which I did. I gave up EVERYTHING only for him to relapse. \n\nThat's when I decided that I am done, and that I need to live my own life. I knew that he had taken money from our mutual savings (so 90% mine, 10% his) without asking me before, so I \"forgot\" my credit and debit cards on to the kitchen table while starting to move my stuff out, and took his wallet from his pocket, placing it on the bottom of his bedside drawer. He was going to hit withdrawals if he didn't have money for booze, so I knew he was going to steal my cards. It was not until a day later that they \"disappeared\" and I saw charges made. Booze. Sex club(?), Casinos. Lots of takeout. Impulsive purchases online.\n\nI called the police, reported the cards missing, and said that my ex was the suspect, and that he is currently trying to drink himself to death (which he always is when he relapses and doesn't hesitate to say it). They came over immediately, I was there too, and they found the cards in his possession, and as he turned violent towards them yelling I set him up, he was arrested him on the spot. I've come clean to the police about his tax avoidance as well, along with illegal threats against me from 2-3 years ago (that I have screenshots of), as the statute of limitations has not run out. \n\nHe's looking at several charges now, including resisting arrest,  illegal threats, stealing, potential tax evasion and negligence, several fines, and isn't a first-time offender. I don't know how he's doing, whether he's sober, I don't care. I have my own life to live. \n\nSince then, I've begun making more money, and traveling the world, and I am finally starting to feel like myself again. I've even made new friends, which I haven't for years, as all of my old friends made me choose between them and him, and I foolishly chose him. ",
    "subreddit": "TrueOffMyChest",
    "title": "My ex's alcoholism made me break up with him, and I \"set him up\" the day I moved out",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j92kue/my_exs_alcoholism_made_me_break_up_with_him_and_i/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 21:40:56 UTC",
    "id": "1j92h5h",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 2,
    "secure_media": null,
    "selftext": "I am 33 female who has worked retail for most of her career and wanted/needed a career change due to rising prices and living on my own. I was so bored with retail that I started to burn out. I thought I needed a new path. I don't have a degree. College wasn't for me and I couldn't find what I liked. \n\nWhen I saw a call center job advertised on indeed for more pay I took it and never looked back. I turned in my two weeks and completed it at my retail store and said goodbye to some of my coworkers I really enjoyed being around. But I needed to do this for my own financial being and my physical health. The benefits rock and the pay is so much better. I'm making more than I have ever made.\n\nProblem now is that my mental issues are rearing their ugly head with the amount of hard calls and abusive customers I've dealt with. I'm only 5 months in with this job. \n\nI suffer from anxiety and PTSD and I thought I had over come those issues. I see a therapist. Now those issues are coming back to haunt me and it's been a struggle. I feel like such an idiot. I want to quit and go back to my retail job so bad but I know it won't pay my bills. This job has done wonders for me financially.\n\nI feel like no matter what I do I am stuck. If I stay here I feel like I'm going to go crazy. If I go back then I will suffer financially but I miss the peace of mind. I'm thinking I should get back on my medications and just keep pushing. I want to keep pushing. I hate myself for my mental struggles and wish I could block them out in order to provide for myself. I just feel so lost on how to take care of myself mentally right now. \n\nThanks for letting me vent though. I'm going to go back and keep pushing through. I might update I don't know...",
    "subreddit": "TrueOffMyChest",
    "title": "I left retail for a call center job with better pay and I regret it",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j92h5h/i_left_retail_for_a_call_center_job_with_better/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 21:27:45 UTC",
    "id": "1j925zu",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 4,
    "secure_media": null,
    "selftext": "im tired of people playing stupid games with theyre social circles . we are humen beings . we need connection,  we need those deep conversations . we all gotta stop consuming buncha stupid videos and end the dopamine cycle , start getting a grip on real meaningful interactions . im 18 male btw and i use social media too but everytime i wanna try something new as of relationships , everybody stick to their chatting and online dates with people they cant see and cant trust. ",
    "subreddit": "TrueOffMyChest",
    "title": "isolation",
    "upvote_ratio": 0.84,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j925zu/isolation/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 21:27:32 UTC",
    "id": "1j925ss",
    "link_flair_text": null,
    "media": null,
    "num_comments": 10,
    "score": 0,
    "secure_media": null,
    "selftext": "Here are some examples of my bravery:\n\n-I went to a college where I knew no one (in a state where I knew no one)\n\n-As an adult, I got on an airplane to move to a place where I knew no one. With nothing but my luggage and my dreams. I didn't even have a job or apartment lined up.\n\n-I've gotten on airplanes to visit places I've never been before. By myself. For no reason other than because I wanted to.\n\n-I've gotten my pubes ripped out in the most painful way possible (full Brazilian waxing)\n\n-I've gotten tattooed twice (and gotten so many chest waxes I've lost count)\n\n-I've gone up to total strangers in public to ask if they want to come over for sex. With no nervousness whatsoever on my part.\n\n...Yet (and this is where my bravery ends) the mere *thought* of asking out a woman I already know on a simple date gives me *crippling* levels of nervousness.\n\nMy phobia of asking a woman out really holds me back. Other than a one night stand 4 years ago, I haven't had sex I didn't pay for in 10 years.",
    "subreddit": "TrueOffMyChest",
    "title": "I'm a pretty brave guy...except in the one area where it really counts",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j925ss/im_a_pretty_brave_guyexcept_in_the_one_area_where/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 21:19:50 UTC",
    "id": "1j91zbx",
    "link_flair_text": null,
    "media": null,
    "num_comments": 11,
    "score": 5,
    "secure_media": null,
    "selftext": "I am so lonely and missing intimacy...\n\nMy husband passed away in December, after a long 4 month battle with Cancer that took him from me.\n\nIts been almost 3 months and it's been so damned hard and difficult navigating being a widow under 40. I already have Depression and Anxiety and ADHD and OCD and PTSD, add on top of that the last 3 weeks with my husband that haunt me still, and I'm not doing great. I'm managing to get by the best I can but I miss human contact. Friends have visited, say with me, spent time with me, given me hugs.\n\nBut i miss that warmth of being held. Of my foot sliding under thr covers to find his. My nightly forehead kiss or holding hands in the store. I miss casual skin contact and the forms of intimacy you have with people you love that aren't just sex. It makes me feel so alone. Like my cup is so empty. Like there is a void. \n\nIve truly never felt more supportive and loved by all the people in my life, but at the same time, I feel so, so, so immensely alone and empty and abandoned and lost and scared. ",
    "subreddit": "TrueOffMyChest",
    "title": "I miss him...",
    "upvote_ratio": 0.86,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j91zbx/i_miss_him/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 21:14:53 UTC",
    "id": "1j91uzb",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "\n\n(We live in Muslim country so things are much difficult so we can't go to authorities)\nI need to share this because it’s eating me alive. This isn’t just her story—it’s mine too.\n\nHer Story: How She Was Trapped\n\nShe met him thinking he was just a good friend. He never acted inappropriate, never said anything with double meaning. He built trust first, slowly making her believe he was a safe person.\n\nThen one day, they went on a trip together. She tried to refuse weed, but he kept pushing until she gave in. Once she was intoxicated, everything changed. He made her believe he liked her, even loved her. And in that manipulated state, he took what he wanted.\n\nThe next day, she still couldn’t process what happened. She even wore a skirt for him, as if she was trying to convince herself that it was something real, something meaningful. But when the trip ended, so did his act. He turned cold—immediately, like she never mattered.\n\nIt took time for her to accept it. First, she blamed herself. Then, she started questioning reality. Finally, she realized—she was just another toy to him.\n\nShe told me:\n\n\"I didn’t know it was all his plan. I was just a toy for him.\"\n\n\"I feel dirty. I feel like I’m not clean anymore.\"\n\n\"Why did he act like he cared, only to throw me away?\"\n\n\nThis wasn’t a love affair.\nThis was grooming.\n\nHe conditioned her trust, intoxicated her, used her, then discarded her. And even after realizing everything, she still blamed herself.\n\n\n---\n\nMy Story: Why This Hurts Me Too\n\nShe told me everything. And I believed her. I still do. But the hardest part? Other people don’t.\n\nEven my own uncle dismissed it. He refused to believe the evidence, called her a liar, and even defended the abuser. That’s what broke me the most—if people can so easily ignore her pain, then what about mine?\n\nBecause this isn’t just about her story—it’s about what this has done to me.\n\nI wake up angry every day. Not just at the abuser, but at the world that lets people like him exist without consequences. I want to protect the next victim. I want him to feel the fear she felt.\n\n\n\nSo I need to ask:\nDo you think she was having an affair to which she alwys said that he was just a good friend whom she trusted ?\nOR\nDO YOU THINK SHE WAS GROOMED...?\n\n\nI WANT REVENGE NOT JUST FOR HER BUT FROM MY ABUSER TOO... ANY ADVICE.\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "I Think She Was Groomed, Used, and Discarded—Now I’m Left with the Pain Too\" do you think she was groomed as an young adult girl.. early 20s..how to i help and avenge abuser..?",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j91uzb/i_think_she_was_groomed_used_and_discardednow_im/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 21:12:37 UTC",
    "id": "1j91t16",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 14,
    "secure_media": null,
    "selftext": "Me and the Situationship old enough to be my dad are not seeing each other anymore. I was very excited and relieved, he's started seeing other people. I know if I ended things he'd just give me the silent treatment, yell at me, attempt to make me look bad at work, or physically hurt me all things he's done at work when he thinks I'm rejecting him. \n\nSo I was very happy and relieved to find out he went on a date with someone else, he even gave me the silent treatment all day yesterday. Today though, he's acting normal though, saying hi and trying to make jokes. I found out I might have to work with him tomorrow so i asked the one supervisor that I do trust if I could skip working with him. I've already told a few supervisors i feel uncomfortable with him and everyone just laughs it off, \"oh yeah he's just a character, that's him.\" Situationship even gloats, \"my job is whatever I want, they're not gonna do anything. Our boss isn't gonna do anything I told her already.\"\n\nTrusted Supervisor doesn't know anything that's happened outside of work, I only told him what Situationship has done AT work. I'm so embarrassed, nervous, I even feel humiliated. I don't want to make an official report but Trusted Supervisor is telling me to take it to the highest in the office, our boss's boss's boss. I am dreading it. I have 2 weeks or he'll make the report himself.\n\nI'm not gonna mention the assault, the weird relationship we had outside of work, only the inappropriate behavior that happened during work but still. I'm worried Situationship will say I just have a vendetta against him. He already gets away with everything, maybe he will bring up our relationship outside of work to cover his ass. Situationship just gets to do whatever he wants and it's irritating me. \n\nHe called another supervisor (who's black) a monkey and almost dropped the N-word. He was screaming this in my face on the street, we work at a hospital and multiple people heard this. No one cares, the supervisors I have told just said, \"yikes yeah he was really mad that day.\" \n\nDread dread dread that's all I feel right now. ",
    "subreddit": "TrueOffMyChest",
    "title": "I might have to report my coworker and I really don't want to",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j91t16/i_might_have_to_report_my_coworker_and_i_really/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 20:59:45 UTC",
    "id": "1j91hpb",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 7,
    "secure_media": null,
    "selftext": "I thought it would be different. I thought I would be a different kind of mother, I thought my partner would be different kind of father. I ignored cracks in our relationship because I do love him a lot and I wanted a child. And now I‘m in my bed crying because I don‘t know how to get through the next day. My back is killing me, the baby has reflux all day long, we barely get out of the house and the post partum fears of him dying or getting hurt are a constant thought circling though my brain. Pumping, changing diapers and cleaning bottles is all I get done when I‘m home alone. And when my partner finally comes home and I could do the chores I‘ve been wanting to do or actually take care of myself for a minute I lack the energy. I can‘t really talk to my partner about it either - best case scenario: he gives well intentioned but surface level advice, worst case: we have a fight. He‘s a good person and he‘s never been lazy or unreliable but he has always struggled with other peoples emotions - especially mine. \n\nEvery night I dread what‘s to come and when it‘s finally morning I feel drained and disgusting.   I knew post partum would be hard, but I really thought I‘d be stronger. But I‘m not. And the worst thing is I don‘t feel that bond I‘m supposed to feel. I love my son but he feels like stranger and i just can‘t figure him out. maybe this was all a mistake but now it‘s to late to go back. All I can do is hope it gets better.",
    "subreddit": "TrueOffMyChest",
    "title": "I regret starting a family",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j91hpb/i_regret_starting_a_family/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 20:45:36 UTC",
    "id": "1j915du",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 1,
    "score": 8,
    "secure_media": null,
    "selftext": "So I’m now 17 I’m also a girl. My older half sister was my dad’s daughter from his first marriage and she was 6 years older than me. I say ‘was’ because she was disowned about 6 years ago for unrelated reasons. Anyways I don’t know when it started nor do I know when it ended and to be honest all I know is that it happened. When I was about 4 years old she full on raped me but I don’t like to think about it as that is the most gut trenching memory I have. My parents don’t know that it happened and in all honesty I don’t want to put the burden of what happened to me on them. My “sister’s” bio mom was an abusive drug addict and I know that in order to know what she knew she probably went through her own sexual abuse but at the same time I hate her with every ounce of my being as I blame her for why I can’t remember anything before the age of 9 or the fact that I had a fucked up childhood. I guess I just wanted to get what happened off my chest as literally no one knows and it’s something I’ve been hanging onto for close to 12 years.",
    "subreddit": "TrueOffMyChest",
    "title": "My older half sister molested me from around the ages of 2-6 and I’m finally going to stop pretending it never happened.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j915du/my_older_half_sister_molested_me_from_around_the/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 20:41:22 UTC",
    "id": "1j911s4",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 3,
    "secure_media": null,
    "selftext": "there was a time where i had a twitter where i posted certain things , used to send nudes to men on here. i feel lonely, one of the reasons i did it was to take control back of my body that my ex raped me for. i hate my body so much \n\ni deleted everything at some point and it feels like that’s all i’m good for. i feel like getting back to it and sexualise myself for money and company. i don’t have a love life at all which doesn’t help me \n\nit feels like my body is the only semi-decent thing about me and felt close to doing porn. a little irrelevant but i feel like being a stripper/escort or hire one to feel something \n\nedit: **PLEASE STOP MESSAGING ME FOR NUDES FUCK OFF also tried therapy multiple times and not going back** ",
    "subreddit": "TrueOffMyChest",
    "title": "wishing to go back to my old ways",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j911s4/wishing_to_go_back_to_my_old_ways/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 20:35:12 UTC",
    "id": "1j90wb1",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "This is my first year in college &amp; when I first started in I joined the freshman gc. About a month of into the semester, I haven't made any friends. I texted the freshman gc &amp; see if anyone wanted to be friends. Angela responded, we met up, and she introduced me to her friends and we've all been hanging out since. Yesterday, I'm getting texts in the gc but I'm not really reading them until I see Angela says my name. I respond how did my name get brought up. Angela says when we all were hanging out yesterday I didn't engage with anyone or say anything and it took her a minute to realize I was there. Then Angela, Randi, &amp; Kasey are all basically saying I don't talk when I'm with them, all I just follow them around, force them to sign me in their dorm to \"hangout\" with them, &amp; they know nothing about me. I texted back saying \"I do talk sometimes its just sometimes I don't talk bc of social anxiety or bc I have nothing to say. The other day only asked yall to sign me bc it was raining hard and I didn't want to walk across campus to my dorm in the rain. I wasn't going to hangout yesterday but then after we left the dining hall Brigitte said she would sign me in and I felt bad asking her to sign me out after she just signed me in. If yall don't wanna hangout with me I won't come around anymore.\" Angela, Randi, &amp; Kasey said we do want to hangout with you we just want you to talk and engage with us instead of sitting there and being a wallflower and something must be wrong with us since you been with us since last semester. I tell them nothing is wrong is them its me and I'll feel like I'm not anyone's friend in the gc and it's my fault bc I don't talk enough but I'm trying more now that I'm in college and I'll still eat with yall and try to more but idk abt hangout rn. About 5 min after I send that message I was walking to class with my I was walking to class with my headphones on and passed Angela. I didn't feel like talking so I didn't say anything. She responds to me in the gc saying I said hi to you and you literally just ignored me. how can we get to know you if when we give you the opportunity and you're not here with us I respond to her and say I didn't see u I had my headphones on and I was going to class. Then Kasey says you did see her. Then a few of the other people in the gc tried to defend me. Today I walk in the dining hall and I see some them sitting together. Usually I go sit with them or least say hi but after yesterday I felt weird doing that. They never spoke to me and I never spoke to them. I'm not sure how to feel about this. I just wanted friends but now I feel even more out of place.",
    "subreddit": "TrueOffMyChest",
    "title": "I was called out for being too quiet and now I feel weird around my friends",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j90wb1/i_was_called_out_for_being_too_quiet_and_now_i/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 20:32:01 UTC",
    "id": "1j90tls",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 3,
    "secure_media": null,
    "selftext": "Anxiety sucks. I've been having an ongoing issue with two co-workers who have basically just been mean girls since the day I started a couple years ago, and the only thing that I'm guilty of doing is trying to do my job to the fullest, which I know they haven't been a fan of because I draw more attention to our team which means more work might be given to our team and more responsibilities which they don't want. I know they don't want this because they have actually vocalized that to our manager, whenever there's a chance for more opportunities or extra work to be done they both shut the idea down so hard and fast and I'm usually the one who's okay doing the small tasks.\n\nThere's multiple incidents where they have both been unprofessional and have come at me in aggressive ways for various reasons. Every single incident has had another teammate witnessed the whole thing. my manager is aware that there is an ongoing issue and there have been corrective actions taken for one coworker since they have complaints in multiple departments from multiple people.\n\nAnd last Thursday they decided to ambush me in a meeting accusing me of not doing my job or avoiding work and insinuating that I was lying when I tried to tell them what was going on, and I had it, so I talked to my manager and they suggested I go to HR, because if I didn't they were going to report it so I figured well if it's going to happen one way or the other I might as well do it. so I reported this to HR something I have never done before. And I have anxiety through the roof, because I've never gone to HR with a problem before because normally in my other jobs the mean girls are the girls that the managers adore and they see me as the problem.\n\nSo in my head I'm going to lose my job because I'm the problem, when I haven't instigated anything. And I hate that I think that I'm the problem and I hate that I have so much anxiety for just trying to stand up to myself and have a non-toxic work environment and not be disrespected in front of my coworkers or at work.",
    "subreddit": "TrueOffMyChest",
    "title": "Workplace drama",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j90tls/workplace_drama/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 20:25:40 UTC",
    "id": "1j90nz8",
    "link_flair_text": null,
    "media": null,
    "num_comments": 94,
    "score": 167,
    "secure_media": null,
    "selftext": "As the title says my (m17) girlfriend (f17) just called me misogynistic and I dont really know how to think about it. We were talking in the phone and somehow got to the topic of our future life together and about how many kids each of us would like to have. I think about having two kids later in life, however she only wants one. Because I would really love to have two kids, I listed her some things in which my own siblings  helped me a lot and how good it would be for the kids to have a sibling. Then she said that my view is misogynistic as I wouldn‘t leave her room to chiose freely\n\nSorry for the spelling/grammar mistakes, English isn‘t my first language\n\n\nEdit: My sisters were there for me while I was bullied a lot, and were my only real „friends“ i had during that time, thats what i meant when I said they helped me a lot es",
    "subreddit": "TrueOffMyChest",
    "title": "My GF called me a misogynist",
    "upvote_ratio": 0.85,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j90nz8/my_gf_called_me_a_misogynist/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 20:23:36 UTC",
    "id": "1j90m78",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 0,
    "secure_media": null,
    "selftext": "Met the girl of my dreams, cutes big eyes, bright smile, fun and energetic, close to GOD, i 1st met her at grade school but we were not that close at those time wasn't even interested at her during those times but i admire her energy and her eyes, time skip to highschool i would often remember her idk why i would suddenly miss her, i only get to be her classmate for once, but her face, eyes and smile is somehow drilled in inside my head, after then i started stalking her socials rarely since its set on private there wasn't much to see, graduated highschool and im still somehow missing her, later on i met her on a senior highschool conference, she still looked the same as the last time i saw her, she was much more cuter and prettier in person, i never knew someone i admire from a long time ago would grow up to someone like her, i do like to approach her, i did a small hi gesture but she doesn't seem to have notice me, after then i realize than she may not recognize me or know me at all anymore it was natural since i never really made much of  connection even back then, she pick a private school and i goes to a public senior high, somehow i would often see her on my way to school and found out she lives nearby my school, so eversince then i would often go late to school just to time her going out for her school too, i never interact on her during those times, later on i gathered courage to talk to her through online and surprisingly she does reply and talk, she then gotten close enough to meet up, and we started off good, she was kind of flirty in a friendly way or im just delusional, and to this day i just confessed my feelings to her but i never mentioned how i liked her for years as i dont want to seem like a creep or a stalker, i really thought i had a chance on her, but i guess its just way too good to be true, i wished i just kept my mouth shut and let things be the way it is, in just a few words i broke that one thing that is keeping me by her side, now im just dating a girl that resembles her but the eyes could never be the same, i think im about to break and create someone like me",
    "subreddit": "TrueOffMyChest",
    "title": "Sometimes its too real to be true, just got rejected",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j90m78/sometimes_its_too_real_to_be_true_just_got/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 20:13:55 UTC",
    "id": "1j90dxn",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 4,
    "score": 0,
    "secure_media": null,
    "selftext": "\n\nFor context, I (45F) have rental policies which I'm very particular about. One of these policies is that tenants are prohibited from having any colors in their house except beige, white, and black. Although this might seem strict, I allow tenants to have colorful screens, clothing, and food boxes (albeit in the trash). I also provide storage for food, which is properly colored to fit my needs. I also do check-ins every two months to make sure my terms are followed, and the property is not damaged. Occasionally, they'll be unannounced so there will be no cover-ups.\n\nOne of my tenants (29F), has been renting with me for five years. We went over the lease agreement, and she agreed to my terms. Since then, she has gotten pregnant and birthed a beautiful baby girl named Paisleigh, whom I insisted upon the name for.\n\nIn the present, it's a brisk August morning. As usual, I go to check my property. It is completely in shambles. The decorations, furniture, walls, and all of that were fine, but there was one massive oversight. Toys scattered everywhere. I would be fine if they were correctly colored, but no. These are colorful toys. Dolls, stacking donuts, blocks, wooden cars, rubber ducks. It was such a disgrace to my property, I had to look away. I reminded my tenant that of course, she can have toys in the house, but they must be in accord with the rental policy. She apologizes, and I leave. I thought my warning would be okay.\n\nFast forward to a few months later, I return, again unannounced. Still, she keeps these pigmented, bright toys around. I further warn her, but it's not enough. She insists bright colors are good for development. Later that night, I enter her house using my spare key, silently creeping into her room. The baby is sleeping inside a playpen, so no worries there. I wait to make sure that she's truly sleeping, then I pounce. I acutely latch onto her throat, and she screams. I feel her voice box vibrating through my strangling hands as she tries to scream, but nothing comes out, just sputtering and choking. I keep choking as she thrashes about, until around three minutes later, and I know I'm done. She has no pulse, and her body is as limp as a ragdoll.\n\nI transport her corpse and the sleeping baby into the car, driving to a beachside town to dump the body. I drive back to my house, and I don't know what to do with the baby, so I decide to barbeque her. As she sleeps, I preheat the grill, lighting it ablaze, and then after about 14 minutes, I set her on the cooking rack. Soon I can hear wailing from under the hood of the grill, before she could gasp for air anymore. It's terrible and loud, but eventually, with the smell of charred meat, it ceases. I drive to a nearby college town to dump the second body.\n\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "I let my tennant go after she broke my policies.",
    "upvote_ratio": 0.14,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j90dxn/i_let_my_tennant_go_after_she_broke_my_policies/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 20:12:07 UTC",
    "id": "1j90cgj",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "My (25M) gf(22F) has 5 exes, which two do them had my same name, even one of them having my same surname, she kept it a secret from me for 5 months until she invited me to her house and met the fam, overnight I had to go to the bathroom and heard her sister and mother talk about how another one with the same name, I kept myself the secret and pressured her with hints, she wouldn’t say, she was just sad and changed subject of conversation, after 2 months of knowing I confronted her and said it was a secret she was going to take to the grave if I didn’t found out, or maybe until marriage. Also her body count being 9 and mine 2, which wouldn’t bother me if I wasn’t a guy who hates one night stands and she had had 4. I don’t know… I can’t find the courage to end the relationship as she had had exes beating her or cheated on. Sometimes she relates those men to me and even her father which abandoned her at 5, every small resemblance I have with an ex or guy that did her wrong I will do the same thing according to her. I want to make peace, she’s just had many experience and can’t seem to move on. I’m constantly worrying and everyday is a small fight. I love her but damn life is hard.",
    "subreddit": "TrueOffMyChest",
    "title": "Making peace with gf past",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j90cgj/making_peace_with_gf_past/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 20:11:48 UTC",
    "id": "1j90c73",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 5,
    "secure_media": null,
    "selftext": " To preface I am in college now and this was almost 3 years ago. Okay so I (F 20) had a big group of friends in high school. We all got really close senior year and there were a lot of characters so I will be using fake names. It was around prom season this whole thing started. There was a boy I was talking to and he wasn’t super favored by alot of people but everyone talked to him because he was like a class clown. We’ll call him Jacob. Jacob had originally planned of going to prom with a girl Tess. Tess never wanted to go with him so when he met me and we started talking he told her that they shouldn’t go together because it would have been boring because she didn’t even want to go with him. This was wrong I know and should’ve told me something because me and Jacob went on to date and he was actually insane. \n\nAnyways this caused a big drama and caused Tess and her close friends to hate me. Tess’s friends were friends with some of my friends and my friends began to act weird to me. Not talking to me all that often but that was fine because I still had my core friends. My core friends being Sasha, Kylie, and Khloe. I ended up having a falling out with Kylie and Khloe too due to all of our other friends deciding to hate me for dating Jacob but that’s besides the point. \n\nJump to prom and all of the weird behavior continued and I had to go on a party bus with all the people who I know knew were talking shit about me. I ended up leaving with Sasha and Khloe because I couldn’t stand to be on the bus and we met up with Jacob. Prom ended so odd and it was clear no one wanted to talk to me because I was with Jacob. \n\nFast forward to the summer after prom. One of the boys who was in my old friend group posted something on his spam story on Instagram with a video from the party bus from prom, “ Missing prom. Don’t see any ‘dirty looks’ but I digress”. This was a direct dig at me because I had told Khloe that whole group had been giving me and Sasha dirty looks on the bus.  Me and Khloe had already fallen out by this time . (Sorry for all the jumping around Im just trying to give context). So I tell Jacob who I’m already dating by this point that he had posted something so Jacob decides to post on his story a picture from prom captioned “I loved prom but definitely not those dirty looks😍”. This starts a war in instagram notes of all places. We’ll call the boy who posted Joey. Joey begins posting in his instagram notes saying how me and Jacob are so mad and then begins and argument with Jacob on instagram notes. I was mortified because really? Instagram notes? \n\nBut anyways they go back and forth with petty comments to each other but I stay out of it. This goes on for probably 20 minutes. Then joey decides to personally attack me and posts “Letting him hit in 3 weeks? Not very disney of you” And he always used to say I could be an actor on Disney channel so I knew this particular comment was for me. I start crying because now personal information is being shared. Oh and every person I used to be friends with was egging him on in their instagram notes. I want to be clear that other than going to prom with Jacob I had never said or done anything to any of the people that were mad at me and posting about me. Joey keeps going and decides to post about things I only told Khloe and Kylie. About my personal sex life with Jacob. Joey posts that on instagram notes and I freak out because now everyone is looking at this and most people know it’s about me. \n\nThat’s when I start getting texts from fake numbers. Slut shaming me, calling me ugly, threatening me and telling me to respond. I couldn’t deal with it. It all ended 20 or so minutes later but I was like wtf. I don’t talk to any of these people anymore other than Sasha. Jacob ended up being a maniac so we broke up. Anyways this all happened almost 3 years ago I guess I just wanted to see what people would say and if going to prom with Jacob made me deserve all this?",
    "subreddit": "TrueOffMyChest",
    "title": "My high school friends posted about my sex life of instagram",
    "upvote_ratio": 0.73,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j90c73/my_high_school_friends_posted_about_my_sex_life/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 19:54:56 UTC",
    "id": "1j8zx5c",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 2,
    "secure_media": null,
    "selftext": "\n\nI’m so jealous of people who go to art school. That was my lifelong dream, but I can’t pursue it due to future anxiety. The socio-economic condition of the world is so uncertain, and I don’t want to throw my future away. It’s not that I don’t trust my skills, but I still find it very risky.\n\nBut whom I despise the most are the talentless people who go to art school. I’ve been putting effort into this field since childhood. I’ve been practicing every medium, trying to learn every technique; studying color, objects, anatomy, proportions—everything… I put my years into my current skills. But for example the people who graduated from my high school that decided to study arts in university—none of them put that much effort into it. Most of them went to art school because they weren’t good enough in any other subject, and this felt like the easiest choice. They took classes in their senior year to create a decent portfolio, and that’s all. All they did was tracing shitty Pinterest drawings before that. And some of them are nepos, who got into art colleges by mostly using their parents’ connections.\n\nI’m jealous, I’m so fucking jealous. They don’t deserve it. It should’ve been me.",
    "subreddit": "TrueOffMyChest",
    "title": "This post can make me sound arrogant and condescending, but at this point I can’t care.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8zx5c/this_post_can_make_me_sound_arrogant_and/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 19:54:26 UTC",
    "id": "1j8zwps",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 27,
    "secure_media": null,
    "selftext": "Well when i was under the age of 6 i had 5 siblings. The two came after I turned 10. I didn't play with them at all because by the time the last two were of playing age I was already a teen. \n\nBut my mom always made sure that we behaved in public. Whether it would be by her pulling us to the side by the ear and threatening an ass whooping or to leave us at home, it worked. We would walk single file behind her, sit at restaurant tables and chat quietly with each other, never raising our voices. We ended up homeless for a year or two when i was young, so we were put in one small room. We were made to clean the house and learn chores so we could help the people we were staying with. \n\nWhen my mom was able to find a house, she said it was always hard because renters always thought that many kids wouldn't be worth a tenant. So anytime we moved we would clean the house spotless. We moved a lot. We also would clean spotless whenever the land lord was visiting. \n\nMy mom knew how it looked to have so many kids behind her, especially when her husband wasn't around because of work so it was only him. She thought people saw her as a poor, ghetto woman with an army of kids who she couldn't control so she made damn sure we wouldn't be like that. \n\nBut like why have that many kids in the first place.... or continue having them even after experiencing homelessness? We were back and forth between many of friends and family after my parents divorced. And we moved 13 times before I was in high school. Yet she still had kids but that's another topic for another day.... \n\nThat basically taught all of us to keep up with appearances. My mom was also incredibly mentally, physically and emotionally abusive so there was always fear in my house. It was my siblings and I against her, so we were all close and together. \n\nBut then we started to turn on each other as we got older, probably from my older siblings maturing and growing bitter and angry at the abuse. I'm going through that phase now. \n\nEither way it led me to become emotionally detached from my siblings. There was always just so many things going on, it was hard to keep up. \n\nOnce my older siblings moved out I was the oldest in the house and it became my responsibility to cook and clean for everyone. I got tired of it and moved out a month after graduating. \n\nI got sick of taking care of others when I was a child, so I just left. Another step i took to separate myself from my family. \n\nSure, having big families are fun. It's never quiet, immediate family reunions are crazy and loud (my mom also had 7 siblings so imagine how big they got), you get to grow up with multiple best friends, but when you have an emotionally and mentally unstable mother with an enabler husband, it's terrible. Never a peaceful moment, especially not with the homelessness or having to share rooms with siblings when we got our own houses, constant arguments because nobody knew how to regulate themselves and constant abuse. \n\nIt drove my older sister insane. I haven't seen her in years. It's driving me insane now. \n\nI never had room to be myself, not until after i turned 18. I never got to properly develop so now I have mental issues. And chronic illnesses. \n\nGrowing up with 7 siblings was hard. My mom's attention was only focused on the younger one. Yeah, we would have fun times and a lot of them but that doesn't overshadow the abuse or anything else.\n\nI always get jealous of people who are close to their siblings. I can never have that, not anymore. I can barely form and maintain friendships, much less familial relationships. \n\nNot to mention how people react whenever i tell them how many siblings I have. I've had to fight  few people who talked crap about my mom being a whore. My siblings have had to fight other kids for the same thing. Nothing says bonding time more than beating the kid who made fun of your younger sibling. Classy? No. Fun? Yes. ",
    "subreddit": "TrueOffMyChest",
    "title": "Growing up with 7 siblings in a low middle class family has really shaped me",
    "upvote_ratio": 0.91,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8zwps/growing_up_with_7_siblings_in_a_low_middle_class/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 19:54:06 UTC",
    "id": "1j8zweu",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "My manager is such a bitch.\n\nHas no control over his emotions, gets over stressed out and takes it out on everything. I am typing this as he threw a temper tantrum and left the office to smoke half a pack of cigs. No sense of professional communication or aptitude to handle adversity or difficult situations thrown at him.\n\nI hate it working under him- while he is forsure more experienced than me. Just as a man I feel I’m better suited for his job. \n\nHe consistently procrastinates and then wonders why shit doesent get done. He is an asshole to people in our building and doesent understand why our department gets such a bad rap.\n\nBut I’m only at this job temporarily I will continue to deal with it. I’m just glad I realized it wasn’t me, he is just a bitch.\n\nIf you feel the same please comment!",
    "subreddit": "TrueOffMyChest",
    "title": "My manager is such a bitch",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8zweu/my_manager_is_such_a_bitch/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 19:39:07 UTC",
    "id": "1j8zj6o",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 19,
    "score": 3,
    "secure_media": null,
    "selftext": "No matter what, I don't see how life is worth living. I don't know if it's due to the fact that I'm missing something and I'm just too stupid to see it or if I'm actually smart and thinking about things that an average person wouldn't, but I see life as entirely meaningless.\n\nIt doesn't matter whether I assign my own meaning to it or accept that it's objectively meaningless and do what I want, there's nothing that justifies the suffering that is inevitable, no matter how good your life is. Besides, no matter what anyone accomplishes, they will eventually be forgotten and their accomplishments will also go to waste. Living for the little things/occasional moments of joy and assigning meaning to them doesn't make any sense to me.\n\nI can't even really talk to anyone about this, besides my therapist (therapies haven't been useful ever since I started going a few years ago btw, even after switching therapists), because nobody seems to understand it and they are just fine with working their pointless 9-5 jobs. Even if you don't work a regular 9-5 and actually like what you do, it still seemingly doesn't matter in the long run. Everyone would just scratch it off as mental illness and not think about it any further, but nobody so far provided me with a solid argument against this nihilistic thinking. I guess that's what I'm looking for. One god damn thing that objectively makes sense.\n\nAnyways, that's all from me. I really doubt that I'll be around for much longer, but whoever might be reading this, thanks.",
    "subreddit": "TrueOffMyChest",
    "title": "It frustrates me that no one relates",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8zj6o/it_frustrates_me_that_no_one_relates/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 19:29:55 UTC",
    "id": "1j8zazc",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "",
    "subreddit": "TrueOffMyChest",
    "title": "Not many people know this about *scars*:  Whether they're emotional or physical, they're not really *healed*.   There is a tiny residual numbness from each one that will be there for the rest of your life.",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8zazc/not_many_people_know_this_about_scars_whether/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 19:29:32 UTC",
    "id": "1j8zaob",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 8,
    "score": 3,
    "secure_media": null,
    "selftext": "When I was a teenager I got away with a drunk driving incident that totaled my car and damaged three more. \n\nNo one died, but the airbag of the car I hit from behind didn’t go off and the driver broke his nose on the steering wheel.\n\nI was so young at the time my family took care of the insurance correspondence while I delt with legal stuff for a hit and run charge that came from it.\n\nMy mother was going through old files and found her folder of all the documents from that time.\n\nI read through them and found out the extent of the man’s injuries who broke his nose. Whiplash so severe he lost work, peace of mind, and quality of life. I never knew these things until now and I couldn’t help but cry reading the reports. I don’t know why I never thought it was more than a broken nose, but I was young and unstable and I guess I had other priorities.\n\nIt probably wouldn’t have helped my state of mind knowing at the time, but something about it feels wrong learning so much later in life. \n\nIm an adult now but still ‘young’ enough that people I’m not close with don’t really respect when I tell them I’m sober. The people I love will never know the extent of the shame I feel when I drink. None of them know the real reason that accident occurred for certain, but I’m sure they’ve suspected.\n\nSobriety is a bitch but self pity wont fix an injured neck. \n\nTLDR; I found out the true extent of injuries I caused in a drunk driving incident. No one ever knew I was drunk and I faced very few consequences considering the circumstances. Don’t drink and drive.",
    "subreddit": "TrueOffMyChest",
    "title": "I totaled my car drunk driving",
    "upvote_ratio": 0.64,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8zaob/i_totaled_my_car_drunk_driving/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 19:27:24 UTC",
    "id": "1j8z8t3",
    "link_flair_text": null,
    "media": null,
    "num_comments": 35,
    "score": 29,
    "secure_media": null,
    "selftext": "My (30f) ex (33m)  is dating a neighbour in my building. We broke up about 8 months ago. We were together 3.5 years. Throughout the course of our relationship there were definitely issues. We lived together for two years and after the break up we still lived together for a month and a half as we had to sell our house. What's wild is we talked about getting married two months before we broke up and he was 100% on board. We broke up over a really intense fight where he blamed me for something he lost. It's a long story, but we fought for 3 days, decided to take a break for a week to think about what we wanted to do about this. He decided to end the relationship.\n\nLiving together still was hell. He was awful. He threatened to throw my stuff away because he thought I was dating. I found out he made two catfishing dating profiles right after we broke up which he later matched with me on and then would block me. I found out from a close friend of his what he was doing. Curiousity got the better of me. I made a real profile of myself to see if it was true. He swiped on me, blocked me, and remade those profiles a few times. He called me dumb each time I disagreed with him with things concerning selling our house. He skipped out on the last mortgage payment. He also refused to help prepare the house for sale. I did everything on my own. Meanwhile he still ate my food, kept walking in on me while I was changing (the door didn’t lock), and would sometimes pressure me to still sleep in our bed because as he put it: “we slept together for almost 4 years, what’s a few more nights.” He also got me an insanely expensive birthday gift and wrote me in as a plus one to a wedding both after we broke up. For weeks after he moved out, he kept trying to sleep at our old house for a whole week. I put my foot down here and told him I needed space. \n\nI tried to be respectful as possible from the start to honor his wishes. I didn’t want to be with someone who didn’t want to be with me. Besides one conversation about our relationship after we broke up a few weeks in, I left him alone. I only talked about the house or things we had to communicate about. I tried setting some boundaries, but after he called me dumb, I gave up and bit my tongue through it until he moved out. \n\nHe always knew where I was moving to, it was also in our documents for the notary. I told him when I found a place which street and he mentioned the building. Since I moved in, I swore I saw him often driving by. I knew he bought a car (that also looks incredibly similar to mine). I also was pretty sure I saw his bike parked outside my building a few times. I heard from a cousin who followed him on Strava that he also ran close to my place or in my street multiple times a week for months. Then there was when I had a dating profile, I saw he was on there for real as himself and it kept saying he was 650 feet away and sometimes 1 mile away. I'd sometimes block him and then he'd have a brand new dating profile again showing the same sometimes. Each time I deleted him, for months he popped back up. It was triggering me so much. I did delete all dating apps two months ago. I had a stalker (different guy) for five years with court dates and all. This same ex helped me through this. He was so empathetic about everything I went through with having a stalker. And here my ex is, also invading my space. In a different way, sure. \n\nNow last Saturday I saw him help a girl move a piano in. He was in the entry way of my building. I felt my heart race and my anxiety spike. There was another guy there so I was hoping that maybe this guy was her boyfriend and he was just friends with them. Then this morning, as I was returning from walking what used to be our dog (now just mine), he walked out of the elevator freshly showered. He smugly greeted me as if I was an old acquittance.  As I looked out the window of the elevator, I saw he used a key to the building. That made me feel a bit uncomfortable too. I was now even more suspicious and panicking. I texted a mutual friend. I don't care that he's dating. If I saw him in the city on a date, I probably wouldn’t react much. I do care that he's in my space. The mutual friend confirmed he's seeing someone and told me her name. We have a group chat with everyone that lives in the building and low and behold there she was.\n\nJust...what the fuck. Who does this? He knew when he probably first went to her place that I live here too. And when I guess things got more serious, he also knew. What's worse is that that friend told me a friend of ours set them up who also knew exactly where I moved to. If I was dating someone and I found out they lived in his building, I’d either stop seeing that guy, I would send a courtesy text, or I’d at least ask the person I’m seeing if we could primarily hang out in my building. \n\nI feel he could have at the very least sent a message. I thought I was being paranoid for months thinking I saw signs of him being in my space. Now I hate the fact that I may run into him this often, but I would have much rather known he’s dating someone than think he was stalking me. I also was just moving on with my life. Seeing him is still a bit upsetting. It's one thing if this was years later, but it's only been 8 months.\n\nAll of the things he's done since…It's so unbelievably cruel. I am so angry. I haven't messaged him because I don't think he'd respect my boundaries. I just want to move on. I deserve that. I don't deserve this.\n\nI've come to the conclusion that he should be the one who feels uncomfortable seeing me. Not the other way around. I shouldn't have to feel uncomfortable in my own space.\n\nSorry for the cursing, but what a motherfucking asshole. Never called an ex that, but he absolutely deserves the title.\n\nJust needed some other people to know about this jerk.",
    "subreddit": "TrueOffMyChest",
    "title": "My ex is dating my neighbour",
    "upvote_ratio": 0.81,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8z8t3/my_ex_is_dating_my_neighbour/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 19:00:48 UTC",
    "id": "1j8yl9d",
    "link_flair_text": null,
    "media": null,
    "num_comments": 11,
    "score": 61,
    "secure_media": null,
    "selftext": "The day I always feared has arrived. My cat looked completely disoriented, and his head was shaking uncontrollably. My brother took him to the pet hospital, and it turned out he has a tumor in his liver and another in his brain.\n\nI was deeply connected to him—we had him for 15 years. With everything I’ve had on my plate lately, this is the last thing I needed.\n\nI'm a 23-year-old guy, lying in bed, crying like a child. I always dreaded this day because of his old age, and now it’s here. The emotions are overwhelming. I don’t think I’ll ever adopt another pet again—the pain of losing them is too much. It’s just not worth it.\n\nSome people think, “It’s just a pet,” but they don’t understand. Try living with one for 15 years—it becomes a part of you, like family. I’m shedding tears as I write this. Why does life have to be so dark, so heavy? It’s hard, man. And it’s even harder when you’re a man, expected to bottle up emotions because showing them is seen as weakness in this fucked-up world.\n\nI can’t talk about this with my friends, so here I am, pouring it out here because I have nowhere else to go. I’ve been trying to pick myself up bit by bit after the negativity of the past four years… and now this?\n",
    "subreddit": "TrueOffMyChest",
    "title": "Had to Say Goodbye to My 16-Year-Old Cat an Hour Ago…",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8yl9d/had_to_say_goodbye_to_my_16yearold_cat_an_hour_ago/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 18:59:20 UTC",
    "id": "1j8yjxi",
    "link_flair_text": null,
    "media": null,
    "num_comments": 41,
    "score": 231,
    "secure_media": null,
    "selftext": "\nHi all. My mom has always treated me like I am her second favourite after my sister all my life. This has really messed up with my self esteem. Now I am married with a son and another one along the way. Anyways, there have been three situations where I asked her to come and stay with us for a bit. We initially both stayed in the same city but now are 2 hour flight away.\n\n1) First, my husband had a work trip in Oct last year. The morning sickness was at its peak at 3 months. And I just wanted someone around incase there is a medical emergency for 3-4 days. We have a nanny to help with my son for most of the day. So all she had to do was just be around. She refused saying she has a neighbour’s birthday party to attend. I let it go.\n\n2) Last month, I called her and asked her if \nshe can be with my son for 3-4 days when I will be in the hospital around my due date. Again the nanny is there. She just has to manage the night when he is sleeping. She refused saying she can’t leave my dad alone during easter time and needs to cook for him. My dad is a perfectly abled man who can cook his own food.\n\n3) Yesterday, my husband’s side of the family had an emergency situation and my husband had to leave for his parent’s place for 3-4 days. This time I was sure I will not ask my mom to come down again. But my husband called my mom and literally begged her to come down as he didn’t want to leave me alone with my son at this juncture. Her cold response was that she has to be with my dad and cook for him etc. She asked us to keep the nanny to stay over for a couple of days. I fully support my husband’s decision to be with his parents at this time for reasons I can’t divulge. \n\nAfter yesterday, I lost it with her. I told her that she wont hear from me again and she is a sad excuse for a mom who can’t even be with her daughter when there can be a medical emergency. And in case I die she need not come either. So she blamed me for moving cities without considering all this. And that my dad has slogged all his life to educate us etc. how can I think she can leave him and rush to me. For context, I moved cities because I got a better job that pays her bills to a certain extent and gives me some semblance of work life balance. As for my dad, he is not a baby.\nWhat kind of mother would want to miss the birth of her grandchild or not want to be with her daughter when she is almost due",
    "subreddit": "TrueOffMyChest",
    "title": "I have decided to cut ties with my mom after she refused to be there for me when I needed her the most.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8yjxi/i_have_decided_to_cut_ties_with_my_mom_after_she/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 18:58:56 UTC",
    "id": "1j8yjkr",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 0,
    "secure_media": null,
    "selftext": "People think that because they went a year without sex and it wasn’t a big deal, they can relate to someone who reaches 25, 30, or 40 years old without ever having kissed or held someone’s hand. They simply can’t. Everyone who tells me sex isn’t a big deal can’t truly understand it, no matter how hard they try. They can’t relate because sex (not just the act itself, but everything around it, like the confidence of knowing you’re attractive enough to attract someone) has become something they take for granted. Only someone who’s never experienced it can truly grasp its importance. You just can’t.  \n\nI know sex can be awkward, messy, or even empty. People get used, hurt, or end up feeling emptier than before. But here’s the crucial part: wanting to experience it doesn’t mean I’m chasing some idealized version. Even in its most ordinary forms, sex is still pretty great, and people still get something out of it. Otherwise, why would so many pursue it despite its imperfections?  \n\nIt’s frustrating to watch others freely explore, make mistakes, regret, have intimate conversations, go on dates, or even just buy condoms “just in case”—gaining experience all the while. People say, “Oh, but sometimes sex can be bad!” But many of us haven’t even had the chance to have sex at all, good or bad. That’s the frustration. \n\nTo all the virgins who want to claim it’s unimportant to them: I’m glad it isn’t for you. Maybe you have low libido, or dating isn’t your focus—that’s valid, and I’m happy for you. But just because you’re a virgin and don’t care doesn’t mean I have to feel the same.  \n\nTo the fatalists: Stop projecting worst-case scenarios and using your bad experiences to dissuade others. Using your story as a universal warning against sex is like telling no one to drive because you had an accident. Yes, sex can get complicated, like anything human, but that doesn’t mean we should avoid it by default or assume the worst.  \n\nAnd stop recommending prostitutes. First, it’s not legal where I live. Second, sex workers might satisfy curiosity about the act, but they can’t replicate the intimacy of someone choosing you.  \n\nTo everyone who says sex isn’t important: Would you trade places? Would you spend the rest of your life without sex, without being touched, without anyone calling you attractive? If it’s so “overrated,” why not? Would you stay in a relationship with a partner who never touches you, has sex with you, or makes sexual comments? If it’s truly irrelevant, this shouldn’t bother you. After all, if you tell me to “just focus on hobbies and friends,” you should be able to do the same to prove your point.\n\nAnd don’t hit me with, “Who says sex is overrated? No one says that!” I’m tired of hearing it in every post I make, or in others’ posts people claiming it’s “not a big deal,” “overrated,” or “no different from masturbation.” It’s a lie they don’t even believe themselves. They trot it out to comfort virgins, but in the real world, look how much energy, money, and drama people invest in sex. If it were “nothing,” why does it drive so much behavior? Sex isn’t everything, but it’s not “nothing” either.  \n\nIf sex is “overrated,” why don’t you stop seeking it? Why not live as if it doesn’t exist? Until then, your indifference just sounds like privilege disguised as wisdom.",
    "subreddit": "TrueOffMyChest",
    "title": "Being virgin sucks a people don't get it",
    "upvote_ratio": 0.39,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8yjkr/being_virgin_sucks_a_people_dont_get_it/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 18:47:51 UTC",
    "id": "1j8ya43",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I hate this so much. I hate myself for this. Yet… I need someone to talk to, outside my friends. I need relationship advice. I’ve never had a girlfriend, or anything serious in my life. Here goes…\n\nI am fully committed to this, so I will give my actual first name, but I will NOT give the girls their names, that would be too far.\n\nI, Alex, am an 18M currently in my senior year of high school, about to graduate soon. I am currently working on finding a way to get over a pair of “identical-ish” twins. I am a Filipino/White American nerd, whilst the girls are Filipina/Laotian (Laosian? Laos?… whatever…).\n\nThis story actually started years ago. Middle school… actually… (ouch it hurts to read this back.) In 6th grade, I was new… and mind you I was completely innocent and gullible. One thing let to another and within the first week of school I was tricked by the guys to say something inappropriate that didn’t correlate to my feelings with the girls at that time at all. During this time, I originally thought that the twins were really cool, one of them was super sweet and nice, yet an emotional storm when upset, and the other was a very sassy girl who completely destroyed anyone in her way. Total badass in my opinion. Anyways, once I hit summer in eighth grade… despite all the drama that happened to me, I… ended up being unable to forget them. Like… thinking about them, fantasizing… making up stories and scenarios… and to be honest… I think I was obsessed. \n\nThis did pick up again in early high school when I remembered that they were going to the school that shared the parking lot with mine. I go to an all boys, they go to an all girls. They have coed classes. This year,  a lot of feelings changed. I felt regret… disappointment, and… self-anger towards myself for liking them for this long. First half of senior year was horrible because I ended up having a similar situation with a different girl compared to what happened in middle school. Apparently the twins found out, and I don’t know what they did with that information. I talked to my best friend about all that I felt. I learned that the twins picked up some nasty habits and changed for the worse slightly…\n\nI still care… I kinda put everything and everyone else around me first before myself because when I was growing up, I was taught to treat everyone the way you wanted to be treated. What I didn’t learn is humanity isn’t perfect like that. Originally all I wanted was to be friends with them… but now they are stuck in my head and I wish… I really wish I could tell them everything… just spill my heart out and just… apologize for everything… and… I… I just don’t want to have a burned bridge between me and them.\n\nIf they see this… know that I’m sorry… very sorry… for all my thoughts, words, and deeds,\n\nAnd to everyone else… please… I don’t know what to do…",
    "subreddit": "TrueOffMyChest",
    "title": "I’m a sad story who can’t get over twin sisters.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8ya43/im_a_sad_story_who_cant_get_over_twin_sisters/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 18:47:02 UTC",
    "id": "1j8y9fu",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 0,
    "secure_media": null,
    "selftext": "At just 16 years old, I’m already thinking deeply about my future. Unlike many others my age, I’ve been through a lot that’s shaped who I am today. From helping my parents and carrying the weight of their struggles to pushing through the challenges of growing up, I’ve learned that life doesn’t hand you anything on a silver platter. I’ve had to work for everything, think for others before myself, and endure a lot of stress and anger. But at the same time, I’ve developed a mindset that sets me apart.\n\nOne of the key thoughts I’ve been carrying with me is the idea that “tomorrow is always promised. Tomorrow is always there until the day you die.” This isn’t just a saying for me—it’s something I live by. To me, this quote represents both a hope and a grind. It’s not just about letting life go by without thinking; it’s about realizing that each tomorrow is a chance to push forward, to fight for something better, and to build a future.\n\nI don’t want to be rich like some people dream of — I’m not asking for millions. I just want a stable, happy life: a two-story house in the suburbs, a good car like a Porsche Cayenne, a loving wife, and kids. I want to be able to give my family a better life than what I had, to leave something behind for my future family tree, so they don’t have to struggle the way I did. It’s not about me; it’s about building something that lasts for them.\n\nUntil a few months ago, I used to think life was just about living day by day, doing whatever you want, because we all die one day. But something shifted in me. Now I see life as a journey where you have to grind and grind and grind until you make it. It might not happen today, next year, or even in ten years—but eventually, something will work out. And when it does, that’s when you can finally breathe, finally enjoy life without the weight of stress on your shoulders.\n\nPeople judge me without knowing what I’ve been through. They call me immature, but they don’t understand that while they have a “cupcake” on their plate, I have a “wedding cake” — a heavy load of responsibilities and struggles that they’ve never had to deal with. I’ve grown up too fast. I’m 15, almost 16, but my life has made me feel like I’m 20 already.\n\nI  smoke to calm the pain, but I know I’m not addicted — it’s just a way to escape the stress. Nicotine soothes my anger, though I know it’s not a solution for the long run. I’ve tried\nWhat I really want is to focus on building a future. I want to master marketing and strategy because I know that’s the way to make real money. I’ve tried dropshipping and digital marketing — nothing worked — but I’m not giving up. I want to learn how to grow businesses, sell them, and build something meaningful.\n\nI don’t see myself as a normal person. I know I have a different mindset — a sharper, more driven way of thinking that most people my age don’t have. That’s why I believe I have what it takes to be an entrepreneur. I want to create businesses, not just for money, but to secure a future for my family and to leave behind a legacy.\n\nAt the end of the day, I don’t care about fame for myself — I want my family’s name to shine. I want people to know who we are, what we built, and what we stood for. Life might be hard now, but I keep pushing because I know that tomorrow is always there. Until the day I die, I’ll keep moving forward, no matter how tough things get.",
    "subreddit": "TrueOffMyChest",
    "title": "i’m 15 but i already feel 20",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8y9fu/im_15_but_i_already_feel_20/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 18:42:27 UTC",
    "id": "1j8y5dl",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "\n\nBack in December I started talking to this girl. We’ve been long distance but she’s been absolutely perfect. Shes been head over heels for me and kept telling me how good and pretty I make her feel and how lucky she is to have me in her life. She’s so loving and gentle and she has mentioned she had bipolar. \n\nThe topic has never really came up much other than she told me she doesn’t like how she is without her meds and that she becomes impulsive, and that if I ever feel a change in her I can ask if she’s taking her medication (this is important). For the last week she’s gotten more and more distant with everyday until she finally went full isolation. Thursday I texted her a long message about how much I appreciate her and she said “aww that’s cause you’re the best guy in the world” and throughout the day she got progressively dryer\n\nI gave her space cause I thought she might need it but later that day she asked me why I haven’t reached out all day. I told her I didn’t know what she needed and I thought she might need space. Ever since then she won’t talk to me, it’s always one word replies. I asked her if she loves me and she said she doesn’t know, I asked her if she’s talking her medication and she said “why does it matter?” Which is so out of character for her because she gave me permission to ask\n\nI broke down last night and told her I’ve been trying so hard to get answers and I’ve been crying non stop. She finally told me “I never meant to hurt you”. And then she said “I told you I had bipolar but you still decided to stay, and now I’ve made you upset” and I told her I still loved her and she said he needed to explain to me but she just can’t. Later last night I sent her a long loving text and she said “I’m sorry about all this”. She’s slowly opening up but not fully. Is this bipolar? She made a promise to me that she’d always be honest and tell me if she wanted to end things, so I’m trusting her promise\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "Is my girl in a bipolar episode?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8y5dl/is_my_girl_in_a_bipolar_episode/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 18:42:13 UTC",
    "id": "1j8y574",
    "link_flair_text": null,
    "media": null,
    "num_comments": 13,
    "score": 0,
    "secure_media": null,
    "selftext": "Early on, before we had actually started dating, she did mention she liked to post lewds on occasion (and even asked my permission to do so). Talking about it, she told me that she didn't post nudes and that it was more of a confidence thing for her. I said I was fine with it, so long as it was just lewds. Later on, when we were officially together, it came up again and I added the condition that it had to be sent to me first, and that I had the power to veto anything I wasn't comfortable posting. She agreed with no argument.\n\nThis hasn't been something she does often. We've been together and she's only posted a few times, and the couple times I did veto a pic she didn't complain or argue. I truly do believe she respects and values my feelings about this.\n\nThe first time she posted something (before we were actually dating) it was a bit... odd. Not really unpleasant, but not necessarily something I enjoyed. \n\nWhen she posted while we were together, I knew that I would not be okay with her doing this forever. At some point, if the relationship was to continue, I would need her to stop. I wanted to give it time. I didn't want to go up to her and say \"we've been together a couple months, time to add some new boundaries!\"\n\nThe most recent time she posted, I knew I wasn't happy with waiting longer. I felt I had to talk with her and let her know my feelings on it had changed.\n\nAnd I feel guilty about it. I do love her and want to out her happiness first. She also does have terrible self esteem and is extremely insecure about her body, so I can absolutely believe that she does it to help with her confidence. And a part of me wants to believe that if it helps her *in any way* to see herself and her body more positively that this is a necessary evil.\n\nBut I'm not okay with it continuing. I don't like the idea of her posting more lewds, and I want her to stop.\n\nAnd I don't even expect an argument from her! When we first talked about it she told me that, even if I said \"no\" she'd still choose pursuing a relationship with me over finding someone who is okay with her posting lewds.\n\nPaet of me expects her reaction to be apologizing for posting them. I almost expect her to be holding back her own tears of guilt for making me uncomfortable. And that just makes me feel even more guilty. I fear that I'm going to hurt her because I want to put myself over her feelings.\n\nI'm not interested in hearing \"I would never date *anyone* who even thought about doing that while dating me!\" Or \"bro, that was a major red flag. You should have ran when she asked you\" or anything like that.\n\nAnd I already know that I need to talk with her, and potentially end the relationship if she's unwilling to accept this boundary. I plan on doing it end of the week at the latest.\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "I feel guilty that I want my girlfriend to stop posting lewds",
    "upvote_ratio": 0.42,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8y574/i_feel_guilty_that_i_want_my_girlfriend_to_stop/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 18:39:57 UTC",
    "id": "1j8y325",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 3,
    "secure_media": null,
    "selftext": "In 2017, I graduated high school with a cosmetology license from a career center. Unfortunately I didn’t have my drivers license yet so I couldn’t look for work. Two years later in 2019 I finally got it and started looking for work; I had renewed my cosmetology license once during that time.\n\nMost of the salons I found wanted years of experience and skills which I didn’t have. I found a few salons that said no experience necessary and applied to those. I got three interviews: two in person and one over the phone. The in person salons rejected me because I had no experience; I turned down the phone salon because I was going to be by myself and knew I wasn’t skilled enough for that yet. I tried other salons and didn’t even get interviewed.\n\nI eventually decided to try and find a part time job. I looked for months and only got one interview, a month after I applied, for a cashier position. They were so desperate I was hired on the spot.\n\nThat was in November 2019.\n\nThen March 2020 happened.\n\nI didn’t bother looking for a job during that time. The next time I looked was 2022. All the jobs I found wanted years of experience, were two hours away at $10/hr, in the next state over (where I’m not allowed to work), want licenses I don’t have, or some combination of. Month after month it was the same.\n\nI tweaked my resume every way I could think of: saying I was a student, saying I had no experience, only searching for salons in my state or in certain areas. Nothing worked. I even tried looking for internships; every single one said I had to be unlicensed and in school.\n\nNow it’s 2025. Everyone, even great clips, wants experience. I’ve given up. No one would take me now. Nearly eight years of no experience? No thank you! And even if someone would take me on they would have to hold my hand like it was my first day of school. Who even knows if what I learned in school is even relevant anymore? Would I even be useful in a salon now? And what clients would want someone like me doing their hair anyway? I surely wouldn’t. I’ll take the new grad thank you! At least their skills are relevant.\n\nSo I let my license expire on the 10th.\n\nTwo years of studying down the drain. Nearly $1000 down the drain. Nearly eight years of being licensed and what do I have to show for it? Rejections, expired unused licenses, and salons that require five years of experience, multiple skill sets from different beauty licenses, and existing clientele.\n\nI’m done.",
    "subreddit": "TrueOffMyChest",
    "title": "I let my cosmetology license expire",
    "upvote_ratio": 0.81,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8y325/i_let_my_cosmetology_license_expire/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 18:35:38 UTC",
    "id": "1j8xz7j",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I’m (F18),and I just left nursing school because I didn’t like it. Now I feel completely lost. I don’t know what to study next, and I’m scared of making the wrong choice. I don’t have a dream job, and my social anxiety makes everything harder. I don’t know how I’ll make friends again, and the thought of being around new people stresses me out.\n\nLately, I’ve been comparing myself to older girls who seem to have everything—beauty, money, and a clear path in life. Meanwhile, I do nothing. I spend my days on my phone, feeling useless. I have no hobbies or talents, while others my age can play instruments, draw, or do something creative. It makes me feel even worse.\n\nMy social anxiety keeps me from living. I can’t even go to the supermarket alone or speak up for myself. When I try to be social, I don’t feel happy—I just feel stressed. I keep forcing myself into social situations, but it never gets easier. That’s why I don’t enjoy life.\n\nOn top of this, my father hasn’t spoken to me in two years. He kicked me out because I wanted to study in a private school, and even though I came back home, he still ignores me. I feel angry because it was his fault, yet I’m the one suffering. I don’t even expect affection from him anymore—I just wish he would support me financially. Now, I can’t even afford basic things like clothes, makeup, or going out.\n\nI don’t know what to do anymore. I feel stuck, lost, and without purpose. I just wish I could find something that makes me feel like I belong.",
    "subreddit": "TrueOffMyChest",
    "title": "I Feel Stuck in Life and Don’t Know How to Move Forward",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8xz7j/i_feel_stuck_in_life_and_dont_know_how_to_move/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 18:33:51 UTC",
    "id": "1j8xxmp",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 0,
    "secure_media": null,
    "selftext": "-we are not related, she is just the wife of my uncle , but she is so beautiful, smart, nice and simply an amazing person and woman!!! 😍",
    "subreddit": "TrueOffMyChest",
    "title": "I have a crush on my aunt",
    "upvote_ratio": 0.25,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8xxmp/i_have_a_crush_on_my_aunt/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 18:23:07 UTC",
    "id": "1j8xoad",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 39,
    "score": 149,
    "secure_media": null,
    "selftext": "As the title says, my (going through a divorce) dad has been dating a woman of 22 years old for eight months now. She is younger than me by a bit, but we aren't certain of her true age. Her passport said she was 18 last year, but my dad said they lied about her age because 18 is easier to get into a country (???) (Visa issues? Idk. I can't wrap my head around an 18 year old GIRL dating my dad. He first said she was in her 30's, which is a bold faced lie.) This is obviously weird to me. I don't mind the woman, and I understand some women are attracted to older men (although there is a clear money incentive here, he pays her to be with him per month, paid for her passport etc.). \n\nBesides the pretty extreme age gap, to me, is also his sexual interests. He gave me his iPad recently as he got a new one. I opened safari and my dad didn't even bother to clear his history (to be honest I don't think he knows how to), the tabs were still open. All of them had titles of 'teenage girl does X Y Z.' or 'Barely legal does X Y Z'. You get what I'm saying. Listen. I get that men get urges, and that young girls probably look attractive. But for some reason I can't stop thinking about this. I can't stop worrying that maybe he looks at me in a similar way. Before all this he would sometimes joke that I should be his wife (when we did shopping or anything mundane really.). A lady once thought I was his wife, which was an insult to me I guess?? lol? but my dad just smiled and said, \"If only!\". The girlfriend has the same style as me, music taste, and even some piercings. I'm not sure if thats just a generational thing or something he actively looked for.\n\nWhen I was going through puberty and still getting used to my body I wasn't very touchy with anyone in my family. But my dad would always insist on hugs and kisses, even after I said no and that it makes me uncomfortable. I couldn't argue for my point because I'm his daughter - of course he should be allowed to hug me etc! So I just kind of sucked it up. There were also countless times where he barged into the bathroom or my room, without knocking. He has probably seen me countless times in the shower. He walks around his house naked too, which I have told him repeatedly I don't like and to please put on some clothes?? His hugs last too long and I just feel really uncomfortable with him. Before I thought it was just me and that I was the one who had a problem - but now I'm wondering if he crossed some lines? I have a younger sister who is around 18. Haven't talked to her yet about any of this or her own experiences.\n\nWhat's worse, the girlfriend has a four year old child (teen pregnancy) and he treats her (X) like his own daughter. But there are some weird things. For example, X frequently sleeps in the same bed as my dad and his girlfriend because she can't sleep otherwise. Thats fine with me, I probably also climbed into bed after a nightmare! Except they engage in sex on the same bed, and when I reacted with disbelief he said \"Well X is asleep.\" I highly doubt X can actually sleep through all that, but it's stranger to me to even think of sex when I have a child so nearby...? There's probably a lot more that he hasn't let slip, and most things I find out by accident on his part (sex toys in his gallery when I was trying to send a photo of us on our day out to my own phone is just one of many times I've accidentally stumbled on something I did NOT want to see.) He is just a weird guy in general, cheated on my mom countless times - even when I was just born. Has no close friends. I feel bad for him most of the time.\n\nI'm just worried and have a lot on my plate (moving houses, getting through my masters, helping my mom with the divorce, etc.) so I don't have time to unpack all this. if there is even something to unpack.   I'm adding a flair for NSFW for obvious reasons and sexual assault because a child might be involved. feels nice to just type this out. ",
    "subreddit": "TrueOffMyChest",
    "title": "my dad (58) is dating a girl around my age (22), and it's making me question some things",
    "upvote_ratio": 0.88,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8xoad/my_dad_58_is_dating_a_girl_around_my_age_22_and/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 18:11:22 UTC",
    "id": "1j8xe7v",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "Sorry if there are any typos, I'm writing this on my phone in the dark.\n\nI (15F) have been struggling with insecurities for as long as I can remember. About my weight, face, height, teeth and hair. I think it's because of my older sister  as she used to make fun of my appearance even in front of her friends.\n\nMy hatred towards my body has left me very sensitive, it's important to note that my mother died when I was younger so that also adds to my sensitivity. So it does happen for me to overthink every comment made about my body or anyone who looks like me in any way, shape or form. And because of that, I tend to cry a lot. And my sister still makes the same remarks and insults after years of seeing how much I don't like my body.\n\nThis evening, we were having dinner in front of the TV when my dad got up to wash the dishes. The series we were watching had a shot of a talkie walkie in the intro and my sister said that I was built like the object. It got to me and my dad saw it when I brought him the dirty dishes in the kitchen and asked why I was pissed. I said \"nothing\" because I knew if I told him why he would either tell me that she didn't mean it, or tell me to \"just ignore her\" like he always does. He started telling me how I need to \"stop acting like this\".\n\nI went back to my seat and started crying so I left to my room to cry in peace. I heard my dad yell from the kitchen how I was so sensitive and emotional and how I always just get outbursts and strat crying over nothing.\nMy sister then came to \"apologize\" saying that \"not everything is about (my) weight\", like she did when I got pissed off earlier at the table. I told her to leave me alone and she did, after saying: \"well, I tried to comfort you, I did what I had to do.\"\nThen she came back telling me to join them and when I told her to leave she told me I was overreacting and that \"it's not that deep\".\n\nAnd now as I'm writing this, I hear them joke around and laugh in the living room like one of them didn't body shame me and the one one didn't yell at me for showing emotions.\n\nAnd it's not the first time something like this happens. You can tell that she's the favourite if you were living with us, the way he talks to her, the way he treats her and her friends, the way he respects her boundaries and not mine, the way it feels like he's TRYING to make me uncomfortable with the \"jokes\" he makes about me and my guy friends.\n\nI feel like I'm not loved and I can't help but wonder that maybe if my mom was still alive, he wouldn't traet me like that or that she'd stand up for me. I can't wait for when I turn 18 and leave. I've been living this for so much and sometimes I don't even wanna live anymore.\n\nBut it pains me to think of my father and sister like that. I keep telling myself that they're good people, and sometimes they are but I feel their hatred overshadows their love for me and I'm honestly done.\n\nI've thought about writing here so many times because I truly have no one to talk to in real life. I don't feel like my bff would get it since her parents love her a lot and last time I told her about a \"fight\" I had with my dad, she took his side.\n\nI don't know what to do, please help me with anything, I'm tired feeling like an obstacle in their lives.\n",
    "subreddit": "TrueOffMyChest",
    "title": "I don't think my family loves me",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8xe7v/i_dont_think_my_family_loves_me/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 17:54:43 UTC",
    "id": "1j8wz0h",
    "link_flair_text": null,
    "media": null,
    "num_comments": 8,
    "score": 3,
    "secure_media": null,
    "selftext": "I (32f) feel like I'm at a lost with my husband(35m). Sadly I feel like I'm the crazy one wanting to have sex more often. I get lucky if we have sex every 2 weeks, but mostly it's every 3 to 6 weeks of waiting. Then I'll complain and a few days later he does initiate.  I think I'm emotionally drained from this repeating cycle and have no idea what to do. We talked countless times of problems and acknowledge previous concerns from him being attracted to me or low testosterone. He has been tested and it did come back low but he needs to take a second test. We still show each other affection hugs, kisses, and spend time together. I just feel stuck in this area and don't know how else to show him how much this is bothering me. I don't initiate anymore because he'd turn me down so many times and that started to hurt. Wanted to say this somewhere because I have no else to really turn to right now. ",
    "subreddit": "TrueOffMyChest",
    "title": "Don't know what to do anymore",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8wz0h/dont_know_what_to_do_anymore/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 17:51:31 UTC",
    "id": "1j8ww8l",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 0,
    "secure_media": null,
    "selftext": "Hi everyone, I’m a 23F. Not really sure what to do in the situation and could use a little advice on how to proceed. Recently, there have been 2 new hires at the company I work at. Let’s call them Tyler (31M) and Sam (not sure what age but I assume also around 30). We had a happy hour about a month ago and I hit it off with the both of them. I noticed that the both of them were kind of flirty with me. However, I particularly got close to Tyler. He was opening up to me about his life. At first I found it a little strange because he dropped a lot of information on me so early on. Over the past few years, he’s lost several family members and told me his struggles with alcohol. I was there to support him and invited him to an event. That went really well, and we ended up hooking up, which might’ve not been the best choice, given that we work together. However last week, he asked me to grab a drink with him in the morning and I said no, because it would be a bad look to be drinking on the job. I met up with Sam, the other new hire after work that day and he knew what was going on with Tyler as well. Sam also mentioned that he has a girlfriend, which I was shocked to hear. Tyler asked me to hang out this week but I’ve been hanging low and trying to dodge him a bit. How do I proceed? Should I confront Tyler? I just don’t want to create a toxic work environment for all parties involved. ",
    "subreddit": "TrueOffMyChest",
    "title": "Found out work fling might have a gf",
    "upvote_ratio": 0.4,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8ww8l/found_out_work_fling_might_have_a_gf/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 17:51:16 UTC",
    "id": "1j8ww00",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 3,
    "secure_media": null,
    "selftext": "she is very hard to live with, soon I will be able to leave and get away from her and move away. I'm counting the days, I'm excited to finally leave. \n\nI'm writing it here because I have no one other than my best friend to tell. I wish my parents believed me. Either way, in a few months I'm free from her",
    "subreddit": "TrueOffMyChest",
    "title": "my 30 year old sister physically attacked me today",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8ww00/my_30_year_old_sister_physically_attacked_me_today/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 17:50:09 UTC",
    "id": "1j8wv0o",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "After giving a shot at love time and time again, I think I’m finally giving up. I dont have anything left inside me to try with someone else just for them to hurt me in the end. ",
    "subreddit": "TrueOffMyChest",
    "title": "I’m loosing my spark",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8wv0o/im_loosing_my_spark/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 17:30:54 UTC",
    "id": "1j8wdwh",
    "link_flair_text": null,
    "media": null,
    "num_comments": 17,
    "score": 53,
    "secure_media": null,
    "selftext": "Throwaway account for obvious reasons. \n\nWhen I was 14, I unfortunately had unrestricted internet access. I ended up on Omegle and met a guy who was 20 at the time. I lied and told him I was 18. We really clicked, exchanged Snapchats, and talked for a while. \n\n&gt; fucked up bad on my part, i know. \n\nAbout a couple months later (another fuck up), I started feeling guilty and told him the truth about my age. He rightfully freaked out and cut off contact immediately.\n\nFast forward almost a decade, I’m now 23 and obtaining my master’s degree. I was visiting a local museum when I thought I saw him. I wasn’t 100% sure it was him at first, so I made casual eye contact a couple of times before pulling the ole, “Hey, sorry, but you look really familiar—do we know each other?” We ended up catching up, exchanged numbers, and started talking again.\n\nWe got along just as well as we did back then (except this time, I was actually an adult). After a while, we went on a date, and now we’ve been seeing each other for almost a year.\n\nHere’s the problem: when I was 13, I told my mom about him. I had lied to her about his age (because I thought I was in love and didn’t want her to shut it down), so she remembers details about him. Obviously, she was protective back then, but since nothing ever happened, it eventually became a weird teenage memory.\n\nI really like this guy. I think I see a future with him. But how do I tell my mom that I reconnected with the same guy I “fell for” as a naive 13-year-old? Do I just tell her the truth and hope for the best?",
    "subreddit": "TrueOffMyChest",
    "title": "I (f23) reconnected with a guy (m29) I met at 14",
    "upvote_ratio": 0.83,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8wdwh/i_f23_reconnected_with_a_guy_m29_i_met_at_14/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 17:29:51 UTC",
    "id": "1j8wcxx",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 1,
    "secure_media": null,
    "selftext": "TL;DR: I have a deeply magnetic connection with a close friend that feels like it transcends labels. We’ve spent countless hours talking, traveled together, and shared moments that feel intimate and meaningful—but she’s also in a relationship with someone else. She never explicitly confirmed or denied our interactions as “dates” but always showed up. I don’t know if I’m caught in limerence, if we’re karmically connected, or if she’s just enjoying my presence while keeping me at arm’s length for her own reasons. Looking for nuanced perspectives.\n\nI 28 F, met my friend 33 F, at an event back in 2021, and from the moment we met, we clicked. There was an instant pull—long, deep conversations, effortless understanding, and a sense of recognition that felt beyond just surface attraction.\n\nWe texted innocuous surface level conversations for the first few months, just checking on each others’ mental health. (We were both working in different places overseas for the first few months right after meeting.)\n\nOur first real hangout, almost a year after meeting briefly, was accidental but lasted hours and hours—the kind of deep connection that makes time disappear. When I saw her again… it felt like we were the only two people in the room. The second she saw me, I was instantly greeted with that familiar warm, joyous energy. When we locked eyes, I can’t explain it fully, it just felt like “A knowing” of sorts. I don’t think I’ve ever seen someone part a crowd like that to get to me. When we embraced, it felt familiar. Like coming home after a long work trip to see someone who loves you has made your favorite meal, run you a bath with a nice glass of wine, lit a few candles, and groovy lo-fi playing in the back. Just grateful to be home to peace. \n\nWe did not have plans to hang… but after embracing, we were inseparable. As the festival was getting rowdy, I and my group of friends decided to Uber to a local bar closer to our apartment downtown. Guess who came with us 😏. While in the bar we get some food and drinks. As I’m about to pay she slaps my hand and pays for us and my friends… NGL, turn on! \n\nIn hindsight this next interaction has made me really consider that she may just be using me for my top tier attention. One of my friends had invited a few acquaintances to join us… one of these new people was kind of flirting with me. I wasn’t paying it any attention other than just being polite. The girl I’m enamored with is looking at me almost like a piece of meat at this point. But we have been exclusively flirting all night and she’s also a bit tipsy now. So I just give her a wink and she returns my wink with a blushed, coy smile. Dude, I’m already in “super Like” at this point. My brain is playing out our whole lives at this point. Probably the Cancer in me 😒🙄🫠\n\nAs I’m having conversations with my friend I hear the woman I like talking to the acquaintance. She was telling the acquaintance how amazing and smexy she thinks I am. And then she turns to catch my gaze while talking to the acquaintance and says CLEAR as DAY AND SAID “I’m going to f*** the sh** out of her fine ass.” It felt like a claim, a moment of possession, but also a test—would I react? Would I take it seriously? Aside from that comment, the entire evening before and after that moment was very different. After ditching our buddies we spent hours of alone time in front of a local lake discussing our pasts, hopes, dreams, and plans for our individual futures… and indulging in adult beverages. LOTS of things unfolded, all initiated by her; PG-13 of course. First intimate moments moments, IMO, should be more sober. Plus, I’m a lover girl. That kind of push-pull dynamic has defined our connection ever since.\n\nWe continued spending time together, going on what felt like dates—me calling them dates, her never rejecting the term but also never confirming. She’d set things up, invite me, and treat me with a level of attention and care that felt… more than friendship. The reciprocal level of attention was intense and intriguing for me. \n\nThen came a moment of clarity—or maybe just contradiction.\n\nDuring one of our late-night conversations, she said she would never date a woman again.\n\nThat confused me because… well, what is this then? Our dynamic has never felt strictly platonic. There have been intimate moments—not just emotional intimacy but physical closeness, moments that felt like desire but were never fully acted on. If it were just friendship, why did she never establish clear boundaries? Why did she let the connection continue in such an ambiguous way?\n\n\nThe Complication: The Other Person\n\nI later found out (not through her, but through context clues) that she had been actively dating AT LEAST one other person the whole time. That alone might not have been a huge deal—people can have multiple connections—but what struck me was that she never openly talked about them with me unless it was to tell me vaguely about how the person she was seeing possessed some quality that she first noticed in me and admired and enjoyed. Like, what is the point of comparing our qualities… Is this somehow now girl talk? And if so, why is it important to point out similarities between us?\n\nRecently, she asked me if I was seeing anyone, and I mentioned that I wanted to focus on securing some additional certifications and pay down the debt on my home, before settling down. The irony? I only found out about her boyfriend being a serious option as her partner from her recent birthday invitation, where his name was listed. Odd, I know EVERYONE else by name on this invite list. I looked him up (yeah, maybe I shouldn’t have), and there were years’ worth of occasional pictures with the together, but she never once shared a photo with me. Though these photos appear to be platonic and sporadic until as of late… which is when I suppose they made it more official.\n\nPersonally this (whatever our relationship is) has helped me discover parts of myself that I’m truly grateful for. In the past few months, I’ve released the need to feel needed. This girl has sparked some self healing I didn’t know could happen… and that’s why I feel ok being friends and not considering a future together… “if you love someone or something, let it go…” I am grateful to be here. When she talks about him, she seems happy, so I’m happy. At the end of the day, I do love her… but I know I love myself more. And that has made all the difference. \n\nHowever sometimes when she talks about him it’s oddly detached—like a relationship based on logic, stability, and cultural alignment rather than passion. She has in the past said she prefers dating within her race for financial and cultural reasons, but this guy is not of that background. I KNOW people can change and evolve, so while I was taken aback by this seemingly 180 degree switch, I just accepted that was her new normal. When I asked why she chose him, she basically said he worships her and is obsessed with her culture—which makes her feel safe.\n\nIt’s weird because I know her to be fiercely independent, dominant, and controlling in her relationships. Though us together. It’s yin and yang. When she’s right, she’s right, and I have been given that same respect. We laugh, have deep expansive conversations, travel to far adventurous places and just do life together. We are so in tune that we often do or say exactly what the other person needs with no prior conversation. We have solved so many problems together, I cannot even begin to list them all. \n\nWith him, it sounds like she plays a more passive role—letting him adore her while keeping a level of emotional separation where she still may hold the power dynamic (not sure since we rarely talk about him) They’re moving in together this month… and he is basically in charge of finding and securing their apartment. Though in contrast, he does provide additional and cherished emotional and financial support. Which is a stark contrast to what she has been used too based on the relationships she’s told me about in the past. For that, I am truly thankful. \n\n\nSo… What Is This Relationship, Really?\n\nAt this point, I feel like I’m oscillating between different interpretations of what’s happening here.\n\n🔹 Is this Limerence?\nAm I just caught up in a psychological/emotional fixation because she represents something I deeply crave? The connection is so intense, but I wonder if I’m just projecting meaning onto someone who enjoys my energy but isn’t actually choosing me.\n\n🔹 Is this a Past-Life or Karmic Connection?\nThe instant familiarity, the pull, the unspoken communication—it feels like something deeper. Have we done this before? Are we tied together in some way that needs resolution? If so, what’s the lesson I’m supposed to learn?\n\n🔹 Is she Using Me for Emotional Validation?\nDoes she just like how I make her feel, knowing I offer depth, care, and emotional nourishment? Am I her safe space, the person she keeps around because I feed her soul in a way her partner doesn’t?\n\n🔹 Is This Just a Situationship Where She Holds the Power?\nShe initiates the dynamic but never gives it full clarity. She lets me feel special but never too special. She pulls me in but keeps an emotional firewall. I often feel like I’m giving way more energy than I receive—not because she’s cruel, but because she enjoys my presence without needing to give me certainty in return.\n\n\nWhat I Know For Sure (What I Don’t Need Help With)\n\n✔ I’m not delusional—I know something is real here.\n✔ I am grateful for the relationship, even if it’s complicated.\n✔ I have grown and learned about myself from this connection.\n✔ I don’t need her, but I deeply value what we’ve shared.\n✔ I no longer feel jealous about her dating someone else—it’s more about understanding what I am to her.\n\n\n\nWhat I’m Still Wondering…\n\n🔹 Does this connection have the potential to evolve into something more? Or is it destined to remain undefined?\n🔹 How do I get clarity from her without forcing a conversation that she doesn’t want to have?\n🔹 Am I meant to walk away, or is there still something valuable to gain from this relationship?\n🔹 How do I protect my own energy while still appreciating what we have?\n\n\nIf You’ve Been in a Similar Situation, How Did You Navigate It?\n\nI know this is long and layered, but if you’ve read this far, I appreciate you. I’m looking for honest, thoughtful responses—whether that’s insight into limerence, past-life bonds, emotional power dynamics, or your own similar experiences.\n\n🔥 Have you ever had a connection that felt magnetic but undefined?\n🔥 How did you know when to lean in vs. when to let go?\n🔥 How do you get clarity from someone who thrives on keeping things unspoken?\n\nThanks in advance for your perspectives.\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "Emotionally Intense Relationship with a Friend—Am I Experiencing Limerence, a Soul Connection, or Just Being Used for Validation?",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8wcxx/emotionally_intense_relationship_with_a_friendam/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 17:25:30 UTC",
    "id": "1j8w933",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "I need to get this off my chest. I lied to my ex  for our entire relationship, and I don’t know what to feel about it. \n\nEx and I met when I was 12. We were friends for a while, but eventually, he made me uncomfortable—constantly pushing boundaries and asking for things he had no right to ask for. I was struggling mentally, so instead of confronting him, I blocked him.\n\nFast forward to January 2024. I reached out to him again. I don’t know why. Nostalgia? Curiosity? Either way, I found him easily—he never changed his Instagram username. When he asked why I had disappeared, I lied. I told him my account had been deleted because my mom found out about the pictures I sent. He believed me, and we never spoke about it again.\n\nWe started talking regularly, and he invited me to his Discord server, where I met some amazing people. However, Jack got into drama—he had a falling out with friends over accusations that he had manipulated another girl. That should have been my cue to walk away, but I took his side.\n\nEventually, he and I, along with a few others—including a friend I’ll call Adam—moved to a separate server. Ex became my closest friend, and soon after, we started dating. I never told him the real reason I blocked him years ago.\n\nWe dated for ten months, and it was a mess. He cheated on me in the first month. He cried, begged, and I forgave him. He was controlling but also obsessive. He made everything about intimacy, introduced me to people he wanted me to be involved with, then got jealous when I just wanted to be friends. He even asked me to rate explicit photos of others—then got mad when I actually did.\n\nThings got worse. In September 2024, my childhood cat passed away. As someone who is autistic, this was devastating—my cat had been my comfort since I was two, even helping me through panic attacks. At first, Ex was supportive. But then came: *“You’re still sad?”* *“Why aren’t you over it?”*\n\nA little while later, I made a new social media account to share my art. That’s when he lost it. He accused me of violating his boundaries and broke up with me.\n\nI thought that was the end. But two months later, he started sending me money, asking me to unblock him. I did. He apologized. We didn’t officially get back together, but he acted like we were—calling me pet names, asking me to put his name in my bio. I refused. He kept pushing.\n\nBy January 2025, I was done. I told him it was over for good. He asked me to block him, so I did. Everywhere.\n\nAnd honestly? I want to say I'm relieved but this is something I think of constantly.",
    "subreddit": "TrueOffMyChest",
    "title": "I Lied to My Ex for Our Entire Relationship, and I Don’t Regret It",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8w933/i_lied_to_my_ex_for_our_entire_relationship_and_i/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 17:13:33 UTC",
    "id": "1j8vynl",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I just need to yell into the void because everyone I know has their own problems at the moment.\n\nI’ve been considering renting a bigger place as I work from home and where I’m at now while cheap is pretty tiny. I was looking on rightmove and found this perfect place on a rent to buy scheme close by that’s on £20 more in rent than my current place for two bedrooms. I’d seen one like that before but enquired just too late so I jumped on this one as soon as I saw it. But despite only a £20 rent increase I just about don’t reach the affordability checks. \n\nIt’s so frustrating because if this came up in maybe a couple years time I would be golden but because it’s now and there’s unlikely to be any developments like that near here any time soon. It just feels like I’m never going to be able to afford my own place, especially as I’m single everything’s just out of reach for just one income. It probably doesn’t help that my sisters just bought her first house with her partner which I’m really happy for her for managing it but I’m also so freaking jealous and I don’t think wanting to afford a house is a good enough reason to jump into a relationship.",
    "subreddit": "TrueOffMyChest",
    "title": "Annoying housing/renting market",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8vynl/annoying_housingrenting_market/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 17:12:54 UTC",
    "id": "1j8vy29",
    "link_flair_text": null,
    "media": null,
    "num_comments": 14,
    "score": 2,
    "secure_media": null,
    "selftext": "\nApologies if this is just a really dumb question. For a little backstory, I met this friend of mine on an internet chat room when I was 19 and he was 42. We quickly formed a sexual relationship over the phone which we both got a lot of enjoyment out of. Within the first few days of us talking, he was fawning over me, telling me I was the most amazing girl he’d ever met, that he couldn’t believe I was real, that I’m absolutely gorgeous and beautiful, that he was literally falling in love with me. He told me he loved me within a couple weeks of us talking. \nIn addition to this, he was trying to push me to do things on camera, over the phone and participate in dirty talk/fantasies I was not comfortable with. I declined on multiple occasions and made it clear I wasn’t into what he was asking of me. He was relentless. He pushed and pushed and pushed. Every time we’d call he’d pressure me into saying certain things and acting certain ways that I wanted nothing to do with. This was so long ago that I can’t remember the exact timeline, but I was on the phone with him one night after maybe a few weeks of us talking. He asked me again to do things I didn’t want to do, and I said no again. He snapped at me and verbally pushed me so much with his tone and language and his begging and pressuring that I finally gave in and did what he wanted, and said the things he wanted me to say. When we finished he said “Gotcha.” I remember feeling so much; mainly I felt a little sick to my stomach. \nThis was five years ago. Since this, I’ve basically given into his every whim sexually. I’ve just let him tell me what to do and basically done it with little protest. If I do protest I just end up feeling guilty, and he ends up feeling bad. I’m 24 now; I’ll be 25 in a couple months. We still talk every day and have phone sex that I’m not entirely comfortable with regularly. The issue is, now sometimes I like it and sometimes I don’t. I’ve never been able to figure out if this is my fault or not. I know the age gap is large, but we met on a shady website for sexual arrangements. We’ve never met in person despite being extremely personal and close with each other, telling each other we love each other all the time for five years, so how much could he really have been “forcing me” if I could have just hung up the phone? I know 19 is young, but I was a legal adult looking for phone sex online, so it’s not like he did anything illegal. He did say that when we first started talking, he thought I was lying about my age and was a little bit younger than 19 which I realize is concerning. I realize our relationship now is probably unhealthy and we’ve bonded in ways that are not normal, but the emotion I have towards this man is undeniable. \n At this point I don’t even know if I’ll care if he did something wrong to me because of how strong the love I have for him is. I realize this sounds ridiculous, I know I sound like an idiot. We met at an odd, vulnerable time in my life and I don’t know if he took advantage of that or not but I know it had to have some affect on the way our relationship has played out. We still talk every day, have phone sex regularly and are very close. I have discussed this at length in therapy and at this point I just really need someone to tell me, flat out, if he is in the wrong or not. If he took advantage of me, or if that’s impossible because it was all over the phone and not a legitimate relationship. I know i sound pathetic. Please go easy on me and just tell me your opinion if you have one. \n",
    "subreddit": "TrueOffMyChest",
    "title": "I can’t tell if the online relationship I’ve formed is unhealthy or could be considered grooming",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8vy29/i_cant_tell_if_the_online_relationship_ive_formed/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 17:11:58 UTC",
    "id": "1j8vx9c",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 41,
    "score": 25,
    "secure_media": null,
    "selftext": "I really like this girl and she ended up opening up about her past experiences in her trauma. She told me she molested her sister when she was eight years old and she regrets it. Her sister forgave her and they’ve talked about it. It’s just crazy because I was molested when I was younger, and I don’t know if I can be with someone that has done that. She also has a lot of trauma and has been raped many times and so have I so I don’t know if I should give her the benefit of the doubt but she’s getting help and she’s in therapy. What do I do? Should I still talk to her. I really like her and I just don’t know what to do",
    "subreddit": "TrueOffMyChest",
    "title": "Girl I’m dating just told me she molested someone when she was young",
    "upvote_ratio": 0.74,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8vx9c/girl_im_dating_just_told_me_she_molested_someone/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 16:58:12 UTC",
    "id": "1j8vkrg",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "The assault was years ago (I won’t mention it again), I’m only just starting to recover recently. Telling people, asking for help, trying to help myself instead of just shutting down and letting autopilot take over—even just sitting with it is hard enough, at that point any little thing is enough to tip the scale or topple it altogether. \n\nThe problem is I work in customer service, so I’m a verbal punching bag to the customers, management micromanages like their lives depend on it, higher ups making changes and not even bothering to do a test run that lasts longer than a week to iron out any kinks and fix any bugs that show up. Needless to say, I have been taking advantage of both PTO and VTO,  and while that helps my mental health immensely it’s very bad for my bank account and all the things I need to pay for to survive. \n\nI’m so mad, upset and overwhelmed that I can’t even be happy that I’ve lost a bunch of weight. I’ve lost ~40-50 pounds in the last several months, maybe even as much as 75 (I wasn’t keeping track at first, so I’m not sure). I’m so fucking proud of myself, for losing the weight and sticking with it (like working out even when it’s the last thing I want to do), but now none of my pants, underwear, or bras fit anymore. \n\nI want to be really proud and celebrate the accomplishment, I haven’t been this weight in maybe 7-10 years and have been working hard on it, but instead I’m upset because my clothes don’t fit anymore and I can’t afford to get myself new clothes that fit this new me. I have like 2 pairs of leggings that are the size I need, everything else is now 2-3 sizes too big, falling down and don’t even have a belt for my jeans. Literally none of my bras fit me; I only have one bra because it didn’t fit my mom and so she said I could have it. \n\nI don’t want to put any weight back on, but I can’t just go on with my day to day life if all my clothes are falling off of me. I think I’ll have to put some back on just so I can wear pants. I don’t want to, but new clothes, even from a thrift store, are a luxury I can’t afford right now. I don’t know what else to do, I just needed to rant/cry/vent this somewhere, thanks for listening.",
    "subreddit": "TrueOffMyChest",
    "title": "I can’t even be happy or proud of the weight I’ve lost, because I think I’ll have to put some back on again.",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8vkrg/i_cant_even_be_happy_or_proud_of_the_weight_ive/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 16:52:38 UTC",
    "id": "1j8vfxg",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 0,
    "secure_media": null,
    "selftext": "I was playing doom and it started freezing and making buzzing sounds which what happens when update is installing, I found out my cousin caused this because I didn't want to play roblox.",
    "subreddit": "TrueOffMyChest",
    "title": "my cousin installed an update to my computer that I now have to download",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8vfxg/my_cousin_installed_an_update_to_my_computer_that/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 16:47:37 UTC",
    "id": "1j8vbg3",
    "link_flair_text": null,
    "media": null,
    "num_comments": 8,
    "score": 61,
    "secure_media": null,
    "selftext": "Thank you guys, your responses were heart warming, confronting, some made me cry, some made me laugh. Some caught me off guard because how do you come up with this much vengeance, I caught myself smiling thinking about your suggestions \n\nFor now, they're not accepting any more visitors so it's a matter of days. I feel validated in my decision to not forgive him. Still not sure about the funeral. His sisters, one used to make clothes for my dolls,  very talented artist, she always offered to teach me, his other sister a total  bad ass, she is so good with people and runs a popular bar in my town. They both have children, 5 girls between them, these kids are amazing, but because of the trauma I kept my distance.\n\nMaybe going to the funeral (not doing anything you guys suggested) can rekindle my bond with my nieces, but I don't know how to ever bring this up. Or just let it be.\n\nFYI I will still spit on his grave. I'm just sad because I lost out on spending time with my nieces and their kids. \n\nAlso quick question, my previous post has been shared 779 times? Where?!",
    "subreddit": "TrueOffMyChest",
    "title": "Small update to my cousin is dying and I do not forgive him.",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8vbg3/small_update_to_my_cousin_is_dying_and_i_do_not/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 16:46:23 UTC",
    "id": "1j8vaep",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 9,
    "secure_media": null,
    "selftext": "I’m currently 23y , and dated the same girl since I was 11. Apart from lovers, we were each other best friend. When I was 20 I had a pretty bad depression episode and an Austistic burnout(didn’t knew at the time) and I became emotionally unavailable. She was also going trough some stuff and needed a friend, but I coudn’t be the partner she deserved at the time, my distant posture and behaviour made her feel unloved. We ended up breaking up. I didn’t want to but when we discussed it I though It was the more responsible decision. I didnt want to hurt her even more. I regret this decision every single day since then. I miss my girlfriend. I miss my friend. Since then I was able to understand what I was going through and learned to not have the same distant posture, but Its already too late. She found someone who saw how amazing she was, and they are now dating. I can’t bear this though without hating myself. I want to reach out, tell her how much I’ve missed her. But I can’t interfere with her happiness. I don’t have the right to reach out. I can’t shake off the feeling of wanting then to break up. I know It’s not right but I just can’t do it. She probaly doesnt want to see my face anyway. And I can’t blame her. I feel so sad all the time, I can’t stop thinking about her. I want to move on, to let her have her happiness and find my own, but at the same time I don’t wan’t to forget her, and honestly I don’t want to fall out of love, to “get over her”. I feel so lost",
    "subreddit": "TrueOffMyChest",
    "title": "I’ve ruined my chance at true love",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8vaep/ive_ruined_my_chance_at_true_love/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 16:33:47 UTC",
    "id": "1j8uzgr",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 1,
    "secure_media": null,
    "selftext": "Throwaway account. 34M. Sorry for the rambling that is about to happen.\n\n&amp;nbsp;\n\nI've been in several long-term relationships since my mid 20s which all failed for a variety of reasons. Typical reasons like career moves which meant relocating and the other person not wanting to move, loss of feelings, etc. The constants in my life though, were my closest friends and family. I knew I could go visit my family after a break-up to help cheer me up. My best friends and I live in separate parts of the country so we stay connected through online gaming. When I'd be in a relationship, the amount of gaming I did with them dropped off but never completely. And when those relationships ended I knew I had my buds waiting for me to get my mind off the broken relationship or whatever.\n\n&amp;nbsp;\n\nAs I've compiled failed relationships I've grown worried and nervous for my future. That I'd be alone forever, never get married, never have kids, etc. But during those periods of single life, I took my freedom for granted. I could do whatever I wanted, whenever I wanted. I didn't appreciate it enough. I got too caught up in chasing family life.\n\n&amp;nbsp;\n\nNow, I'm with someone and we're engaged. They have kids from a previous marriage and they're with us most of the time. We have one of our own on the way. We recently bought a new house that I'm not thrilled about. Mostly because of how much we paid for what we're getting. When we got engaged I was excited. When I found out I was going to have my own child I was excited. I love my partner very much and I love the children very much as well. \n\n&amp;nbsp;\n\nBut for some reason, the last few months have been tremendously hard on me. I'm sure it's all the changes happening and the feeling that I have no escape - because I don't. I can't just break up and find my own place like I did in the past. I feel stuck, despite my feelings for my family. I miss my single life and being able to do what I wanted and answering to no one. Going to work, coming home, eating whatever I wanted and playing games or going for a beer or whatever. It was totally up to me. Now I'm a slave in my own house. I go to work to pay the bills which is never ending. I can't use any of that money for my own hobbies or interests. No more deciding on a whim that I want to take a long weekend and travel somewhere. No more unwinding after a long day of work because being at home with kids is also work. By the time the kids are in bed, my partner wants us time which to be honest, sometimes I just want my own time. And sometimes I do get it but not as often as I'd like. Probably selfish of me but it's the truth. \n\n&amp;nbsp;\n\nI'm getting everything I wished for when I was single and desperately swiping on dating apps, and now I regret it. I was too anxious about my future that I was blind to the true happiness I was experiencing. If I was given a no strings attached choice to go back to single life, I would take it. I feel guilty for admitting it but it's the truth. \n\n&amp;nbsp;\n\nI suppose I'm looking for encouragement, but right now it feels like nothing anyone says will make me feel better. Thanks for listening.\n\n&amp;nbsp;\n\nTL:DR;\n\nI was desperate for companionship and a family while I was single that I didn't realize that I was the happiest version of myself when I was on my own. Now that I'm a stepparent and about to be a real parent, it's hitting me hard and I wish I could get my old single life back.",
    "subreddit": "TrueOffMyChest",
    "title": "My life is changing drastically and I regret it",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8uzgr/my_life_is_changing_drastically_and_i_regret_it/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 16:30:45 UTC",
    "id": "1j8uwuy",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I have so many people in my life that all say I am here to help I would do anything for you I love you so much as long as I pay for what ever they want and just give them what they want help them when with anything at all ( tattoos, piercings, building thier house,  mechanics, painting,bed time cuddle )\nYet I need someone or anything and it goes so unnoticed and no one to do a thing for me I go to bed alone iña caravan alone everynight ",
    "subreddit": "TrueOffMyChest",
    "title": "Empty promises",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8uwuy/empty_promises/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 16:21:09 UTC",
    "id": "1j8uob0",
    "link_flair_text": null,
    "media": null,
    "num_comments": 33,
    "score": 12,
    "secure_media": null,
    "selftext": "I have an obsession with wanting to be skinny and its starting to ruin my life. I cant eat food normally because every time i look at food i think “would a skinny girl eat that?” “would i eat that if i was at my goal weight” “what if i get really fat? would my family still like me? would my boyfriend still be attracted to me?” “how many calories? how long do i have to walk to burn that?” and all these people online say “you can still eat the yummy stuff! just make sure its within your deficit.” but no, you cant eat the yummy stuff because its so high calorie that it will take up most of your deficit. Or I lose control and eat more than i originally planned to.\n\nEvery time i pass another girl in public i think “Wow shes skinnier than me, i wonder how she eats.” “does she exercise? i wish i knew her routine.” “i bet she doesn’t eat how i do” “does she stare at the mirror and cry over her weight? i wonder if shes happy.” “i wonder if my boyfriend wishes i was that skinny” Its ruining my perception of people. Every time i see a skinny person i force myself not to stare because its killing me that im not skinny like them.\n\nIm going to spain soon for a study abroad trip. We’re going to the beach and i want to look as skinny as i can for that trip but its in May and i doubt ill even lose 10 pounds before then. If i cant look skinny, i want to at least look toned but i don’t have enough time.\n\nI want to eat food normally, i want to look in the mirror and not wish i was 20lbs lighter because “only 20lbs and ill be happier” im 5’6 and 150 pounds and i just keep gaining and gaining. i used to be 125 and even then i thought i would look better if i was smaller, i feel like ill never reach the skinniness i want to be. I want to learn to love this body that i have now. im healthy, i can walk, i can breathe, i should be happy. But still all i want is to be dainty. I need to get into therapy, im working on it, but i feel like im going to feel this way forever no matter how much therapy i get. ",
    "subreddit": "TrueOffMyChest",
    "title": "wanting to be skinny is ruining my life",
    "upvote_ratio": 0.69,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8uob0/wanting_to_be_skinny_is_ruining_my_life/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 16:15:56 UTC",
    "id": "1j8ujon",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 6,
    "secure_media": null,
    "selftext": "Long story short. Have a great relationship with some people at work, the people I work with directly, not so much. The people I work with I reported for some abhorrent material etc... on a media platform they were collectively using about people in work and in particular those I have a great relationship with.\n\nInvestigation from ER should've been two weeks when it first started, that was up today.\n\nLast week ER stopped their regular check ins with me and now this morning said the Investigation will take a further two weeks.\n\nAnd needed to ask me questions etc... I was supportive and said sure.\n\nFound out the four I reported (we're a team of 7) have banded together, one of the four are dating a fifth in the team so there's five now stringing a story that I was involved in what they were up to. And worse, that i was speaking in-person saying x y and z about the people I have a great relationship with.\n\nPeople I have a relationship with have blocked me on everything, so obviously been spoken to and most likely asked to answer some questions.\n\nWhat's worse is someone in my team, of the four I reported, I'll call him zero has a super strong friendship with someone outside the team, I'll call Zilla, and although we've all been told not to talk about it Zero has told Zilla what's been going on.\n\nAnd like excited kids everyone Zillas group, outside mine, are clamouring over her to learn the gossip and painted this image of me throughout their team now. So people in that team have approached the people I have a good relationship with and asking them questions, like is it true I was this that and the other with them or to them.\n\nI can't prove or disprove spoken word. And I'm now worried that I'm going to \"go down\" like the rest of them.\n\nGot a message from someone I dont work with but used to, called Bob. We have a great relationship and we catch up still. Each of us can't stand and have never trusted person zero. However, person Zero does still go and see person Bob every two weeks, just at the door because Zero picks up weed from Bob. \n\nI had a message from Bob saying Zero was fuming about me and rambling about how I've lost him his job (I didnt, he done that himself, he wrote what he wrote, not me) etc... but he is going to take me down with him (Zero apparently turned up, way of his head on some drugs). Talking about how he has Zilla onside to take on me too, basically take on the floor she works on to get me down.\n\nBobs chatting with his neighbour now to see if his ring doorbell caught his rambling, hopefully it'll help me.\n\nWhat isn't helping me. Is the lovely older gentleman assigned to the investigation in ER, knows NOTHING about technology. He showed me a picture that I had apparently taken and claimed to be one off the people I had a good relationship with. I obviously didn't take this photo, and it's been edited to look like it was received through a chat. I asked him to reverse image search it etc... he wouldnt and didn't understand, I got annoyed, took a photo of the screen he was sharing and found it was a picture from a forum post like 5 years ago! But wouldn't accept it, because \"you can't fake generate chats\". Later when I shared my screen I went to Google and literally googled *fake \"put favourite chat app name here\"  message maker*, and theirs hundreds!!\n\nFantastic.\n\nWhat a shit show.\n\nDecided I'd look into just jumping the sinking ship but unfortunately in my role even if I left it they'd require a degree to go back into it now which I don't have, and the same role elsewhere wants one. So may have to just bite the bullet and take something random for now at a huge pay cut. But then I'm worried it'll look like I'm guilty to those I had a good relationship with, not to mention I'm worried I may never be able to build my bridges with them now.\n\nOh, and not to mention how one of the people involved were immediately fired after I reported it because of their involvement being the most excessive, but everyone in team loved them and thought they were sweet and so not happy I lost them their job.\n\nGod. I feel like I'm coming out worse in this. But I want to trust the process. I keep telling everyone i don't know anything, talking like ER told me to, but it's preventing me defending myself.\n\nJesus, quick moan over. Back to the grind now. Don't report anything at work! If the apple cart hasn't tipped, dont push it. All I'm learning is that this is a hot mess you don't want to be a part of. Just keep quite and keep clear of anything. If something bad is discovered, fantastic it's dealt with and you're not involved, be happy. If it isn't discovered, everyone's still happily not wise to it and you can still be happy.\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "Colleague's closing ranks after a report. With lying I'm now looking to be losing my job. Fantastic.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8ujon/colleagues_closing_ranks_after_a_report_with/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 15:56:08 UTC",
    "id": "1j8u2gn",
    "link_flair_text": null,
    "media": null,
    "num_comments": 18,
    "score": 73,
    "secure_media": null,
    "selftext": "\\*\\*Edit\\*\\*   \n Its all happened between 2017 - lets say 2020 / 2021  \nI lost my love for him and I needed to learn to love him again. Something inside of me never stopped believing that we can get through it. When we first meet in real life I just knew I wanted to be with him.  \nHe now works as a optician shop assistant.  \n  \nFirst off, my husband (25M) and I (25M) have known each other for nearly 14 years. We got married in 2022, and I love him deeply. We have a strong bond.\n\nWe now have a relationship stronger than ever, but sometimes esp. now that I am at my lowest these thoughts come creeping in.  \nI definitely not regret having him..just would make things differently if it makes sense  \n\\*\\*\n\nWe're both FTM (Female to Male transgender) and have gone through our transitions together. My husband started his transition at 16, while I began in my early twenties. Due to PTSD, I had shut myself off from feelings of being \"wrong\" for a long time before finally starting my transition.\n\nI moved in with my husband's family when I was 17 because my mother left the country, and my father—who was a gambling addict and had many women—did not provide a stable home. So, I took the chance to leave.\n\nAt first, it was tough living together in such a small space—just a 20m² room, his childhood bedroom. I went from total isolation to suddenly being part of a family of five.\n\nFast-forward a bit—my husband was manipulated by his family and ended up developing a severe eating disorder (anorexia nervosa). Meanwhile, I was slowly starting to figure myself out and attending therapy for my PTSD. What made things worse for him was that he was an undiagnosed autistic man who couldn't understand or process his emotions. The early years of his transition only intensified these struggles. He was constantly overwhelmed, couldn’t give me the space I needed, and often shut down completely.\n\nWe were both damaged teenagers—just 18 years old—without a real understanding of the world or ourselves.\n\nI fought alongside him through his transition and worked for his family's acceptance of him. When he started spiraling into anorexia, I was attending a really good school that my dad had enrolled me in. But because of my own mental health struggles and the start of my own transition, I started missing school more often.\n\nI drove him almost daily to a lecture class he was taking to improve his job and school qualifications (since he had missed a lot of regular school due to mental health issues). I skipped my own classes for him while he was letting go of everything. Eventually, I got him admitted to a mental hospital to treat his anorexia. At his lowest, he was 1.58m tall and weighed only 38kg.\n\nHe was allowed to come home on weekends but had to return to the hospital at night. I rarely saw him, and I became sick myself. I didn’t know what to do—I had no friends, and my family wouldn’t have taken me back.\n\nLuckily, we found a way forward, and I was able to help him recover. I monitored his eating habits, carefully helped him through the ups and downs, and cooked food that wouldn’t make him nauseous. It took us over a year to bring him back to health—it was like learning to walk all over again.\n\nThat year, I missed even more school, which meant I had to repeat a grade. Because of that, I lost my chance at earning a master’s degree or an engineering title. I graduated with good grades, but I didn’t qualify for higher-level jobs.\n\nRecently, I was diagnosed with osteoarthritis in my shoulder, meaning I can no longer work as a painter. I feel like I’m at my limit. I keep rethinking everything—if I could go back, I would take better opportunities, get him professional help sooner, and make sure I secured my own future.\n\nI know I’m only 25 and still have my life ahead of me, but careers start young. Now that I’m jobless, I’m trying hard to market myself to at least get a decent job.\n\nI also know that without me, my husband wouldn’t be here today. But sometimes, I regret sacrificing so much for him. I always joke that if you're unlucky in gambling, you’re lucky in love—since we have a strong relationship and will celebrate 10 years together in 2026. But I regret missing out on so much in my youth—not being able to go out, either because of my PTSD or because I couldn’t leave my husband alone.\n\nThe worst part for me is that I always promised him I’d build a home where he’d be safe from his family’s toxic traits. But after everything I’ve lost, I don’t know if I can fulfill that promise anymore.\n\nSometimes, I wonder if I would be better off with a partner who had better mental health. But then, how could I even think that? He was always the one person who stood by me, who wanted me in his life. My own family treated me like a burden—something to be moved around, something unwanted. My mother even told me to my face that she had wanted to put me up for adoption when I was five.\n\nI’m so exhausted. I just want stability—a decent job, enough money to pay the bills without constantly worrying about groceries. I want to build a good life for us.",
    "subreddit": "TrueOffMyChest",
    "title": "I regret that I sacrificed my teens to care for my husband",
    "upvote_ratio": 0.78,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8u2gn/i_regret_that_i_sacrificed_my_teens_to_care_for/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 14:43:22 UTC",
    "id": "1j8sdb8",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "I don't know what I'm trying to say or why but this is something that's suddenly been constantly pestering me for days.\n\nI come from a dysfunctional family. My father is abusive to my mother and she stayed in this marriage only because he had the means to give me a better life and future. He is not abusive towards me as long as I live by his patriarch rules.\n\nI AM grateful for the opportunities and support, whether it be financially from my father or emotionally from my mother, that I've got through years and still getting. But throughout these years I feel like SOMETHING INSIDE ME DIED A LONG TIME AGO. \n\nFrom a very young age I developed a distaste for any kind of relationship with men that goes beyond platonic boundaries. I'm 24 years old but I've NEVER been in love or had a relationship. I've once developed a crush at 14 but didn't pursue it due to my body insecurities, but most importantly due to fear of what a man in a relationship would be like. \n\nI see girls at my age dreaming about ideal man, life in relationship or after marriage.....you know the usual, but I could never imagine myself in a real life scenario like that. If I do imagine, its only through a fantasy perspective with the safety of knowledge that it's something that would never happen. I am a virgin and have healthy sexual appetite, but I cannot imagine myself having sex with another man. It feels horrifying. I even thought that maybe I'm lesbian or asexual but that is not the case. \n\nI want to be able to love whole heartedly and desire a man like any other girl, but I can never EVER trust anyone to have an intimate relationship like that. Because of all this I've become a cynical person. I'm not even beautiful or attractive, and this is not my insecurity speaking it's a fact which becomes apparent with how people interact with you. So of course no one would be able, or as a matter of fact willing, to love me romantically. \n\nBecause of this I've decided to never get married in life or be in a relationship. I don't like casual sexual relationships, but that isn't much of a bother as I can satisfy myself quite well. I could blame my abhorrence about how most men tends treat a woman but in reality my broken soul is as much toxic as the former reason. But it saddens me that in this life I could never ever have a family of my own, since a healthy family environment is all I've ever wanted in my life.\n\nIf you've read till the end, thank you so much for hearing me out.",
    "subreddit": "TrueOffMyChest",
    "title": "I want to love and be loved but I think I've lost that capacity long ago",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8sdb8/i_want_to_love_and_be_loved_but_i_think_ive_lost/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 14:43:18 UTC",
    "id": "1j8sd92",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 1,
    "score": 0,
    "secure_media": null,
    "selftext": "My (18ftm) ex (19m) and I had been dating for just short of two years. One time, I found him messaging someone inappropriately over discord and when I confronted him, he begged me to hit him because he “deserved it”. He wouldn’t stop begging me to so eventually I did hit him a few times against my will. \n\nA few days ago, he broke up with me. Wed already been on a break for a week and it has been the worst week of my life. I have felt completely unlovable and out of control. The night of the day he broke up with me, I downloaded Grindr and fucked a guy. It was dirty , horrible and regretful and because of that I wrote about it in my diary. He found the diary entry yesterday while I was at uni and when I got home in a drunk psychotic rage he punched me 30-40 times, put me in a sleeper hold and threatened to kill me. I hit him back twice. \n\nHe’s already starting to tell people I hit him first, and I’m so scared that the more I confide in people about this, the more people will find out that I hit him first. Not sure what to do. \n",
    "subreddit": "TrueOffMyChest",
    "title": "My ex beat me up but if I tell anyone it’ll get out that I hit him first",
    "upvote_ratio": 0.22,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8sd92/my_ex_beat_me_up_but_if_i_tell_anyone_itll_get/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 14:42:49 UTC",
    "id": "1j8scv7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 0,
    "secure_media": null,
    "selftext": "So I know this title sounds really confusing, but basically the whole context is that I called a friend about what to do as I was domestically abused by this person I was seeing as a casual partner. \n\nI took the courage to tell her what happened as I was really scared. And she told me she can drive me there to the hospital as I didn’t want my parents to find out. \n\nSo I agreed without knowing that her license was suspended and the nurse had called the police as I told her I was abused. The police saw my friends face as she was waiting in the waiting room and I told them that she drove me here. I saw the police writing this down, and now I’m very stressed I might have gotten her into trouble if I go to court for the abuse to get justice the judge may do a background check on her license? \n",
    "subreddit": "TrueOffMyChest",
    "title": "Will my friend be charged who committed a crime to help me report a crime?",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8scv7/will_my_friend_be_charged_who_committed_a_crime/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 14:39:45 UTC",
    "id": "1j8sac5",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I have been through a lot past couple of years.I just constantly blame myself for the things that had happened.Theres a lingering feeling of guilt that I can't shake off.I can't remember when was the last time i was happy. I used to be strong but after sometime it was too much for me i had to take antidepressants and still on antidepressants .small matters like my mother or bf not receiving my calls gives me so much anxiety sometimes i feel numb.Every second i feel like something bad will happen to me or the people i love .If anything good happen i stiil can enjoy the moment fearing something bad will happen or I'll mess up things again.l'm a final year med student . There's always an anxiety if I'll pass my final exam what'll happen will I'll be able to take care of my family properly.My parents has sacrificed a lot for me .Will i be able to make them see that all their effort was worth it .I want to settle in UK or Australia after i complete my exam and then I want to take my family with me but that'll take some significant time . Though my brother and sister in law lives still lives with my parents they don't take care of my parents that much if my mother becomes ill or anything she have to take care of herself which makes me think if i go for higher studies my parents probably won't be taken care of . I'm afraid that I'm not there for my parents when they need me .But then i so want to leave my country and pursue my dream .so many uncertainties about the future makes me frustrated, tired , anxious to no end. Every breath feels so heavy sometimes .Is it what adulthood is like or am i overthinking. I don't fear responsibility what i fear is failure to fullfil my responsibilities , fullfil the expectations of my parents.I feel like a looser writing this....",
    "subreddit": "TrueOffMyChest",
    "title": "Uncertainty, overthinking",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8sac5/uncertainty_overthinking/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 14:25:46 UTC",
    "id": "1j8rz7h",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I don’t know why she’s in prison and I don’t really have the guts to ask her why. I’m seeing her in about a week and a half. It’ll be the first time I’ve seen her in 6 or 7 years I can’t remember. \n\nfor context: she’s in a different country than me right now and our past relationship was also quite rocky. We lost contact a year ago and I just stopped replying thinking she abandoned me but now that I know she’s in prison, everything’s different.\n\nI don’t know if prison has changed her or if routine has cured her of being the most unstable person in the world. I am both excited and terrified. Excited for her to see who I’ve become. Terrified because I’ve not had contact with her at all. All the prison bookings I’ve done with the guards and I only really got her prison info and whereabouts from her Facebook friends. I have no idea what reaction she’ll have.\n\nI really hope the sentence is short because my heart breaks everytime I think of her being alone in prison. \n\n",
    "subreddit": "TrueOffMyChest",
    "title": "My mom is in prison",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8rz7h/my_mom_is_in_prison/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 14:16:08 UTC",
    "id": "1j8rrjw",
    "link_flair_text": null,
    "media": null,
    "num_comments": 9,
    "score": 13,
    "secure_media": null,
    "selftext": "I know this might seem an odd title but in the last couple few months, I have been listening to a lot of rock and a lot of metal music  but I have began hating theatre music I am an actor, but I’ve slowly resent theatre music i’m certain aspects of it. such as the songs and the lyrics and everything else, but I love rock",
    "subreddit": "TrueOffMyChest",
    "title": "I love heavy metal and rock!!!",
    "upvote_ratio": 0.84,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8rrjw/i_love_heavy_metal_and_rock/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 14:07:17 UTC",
    "id": "1j8rkqv",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "To be honest I hate posting my problems on the Internet but I need to get it out. I'm so fucking tired of fucking up. I'm tired of not having self control. I'm tired of thinking every fucking mistake I made. All I want is to be left alone now because I keep causing damage to myself and others around me because I want to keep the peace by all means necessary it's gets me fucking nowhere but dragged through the mud and making continuous mistakes. I hardly sleep I hardly eat yet I force myself because I need to still function for myself. My marriage is dead my daughter is dead and in the span of five years all I did was made mistake after mistake lying to save face on just to have come back worse having to fake being happy because I don't want to let anyone in and questioning my decisions every fucking second and I just want to figure myself out. My ex-wife told me she stopped loving me after I let go of her hand when my daughter passed and was trying to make it work and I didn't even find out till a few months ago and it eats away at me on top of her wanting to add a third person into our marriage for a \"bond\" and saying that she wanted us to have each other because we were all missing something after I repeatly offer to go to couples therapy to figure out problems out. Now she wants to be just friends but Im sure I know how that's going to go I'm just going to be a back up when something goes wrong and I refused to be like that. She even said that maybe some time down the road she would consider me again but what's the point I'm trying to build myself back up now and she doesn't want to try to work things out I can't even figure out if she was the first cheat or was I because I actually made a move on another female because I was unsure about so much shit I needed to get away then I force to question if I had feelings or psuedo feelings. I'm in therapy now trying to to figure myself out but this shit still eats away at me and I just want to isolate entirely I don't wanna laugh I don't wanna do anything besides focusing on my career and my growth because the entire time this bullshit with her and this bond bullshit was happening I was just trying to focus on school to get us in a better place now it feels fucking useless because the meaning behind it is gone and now I'm struggling to find happiness with finishing college. Fucking being nice because it's gotten me nowhere but shitted on and devalued. I need to quit the shit and do what I gotta do for me and only me because I have no one else but me to look out for yet it's a bitch in a half to fight this fucking habit and I'm tired of it I'm tired of everything I'm almost 30 years old I shouldn't be dealing with this bullshit like for fucksake she feel in love with a guy that has repeatly said that he's not interested and yet his actions says other wise and she's still feeding into it after saying she needs to get away from everything ",
    "subreddit": "TrueOffMyChest",
    "title": "I'm tired of fucking up",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8rkqv/im_tired_of_fucking_up/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 14:02:10 UTC",
    "id": "1j8rgrd",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 14,
    "score": 0,
    "secure_media": null,
    "selftext": "See my previous post for more context \n\nA few days ago, my (18ftm) bf (19m) broke up with me. We were together for just short of 2 years and he was my first. He had been with 15-20 ppl before me which made me really insecure and we went on a break because I was insecure of it along with other things. \n\nWe were also on a break a week before and then he fully broke up with me. It’s been the worst week of my life. \nWhen he broke up with me, I didn’t know what to do with myself. I felt so out of control and unlovable and I just fucked a random guy on Grindr. It was awful, disgusting and I felt so dirty and guilty the whole time and i never want to put myself in that position EVER again. I felt so discarded and it was a completely immature thing to do. Because of that, I wrote about it in my diary. \n\nMy ex found himself in a bad place so I let him stay at mine. I had uni the day after so I left in the morning. When I got back, he had found my diary entry, drank all my vodka, smoked all my weed and cut himself on his whole body. He then woke up and in a state of psychosis, he punched me 30-40 times, put me in a sleeper hold till I passed out, choked me, and tried to cut me. \n\nHe has BPD/bipolar and PTSD which isn’t an excuse but because of how much I hurt him it’s making me wonder if I deserved it. I’m also scared to tell people because if I tell people and he finds out, then I’ll be known as an abuser too. \n\nI’ve hit him before too which makes me think that now we’re even. \nOne time I found him messaging someone inappropriately and he begged me over and over again to hit him cus he “deserved it” so I did cus he was just begging me to. It wasn’t nearly as bad as the beating I just got but my actions were worse. \nWe’re broken up now but man I don’t know what to do with myself. Some helpful advice would be appreciated ",
    "subreddit": "TrueOffMyChest",
    "title": "Did I deserve to get beat up by my ex?",
    "upvote_ratio": 0.47,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8rgrd/did_i_deserve_to_get_beat_up_by_my_ex/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 14:01:08 UTC",
    "id": "1j8rftz",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 16,
    "secure_media": null,
    "selftext": "my bf says he never loved me and was only because it was easy sex and I am financially stable. I used to go above and beyond for him.. I always felt i am invested more but I didn’t care.. now I am devastated and he ended things horribly like I am nothing",
    "subreddit": "TrueOffMyChest",
    "title": "after 4 years bf admits he never loved me",
    "upvote_ratio": 0.91,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8rftz/after_4_years_bf_admits_he_never_loved_me/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 13:59:24 UTC",
    "id": "1j8redt",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "Mom Tell you something about a text I have on my throat and I just want it out\n\nI remember at 17 I sent text Messages online straighteners I don't know why I did that maybe I was so lonely and sad all of them were men the other one tried to call me I blocked him\n\nThe other second one naked picture of me but I gave him a fake picture one day I ended up with one pic of me and he didn't believe me for a moment But he wanted more and he sat his I quickly blocked Him\n\nThe third one he was 19 we were texting about whatever then it turned to sexual Pic and video (not a video call) we, not I didn't feel like I supported my family he said guess he supported Me a few days sometimes we argued sometimes we, not I sent him a picture of New Orleans (I should not do that) but not my face\n\nOne day (I guess we don't talk that much or I don't remember the rest)\n\nHe asked you for more pics of me I told him no he started to send mass messages to me I fought back\n\nI'm so tired of him I end here I block Him\n\nWhy do I keep with this myself I don't want to feel, hear, and see you are a mother who failed\n\nYou are not a failed mom\n\nYou are the greatest mom I ever had I will love you for death\n\nText you always didn't break me into pieces\n\nIt's not your fault Mom it's my fault\n\n\\-the daughter\n\n( I need to get out)",
    "subreddit": "TrueOffMyChest",
    "title": "I can't take it no more",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8redt/i_cant_take_it_no_more/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 13:41:01 UTC",
    "id": "1j8r05b",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 0,
    "secure_media": null,
    "selftext": "The intention of this post is not to promote anything; this is a throwaway account. NSFW \n\nIf someone who knows me read this post, they would be surprised because not only am I super shy, but I’ve always been embarrassed to talk to men. I even feel self conscious wearing crop tops and showing my stomach\n\nI started studying marketing and worked at a call center for a few months, which was horrible. I’m extremely anxious, and every call made me feel awful. I started looking for jobs in other fields, but the only place that pays well without experience is call centers, and I need the money for my studies\n\nSome of my friends used to joke that if they had my body, they would sell nud*s. I never thought much about it, but recently, I came across a post from a girl who does it. She’s not viral, but she makes sales from time to time and does well. My body isn’t perfect, but I know my body type is generally considered attractive\n\nI see it as a side hustle while I save up and start a business idea I have or while I finish my studies.\n\nSo now I can’t stop thinking that maybe I should at least try it without showing my face. It sounds awful, if my mother knew, she would be ashamed. My friends wouldn’t believe that someone like me would even consider it, even I don’t think I would be able to go through with it\n\nBut just thinking about having an income without working 9 hour shifts and then studying is very tempting. I know I don’t have the worst life. I know the right path is to work hard. But it also makes me sad to see how some of us have to struggle so much to get things that others just have effortlessly\n\nI know this would make me the kind of woman no man would take seriously, but I’ve already come to terms with not having a partner anyway because I’m extremely shy\n\nI try not to think about it, but the more time passes, the more tempting it seems. I'd appreciate any thoughts on this",
    "subreddit": "TrueOffMyChest",
    "title": "I can't stop thinking I should sale pictures of myself",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8r05b/i_cant_stop_thinking_i_should_sale_pictures_of/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 13:10:21 UTC",
    "id": "1j8qdbf",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 11,
    "score": 0,
    "secure_media": null,
    "selftext": "Hello everyone. I’m a 19M. Over the last couple of years my life went downhill and I realized how big of a loser I am. I don’t know. \n\nIn high school I got bullied. I was kind of the mockery source of my class. People loved making jokes about me. After hs I took a gap year hoping that I can clear my mind. I tried to get my driving license meanwhile. I failed 4 times and “burned my file” which means I need to go through the whole process again. This is not common. I’ve talked with many friends and read comments online about this. People say “you shouldn’t touch to a vehicle.” “Failing this many times is a success on its own.” “You’re not a real man if you failed 4 times in a fucking driving test.” And so on. Every one hits me from my chest like a knife. \n\nMy grades steadily declined. I still haven’t failed but I know at some point I will if I go on like this. I’m skinny and underweight. I am ugly. I mean objectively ugly. I am insecure about lots of things and they only add up. This latest driving test was just the last straw. \n\nI’ve never had any true form of human connection. Never had any close friends that I could whine to. Never had any romantic relationships. Never had respect or love from anyone. \n\nI often feel like an imposter. As I walk around the world, I think that if people knew about me they would feel better about themselves. They would just start to laugh and mock me. Ridicule me. I’m a  failure. I think that my family is embarrassed me and my friends just put me around to feel better themselves. When I get into a social settings I can’t help but feel awkward, feeling like I’m just inferior than anyone else. I live every waking moment with an intense self hatred, self disgust and just drowning into my insecurity. \n\nSometimes it goes well tho. Sometimes I can see hope in my future. But it doesn’t last long. I fuck up at something else. I go to a psychiatrist and diagnosed with depression, anxiety and adhd. I am medicated with Paxil and atomoxetine(generic strattera) will start Ritalin soon. \n\nI don’t know life just hits me from everywhere, not only from outside but inside too. I just want to crawl into a corner and die. Painless. \n\nIts so fucked up to feel like you have no one to rely to. Not even yourself. \n\n",
    "subreddit": "TrueOffMyChest",
    "title": "I feel like a joke",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8qdbf/i_feel_like_a_joke/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 12:50:16 UTC",
    "id": "1j8pz0g",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 78,
    "secure_media": null,
    "selftext": "My moms godson (GS) is 19 and recently started trade school to become a welder, but decided to live on his own as he wants freedom. \n\nGS had a habit of smacking, chewing with his mouth open and slurping food loudly when he was growing up - a problem that both of his parents, especially his mom, took issue with. GS's mom **hates** poor table manners, but especially hates smacking on your food.\n\nI vividly remember visiting GS's home during lent one year and he was smacking on his food really loudly. GS's mom asked if he's eating his dinner loud enough so either God or the seagulls can hear. \n\nI understand if this took place in a different culture of part of the world where it's acceptable it'd be fine, but we're Mexicans from Texas, so it's not.\n\nWhen GS moved out, one of the first things he told me was that he started smacking on his food again and that it felt \"liberating\" whatever they means.\n\nLast night he messaged me saying that he now understands why his folks were so adamant and uptight about table manners. I'm thinking a girl lost interest or somethin, but no. \n\nHe was eating and bit his lip hard, which the shock caused him to choke on his food. He lives alone and nearly ran to a neighbor for help. Lord, I could hear his mom's voice in the back of my head saying, \"See? See.\"\n\nTL;DR: table manners are good to have",
    "subreddit": "TrueOffMyChest",
    "title": "My moms godson started smacking on his food now that he lives alone",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8pz0g/my_moms_godson_started_smacking_on_his_food_now/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 12:37:39 UTC",
    "id": "1j8pqg6",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 12,
    "score": 1,
    "secure_media": null,
    "selftext": "I (15M) am secretly very depressed and often have suicidal thoughts. But none of my family knows, which I am glad about. I sometimes think about telling my dad, but he would just get mad at me. He's honestly pretty abusive. I have no fucking clue what to do, and it just gets worse every day. I'm not allowed to go to the park, and my parents never take me and my siblings anywhere. Hell, they won't even put me in school. And my grandparents on my dad's side know but just don't give a fuck. So I'm just stuck inside all fucking day.",
    "subreddit": "TrueOffMyChest",
    "title": "My life sucks",
    "upvote_ratio": 0.55,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8pqg6/my_life_sucks/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 12:26:55 UTC",
    "id": "1j8pj7l",
    "link_flair_text": null,
    "media": null,
    "num_comments": 20,
    "score": 27,
    "secure_media": null,
    "selftext": "I’m 24 (f) and my mom is in her 50s. At the beginning of this year I decided I wanted to loose all the weight I had put on since moving back home from college. My mom and grandma are Italian and obsessed with basically forcing you to eat as much of their food as possible. When I started my weight loss journey I weighed 137 and I’m 5”5. Nothing wrong with this, but all through out college and high school my typical weight when eating healthy, but balanced, and staying consistent in the gym was ~125 so I defiantly noticed a difference. I was extremely uncomfortable / insecure every time I had to dress nice or for going out because I was so used to always being relatively small/lean. So over the course of the last 3.5 months I locked in and lost like 17 pounds. I now weight 120. I did not starve myself or even work out excessively. I just focused on portion control while eating calorie dense foods but tried to stick to Whole Foods most of the time.  Continued working out 3-4x per week. My mom recently noticed the weight gain and it’s going nuts, calling me disgusting, anorexic, “sick” and horrible every time I get dressed to go somewhere. Keeps saying she’s sending me to a doctor to “fix my problem”. Literally screams at me to gain weight. I defiantly need to move out, but for the time being feel so frustrated and angry. Why does she think it’s okay to say this stuff to me? I do not have an eating disorder, but IF I DID, she would be handling this situation so poorly it would only fuel the disorder more. My mom is ALWAYS trying to loose weight even though she is small and thin. Will brag about eating a “protein shake” and pack of nuts for the whole day at work. So it’s so hypocritical everything she is saying. And although I realize I am on the thinner side, I am so much more confident in my body now. I’m not planning on loosing more but also I’m not just going to gain it all back to make her happy so not really sure what to do in this situation but I’ve just about had it with her. Kinda just ranting and open to any advice or suggestions :) ",
    "subreddit": "TrueOffMyChest",
    "title": "Mom keeps calling me anorexic and disgusting for my weight loss",
    "upvote_ratio": 0.9,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8pj7l/mom_keeps_calling_me_anorexic_and_disgusting_for/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 12:24:26 UTC",
    "id": "1j8phj5",
    "link_flair_text": null,
    "media": null,
    "num_comments": 20,
    "score": 43,
    "secure_media": null,
    "selftext": "\n\n\nBackground: my dad recently got married. It’s been 4 months now. \n\nThe story: I had a stomach ache from something i ate. My dad always told me if I needed something at night to text him or call him or if needed to knock on their bedroom door. They have a mini pharmacy in their room and not else where because there are other kids in the house. At around 1:00 am I went to make myself tea hoping that it would calm my stomach down but the pain became more uncomfortable. It then became 2:00 am. I heard a blow dryer from their room so I thought they were awake and thought it be will quicker and faster to just knock on the door and get a painkiller.\n\nHis wife answered and she was in a bath robe. You can understand what I mean by saying that. I thought it was too late to turn around now so I asked for a pill. She opened the door of their room and walked in and I assumed it was fine to walk in too. My hands were shaky when I took one pill out so it fell on the floor so I took another one and walked out. \n\nI woke up this morning and my dad was angry. His wife is accusing me of pretending to be sick to see inside their room, that I pretended to take a pill and threw it on the ground, that I walked in uninvited and looked around the room, how they’re shocked that this behavior would come out of a 17 year old and that I should have never knocked on the door of newly married couple. \n\n\nBackground on me: Before my parents separated they weren’t living like every other couple. They were living like roommates so my sister and I would just walk in and out or knock on the door so there are new things that I’m learning from this marriage like what the boundaries are. Consider me naive with this stuff. \n\nAs for why I didn’t call or text. I don’t know it didn’t pop into my head. I thought they were still awake and that knocking would be faster. \n\nMy dad is already telling me that he’s tried defending me so many times in front of his wife because of my mood swings (they’re stress related) and that I ruined the picture that he has tried painting of me in front of his wife and how she could start acting petty now and treat me badly if I keep doing this as if I done it on purpose? \n\nI feel like it’s not fair because if it was her daughter knocking on the door it wouldn’t have brought the same response or reaction. \n\nI’m thinking of talking to her directly and explaining my point of view without my dad being the mediator or defender. ",
    "subreddit": "TrueOffMyChest",
    "title": "Dad remarried - wife accusing me of being nosy",
    "upvote_ratio": 0.91,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8phj5/dad_remarried_wife_accusing_me_of_being_nosy/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 11:50:05 UTC",
    "id": "1j8ovyi",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "I just get in this cycle of depression broken up by brief moments of happiness that give me just enough hope to continue. I know there's a light at the tunnel. I know I could solve my problems. But I'm just so tired.",
    "subreddit": "TrueOffMyChest",
    "title": "Just really tired",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8ovyi/just_really_tired/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 11:46:52 UTC",
    "id": "1j8ou02",
    "link_flair_text": null,
    "media": null,
    "num_comments": 732,
    "score": 1633,
    "secure_media": null,
    "selftext": "My wife (31) and I (28) have been together nearly 8 years, married for 3. We have a 3 year old son and a newborn. We have a loving relationship where we’re best friends, have great communication, and amazing and regular sex (which has just started again following the pregnancy). All in all, I would say a very healthy relationship. \n\nAlmost 2 years ago now, I uncovered my wife’s affair. I had picked up her phone to use it for my son because I didn’t have mine to hand, and saw a flirtatious message between her and her work colleague (let’s call him J). I immediately challenged my wife and she said he was just being flirty because he was drunk and the message made her feel uncomfortable. I asked to see the rest of the conversation but she had deleted it because of how uncomfortable she had felt. I had some red flags but had no reason to truly disbelieve her so we talked it through and I tried to let it go. Fast forward a couple of weeks and I couldn’t shake the feeling that there was more going on. I did the horrible thing of checking through her phone and in her deleted photos, I found some pictures of her and J kissing. I immediately brought this to her and asked what was going on. She admitted that she’d been having an affair with J for 2 months. They’d kissed and masturbated each other once but that was it. It was mostly an emotional affair. She said she’d been having a crisis since she turned 30 earlier that year and was struggling mentally. She was feeling old and that when J had shown an interest in her, it made her feel sexy and it was exciting. She wasn’t in love with J but felt trapped in the affair because he was in love with her and if it got out, she could lose her job because she is a higher rank than him. I asked her whether she chose me and our life, or him, and she chose us.\n\nFast forward a year and my wife and I were discussing having another child. We’d moved on a lot since I discovered the affair and we had actually become closer as a result. We fell pregnant quickly but the pregnancy itself was tough because she has Hyperemesis (severe pregnancy morning sickness). This wrecked her both physically and mentally. This was when I noticed her getting closer to J but it seemed just to be a friendship. I was sceptical but believed my wife when she had regrets the original affair. My wife was very open and honest about her friendship with J, and revealed a lot to me so I didn’t feel any need to doubt her especially as we were having another child together. Her friendship with J was up and down as he kept pushing her away especially when he found out she was pregnant. I put this down to him still having feelings for my wife and being heartbroken or something that she had fully moved on. \n\nOur baby girl was born in January 2025 and my wife and I were a firm team and all seemed well. She went on maternity leave and we coped with the transition to having 2 children. It was at this time that J completely distanced himself from my wife which she again told me all about. She felt upset about it but said she didn’t care because she had her family to look after. Again, I believed her. Foolishly. \n\nAbout a month into her maternity leave l came upon my wife texting her cousin. I walked up behind her whilst doing errands and saw she had screenshotted a message to J she had sent earlier that day saying this was the longest they’d gone without talking and that she missed him. I told her I thought this was totally inappropriate and I didn’t like the emotional weight of her saying she missed him. She told me it wasn’t in any way other than as a friendship. For whatever reason, I started to get doubts about what had been going on between J and my wife. \n\nA couple of weeks later, our family travelled to Rome to spend time with my wife’s family (she is Italian and she grew up there). She went out with her cousin one night and I felt compelled to check the notes on her iPad because I knew that she sometimes wrote down thoughts there. I found essentially a diary entry or perhaps a draft message to J where she said doesn’t do friend with benefits, and whilst the physical parts of their relationship were fun, it wasnt worth the risk if there wasn’t more to it. She also said she still loved him but couldn’t commit if he didn’t love her and she would stick with me if she had to. This entry was on 28th December. \n\nThe next morning, I found a moment when my wife left her phone and quickly checked her WhatsApp. In the locked messages section, I found her conversation with J and the night before they were sexting. I didn’t get much time with the phone but I’d seen enough. I can’t imagine that sexting is the furthest they’ve gone during the affair. \n\nI was/am devastated as this was a couple of days ago and I have no idea what to do. I want to challenge her right now with a view to know what’s been going on and then end everything. I would get on a plane and go back home. I’m so confused because my wife and I went for dinner last night, and it was just us, no kids. We had an amazing time and told each other how much we loved one another (this is true on my part even though I am so hurt). \n\nI don’t know whether to wait until we get home, or just forget about it all and see what happens. I don’t think I can move past this, especially as she was cheating on me throughout the pregnancy with our child. I do have doubts whether my daughter is mine, but I think she is. \n\nI am so lost, in so much pain and have so many questions. I love our life, I love our children. If I end things, all that will end and I will not be able to see my kids as much. It feels better to get this off my chest, so thank you and sorry for the splurge. ",
    "subreddit": "TrueOffMyChest",
    "title": "Found out my wife has been cheating on me. We have a 6 week old baby.",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8ou02/found_out_my_wife_has_been_cheating_on_me_we_have/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 11:35:19 UTC",
    "id": "1j8ond5",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 1,
    "secure_media": null,
    "selftext": "Is it weird that I want to find the love of my life online without him sharing his photos ? I find it beautiful to fall in love without knowing how the other looks like ",
    "subreddit": "TrueOffMyChest",
    "title": "Online dating",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8ond5/online_dating/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 10:49:40 UTC",
    "id": "1j8nxyc",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 5,
    "secure_media": null,
    "selftext": "I love my sister so much, but sometimes I can’t help feeling jealous of her. I wish I looked like her, or even that I was her. She just seems to have something I don’t—maybe it’s the way she carries herself, the way people respond to her, or just the fact that she seems more… enough.\n\nIt’s not that I don’t want to be me, but sometimes being me feels like it’s not enough. I catch myself comparing every little thing—her face, her body, her confidence—to mine, and I always come up short. She hasn’t made as many mistakes as I have, and she’s never felt the need to go to other people just to feel worthy. She’s always seemed whole on her own, while I’ve spent so much time searching for validation in places I probably shouldn’t have.\n\nI hate feeling this way because I love her, I really do. But I just wish I could be enough.",
    "subreddit": "TrueOffMyChest",
    "title": "Feeling jealous of my sister even though I love her",
    "upvote_ratio": 0.86,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8nxyc/feeling_jealous_of_my_sister_even_though_i_love/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 10:39:58 UTC",
    "id": "1j8nsyl",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 6,
    "secure_media": null,
    "selftext": "I saved up for and have been paying off this trip with my school for months. Were doing travel abroad and doing a lot of hiking and walking right? Second day in I over do it walking around the capital city and strain my hip. I woke up this morning and couldn't move my leg unless I used my hands to make it move. It hurts to walk on and im just so tired of my body falling apart. I'm only 24 and I have a messed up knee, carpal tunnel, I get constant styes and now this. I'm just so tired of it. I want to be able to walk around for hours without worrying about hurting my knee, I want to be functional. Now I'm missing a hiking portion because I opted to stay at the bus to take care of my leg and make sure I don't hurt it worse. I'm debating getting an overpriced hiking stick at a nearby store and seeing if that helps. I'm just tired of this happening. It feels like I get sick or injured somehow once every other month. Just before this trip I managed to recover from strep and avoid catching covid from my sibling but now I'm slammed with this. I just don't know ",
    "subreddit": "TrueOffMyChest",
    "title": "I finally get to go on a trip I've been looking forwards to, only to get hurt during it",
    "upvote_ratio": 0.87,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8nsyl/i_finally_get_to_go_on_a_trip_ive_been_looking/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 10:37:39 UTC",
    "id": "1j8nrrr",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "I dont know why but i feel like im a failure socially (i only have 4-5 friends), academically even though i have a good average, im a disappointment to my parents. Idk why i feel like this but i needed to say this to somebody. Also if you have any tips for me please comment it. Have a nice day ❤️",
    "subreddit": "TrueOffMyChest",
    "title": "I feel like a failure…",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8nrrr/i_feel_like_a_failure/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 10:17:46 UTC",
    "id": "1j8nhdx",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 3,
    "secure_media": null,
    "selftext": "I don't wanna write a sob story or anything, but I'm a fifteen year old girl and I get really physically ill and nervous whenever romance is brought up or happens to me. Like I get this sick feeling in my gut and my heart starts beating out of my chest.\n\nLike, today in class we were watching a movie, and I had to look away when there was people on the screen kissing. Nothing sexual, it was just kissing. I'm literally in high school. My friend asked me why I did that but I brushed it off as hearing the vent make a weird noise.\n\nOr, one time I somehow managed to kiss a guy, and as soon as our lips touched I kind of wanted to disappear. I went to the bathroom a few minutes later and puked up my whole lunch because of how gross I felt.\n\nIs this normal? I can think of a few reasons for this issue - being raised religious (my parents won't let me date till I'm in my mid twenties), being autistic and having anxiety or maybe just being socially awkward, but I dunno. A bunch of my friends are dating each other and it's very easy for me to help them and talk about it but when it's in front of me or involving me I kind of shut down.\n\nMany thanks !\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "I think I'm gonna be stuck alone forever",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8nhdx/i_think_im_gonna_be_stuck_alone_forever/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 09:54:28 UTC",
    "id": "1j8n5p9",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 0,
    "secure_media": null,
    "selftext": "21M. Alright, so lets be real - us guys have tried to measure our dickss atleast once in our lives. I did too, and let me tell you... I mismeasured mine as a kid and spent years feeling insecurity over nothing.\n\nBack in middle school, I thought I was below average, thats what the numbers said. Every time I heard girls joke about how 4 or 5 inches is way too small, it stung. I started avoiding those conversations, dodging situations where I might have to \"prove\" myself. I even fumbled with girls who were actually into me, just because I was in my head about it.\n\nAs i became more mature, my mindset changed. I stopped giving fucks. Now I was more of a \"fuck this, it is what it is\" kinda guy. I was determined to focus on the things i can change. I went to the gym, grabbed my balls and asked out chicks i liked on dates, and honestly? Life got better.\n\nFast forward to last week - I randomly saw a measuring tape lying around. Me being bored, I figured, why not? Maybe it grew a bit, maybe it didn’t, but at this point, I couldn't care less and was purely measuring for fun. **HOLY SHIT!!!** I was the average joe before, but now somehow my dick is inches bigger than the average size. I couldn’t believe it. Measured again. And again. Even got a different measuring tape. Same damn results.\n\nI felt dumb but also kinda hyped. All those years of insecurity - for nothing.\n\nPS : this post isn't to make my fellow chads feel insecure. Up until last week I was riding with the below-average squad. It doesn't really matter, and I've accepted that too. There will always be someone bigger, stronger, or better than you in some way, what makes you special is your uniqueness and how much you own who you are. Focus on the things you can change, life will treat you better.\n\nThanks for reading",
    "subreddit": "TrueOffMyChest",
    "title": "Middle school me was devastated… present me is pleasantly surprised",
    "upvote_ratio": 0.3,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8n5p9/middle_school_me_was_devastated_present_me_is/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 08:25:44 UTC",
    "id": "1j8m0t0",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 2,
    "secure_media": null,
    "selftext": "I’m writing this at 1 AM from a hospital room, and I’m drowning in so many emotions that I don’t even know how to put them into words. I feel sad. Angry. Frustrated. Hopeless. I don’t know how I’m supposed to feel anymore, but all I know is that I feel like my world is crumbling around me, and I’m stuck trying to hold it together alone. I just need someone to hear me — because I’m at my breaking point.\n\nI’ve been carrying trauma for over a decade now. It all started when I was 13. I was a freshman in high school — quiet, shy, reserved, and just a normal kid trying to figure out life. My high school was part of a cluster of four buildings right next to each other, and my brother went to the school next door. One morning, like any other, I walked to my first-period class thinking nothing of it. I sat next to the window, and suddenly, I noticed a huge crowd forming outside in front of my brother’s school. I looked up — and there was my brother, standing on the edge of the third-floor building, trying to jump.\n\nI froze. My stomach dropped. I couldn’t process what I was seeing. I got up from my seat, walked out of class crying, and started hyperventilating. I remember trying to get closer to the crowd, and when a staff member stopped me from getting through, I yelled out, *“That’s my brother!”* I remember blacking out after that — the panic attack took over me. My parents were called to rush over, and they assisted my brother first before coming to get me. We went straight to the hospital, and that’s the day my life changed forever.\n\nAfter that incident, I couldn’t return to my school. Every time I walked through the doors, I would have flashbacks of that day. I begged my parents to transfer me out, and they did. But that didn’t stop anything. My brother kept attempting — again, and again, and again. I transferred to a new high school each year, hoping I could outrun my trauma. I even forged my parents' signatures just to transfer myself, but no matter where I went, the pain followed me.\n\nAnd each time he attempted, I blamed myself more and more. *Maybe if I was there for him more, he wouldn’t have done it.* That guilt ate me alive. I isolated myself, refused to make friends, and shut myself off from the world. My entire teenage life revolved around my brother's mental health and trying to survive my own internal battles.\n\nIt didn’t stop after high school. I finally decided to enroll in community college, thinking I could have a fresh start. But again — he attempted. This time he overdosed on drugs, and we had to rush him to the hospital. This happened *three times* during my college years. Each time, I had to drop everything — my classes, my life, my sanity — just to relive the same traumatic experience over and over. I started falling apart mentally. I had no friends, no normal life, and every time I looked in the mirror, I hated myself.\n\nI finally sought therapy when I was 22, and my therapist told me what I already knew deep down — I had been psychologically abused my entire life. I had been carrying so much trauma, guilt, and blame for something that was never my fault. But how do you unlearn something like that? How do you stop blaming yourself when you watched your brother almost die over and over again?\n\nAnd then it got worse. My brother started getting heavily into drugs and alcohol. He overdosed *again*. I remember walking into his room and finding him unconscious with a bottle of pills and his skin turning blue. I can’t even count how many times we’ve had to call 911. The hospital feels like our second home now. The trauma just never ends.\n\nA few months ago, he swallowed an entire bottle of his medication — and we found him just in time. His skin was turning blue. Cyanosis was kicking in. Another call to 911. Another night in the psych ward. And guess what? He still doesn’t care. After that incident, the doctors finally put him on psychiatric injections — hoping it would stabilize him. But it hasn’t. He still gets drunk. He still uses drugs. And he still shows no remorse for the chaos he’s caused our family.\n\nAnd now comes the part that’s breaking me the most.\n\nToday, my mom was officially diagnosed with Stage 4 cancer. The cancer has spread so bad that the doctors are keeping her in the hospital for a few days to run more tests — but the prognosis isn’t looking good. And I know *exactly* why my mom’s health deteriorated so fast. It’s because she spent *years* neglecting herself to take care of my brother. Every time he attempted, she stopped eating. She stopped sleeping. She would sit by his bedside 24/7. She poured *every ounce* of her energy into saving him — and in the process, she destroyed herself.\n\nAnd now she’s dying. And I can’t help but feel like this is my brother’s fault.\n\nWhat broke me the most was when I came home after being at the hospital all night with my mom. I told my brother about her diagnosis, and he *didn’t care*. He was high and drunk — again. I begged him to come see mom with me, and he brushed me off and said, *“She’s fine.”* I wanted to scream at him. *“She’s not fine! She’s dying — and it’s because of YOU!”* But I didn't.\n\nHe finally came to the hospital with me but showed *zero* emotion. No hug. No comfort. No empathy. He just sat there like a zombie, high out of his mind, and I wanted to scream. My mom never left his side after *nine suicide attempts*. And now that she’s the one dying — he doesn’t care.\n\nAnd now I’m scared. Really, really scared.\n\nI’m scared that my mom is going to die thinking I was a terrible son. I’m scared that my brother’s mental illness will be dumped solely on me when she’s gone. I’m scared that my sister, who abandoned us years ago because she “couldn’t deal with it,” still won’t come back to help. I’m scared that my dad will fall apart after she’s gone. And I’m scared that I’ll end up like my brother — mentally gone, emotionally numb, and completely hopeless.\n\nI haven’t been able to make a life of my own. I’m 25 now — and I still feel like I’m stuck in that 13-year-old version of myself, frozen in time from the first time I saw my brother try to jump. I haven’t been able to build friendships, chase dreams, or have normal life experiences because every year, I’m reliving the same traumatic cycle. And now my worst fear is coming true — I’m about to lose my mom. The one person who held us all together.\n\nI see my psychiatrist later today, and honestly, I don’t even know what to say. Do I ask for stronger medication? Will it numb me out enough to survive this? Will it turn me into my brother?  I don’t want to turn out like him. I’m terrified of what my life will look like once my mom is gone and I’m left alone with my brother’s mental illness. My sister wants nothing to do with him. My dad is breaking down. And I’m scared I’ll get sucked into the same darkness my brother lives in.\n\nI keep asking myself, *Why can’t my mom catch a break?* She gave her whole life to take care of my brother — and now she’s paying the price with her life. And here I am, 25 years old, and I’ve never been able to build a life of my own because I’ve spent my entire existence putting out fires my brother caused. And now, I’m about to be left alone with all of it. I don’t think I’m strong enough for that. I’m genuinely scared I’m not going to make it through this.\n\nI’m watching my mom’s life slip away. I’m watching my dad break down. I’m watching my sister keep her distance. And I’m watching my brother continue to destroy himself while showing no remorse for what he’s done to this family. And I’m just here…holding it all together with no one to talk to. I feel like I’m about to lose my mind. I feel like I’m on the verge of completely breaking down. I have no friends. No outlet. Just my psychiatrist, my medication, and my panic attacks.\n\nThe saddest part? Two weeks ago, my parents were packing up our house and making retirement plans to finally enjoy life after years of hardship. Now that dream is gone. My mom is dying, my dad is falling apart, and my brother couldn’t care less. I’m stuck picking up all the pieces.\n\nI don’t know what I’m hoping to get from posting this. I just know I’m not okay. If you made it this far — thank you. I just needed someone to hear me. Because I feel like no one in my real life sees me anymore. I’m just the sibling of the “mentally ill brother.” The one who’s supposed to stay strong. The one who has no life. The one who will be left alone and scared.",
    "subreddit": "TrueOffMyChest",
    "title": "The Honest Truth.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8m0t0/the_honest_truth/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 08:09:12 UTC",
    "id": "1j8ltdb",
    "link_flair_text": null,
    "media": null,
    "num_comments": 19,
    "score": 0,
    "secure_media": null,
    "selftext": "My friend is an amazing woman who is very smart and kind. She is empathetic and posseses many qualities that would encourage men to date her. The reason I bring this up is because even someone as great as her has said things that have further intesified my anxiety toward dating. We got to talking about what we physically like in people and she said, \"I really hate saying this, but it's kind of a big deal breaker for me if a guy isn't tall. I could maybe date or hook up with them, but they have to heavily compensate in other ways. He would have to be really, really handsome though I would still be a little upset.\" \n\nHearing her say that men should compensate for lack of height scares me because I know that I lack way too many physical preferences that other women would desire. I'm average height where I live at 5'9 with an absolute ugly face and narrow body frame. My penis is nothing to brag about. I don't know how to be charismatic since I literally never know what to talk about even when I'm relaxed and not worried about pursuing anyone. I don't have any way to compensate for all my physical \"flaws\".\n\nMy face is so strange looking that it causes women to get nervous or laugh at me. I know it's not my mannerisms or expressions because I've asked my friends if I seem very nervous or awkward in public and they tell me no. I'm actually more nervous in public with my friends because they are very good looking, and I feel embarrassed knowing they are seen next to me. I hate being trapped in such an undesirable body. \n\nEven if a woman could get past how I look, I would feel extremely unworthy of her. I want a woman to find me physically desirable, but my looks are so bad that a woman will never be as sexually attracted to me as I am to her. I know beauty is subjective, but there are certain traits that are more favorable, and as I've said before, I don't have them. I can't stop feeling so undesired and worthless no matter how much I distract myself with passions and hobbies. I'm tired of it all. ",
    "subreddit": "TrueOffMyChest",
    "title": "My friend said something that made me realize why I'm so afraid of dating",
    "upvote_ratio": 0.44,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8ltdb/my_friend_said_something_that_made_me_realize_why/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 07:57:40 UTC",
    "id": "1j8lnx0",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 2,
    "secure_media": null,
    "selftext": "\nTonight, after spending the whole day with his friends, it was after midnight and I just wanted them to leave so I could have privacy and peace in my own home. He knows i’m an introvert and I was drained. Instead of understanding, he got irritated, like I was being difficult for wanting space. He said he was fine with them there, so his comfort should matter too, and accused me of being selfish.\n\nI told him my comfort should matter. Most men respect that having company over late when they live with their woman isn’t okay. it’s not like they were in the living room, they were in the couch in our bedroom. i felt uncomfortable after it got late, i wanted to undress, and be comfy in bed and not care about people i barely know hearing me snore. But he flipped it, saying he can’t hang with his friends or stay out late because of me and my “stipulations” since he cheated (whole other story). I told him he was being unfair. He said I was mad because he wasn’t giving me attention, that I can’t take him having fun without me. That hurt, because it wasn’t true.\n\nI brought up how he’s being immature and he’s 30 hanging out with 21- and 23-year-olds, and how it makes me question if he’s serious about the life he claims to want. He acts like he’s single, not a family man but telling me he wants a baby. \nAnyway, his response to that was to call me jealous and asked if i’m mad because i’m old, told me to carry my “old ass” to bed. I reminded him he’s my age, i’m 31… and the guy i dated when we broke up was 24 and never once said anything negative about my age but he doubled down, saying the guy was nice because it was “easy p***y.”\n\nI told him not to talk to me like that. He laughed in my face. Then he brought up me going out the other night and disappearing, implying I cheated. \nmeanwhile i only went out because he was out all day with these friends and didn’t check in and didn’t come home, i left the house at 10pm and he still wasn’t home. but then i was the bad guy when i got back in after 1, when he left the house from 9am and left me stranded taking my car?\n\nI asked him, if he thinks I’m an old worthless cheater, why is he still here? He didn’t answer. Just kept watching TV, laughing, then went to bed like nothing happened—while I sat on the couch crying…\nhe’s snoring as i’m typing this and i feel like crap.",
    "subreddit": "TrueOffMyChest",
    "title": "i’m selfish for wanting company to leave",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8lnx0/im_selfish_for_wanting_company_to_leave/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-11 07:35:25 UTC",
    "id": "1j8ldsu",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 0,
    "secure_media": null,
    "selftext": "My husband found out I spent $1000+ on an autism and adhd assessment and he’s mad. I didn't tell him because I knew he would say no. For context I have had a history of depression anxiety starting from teens, childhood SA, diagnosed BPD.  I got the diagnosis because for a long long long time I've wondered if I'm on the spectrum. I'm 35. I'm also sham to 5 kids, but he always says that his money is my money too etc.  I know it's a big amount to spend but he spends big amounts as well.  \n\nAnyways, he thinks it’s too much money for something with little value and gain. Basically a label he said and I got \"scammed\".  He asked me what it means being high functioning autistic and what inattentive adhd means (in a combative defensive way not in a wanting to learn way).  He should know our son is level two autistic and combined type adhd he is 10.  He's had 10 years to learn.  I also believe our daughter is on the spectrum with adhd have had her assessed just not diagnosed.  \n\nNot sure what I'm wanting.  I feel so invalidated and unsupported.  \n\nThanks for reading this far.  ",
    "subreddit": "TrueOffMyChest",
    "title": "Am I wrong?",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j8ldsu/am_i_wrong/"
  }
]