[
  {
    "postId": "t3_1j65iqy",
    "title": "I got terminated from my volunteer position with no explanation",
    "content": "So I (18f) just finished volunteering for the day at my workplace (animal sanctuary) yesterday, when I got a message from my boss to see he sent me a termination letter, nothing in the message either just the letter itself, and they have ignored me since.\n\nAlso sorry this is a long one, I just have a lot of things in my head I need to sort out.\n\nSo a bit of backstory, since I was around 14 I’ve been dealing with the struggles of depression, anxiety and adhd and ended up leaving school in yr10 because of it. Took a while to figure out but I ended up going to tafe to complete my cert ii and iii to become a qualified zookeeper as I’ve always loved animals and can’t see myself doing anything else. Because of tafe I had to start volunteering to complete the practical component of my course and ended finding this amazing sanctuary to work at.\n\nSo I ended up starting there in early February 2024 and fell in love with the place and the people. I was originally going once a week but started going twice a week in around November bc I loved it so much and wanted to be there more. They always told me they loved how I would be there consistently every week and I would pride myself on it as it was a big commitment for me as I lived an hour away.\n\nThe environment there was great, honestly I couldn’t have asked for it to be any better. The owners always quite involved and prided themselves on this and wanted us to feel more like family rather than a workplace. Because of this I became quite close with the people who were on my days and considered them my second family.\n\nThe owners also lived on site and their kids were always around, because of this I became quite close with them as well, even buying them small presents for their birthdays and helping them with their homework.\n\nI suppose I’m telling you this so you understand how close I was with them, their family and the other volunteers, so you can understand how hurt I am by the way they’ve handled this situation.\n\nEven on my bad days, they were half the reason I’d get up in the morning, even when I didn’t want to drive, or talk to people, I’d still show up bc I didn’t want to let them down, as again I seen them as my second family and greatly valued their opinion.\n\nSo fast forward back to yesterday, it was completely normal. Nothing out of the ordinary, we were still talking like normal, doing all our tasks as normal, having lunch together like normal, I even got a last minute tour and stayed back to finish it up, which brought in a fair bit of money for them.\n\nAlso just a note, it’s a non-profit, all the money from tours goes right back into the sanctuary to care for the animals, food and water, vet bills, etc.\n\nSo just my little routine afterwards, I stop on the way home to go to the bathroom, get food, etc. So I was checking my phone like normal, and seen he sent me an attachment, funny thing is I thought he was sending me a dumb reel or something. Boy did I have a rude awakening when I read termination letter. So naturally I read through it and start crying because again, that day was normal, there was not even a hint that something like this was coming. Luckily I had one of my friends with me so I didn’t do something dumb like driving with so many tears in my eyes I could barely see and probably getting into an accident.\n\nIn the letter he basically highlighted the fact that he wants to maintain a positive workplace and while he values my input, he needs to put the sanctuary first, blah blah blah, the typical things in a letter that would put the blame on me so he doesn’t seem like the bad guy.\n\nSo one important thing to mention, they say this to everyone but from the start they said that they’re the kind of workplace to make sure everyone’s included and don’t like people to form cliques. However, I became really close to two people in particular, specifically because they’re great friends and have done so much for me.\n\nNow while I was really close with these two, I feel we included everyone when we could. Especially since some days at the sanctuary we’d be so busy we’d barely see each other that day. So we’d always go out for lunch, however we’d always ask everyone if they wanted anything and never ate out, always came back to be a part of the whole team. (We’d all have a break at the same time.)\n\nNow obviously being friends, we’d hang out after work, (but again we’d ask some people if they’d wanna come if we weren’t going too far away.) And we would call and stuff, but I feel it’s normal for friends to do that.\n\nSo one thing I could see where they wouldn’t have been to happy with this, is that we were doing an animal course about 5 hours away. You have to finish the online part first before you go do the practical bit. So one of my friends told the boss that we were going to be doing it (he already done it prior and was just driving us), and unlike the last time it was done, they didn’t put it on the group chat or anything for people to say they’re interested. I think they assumed we’d tell people that we were doing it and ask if they’d want to come. Mind you this was about a month in advance, so plenty of time for people to do the online section. I will say this course ends up being quite expensive so some people weren’t able to do it due to financial reasons anyway.\n\nAnyways long story short, one other person from the sanctuary ended up doing the course (btw the course only has 4 spots for the Prac part). We had a great time and included him in nearly everything we did (he traveled separately to us so was only left out of stuff we did on the way). We even had a game night and everything and really the only people who were left out were the people who couldn’t come but wanted to, which I don’t blame them for.\n\nI can only assume that this is the reason they fired us (my friend that drove was quitting, next week was going to be his last, however they messaged him yesterday basically telling him to not come back, and my other friend also got a letter similar to mine.)\n\nAgain, I was completely blindsided by this, as yesterday and even the last few weeks were completely normal. No they didn’t even try to chat with us, saying something like, ‘hey this is what we can see is happening and we don’t like it, can you just try to include the other people more’. Something like that and I wouldn’t have been as devastated.\n\nThe only other thing it might be is that I would make some pretty crude jokes, although I wasnt the only one that would say them, and me and my boss would say them to each other and everything (we’re Aussie btw, it’s part of our culture I suppose, if we don’t know you or don’t like you, we’ll be quite civil/polite to you, but if we do like you then you’ll probably cop it.) although I don’t think this was the problem bc again it wasn’t just me making these jokes.\n\nI guess what hurts the most, is that I really respected my boss and viewed both of them quite highly. Like they’re great people (at least I use to think so), they’re great parents, really community oriented and from what I’ve heard, quite highly regarded in our field. So basically for him to not even have the decency to even send me a message along with the letter it is what hurt the most. So naturally I sent them both a message, asking them to give me a call bc for my own peace of mind, I really need an explanation. Both of them (I assume accidentally) opened the message and I can see they read it, however they both ignored it. So I sent them an email this morning, however still waiting on a reply.\n\nI’ve never been through a breakup but I imagine it’d be like this, except instead of breaking up with one person, I’ve just lost my second family. With no warning, no explanation.\n\nAnyways thanks for listening to me ramble, sorry it was so long, I’m just kind of at a loss for now. Hopefully I’ll stop crying and get out of bed soon. Thank youse 🫶\n\nTLDR - I was volunteering at an animal sanctuary when I got a termination letter from my boss, with no warning, no explanation. I feel like I’ve lost my second family.",
    "score": "3",
    "comments": "3"
  },
  {
    "postId": "t3_1j6mwnr",
    "title": "The phrase \"you're not owed sex/companionship\" is being used as a shield from criticism for discriminatory dating preferences.",
    "content": "I was reading a post from an autistic man complaining about being constantly rejected by women because of his quirkness/weirdness, even though he claims to be a non-misoginistic stand up guy.\n\nThe replys? You guessed it! \"You're not owed sex, you entitled incel!\"\n\nWell, no shit Sherlock!\n\nOf course he is not owed sex, but wouldn't it also be appropriate to have a conversation about dating preferences and how they're often based on various forms of discrimination, like racism, classism, ableism and toxic masculinity?\n\nWhy isn't anyone advocating for people to question their dating preferences when so many of them are rooted in several forms of discrimination them themselves claim to be against?\n\nYes, if after further reflection you still feel you can't let go of your preferences, by all means chase them, even if they're not exactly based on positive traits, because you really don't owe anyone your affection or your private parts.\n\nJust don't use that excuse to not have to do some introspection about your preferences, their roots and how that's affecting you and also keeping some great people from finding love.",
    "score": "0",
    "comments": "34"
  },
  {
    "postId": "t3_1j5q831",
    "title": "Parents called me a communist for wanting more hours on my job",
    "content": "I (17M) am a Filipino, and have been living in Canada for about 6 months now. Just last month did I finally land a job at the deli in a supermarket after months of seemingly endless jobhunting.\n\nHowever, my manager at the deli is... lets just say, a not very nice person. Shes very condescending, and pretty much just has something against the students that work in the deli (me included).\n\nHer very obvious and not well hidden hatred towards the students finally came to a full fruition when she scheduled ALL the students for the rest of the month just less than 10 hour shifts a week. In fact, one of us was even getting just 4 HOURS in a week.\n\nIts not like we were being greedy or anything. All of us need the money. One of us needs it to buy insurance for his new car, and another one of us needs it to buy a new car. I need it to pay the internet bills in my house, help my parents with their payments, and maybe soon buy a PC for myself.\n\nWhen I saw my schedule for the rest of the month, as expected, I was pissed. I mean, seriously? We haven't really been slacking off either, all of us even do our jobs arguably well.\n\nWhen we went to ask our manager about it (she was supposed to STILL be at work) another one of the employees at the deli said she already TOOK OFF.\n\nOf course, we are planning to ask her about the schedules tomorrow.\n\nBut when I told my parents about it, they were not happy.\n\nThey thought I was asking for too much.\n\nOf course, I was once again pissed. For someone who works as a STUDENT and earning MINIMUM WAGE helping his OWN PARENTS PAY THEIR BILLS, I think I should atleast have SOME right to extend my hours, no? But no, of course not. When I told them it should be MY RIGHT to ask my manager for those few extra hours, they then went to comparing me to protesters.\n\nNo joke, heres how the conversation went:\n\nDad: \"What if the next time I start seeing you on the streets holding a placard? What if you end up like those pink protesters back home?\" (Referring to what happened back in the Philippine presidential elections)\"\n\nMe: \"I don't think it will go THAT far. Besides, even if it does, I think protesting about our hours should also be a part of our rights, no?\"\n\nMom: \"What are you thinking? The way you're thinking now, you're gonna end up a member of the NPA!\" (A Philippine communist terrorist organization)\n\nNow, this made me even more pissed. But to my parent's credit, they DID try to diffuse the situation.\n\nHow did they do that? Why, by insulting the way I do my chores at home, of course.\n\nThey said I needed to \"Prove myself at home\" first. \"Do the chores well first\". Like huh? I already do my job/s to the best of my ability as far as I know, I don't really know what else I need to prove at home. I mean, I guess fair enough??? I suppose theres still a few things to work on I guess??\n\nJust so yall know, I DID consider telling them that my manager was a not-so-nice person. But considering they already called me a communist for wanting more hours, I don't even wanna KNOW what they would wanna call me if I complained about my manager. \"Just do your job and bow down to your bosses\", thats their motto, after all. (Not even joking).\n\nHonestly, my brainrotted side thinks this is pretty funny, but it kinda made me feel bad at the time. My parents would literally rather compare their own child to a bunch of terrorists rather than siding with them! Amazing!\n\nTLDR: Manager is an asshole, gave me bad hours, and when I told my parents I was gonna ask for more hours, they compared me to communist terrorists",
    "score": "18",
    "comments": "10"
  },
  {
    "postId": "t3_1j6kd1t",
    "title": "I (M30) lost the love of my life (23F) and I'm about to kill myself",
    "content": "I was in a long distance relationship with this girl, since last august. She took me at my worse, at the time I was alcoholic, had no job, had social anxiety over the roof. Was single for years since my first relationship cheated on me 20 times or more, since then, I couldn't trust any woman and I was a bit broken. But life was going on anyway.\n\nDuring those months together. I've had multiple relapse of alcohol and would send dumbs drunk messages to her. Nothing to serious. But it happened quite a bit. Just forgave me and understood my alcoholism, if I definitely stopped drinking.\n\nThat what I did. For the last 15 days, I was sober. I didn't told her but it was really really harsh, sweating, mood swing, shaking. But I was determined to not disappoint her.\n\nLast Sunday. She sent a friend of her to message me on Instagram. I told her I was in couple. But then, I liked a photo of her in bikini, and told her we could flirt.\n\nShe had few followers, only one photo, for me it was pretty much a fake and I was messing around.\n\nI would never have gone said that if I knew it was someone real, nor gone any further.\n\nI am french and here, I've been asking friends and most of them tell me it was dumb, and a bit disrespectful, but not cheating, that our love must go above this mistake.\n\nFor her, friends and family all tell her I'm disgusting, it's unforgivable, and she told me you can't repair a broken glass... She never forgave cheating, and won't.\n\nShe is now ghosting me, blocked me everywhere because I have been spamming her to talk to me at least. I didn't realised at that time it was cheating and I feel miserable.\n\nI've been sleeping for weeks, I've had found a job that I left the day after she broke with me, I even booked a flight and then canceled it, losing money in the process.\n\nIt's been one weeks and I desperately need her help, she was the one goal of my life, the only one I've ever been able to love again, I feel like killing myself everyday and I am not even joking, I know it will go wrong for me, i physically cannot live my life without her, not for a mistake I didn't realised... I never ever cheat, and I would never ever, I guess our boundaries are different and it's a miscommunication.\n\nI have nothing to ask, my chest is empty, my life is empty, I just wanna kill myself now, and I have no way to contact her to explain her my point of view...\n\nTLDR : Sorry if I failed you, I don't know how much longer I can endure this. I love you more than anything. Sorry. Sorry. Sorry...\n\nEdit : The worse part is she never let me a chance to explain myself, to even say goodbye, she just disappeared like I am nothing. I can't express how much pain I am going through right now, I just cant keep living this life without her.",
    "score": "0",
    "comments": "18"
  },
  {
    "postId": "t3_1j64p36",
    "title": "I think about the one that got away even though we were never together.",
    "content": "Due to trauma I have an extreme flight feeling so that even though things are going good with my current partner I keep thinking about just packing my things and leaving. I keep thinking about a FWB I was with prior that if we had tried a relationship probably we probably would've been great together. I love my current partner and don't want to actually leave him and I can't say anything to either of them because I won't let my trauma response ruin a relationship and friendship. I am working on it with my therapist. I know that if I do pack up and leave and have something with the friend that the same feeling will happen with him because I need to work through the trauma rather than giving into it. I don't really have any friends I can talk to about it because none of them will understand.",
    "score": "3",
    "comments": "0"
  },
  {
    "postId": "t3_1j6b0mk",
    "title": "Why am I doomed to watch someone be in love and when I am they choose someone else",
    "content": "Not found",
    "score": "1",
    "comments": "6"
  },
  {
    "postId": "t3_1j6447m",
    "title": "Moving on from my ex gf has been difficult 29M",
    "content": "We broke up over two years ago now. Things have gotten better of course and my life has changed for the better. I’ve accomplished new goals and have a new trajectory in my life that I didn’t have before. Regardless, I still hold have regrets on how I handled things with her. I still miss her a lot.\n\nI have dated since then and have met some nice girls too. I’m not sure if it’s a conscious or unconscious thing, but I have yet to find a connection like I had with my ex. There have been some women I have connected with in special ways. I just don’t think I ever felt seen and understood like I did with her.\n\nI could always be myself and we had so many great memories just hanging out and vegging out. The laughs we had and the conversations about life. I realize every connection is unique. I have mostly accepted that we probably will never be together again. We tried to be friends, but I just could not stomach seeing her with someone else. It was way too difficult. I can admit that.\n\nI just don’t want to keep being in limbo. I think closure is something I never got. I probably will never get. I wish this monkey would get off my back.",
    "score": "3",
    "comments": "0"
  },
  {
    "postId": "t3_1j5xime",
    "title": "I just had to google a slang term. I'm 23...",
    "content": "It made me feel old for the first time in my life. Zesty ah",
    "score": "7",
    "comments": "9"
  },
  {
    "postId": "t3_1j63zlg",
    "title": "Too rich to qualify for assistance. Too poor to pay the medical debt I need assistance for.",
    "content": "Sometimes I wish I could literally die in an accident so that the calls from collections and bills piling up on my mailbox stopped. Sure, I make $80K, but it means jack shit when I live in a somewhat expensive city and a huge chunk of my income goes towards these bills.\n\nRecently I started to have health problems, which are making me attend therapies to manage said problems twice a week. I'm spending an average of $600-$700 a month. I ended up in the emergency department last month too, which means I have to pay $4,000 to them.\n\nEverywhere I go for assistance turns me away because I don't make less than $60K, yet these braindead morons working there don't understand the concept of my income going towards these bills, leaving me with less money to even feed myself. I'm down to 1 meal a day and honestly I can manage it because I have an eating disorder, but I just feel bad for others that genuinely can't do it.",
    "score": "3",
    "comments": "0"
  },
  {
    "postId": "t3_1j5u6k8",
    "title": "I'm in over my head. How do I stay positive?",
    "content": "My (52M) father-in-law (85) moved in with us from another state due to his declining health. There was no way he could live by himself any longer. He’s a solid guy...sharp-minded, well-read, but lately, he just sits, naps, and stares into the void for hours. I work from home, and watching him decline, watching him die...has started to weigh on me in ways I didn’t expect. He says that if he stops eating he won't last as long and things like that. He's on all kinds of meds for cancer to depression of knowing he's dying.\n\nIn the past two months, I’ve had to give him more showers than I can count after accidents. I’ve hosed down clothes, scrubbed poop from the shower, and still not used to the loud burps, the constant farting, the mad dashes to the bathroom, while using a walker, hearing his despair as we walk, listening to him crumble in humility. I haven’t said a word to anyone about it because the first thing I feel isn’t frustration...it’s sadness. He had prostate cancer, and it’s spread to his bones. The doctors haven’t given us much insight into what’s next, but every day, I can see him slipping. My heart is breaking in all kinds of ways.\n\nMy bride works crazy hours and makes about twice what I make. She feels awful that this is upon me, and we even tried bringing in a nurse for a day, but after they left, he begged me not to have them come back. He likes it here, just the two of us most of the time during the day. He moves between the window with a bird feeder, his recliner, and his books. When my teenage boys are home, they watch history documentaries together, and for a little while. And we do small things on the weekends.\n\nI don’t say anything to my wife—she’s losing her dad. I won’t let her see me struggle. I won’t let him see it, either. I’ll be here 100%, without a single complaint. But the truth is, I can feel it getting to me, and my kids can too.\n\nHow do I stay positive? How do I keep from drowning in this? I knew this would be hard, but I didn’t realize just how much. I’m in over my head, and that itself makes me feel selfish. UGH!",
    "score": "9",
    "comments": "9"
  },
  {
    "postId": "t3_1j4xfoh",
    "title": "I overheard one of the funniest conversations ever and i can't stop laughing",
    "content": "Not found",
    "score": "1124",
    "comments": "32"
  },
  {
    "postId": "t3_1j69ulf",
    "title": "I finally made a move on my best friend and it went terribly",
    "content": "We have been coworkers for almost 10 years and best friends for over 5 years. I'll keep it vague because she uses reddit regularly. Annie (fake name) and i are both in our 30s, both single, we talk constantly- we are either texting through the day or voice noting each other while we are driving. Everyone at work thinks we are a couple and are constantly asking if something is going on, unfortunately nothing ever has.\n\nI've been in love with her since I first met her. She's just so beautiful and smart and funny, there's nothing I don't love about her. She's a great mom too and I've been partially filling a void in her sons life of a male role model. Anyway on to the incident. We were out for dinner after work. I had asked her out knowing I was going to finally confess my feelings, but she didn't know that was my intention, we get dinner regularly enough.\n\nWhile eating we were gossiping about work and about a new project we are starting. It'll be us two and a guy called Craig (m 50s). Craig has asked me out multiple times to the point its definitely an ongoing joke. He knows I'm interested in women only and we have a great working relationship. Annie makes a comment about us having some late nights working coming up and I better watch out for Craig's advances, I joke that I guess everyone just wants to kiss me, she says not everyone. OK not a great start. I say well speaking of kissing and she cuts me off and just says \"please dont\".\n\nI just said ok. We both got fairly quiet. Finished our dinner with some small talk and work chat. Went our separate ways and haven't spoken since. It's been 2 days. I'm just so sad and lonely without her. I miss her son. I want to talk to her so much, but I know I can't keep this situation going on or I'll lose my sanity. I'm going to look for a new job. Maybe actually start dating women. In time I hope I can be a real friend to her. I feel bereaved. If anyone has been through this type of situation and has any advice please let me know.",
    "score": "1",
    "comments": "8"
  },
  {
    "postId": "t3_1j60ub5",
    "title": "I’ve been questioning everything about social media and how it impacts our lives lately.",
    "content": "I’ve spent so much time on social media, but I’m starting to feel like it’s taking away from real-life connections. I’ve been wondering if anyone else feels this way. Does anyone else feel like social media makes us more isolated, even though we’re constantly ‘connected’? And if you’ve felt this way, how have you managed it? I just feel like I’m constantly comparing myself to others and losing track of who I am. It’s exhausting. I needed to get this off my chest.",
    "score": "4",
    "comments": "1"
  },
  {
    "postId": "t3_1j62s93",
    "title": "Spoilers don't make me mad.",
    "content": "Not found",
    "score": "3",
    "comments": "3"
  },
  {
    "postId": "t3_1j5l4s1",
    "title": "Just had to block my fake coworker with no explanation and I feel good about it.",
    "content": "I (19F) work with this girl, Genly (25F).  At work, she plays the sweet, quiet girl, and everyone thinks she’s so nice and understanding. But behind the scenes? She’s a two-faced gossip who talks shit about everyone, including the people she claims to be close to.\n\nAt first, we were pretty close, but the more I got to know her, the more I noticed how fake she was. She’d backstab people she said she liked, and I realized she was probably doing the same to me. So, I decided I was done. No warning, no explanation  I just blocked her on everything and moved on.\n\nThe second she found out, she ran to Facebook and posted some weird, fake-intellectual quote about people being “obsessed with psychology and personality traits,” my coworker told me clearly trying to make it seem like she’s above the drama. She even told people I blocked her, which is just petty. Like, just admit you’re mad and move on.\n\nBefore all this, Genly used to be super close with another coworker, Joanna (24F). I asked Joanna about something that made her realized that Genly was saying behind her back, and that opened Joanna’s eyes. Their friendship ended after that. So now, Genly has no one left except two other coworkers, Maribeth (22F) and Kenneth (20M), who are just as fake as she is.\n\nThe crazy thing? The day after I blocked her, Maribeth and Kenneth almost got attacked by a dog on their way to work. I passed the same dog later, and it didn’t even look at me. Then, Genly didn’t show up to work that day, claiming she had a “stomach ache.” The timing is insane, like the moment I cut her off, her whole vibe got thrown off.\n\nI know some people are saying I should’ve talked to her before blocking her, but I honestly don’t owe her an explanation. She was fake, I removed her from my space, and that’s it. I’m done with her.",
    "score": "26",
    "comments": "3"
  },
  {
    "postId": "t3_1j657gu",
    "title": "Am I being used?",
    "content": "Am I being used?\n\nDo I (26F) need a reality check? I’ve been friends with my friend, Blake (26M), for over a year now. We have been pretty close since the beginning. When we first met, we bonded over our shared love for playing soccer together and music. I would say we have many similarities. We both enjoy adult animation, like Studio Ghibli, raves, and playing board games. Since we shared many similarities, we kept in touch daily through text messages, phone calls, and FaceTime. We had a mutual friend named Jennifer. Jennifer and I were very close until I noticed that whenever we spent time together, she spoke negatively about everyone around her. As a result, I gradually distanced myself from her. Around the same time, Jennifer and Blake started dating. Although I wasn’t close to Jennifer and didn’t personally like her, I wanted Blake to be happy. Blake and I maintained a consistent relationship and communication. We talked every day, even during our lunch breaks, via FaceTime. However, things took a turn when Jennifer informed Blake that I had feelings for him and wanted to pursue a romantic relationship with him. That was not the case, and I was even in a relationship at the time. As a result, Blake ended our communication to preserve his relationship with Jennifer. We did not talk for eight months. However, in January he reached out to me. He told me that Jennifer suddenly broke up with him in December. Since then, we’ve been hanging out again. In February, we attended a rave and ended up having sex that night. A week later, we confessed to each other that we had both harbored feelings for one another since we’ve first met. At this point, I informed him that I didn’t want to be a rebound, and he responded by stating that he wasn’t ready for a relationship and wanted to focus on healing. I accepted his decision. We continued spending time together and continued having sex. However, I later told him that I no longer wanted to have sex with him because I was struggling to separate our friendship and romantic feelings. Around the same time his ex-girlfriend, Jennifer, filed a protective order against Blake.\n\nSidebar: Personally, I have had past experiences with abusive men, which may have influenced my perspective. However, I must admit that I am not entirely aware of the details of Jennifer and Blake’s relationship. Given Jennifer’s personality, I can’t help but wonder if this situation is a attention-seeking ploy. On the other hand, I have only heard Blake’s side of the story.\n\nHowever, I suggested that we establish boundaries. We agreed to refrain from having sex and I told him I need a break from constant communication. I also told him to fine another trusted friend to confide in about the Jennifer situation because I haven’t healed from my own trauma from the abusive I had endured. Blake expressed his agreement to the physical boundaries and expressed he didn’t want to lose me again and our friendship.\n\nSince implementing these boundaries, our relationship has undergone a significant change. We don’t talk that much anymore and when we do the protective order case seems to be the main topic of discussion. Although, last night, I visited Blake’s place to watch Star Wars. During the movie, he asked me to engage in a platonic cuddle. We did, and he said Thank you. I inquired about the reason behind his gratitude. He mentioned that my presence was naturing and made him feel less lonely. Am I only in his life  because he feels lonely?",
    "score": "2",
    "comments": "4"
  },
  {
    "postId": "t3_1j69boc",
    "title": "I want to fall back into addiction and ruin my life",
    "content": "I’ve been sober off drugs for 4 months and 2 months of booze. I just need to get it off my chest man I fucking miss it, I miss living horribly, selling the things I own for money to buy drugs, doing stupid shit to get drugs, going to hang out with people who were like me. Going to traps and getting fuckef up with strangers. Unnecessary drama, long nights where at the end I would be begging to just disappear. I miss having those problems, family issues with the screaming and yelling, I miss making dumb decisions that I still regret, I want to make more. I don’t know how to live this life, I can’t do it I can’t function like this, I go back to rehab at the end of may and lately all I think about is how much fun I could have by going back to using and doing stupid shit until then. My brain is tired and my mind is starting to work again and it scares me, I’m usuing weed to help but I’m still sober for a good amount but it’s not like the old high. Things dknt feel real like I know they are but like everything is just coming back and I don’t want to remember, I don’t want to look in the mirror and realize I’m a person. I don’t know who I am",
    "score": "1",
    "comments": "0"
  },
  {
    "postId": "t3_1j697oj",
    "title": "My Grandpa has Lung Cancer",
    "content": "That’s pretty much it. We got the news tonight that what he told us was just bronchitis was actually a week long hospital stay to find out he has cancer.\n\nHe didn’t tell anyone.\n\nSo many people in my family have been sick sure, but my grandpa didn’t do anything to deserve this. He’s still so young too.\n\nHe’s such a good man. He dedicated his life to God and this is what he gets in return. I’m so mad and angry. I’m sad. I’m pregnant with my second child and I was so excited to tell him. But now, I’m just scared.\n\nIs there anything I can do to help him through this time? He’ll be starting chemo so I want to help him be as comfortable as he can be, which I know isn’t much.\n\nPlease someone tell me he’ll be okay. What did he do to deserve this cruel punishment.",
    "score": "1",
    "comments": "1"
  },
  {
    "postId": "t3_1j68tj9",
    "title": "My mom is abusing me and I'm tired of it",
    "content": "I'm 14 years old and have told two of my friends briefly about this but I feel like I'll annoy them if I speak about it more. I just want to get this off my chest and put my experience somewhere in hopes it'll make me feel better. I'm also posting this here because I don't want anyone to try and intervene, it'll just make everything worse. Content warning for violence as well, but suicide is mentioned first so I used that flair, sorry.\n\nMy mom is an okay mom most of the time, but she's very quick to anger and has total freakouts over small things that always result in herself threatening to kill herself, or saying she's going to kill herself. I have a little brother who is 13, and my mom is 45 with a history of suicidal thoughts and one attempt before we were born, which she told us about.\n\nWhenever we get into huge fights, she usually takes my stuff and threatens to destroy/burn it (she never does), she never let's me talk and always screams over me, and then of course she threatens to kill herself and says it's because of me and my brother and she says we ruined her life. I can understand why she resents us to an extent, my brother and I are rape babies and we look like our dad. On the topic of him, he's an abusive rapist who was/is addicted to drugs, and who hasn't been in our lives since I was 3. He has gone off the radar for a few years and nobody knows where he is. My mom keeps threatening to send us back to him and has shown us her text in him multiple times telling him she's done with us and that he needs to come get us. He never has, obviously. The last few times we've gotten in fights I never even yelled once and just keep talking calmly because I heard that helps calm angry people down, it doesn't work she just keeps yelling, and there's even been a few times when I do raise my voice that she literally covers her ears and says \"lalalala\" like a toddler until I stop talking.\n\nAfter she threatens this, she usually leaves the house and says she's never coming back and says we can live with our grandmother. She says either that she's gonna drive off a cliff, into a brick wall, etc etc, or that she'll just straight up abandon us and start a new life somewhere. Then she'll come back some time later and act like nothing happened, very rarely she'll apologize but if I ever try and bring up what she's done again when she's calm, she'll just get enraged again. I've tried talking to her about it through text only once when she was out of the house, sending her a lengthy few paragraphs about my concerns, but she responded back basically just shaming me, and when she came home she was angry and she said she showed the text to all of her friends, which are mostly my friends parents, and she said they don't like me anymore and I won't be able to hang out with any of my friends anymore. I started avoiding all of my friends and eventually began online school because of this, and now my mom claims all my friends and their parents miss me and they don't understand why I don't talk to them anymore. I don't know what to believe anymore.\n\nWhen she isn't in these weird freak out modes she's an okay mom but she snaps at random stuff before flipping like a switch and being happy again. Just yesterday she was yelling and slamming around her computer because she couldn't upload her photos to Facebook, she's a photographer. A few people had just been over to fix our dryer about an hour earlier, which has been broken for months, so mid yelling at her computer she just got up and went to go text out the new dryer and then when it worked she was all smiles and apologized for yelling.\n\nShe also frequently tells me and my brother that we're the only thing keeping her alive and that she would probably kill herself without us, and she's told us multiple times that she doesn't own a gun because she's afraid that when we grow up and move out she'll kill herself because she has no one to rely on anymore. This scares me and I want to move away for college when I'm grown, I planned on leaving this household as soon as possible, but I don't really want to anymore because she keeps saying things like that. She says stuff like that and says she loves me and my brother, but then says the exact opposite when she gets really angry and says she wants to die because of us and she blames everything she's mad at on us \"stressing her out\". She's also gotten physical with me and my brother multiple times, like digging her nails into the back of my neck and holding my face into a pillow because I wouldn't give her my phone because she said she was gonna break it, chokeholding me and dragging me out of me room before locking me out of my room and tearing it apart because I hid my art tablet from her, and more. She's done stuff with my brother too and I'm ashamed to admit this but I don't know what because whenever she's mad at him I just hide in my room so I won't get punished for helping him. He does the same when she does that stuff with me. I only know she hurts him because I can hear it.\n\nI don't want to call the police, I'm scared and I don't want to live with my grandma or in a foster home or anywhere else and I don't want to be separated from my brother and pets. She actually encourages me to call the police on her and says she'd rather go to jail than live with us. I just want to explain to her how her her actions hurt me and my brother and I want to get her to stop. There's been periods of times where everything has been fine for a while and my family is just a normal happy family and I cry sometimes thinking about how that's what my family could be like if my mom wasn't the way she was. I know I'm doing it to myself at this point by not calling the police but I'm just scared and keep hoping things will change.\n\nRight now is one of those times where everything's fine, my mom is currently talking to my brother, offering to clean off the couch and sit and braid his hair while they watch the movie together. We're all acting like nothing's wrong. I just wish my family could be this way all the time.",
    "score": "1",
    "comments": "13"
  },
  {
    "postId": "t3_1j68o9l",
    "title": "Feeling like dogshit",
    "content": "Not found",
    "score": "1",
    "comments": "0"
  },
  {
    "postId": "t3_1j5wfhm",
    "title": "Scared I’ll never get a long term partner and family due to my mental health illness",
    "content": "Hey everyone, just curious what you think.\n\nI (31) have been struggling with OCD for a couple years. I’m scared to stay alone forever. I read in the OCD sub and there’s multiple posts about breakups due to the illness and it destroying people’s relationships. I had a similar experience, my only relationship (3 years) with my boyfriend (m, 23 at the time) ended because he couldn’t handle the stress and anxiety I had. I had just gotten my diagnosis 2ish years into the relationship and was severely affected at that time. I’m scared to have to stay alone and miss out on the family I’ve always wanted. Who would want to be with me and stay during f.e. relapses or difficult times where I’m panicking a lot.\n\ntl;dr will I have to stay alone because of my difficulties I’m having (due to my mental illness) and would bring into a relationship?",
    "score": "5",
    "comments": "1"
  },
  {
    "postId": "t3_1j5byqh",
    "title": "i love my girlfriend",
    "content": "im just laying here in bed on my day off work listening to my girlfriend playing emo music from the early 2000s and singing extremely off key in the living room. i love her so much. ive never loved another person like this before. i have such terrible body dysmorphia/an eating disorder and she never fails to make me feel like such a stud too. we met on instagram in 2023 and have been together for around 2 years now. we were long distance until november 2024. we live together now and its so nice being able to go on errands with her and we had a nap today with our cat and rewatched Jurassic World. when i get off of work shes just there. after 20 years of being constantly traumatized its just a breath of fresh air. im so lucky to have her",
    "score": "118",
    "comments": "10"
  },
  {
    "postId": "t3_1j63n2g",
    "title": "I might have cancer again, and I'm not telling anyone but my doctor.",
    "content": "I had melanoma cancer in 2023 and I'm starting to notice some of the same symptoms. I'm making a doctors appointment to get it checked out but if it's positive again I'm not telling my family or friends. I've always been the rock so when I couldn't be everything fell apart, I've had to put so much energy in time in repairing my life because I tried to depend on my village and they let me down on every account. I would rather go through the worst experience of my life again alone then go through the disappointment they put me through again.",
    "score": "2",
    "comments": "1"
  },
  {
    "postId": "t3_1j6boe6",
    "title": "I meme and troll an NBA player and his fans because I'm jealous.",
    "content": "I have multiple troll accounts on different platforms and run various meme pages shitting on this NBA player. He plays on a rival team and everytime he plays my team he whoops our ass. Just seeing his face makes me seethe with rage.\n\nMy gf also thinks he's good looking and I saw that she follows him on social media. Fuck this dude, man. I'm gonna discredit his whole career and slander him with my dying breath.\n\nI love upsetting his fans. They get so triggered when I mock his goofy ass.\n\nHe's also a light skin so has pretty privilege so gets glazed like no tomorrow. Fuck dude.",
    "score": "0",
    "comments": "9"
  },
  {
    "postId": "t3_1j67ypz",
    "title": "I hate my husband",
    "content": "Well i dont hate HATE him. I still respect my husband. He provides a lot, roof over me and our son’s head, food on the table, water to drink.. yeah what am I complaining for right? I should always be grateful that im in this position, which i am. It’s just there are things that still bothers me, that ruins my mood, sucking the soul out of me little by little, draining my life day by day, inch by inch. Idk if im just a whiny wife, but here are some things that messes w my head everyday:\n\nHe NEVER puts his coffee mugs in the sink after he used them, there’s always hundreds of them outside where he smokes (i told him a million times to put it in the sink after he finish using it, i dont mind washing it, JUST PUT IT IN THE FUCKING SINK) but noopee, still compiling outside the house. Til this day, i let it be, there are still 4-5 mugs outside the house, not gonna touch it ever unless he brings it in. This is so sad for me, cus he knows i got a bad eczema on my hands, so everytime i wash BUTTLOADS of dishes, i have to wear gloves, wash the gloves, dry the gloves, also wash my hands bc rubber gloves makes me itchy a bit etcetc my main point is its hell and back on earth for me to do dishes, and he’s not considerate of that. We once had a big fight bc when we’re at our inlaws (his fam) he fucking WASHED HIS MUG??? Huh? Since when the fuck do u do that? So you care what your family says about you instead of caring about your eczema hands wife? Yea fuck you.\n\nhe rarely takes care of our son. I literally do everything. He only takes care of him if i told him to. Sometimes when i shower, i have to actually ask him ‘can you watch him for a bit’ he has this ugly smug face and said ‘k’ like um wtf? You’re supposed to b excited?? He’s your son??? You will b rarely seeing him cus you work offshore???? Get this, infront of his family, he acts so fatherly, playing with him, taking care of his diapers etc while me, if we’re actually home, IM DOING ALL THE FUCKING STUFF, not him. He literally does shit IF i tell him to. He’s never considerate of how tired i am 24/7. 90% of the time if I dont wanna see his smug face if i have to shower and no one is watching our son, i had to put our son in his crib and let him watch ms rachel on ipad, eventho it hurts me doing that cus im limiting his screen time. And what was my husband doing that time? PLAYING LEAGUE OF LEGENDS, and he’ll be like ‘sorry im in game, i cant quit’ well fuck you. And also get this, when i found out that im pregnant and i wanted to abort it (cus i know im not ready) he was the ONE who strongly insisted to keep it cus he said he cant wait to be a dad. Well step the fuck up bro\n\nidk if im wrong or just exaggerating but he prioritizes his family over me and my son. If there was a fire, he would save his 4 brothers and 5 sisters instead of his wife and son. He would go to the ends of the earth for them ( once he had to deliver something car oil at 6AM for his sister n her husband, 6AM??? Mf usually wakes up at 2pm ffs.\n\nhe has this obsession w fixing up old cars he would spend loads of money on it and w literally his blood, sweat, tears and his time. Yo i don’t mind mf got a hobby, i got a hobby too, that’s great for him, but wht abt when i need to shower???? Do i have to go outside to ask you to watch over our son again with your ugly smug face again?? to sum up he has 2 obsession, league of legends and his car. None of which you can bother him at all. My hobby is just gym. JUST GYM. FOR 1 HOUR. At which i can ONLY work out when my son takes his afternoon nap! I just want him to evenly schedule his hobby.. not to the point he doesn’t have time for his son or me. Do u think he listens? Nah. Everytime i told him this he’ll be like ‘this is the only time i can do this, while im working at sea i cant do this stuff’ im like HELLO? cars and games are forever?? Your wife and son could leave you or die anytime? wtf is his mindset mahn istg he’s still acts like a teenager. I literally feel like i have 2 sons as of this time.\n\nhis dirty clothes and socks. Need i say more? I feel like almost every wife experienced this.\n\nhe spills his coffee and chocolate milk every where in the kitchen but never wipes it. (I once saw the mf VACUUMS his family’s kitchen bc there was a spilled rice grains). Basically he’s really sloppy.\n\nThere are more but that’s the top of my head. Idk what I should do. Everytime i tell him whats been bothering me, we always have a huge fight and it always ends with (ok i promise i wont do it again) but he still does and its and endless cycle. I cant leave him bc I literally have no money to raise my son alone (AND my mom is getting old, so i have to take care of her too). So til now im just tolerating everything but it drains my energy so much but at the same time i put on a happy smile on my face for my son, i dont ever want my son to see depressed or angry.\n\nMind you, he used to b very sweet and thoughtful at the beginning of our dating life and marriage life. I thought he was the most amazing guy. I know he loves me and my son, but i dont think he loves me enough to change his ugly habits.",
    "score": "1",
    "comments": "24"
  },
  {
    "postId": "t3_1j67wme",
    "title": "I’m terrified to go wedding dress shopping",
    "content": "I’m marking this as positive because I’m so excited but also terrified. I’m on mobile so forgive any weird formatting.\n\nI’m 23, almost 24. I’m getting married march of 2026. Im scared of change and getting married and moving out of my parents house terrifies me. Dress shopping makes it so real. On top of that I want the tradition of him not seeing the dress. Because I’m working on weight loss and in the middle of a masters degree I have limited time to do everything I need to do so I’m starting early. I remember our first date. We met online and the first time he seen me he took a step back in awe of me. I can’t wait to see that on my wedding day. But that means I have to hide this dress from him for so long. How do I not show my best friend my wedding dress.",
    "score": "1",
    "comments": "1"
  },
  {
    "postId": "t3_1j63eh6",
    "title": "I feel stuck in this life of disappointment",
    "content": "damn i will definitely be embarassed about this in the future but anywaysi've always been a sensitive person, i always cared about others and made sure to make them feel good and happy. My middle school years weren't the best: i had to move out of my old house and i completely changed life by moving to a town 50 minutes far from my previous residence. You can imagine that I, an introverted and nerdy kid, wasn't able to make many friends, and so i got lonely. In fact i was known as the lonely kid, no one ever wanted to talk to me and sometimes even made fun of me (i discovered some years later that everyone talked behind my back during those years, and that was the reason no one even wanted to approach me). And so i spent three years of my life by myself: i spent my days alone, definitely years that i wouldn't want to live again. Once middle school ended, i was full of hope: that same summer i made some friends and had a lot of fun with them, and so i was positive about starting high school. And so, once my first year of school started i tried to me more extroverted and social (the outcome was awkard, i'm not good at being extroverted). Even tho i tried, the outcome wasn't positive. This time no one talked behind my back, but i had trouble making friends and so i became the lonely kid once again. I was depressed, spent my days listening to music and sleeping all day just to escape that feeling of void that was suffocating, swallowing me whole. I was ready to end it all, but i wasn't brave enough to even try, so i kept living my life and eventually things got better. I made new friends, i became more social and felt truly happy after years of suffering. I am happy about how i lived the rest of my teenage years, but that feeling never got away. I am now left with an overthinking mindset (idk if i can call it like that), which leads me to anxiety about all the friendships that i currently live: i can't be calm, because i sometimes think that everyone will sooner or later go against me and make me live the hell i went through one more time. I can't trust anyone, and this thing is making me mad, because come on, why am i so defensive? why can't i just live my life like the others, and not worry about this? i don't truly know why i wrote this, probably to feel better or to relate to someone here who perhaps lived my same experience. Anyways, i feel costantly feel this overwhelming sense of entrapment in my own life, i feel like my past will always follow me, no matter what i do. No matter how many new people i will meet, i will always have this anxiety that they will disappoint me, and life is so hard this way. I don't even know if someone will read this, i will probably only get some upvotes and my post will be forgotten in this sub",
    "score": "2",
    "comments": "1"
  },
  {
    "postId": "t3_1j67lmd",
    "title": "Feeling Like I Don’t Belong in My Own Culture",
    "content": "Growing up in a small town in England, I always felt like an outsider, even in my own family. I loved them, but I never truly felt like I belonged. When I moved to New Zealand at 16, I hoped things would change, but I found it even harder to make friends and felt even more misunderstood. That sense of not fitting in just followed me.\n\nOver time, I started wishing I had been born into a different culture—not because I think life would’ve been better, but because something just never clicked with my own. I’ve always found my culture awkward and uninteresting, but when I met my first South American friend, something felt right. The more people I connected with from Chile, Peru, Brazil, and Colombia, the more I felt at home.\n\nI know South America is incredibly diverse, and I don’t mean to generalize, but I can’t ignore the feeling. Maybe belonging isn’t about where you’re born, but where you feel understood.",
    "score": "0",
    "comments": "2"
  },
  {
    "postId": "t3_1j604wh",
    "title": "Everyone's dying on me",
    "content": "Over the past seven years, three of my friends have committed suicide and two have attempted.\n\nNow I am doing better but my partner is suicidal again and he says he can't just take a break from college and work to get some time off because he'll lose his student visa. I can't afford to put him through college, he can't live with us because my abusive brother wouldn't tolerate a man living with his little sister. His life is full of regrets. He had a fullride scholarship back in New York but due to a misdiagnosed SLAP lesion, they fucked up his shoulder during a surgery and his American degree is basically worthless here. All that work for nothing. I don't know how to cheer him up. I don't want to lose my best friend and first love.",
    "score": "3",
    "comments": "2"
  },
  {
    "postId": "t3_1j67irz",
    "title": "I feel like I can’t find love.",
    "content": "I (M21) am in my last semester of undergrad. So far in college career I’ve been on 0 dates, had 0 sex, and I also haven’t had my first kiss yet. Anytime a friend would ask how I was doing with girls I would say that I didn’t have time because I was taking 18 hours every semester. Partially, that was true. Depending on classes, it could be a particularly time-intensive thing. Though, I would try to get involved on campus whenever I could.\n\nI guess, long story short, all my friends have had this stuff fall into their laps. I don’t know why I haven’t been so lucky. I’m worried that I’m past the point where having no experience is fine, and now it’s leaning into “sad” territory. I think I’m decently attractive and funny, so I don’t know what my issue is.\n\nI am going to grad school VERY far from my whole support system and where I’m in undergrad. Im afraid the work load there will put me in a similar position to not be able to do anything.\n\nI don’t know, I guess I’m just throwing this out there.",
    "score": "1",
    "comments": "2"
  },
  {
    "postId": "t3_1j6ijya",
    "title": "I fucked a escort today, got scammed before the deed and also lost complete interest in sex",
    "content": "I called a escort in desperation and realised sex is not for me, I will watch porn and continue my life and a independent man. She abused me verbally as well as she was not happy with what I was doing. I lost interest in my ex and also any girl ever. I will continue my path towards spirituality.\n\nI am thankful for the decision I took for the betterment of my life. Thankful to the whore, thankful to the scam, thankful of the universe to have money to experience this event.\n\nI am a God. Like everyone else.",
    "score": "0",
    "comments": "14"
  },
  {
    "postId": "t3_1j674ys",
    "title": "The past few weeks have shown me that life will continue without me.",
    "content": "Specifically, that my animals will be OK. One dog will go to my parents'. One will go to my friends who are obsessed with her breed (and if they find her another home, awesome). My bird will either go to the local zoo or the house down the street. My cat can literally go anywhere. I am not needed.\n\nI promised my therapist I would reach out if I was planning anything. I lied. The gun in the house is gone but I still have the ability to purchase one amy day I'd like.\n\nWork doesn't need me. We all know we are expendable at our jobs, but it's been hard for me to accept. But there's no other way to reconcile the fact that I've been at my job longer than two employees who have become managers and yet I'm nothing.\n\nI'm useless. I'm dispensable. I'm nothing.\n\nI'm about done.",
    "score": "0",
    "comments": "1"
  },
  {
    "postId": "t3_1j4r8qt",
    "title": "My Gf has been sending “Fit checks” lately randomly",
    "content": "This past week when I have been at work. I got a random picture of her in an almost “T-pose” position and it’s titled “Fit Check”. I just think it’s so funny and adorable. It was just her wearing sweats and a T-shirt or something but it made me laugh and genuinely improved my day.\n\nI love this girl!",
    "score": "2112",
    "comments": "48"
  },
  {
    "postId": "t3_1j66ms7",
    "title": "My friend has a new boyfriend and I hate it",
    "content": "I know it probably sounds like I’m in love with this friend but I’m not. I’m married and happy. But this boyfriend is an ex friend and ex boyfriend of mine and I was really close to them. They were my first friend in my new highschool where I didn’t know anyone. One day a couple years ago they texted me saying all this mean stuff and telling me that we weren’t friends anymore. They also didn’t tell me what I did.\n\nIt hurt so bad for years, and I’m just now getting over it and I was doing good until I saw my friend posting about their new boyfriend and seeing my ex’s face just hit me.\n\nEven after we had broken up we were great friends and hung out almost every day until that text.\n\nA really big part of me wants to stop being friends with the current friend, or at least keep my distance until I feel like I’m ready. I don’t know what I’m going to do. Honestly I might just block them after sending an explanation. I’m a bad person after all so they probably shouldn’t be friends with me.\n\nSomeone please help",
    "score": "0",
    "comments": "2"
  },
  {
    "postId": "t3_1j61ohl",
    "title": "My sister’s life is ruined ig?",
    "content": "TW: drug abuse\n\nSo, I don’t know how to start. My sister has/had a long-term relationship and I even considered him my brother because he was like that with me. They even have a child together. It all started last year when my bil asked my father for 400€  but not to tell my sister and he would pay it back as soon as he got paid. To this day he never payed back and he lost my father’s respect because of this. We suspected that he may be doing drugs but we kinda hoped he wouldn’t do something like this because he loves his child to the moon. There were few incidents where he acted off… we never interpreted much into this and just hoped everything would be okay. He works in a field where the future is the secured and a few weeks back he told us that he and his other colleagues were laid off but they would all receive loan payments till the contract ends. Idk it came with a surprise and I had a thought that maybe he was the only person that got laid off. I asked my bf about it because his father works in the same company but in a different department. He said he didn’t know anything about this. Well, wednesday was the incident that ruined my sister’s life. We don’t know what happened exactly but my sister has ended the relationship for good and threw him out because she found drugs. She told our mom that he had a history with drugs a long time ago but he swore it would never happen again. Since yesterday he is supposedly in rehab. I don’t how to talk to my sister about this and I don’t know what to think myself. He was like a brother and I always defended him to everyone. I am scared what will happen in the future, I mean what if he collapses again? Right now my sister is a single mom who works full time with only a half day daycare. I don’t know whether my bil was under influence when he was watching my nibling. There were times where he was alone with my nibling for two weeks. Was he driving under influence? And was my nibling with him? For how long was the abuse? Will my sister recover from all this? Was he thinking about what his abuse will do to my sister and nibling? Was he even thinking?\n\nThere is only so much hurt that a person can endure and my sister had enough in her life. My mind all over the place and I have so much questions I would like to ask but I know that I can’t get an answer. I would like to tell my bil how disappointed I am but I know that this would not help his rehab. My mind is all over the place and my heart is hurting and I can’t talk to anyone expect my mother but she feels the same way expect that her heart hurts more because this is her daughter. I don’t know what to do right now. I don’t know what to think. I don’t know what to feel. I don’t know how to help my sister.\n\nI had to get this off my chest, thanks for reading",
    "score": "2",
    "comments": "0"
  },
  {
    "postId": "t3_1j61gar",
    "title": "Is there a right way to tell my Christian brother about my sexuality?",
    "content": "Hi, this is my first time writing here, so I hope it makes sense. I am a 21 year old female, living in a generational Christian family. Being told your entire that married and have kids is something I have to do, and that if I don’t now I will someday. So when I found at the age of 14 that I am Asexual and just a couple years after Bisexual. I kinda felt relived but also terrified. I have only told my cousin and she was very accepting of me and we tell each our problems all the time. I have been debating on telling my brother about my sexuality for a couple years. Just the two of us are going on trip, this can either going to ruin our whole trip or strengthen our bond. The biggest problem is that I am worried he will think I am too young to talk about these topics and he’ll say I can change, either when I am older, or when I find the “right” person. All that to say that I love my brother, but knowing his biblical stance on sexuality has made this very difficult for me to say anything. Anyways thanks for reading my rambling, I haven’t 100% decided to tell my brother but I hope to soon.",
    "score": "2",
    "comments": "1"
  },
  {
    "postId": "t3_1j5rrfg",
    "title": "I don't want to go home",
    "content": "I'm almost off of work and I just don't want to go home. It's so fucking overwhelmingly noisy there almost daily. I fucking hope that dump burns down one day. I'm so tired.",
    "score": "6",
    "comments": "6"
  },
  {
    "postId": "t3_1j660wr",
    "title": "Experienced my first obvious racism and I don't know how to feel",
    "content": "Was in the bus with my daughter today, so next to me is 2 white girls and the seat before me is an Asian boy. So one of the girls made a monkey noise and the Asian boy proceeds to say why would u make a monkey noise when there is 2 monkeys sitting next to you. You would think this is where I went off on them but I was too stunned to speak I couldn't say anything. It's so sad that in 2025 we still have to be going through stuff like this",
    "score": "0",
    "comments": "0"
  },
  {
    "postId": "t3_1j5v8s2",
    "title": "my grandfather passed away and all i feel is guilt",
    "content": "my father was abusive towards me with my earliest memory being him breaking my arm. it all went to court after he tried to strangle me to death when i was 8 yers old. i cut his whole side of the family off and my decision was consolidated when they sided with him and when i was 9 years old, despite making it clear i didn’t want to see them, my grandmother ran up to me and refused to get go of me while my grandfather watched. i felt betrayed by both my grandparents and had not spoken to either of them since. im 17 currently. december i found out my grandfather had terminal stomach cancer and i sat there wondering if i should make contact before it was too late. he had not done anything to me but he was complicit. i carried on as normal until last night i sat there deciding that i was going to write to him after school. the news came in at 11am, he had died. months of back and forth on whether or not to do it and he died. theres no chance of rekindling because he’s not here anymore. all i can do is sit here and wonder what life would have been like if i didn’t make the decision i did 9 years ago and i feel that will haunt me forever. i feel like such a shitty person.",
    "score": "4",
    "comments": "3"
  },
  {
    "postId": "t3_1j60x34",
    "title": "I have a crush on my friend, but he’s still in love with his ex",
    "content": "A while ago, I had a friend who I think might have liked me, but I never acted on it. Back then, I wasn’t sure how I felt, so I didn’t say anything. Later, he got into a relationship, and we stopped talking. Now, they’ve broken up, and we’ve reconnected—but in the process, I’ve realized I have feelings for him.\n\nThe problem is, he’s still completely in love with his ex and desperately wants her back. Recently, she reached out to him, and I’m scared they’ll get back together. It hurts because I can’t stop thinking that if I had spoken up back then, things might have been different.\n\nNow I don’t know what to do. Should I tell him how I feel or just accept that I missed my chance? Has anyone else been in this situation? How did you move on?",
    "score": "2",
    "comments": "0"
  },
  {
    "postId": "t3_1j65b2d",
    "title": "I’m being sued for something I didn’t do",
    "content": "Hi I’m 24F & back in July 2024 I was at a stop light when a guy got out of his car & started yelling at me because I was too close to his car so I rolled my window up and that’s when he got even more mad and tried to get his hands in the window before it closed but luckily it closed on time so he just banged my window. I didn’t say a word to him and just kept on driving but that’s when he reversed into my car and hit me. I called the cops and they said it was my fault because based on the damages it looks like I hit him and it was a he said she said situation. Fast forward I just found out I’m being sued today by him. Idk what to do. I’m also in nursing school & im scared I’m gonna get kicked out.",
    "score": "1",
    "comments": "2"
  },
  {
    "postId": "t3_1j6595g",
    "title": "How my step moms been treating me",
    "content": "So basically she’s just been up my ass for the past couple months and I’m getting sick of it. She’s lied to my mom about me, completely ignores me and clearly favors my brother over me. I literally can not handle it anymore. I don’t even like being in the same room as her because she brings down my mood. All her and my mom do is fight and it’s too much, all my mom does is complain and say she’s gonna kick her out but she never freaking does. I’ve had a rocky relationship with my mom but it’s getting better but my step mom makes me literally want to move out. She complains when I do literally anything or if I go anywhere. Like a couple hours ago I used some nail clippers and a nail file to do my nails and I used hers (mind you she uses my shit all the freaking time) and me and my family used to Sharing stuff If someone needs it and she texted me while I’m at work bitching at me telling me not to use her shit and she’s sick of me. I told her sorry and she just kept going demanding that the minute I get home I gotta give them to her (which I already planned to before but I had to leave for work) I’m literally a minor and I work two jobs and she’s always on my back calling me lazy and spoiled. She loves to compare her childhood to mine (she didn’t have the best childhood) she told me I’d never make it if I went through what she went through, mind you I’ve been through abuse and assault ontop of that depression and anxiety. I literally just want her to get off my back, any advice or help? (Sorry if there’s spelling or anything I’m at work writing this)",
    "score": "1",
    "comments": "0"
  },
  {
    "postId": "t3_1j5wepk",
    "title": "Out of nowhere, I met this really gorgeous girl, and now I'm over here second-guessing everything-like, am I even doing this right?",
    "content": "Hey everyone, to whoever’s reading this story. I’d love to hear your thoughts on it. I guess I should start with a little backstory.\n\nAround early autumn last year, I was walking through one of the neighborhoods in my city. It was my last day at work, and after finishing up, I decided to take a stroll, grab something to eat, and soak in the last warm, sunny days. I found a nearby bench, sat down, popped in my earphones, and just listened to music as I made my way to a café.\n\nAt some point, I noticed a girl who looked really upset.\n\nI hesitated for a moment but then decided to go up to her and see if she was okay. Turns out, she’d had a really rough day. We ended up walking together, exchanging contacts, and chatting later on when we had time.\n\nOur first few meetups were easygoing and fun. We talked, got to know each other, and with every meeting, we started growing closer. After about a month, I started visiting her place after the gym to unwind a little.\n\nAnd then, at some point, things between us started feeling like more than just friendship. There was this warmth, this physical closeness that I’d been missing (even though I had plenty of friends, I was single at the time).\n\nShe’s absolutely gorgeous—like, the kind of girl who turns heads wherever she goes. She’s tall (about 185 cm), has an amazing figure, a beautiful face, and these deep brown eyes that just pull you in. She’s got a great body, though that’s far from the only thing I like about her. She’s also a few years older than me.\n\nThen, about three weeks later, after lots of time spent together and some really great conversations, I went over to her place again, this time bringing flowers to surprise her.\n\nI rang the doorbell, and when she opened the door… my jaw literally dropped.\n\nThere she was, standing in front of me in red silk shorts and a top, looking absolutely breathtaking. I just stood there, speechless, until she pulled me inside, wrapped her arms around me, and kissed me.\n\nWe headed to the kitchen, where she was cooking some meat for dinner—something she knew I liked, even though I’d never actually told her. That moment just hit differently. It was like she knew me better than I knew myself. That was when I realized—this girl had completely stolen my heart.\n\nLater, she even got me a pair of shorts and an T-shirt so I’ve have something to wear around her place.\n\nI changed, sat down with her on the couch, and we put on some YouTube. Before long, we were cuddling, and yeah—that was when we kissed. The whole evening was just perfect.\n\nAnd now, every day, I catch myself wondering: am I doing the right thing? Because I honestly love spending time with this girl.\n\nI could really use your advice.",
    "score": "3",
    "comments": "4"
  },
  {
    "postId": "t3_1j64ucy",
    "title": "The Animation industry is making me think dark thoughts.",
    "content": "Hello. I’m posting this on here because anywhere else I could be found out.\n\nI’m a recent graduate who studied animation. I want to be a character animator working with studios or even just contract/ freelance work.\n\nBut nobody is hiring juniors or graduates. I aced my grades. I’ve been given compliments on my reel. I have connections. I did some experience only to be ghosted.\n\nLinkedIn and indeed are only posting Senior, Lead, or Principal positions, even if it’s a mid position they won’t hear back from you. Even when I reached out to people they said they liked my work but weren’t hiring. In 2023-24 I reached out to over 115 places. From 2023 to now I have a spreadsheet and I’m on application 724.\n\nAxis Studios shut down, Technicolor and its subsidiaries shut down so now there’s an even bigger pool.\n\nI feel hopeless. I feel empty. People telling me that AI will take over me too, there’s nothing anymore. All I’ve ever seen myself as is an animator and if I can’t be that I don’t see myself doing anything else and I can’t fathom doing anything else that it’s making me think horrible things. That if I can’t get a job or if I’m stuck and the industry fails and I have to switch I’ll be at square one and I just can’t.\n\nWhat can I do. I’m so scared and hopeless.",
    "score": "0",
    "comments": "0"
  },
  {
    "postId": "t3_1j5zwvd",
    "title": "I just want my mom",
    "content": "My mom died when I was 25 in 2014 my dad shortly after in 2017... I never got to ask advice about my kids or life.  I never had my father walk me down the isle. I never even had the chance to see them with gray hair. I guess depression is just hitting me really hard today. I remember when my dad died that one single moment where you realize that you will never see either of your parents again in this lifetime. I know it sounds stupid but I could literally feel pieces of my heart breaking off. I guess I just want to know what yall do when you're feeling down and depressed. Besides smoking and drinking cause obviously that doesnt help.... I am so jealous that so many people that are way older than me still have BOTH or atleast one parent. If any of you feel this way then I am sorry.",
    "score": "2",
    "comments": "2"
  },
  {
    "postId": "t3_1j64e6n",
    "title": "I hate living with my parents so much",
    "content": "I moved back home recently after graduating from college and living with my parents again has made me cry more than I did during my four years at college. I found out today that my mom opened an enveloped addressed to me and read mail intended for me that included a lot of personal information. She left the letter in her room for at least three days without even telling me I had any mail, and only mentioned it today. She's also been using the personal info in that letter to make fun of me.\n\nYeah, I'm lucky to have parents that will welcome me home and that feed me. They're not bad parents. But living with them genuinely makes me want to die.",
    "score": "1",
    "comments": "4"
  },
  {
    "postId": "t3_1j5sthk",
    "title": "Why do I lie all the time?",
    "content": "I always lie, I can recognize that I'm a compulsive liar. I lie about small or big things. I always feel horrible after and I just want to become better person. How do I change?",
    "score": "4",
    "comments": "4"
  },
  {
    "postId": "t3_1j648yo",
    "title": "Who am I?",
    "content": "Can someone explain my situation?\n\nI don’t know who I am. Am I from this country? I don’t feel like I belong.\n\nI don’t feel like a woman or a man. Sometimes I feel like a child, sometimes a man, sometimes a teenage girl, sometimes a mother, sometimes a woman.\n\nI don’t know, but I feel frighteningly different from my family and the traditions of my country.\n\nEven the religion of my country—I’m not fully convinced by it.\n\nAm I religious or not?\n\nWhy do I always drift off and listen to songs in different languages but never in my native tongue?\n\nWhy do I always feel like I’m living in a parallel world? Why don’t I feel like I belong to this earth?\n\nWhy am I always alone, and why do I love escaping reality?\n\nAs I write this, I remember my childhood. At first, I pity that little girl, but in the end, I don’t want to sympathize with this woman—not because I’m not proud of myself, but because… why am I not brave enough to discover who I am?\n\nWhy do I feel like my personality isn’t real?\n\nIs it because of my environment, society, or because I don’t belong to this country and this religion?\n\nWho am I?",
    "score": "0",
    "comments": "0"
  },
  {
    "postId": "t3_1j5owrb",
    "title": "i can't stand people coming over to my place but i don't mind visiting them at theirs",
    "content": "title. i'm extremely introverted and my social battery runs out very quickly, but that being said, i'm definitely not antisocial. i have three close friends that i love dearly and i don't usually struggle with making new connections. however, i always make up excuses to not let people come over (especially when it's a one on one hangout) because i feel like at some point i'm just too tired to hang out in contrary to them and i just have to wait for them to decide to leave. it makes me feel horrible to essentially kick my friends out so i don't do it, but after a couple hours i'm pretty much done socialising and switch to survival mode. when it's me who comes over to other people, i can just leave at any given moment when i feel uncomfortable.\n\ndoes anyone else struggle with this? i just treasure the tiny piece of space that i have too much to let people into it even if they're my friends, but never allowing people to come over probably makes me seem like a weirdo. if i were to tell my friends why i always insist on visiting them instead of vice versa, they'd probably get offended that i get tired of their company at all.",
    "score": "6",
    "comments": "1"
  },
  {
    "postId": "t3_1j5l09y",
    "title": "15 Years in Canada—Now I'm Jobless, Broke & Out of Options",
    "content": "After spending 15 years building a life here, I never imagined I would end up with nothing, forced to start over from zero again. I have updated this post to clarify a few things based on feedback.\n\nI take full responsibility for my situation. I made many mistakes along the way, whether it was not staying on top of deadlines, assuming I had more time than I did, or not making the best choices. I have struggled with severe ADHD my entire life, and since I choose to manage it without medication, I often leave things until the last minute. That habit has hurt me in more ways than I can count, and this situation is no exception.\n\nAt the same time, the immigration system has changed significantly over the years, making it much harder for someone in my position to qualify. In the end, it was a mix of bad timing, personal missteps, and an immigration system that has only grown tougher for people like me.\n\nI moved to Canada as an international student a little over 15 years ago. I started from nothing, learning English from scratch, completing my academic English education, and then going to university and college. I worked multiple jobs as a developer while paying my taxes and contributing to the country I wanted to call home.\n\nDespite all that, I lost everything when my work permit expired a few months ago. I did not qualify for enough points under the ever-changing immigration system, so as soon as my permit expired, my job was gone. Because my work permit expired, I was not eligible for unemployment benefits, had no options, just the expectation to pack up and leave like I never existed.\n\nThe worst part is that this is not just about money or survival. I genuinely loved my job. I had amazing coworkers, a great team, and what I believed to be the perfect job in the perfect country. I was lucky enough to have made meaningful contributions and had so much more to offer as a 32-year-old with a bright future ahead of me. That is why I have so many regrets about how things turned out, and I know they will stay with me for a lifetime. I would give anything to go back and keep doing what I love. But because I wanted to do things the right way, legally and honorably, there just do not seem to be any options left.\n\nLosing my job did not just mean losing income. It meant losing my ability to stay afloat in the country I call home. Even when I had a good income, I was living paycheck to paycheck, covering expenses for two people. A large portion of my money went toward taxes, rent, and paying off debts that piled up after I lost my previous job during the pandemic. Now, with no work permit, not even under-the-table cash jobs would be enough to cover my expenses, and those would not be legal for me anyway.\n\nOver the years, Canada’s immigration system has become increasingly strict. The requirements kept changing, the point thresholds kept rising, and options like employer-specific work permits, which could have been a lifeline for people like me, were removed in Ontario. By the time I finally became eligible or was just about to, things had already shifted again. I know people who moved to other provinces because obtaining permanent residency was easier there, but even that became riskier when some pathways suddenly disappeared.\n\nGoing back to Turkey is not just about starting over. It is a nightmare waiting to happen. My brother and I are both considered army escapees, which means we would be forced into mandatory military service soon after arriving. The Turkish army is notorious for its brutal conditions. As ethical vegans and atheists, we would be in an impossible position. The army does not accommodate veganism, and being openly atheist is frowned upon both socially and institutionally. I know our time there would be unbearable in every way.\n\nThe system does not account for people like me, those who have given everything to this country, only to be left with no way to stay.\n\nIs this how the system treats people who dedicate their youth, education, and labor to this country?\n\nI do not want to sound ungrateful. I have always loved this country, and I still do. I love its people, and I consider Toronto my real home. Leaving would feel like losing a part of myself forever. But after all these years, not having a viable pathway to stay just does not feel fair to me.\n\nAfter more than two days without sleep, with stress piling up and rent due while I have no income, my mind is all over the place while writing this.\n\nI also recorded myself talking about all of this for about half an hour right before writing this, crying the whole time. It felt like therapy in a way, just letting it all out. Now, writing this feels like another form of that release.\n\nI do not know what comes next, but I needed to get this off my chest. If nothing else, I hope sharing my story highlights how the system fails people who follow all the rules and still end up with nothing. I truly hope it will somehow help future people like me.\n\nThank you for reading. I truly appreciate anyone who takes the time to respond with feedback, suggestions, or criticism.",
    "score": "10",
    "comments": "50"
  }
]