[
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 07:50:27 UTC",
    "id": "1j3y0s7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 2,
    "secure_media": null,
    "selftext": " I (18M) don't know what to do with myself. I know I shouldn't worry because I'm young and \"I still have a lot of time\" because whenever I post something similar on this app people tell me this. But I'm seriously starting to get worried. No one looks my way at all and everytime someone does, they get bored and ghost me. I think maybe I should stop looking and I'll find someone who is interested in me at all. The worst part is I'm not even looking for a long term relationship, I just want to have fun and I keep getting burned. I wish someone would atleast say something mesn to me because that would be someone saying anything to me. I'm so isolated and bored.",
    "subreddit": "TrueOffMyChest",
    "title": "I don't think I'm anyone's type",
    "upvote_ratio": 0.63,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3y0s7/i_dont_think_im_anyones_type/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 07:06:10 UTC",
    "id": "1j3xfr3",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 4,
    "secure_media": null,
    "selftext": "I was really good at studies until my 6th standard. I studied at a really good school near my mother’s house. But then I had to move to my real home with my father, mother, and brother. I joined a new school, and everything changed. I struggled to keep up with the new environment, and my schooling started falling apart. I became depressed.\n\nSomehow, I managed to pass my 10th through NIOS open school. Then I joined a government school for my 11th, but I fell into the wrong friendships. That led to me being sent off from school.\n\nHere comes the plot twist...\n\nAfter that, I was just sitting idle at home while my brother was doing his BTech in Biomedical Engineering from a well-known government college. My father had passed away by then, and I started feeling like a burden to my mother. I wanted to help her financially, so I started looking for jobs.\n\nFor two years, I worked multiple jobs—petrol pump operator, hospital attender, security guard—just trying to earn something.\n\nThen, in November 2019, after quitting my exhausting job as a hospital attender at the age of 19, I joined Delhivery as a courier delivery person. The job was insanely tough—at least 30 deliveries per day for a salary of ₹8,000 per month. I lasted two weeks before quitting and joining Swiggy as a delivery rider.\n\nSwiggy was fun at first. I was earning daily, spending recklessly on food and cigarettes, just living in the moment without thinking about the future.\n\nThen, two weeks later, everything changed.\n\nOne late night, around 11 PM, on my way back home, I met with a horrific accident. A truck carrying a full load of wood logs crashed into my bike.\n\nThat moment destroyed my life and shattered my mother’s hopes.\n\nI was bedridden for 4 years. My injuries were severe—multiple fractures, permanent damage to my hip and leg. The hospital treatment was not good enough, and recovery was extremely difficult.\n\nBut I didn’t give up.\n\nAfter years of suffering, I finally started walking again. And now, I’ve joined BCA online at Manipal University Jaipur to build a better future for myself. I’m learning to code, and I want to use this opportunity to change my life.\n\nI don’t know where this journey will take me, but I’m not giving up.\n\nThanks for reading. I just wanted to share my story.",
    "subreddit": "TrueOffMyChest",
    "title": "I lost everything, but I’m trying to rebuild my life",
    "upvote_ratio": 0.84,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3xfr3/i_lost_everything_but_im_trying_to_rebuild_my_life/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 06:47:15 UTC",
    "id": "1j3x5sb",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 0,
    "secure_media": null,
    "selftext": "I love my baby and I am so excited to meet them, but I’ve been miserable my entire pregnancy. I’ve been sick nonstop and I am exhausted and I want this to be over. I’m in the third trimester and nearing the end anyways, but the thought of waiting even one more month is making me so depressed. I just want to not be pregnant anymore, I don’t want to wait 7 more weeks. I’m drowning. ",
    "subreddit": "TrueOffMyChest",
    "title": "I want to induce preterm labor on purpose",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3x5sb/i_want_to_induce_preterm_labor_on_purpose/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 06:45:29 UTC",
    "id": "1j3x4w1",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 3,
    "secure_media": null,
    "selftext": "Edit: i forgot the obligatory Click meniton  \nI (16M) have a mother who loves birds, especially cockateils, she has three in total, until about 2 months ago. two of them ended up getting a little too close and WHAM. babies. Now my mother is overall not very good at parenting, she messed up me and my sister pretty bad. But when it comes to her pets she at least acts like she loves them.\n\nNow when these babies hatched, two survived, and they were looking really nice and healthy, that was until a couple weeks ago. my mother was starting to get annoyed at their constant screaming (you know... as babies do) and decided that they were eating enough seed, it wouldnt matter if they were seperated or not from their parents (they were still being fed by their mother and father occasionally throughout the day). so cue her forcibly taking them, cramming them into a small cage, and not letting them see their parents anymore so they \"wouldnt scream again\".\n\ni was going to say something, but due to being too scared to say anything (if anyone disagrees with her on something big, she gets explosive) i kept my mouth shut. i mainly helped her with them when we had to hand feed them when they were infants, so i wasnt as worried as checking on them as i should have been, becuase i thought she could handle it. aparently i was wrong, she cant, and her decision to seperate them ended up being fatal for the youngest. in heindsight i think he was stressed from being seperated from his mom so suddenly, and so he stopped eating. according to my mom, he haddent really been eating too much over the past two weeks or so (ie, since she seperated them). i could be wrong though. (i have some experience with birds and i at least do my reserch.)\n\nthe youngest couldnt stand up. just trying to walk resulted in him just stumbling and falling over. i asked my mom why dont we take them to an avian vet, to see if something was wrong, and her words were \"i dont want to deal with some sick bird, its too stressful. if they die they die. and plus the vet bill will probably be 200 dollars and i dont want to spend that much\" so cue me flabbergasted, i try and hand feed the bird, at least a little bit. and it works, he's eating some, and putting him on his mother's cage floor, and hes slowly eating some seeds. im estatic, and i think, \"oh, ill check up on him in an hour.\"\n\ncue me falling asleep for a few hours instead, and  i wake up to check on him, and he's already passed away. i tell her, and what does she say? \"oh well, i'll bury him tomorrow put him in a plastic bag until then\" (not really relevent, she buried all our previous pets in plastic ziplock bags and such so thats going to be a nice supprise for the next owner. i recommended that she stop doing that but she still does anyway)\n\ni cant belive im related to her, how can one person be so heartless. she loves all her pets until they get sick, then theyre just another burden to her, talk about unconditinal. and worst thing is, i bet she wont even listen and pretend like it died from some illness. again, it could have been something else but im pretty confident she killed it.\n\ntldr: my mom shouldnt have birds, and especially never should have tried to hatch and raise baby cockateils if she really gets annoyed that easily. birds will be noisey (i know from experience).",
    "subreddit": "TrueOffMyChest",
    "title": "My (abusive) mother tried to raise baby birds, it did not go well.",
    "upvote_ratio": 0.81,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3x4w1/my_abusive_mother_tried_to_raise_baby_birds_it/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 06:39:47 UTC",
    "id": "1j3x1yo",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "TW: mentions of SA\n\nto make a long story short, i (F19) started talking to this guy we’ll call Jesse.\n\nanyways the first time i hung out with him, i told my mom i was out with a different friend and not a boy. the same night i told her the truth because i had a little bit of a guilty conscience, and if i told her the truth i wouldn’t have to lie in the future. \n\nso, i told her the truth and she always gets defensive when it comes to me and my relationships and i genuinely don’t think she trusts me. she started telling me that there’s no such thing as boyfriend and girlfriend in the bible and that if i wanted to date him i wasn’t even allowed to kiss him. does this not sound weird and irrational??\n\nthen she proceeded to try to scare me out of being in a relationship with him by saying things like “do you want what happened to your sister to happen to you? do you want what happened to me to happen to you?”\nfor context my sister was SA’ed but not by her boyfriend. my mom was also SA’ed but not by her boyfriend either as far as i know. \n\nout of all of her kids i’ve never really done anything bad. i don’t drink, smoke, party, do drugs etc. i fully understand that i lied to her abt where i was going but that was really the only “big” lie i’ve over told. she even accused me of stealing 20 dollars from her the other day. \n\ni understand im her youngest child and she wants me to be safe, however she’s gonna need to let me off this leash eventually. my whole life she has been super overly protective and it’s only when it comes to relationships where she jumps to conclusions and thinks im trying to buss it down and buss it open😭 i also told her she doesn’t need to worry about this because im not ready for this step even in the slightest and Jesse would never do anything i wasn’t comfortable with. \n\ni also want to say that i’ve only been in one other serious relationship and it was long distance. \n\ni guess im just hurt that my mom doesn’t believe me anymore for nothing. today, i asked to borrow her car because she doesn’t use it since she doesn’t work and she has a full tank. i’m a mobile dance instructor so my gas has been depleting fast. my job requires a TB screening and the closest location to me is abt 30 minutes away so on friday i got the start but i needed to come back 48 hours later. so i ask my mom to use her car and she asking me all these questions \n\nher: when\nme: 7:20pm\nher: when\nme: today\nher: where\nme: *location*\nher: where\nme: i just said the location why are you asking me where again?? a clinic??\nher: interesting\n\nat that point i gave up and told her id take my own car even tho it doesn’t have gas in it. she tried to tell me to go tmr before work, but i told her im not waking up earlier than i need to because she doesn’t trust me. \n\ni told her that now she knows abt Jesse i don’t have a reason to lie so idk what’s up with her. when it comes to me specifically in relationships my mom goes berserk but all my other siblings didn’t have to deal with her mouth. but yea that’s all i have to say im just sad. \n",
    "subreddit": "TrueOffMyChest",
    "title": "my mom doesn’t trust me",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3x1yo/my_mom_doesnt_trust_me/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 05:55:33 UTC",
    "id": "1j3wdom",
    "link_flair_text": "Positive",
    "media": null,
    "num_comments": 1,
    "score": 4,
    "secure_media": null,
    "selftext": "My boyfriend of a little under a year is taking me fishing tomorrow because we don't need to be at school due to underclassmen tests we don't have to participate in and I'm so excited. Im not particularly into fishing or anything related to it but he's so cute and so excited that I got my fishing license (literally ten dollars and 5 minutes of my time) so I can come with him cause he's been wanting to go fishing for ages. \n\nHe's obsessed with anything related to fish— he has three fish tanks and wants to work at the tropical fish store and watches videos of people making fishing lures for fun and I love him so much. When we started dating we had basically nothing in common and didn't know each other very well but we've both been trying so hard to find things we both like to do and like to do together and idk I'm just so so so so happy and excited and he's picking me up at 5 in the morning so I can \"skip school\" (I have a 4.4 GPA and it's a non-academic day but that's as rebellious as I get usually) and go fishing and idk I'm so excited to see him I love him so much",
    "subreddit": "TrueOffMyChest",
    "title": "I have never been more excited to go fishing in my life",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3wdom/i_have_never_been_more_excited_to_go_fishing_in/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 05:39:07 UTC",
    "id": "1j3w43u",
    "link_flair_text": null,
    "media": null,
    "num_comments": 16,
    "score": 1,
    "secure_media": null,
    "selftext": "Hey, so, it's really hard for me to come on here and say this. First of all, I know I'm 100% to blame for everything. And, I'm contemplating whether I should leave my boyfriend. Not for me, I don't want to leave him and I think that would hurt so bad. But for him. I feel he deserves so much better.\n\nYou can be blunt with me and tell me what a horrible person I am, I'm not going to be defensive about that. That's what I think of myself right now too.\n\nSo, me 18F and my boyfriend 23M have been dating for almost 11 months now. I love him, so much. I feel pathetic typing this because I know what I'm about to say after all of this will be quite alarming. But he truly is the most amazing, smart, funny, sweet and handsome guy ever. We have many fun times together. However, me myself, I struggle a lot mentally. It's taken me months on a waiting list to finally get into see a psychologist. \n\nBecause I struggle quite a lot with my sense of self and insecurities/suicidal thoughts, I fear that I have brought these things into the relationship. When i first started dating him, I thought I was doing okay. But I realised that my perspective on life, my emotions and everything is so turbulent that it can change quite fast. It's just lately, it's been very bad.\n\nI get mad and upset. You might think that's normal, and, well that itself is however...I've hurt my boyfriend so much by being depressed. I know I'm very toxic to be with right now. I almost jumped out of his car to commit suicide the other day. He is very shaken up and I feel bad because after that all happened. I realise \"holy fuck I just traumatised him, what have I done, I'm an absolute monster.\" I feel like a monster. He loves me a lot and cares a lot. After that all happened, I was at his house crying. He said we should break up temporarily. But hearing that just crushed me and I felt more suicidal and I was begging him to not leave me. I am utterly terrified of him leaving me. I got so upset that, I hit him. 3 times. On the shoulder. I then started crying even more and apologising profusely. However this is the second time something like that has happened. It's like, whenever I'm upset I just loose it. \n\nI am filled with so much guilt. He forgave me. But that doesn't stop the guilt. I know he deserves so much better. I don't feel like I should be with him because I don't want to hurt him more. I love him beyond words can describe and I'm also so scared of him not being apart of my life. I feel so stuck. \n\nI accept full accountability. I know I'm wrong. I know my actions were disgusting. I want to be better. I'm just so scared. I don't think I've stopped crying since I tried to jump out of his car and I hit him. He says he'd still rather be with me than anyone else. I feel so bad, I'm a monster.\n\nI just don't know what he sees in me and it kills me to think about but I feel like he could be so much happier with a girl who isn't a liability like me. :(\n\nI'm really trying to be a better person for him and go to therapy because I don't want to loose him but I'm so conflicted as well because would loosing me make him happier??\n\nI know that all of this sounds awful. I just thought I should post this on a private account to feel more shame. If I could give him the world, I would. :(",
    "subreddit": "TrueOffMyChest",
    "title": "I keep hurting my boyfriend.",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3w43u/i_keep_hurting_my_boyfriend/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 05:07:23 UTC",
    "id": "1j3vkv1",
    "link_flair_text": "Positive",
    "media": null,
    "num_comments": 3,
    "score": 31,
    "secure_media": null,
    "selftext": "  My boyfriend and I both speak English. But I honestly find other languages just so beautiful. Pronunciation and phonetics is what makes other languages so gorgeous to me.\n\n  Originally I started learning for the hell of it. But when I was practicing with my bf a few times he really seemed to like hearing me speak French, so my goal has shifted.\n\n  I’m now learning it so I can flirt with him. Originally it was just because I found the phonetics of French very nice but honestly, seeing my boyfriend smile and blush when I call him pet names is so much better. I’m by no means even relatively fluent in the language but I’ll get there.\n\n  I just need to find a better language learning app that is free, but anything for my boyfriend. He is my love after all.\n\n  I am also learning because god damn what I would give to be able to visit France for some good cheese. But my priority lies with my boyfriend. He knows, I just don’t think he knows he’s my main motivation behind my language learning journey.\n\nEDIT, about two or so days later; I’m back to gushing about my boyfriend. We hung out together yesterday and he was so sweet and gentle with me. He’s my first ever boyfriend (I focused more on friendships before I dropped out), and he’s aware of that and he’s so kind. He constantly asks to reaffirm my boundaries, even more so when he learned about my past.\n\nToday we were on call together and he was doing his morning routine so I said fuck it and got up and did my own for the first time in months. My teeth are now brushed and my face washed + Moisturizer. I feel so awake and happy. I genuinely don’t think I deserve him because he’s made me feel so happy and is constantly reaffirming my gender identity when I’m having bad days. He’s uplifting and he doesn’t get mad if I tell him I’m having a bad depression day and am struggling to take care of myself. He just makes me feel so much better about myself and my mental issues and for fucks sake I think he’s a keeper and I’m so happy he is.\n\nIf we ever get married I’m fucking doing my vows in French. Just for him. And only he will know their English translation. And honestly, I know I’m thinking way too far ahead but I hope we get married. Because even I think six months in and we still have the same connection and spark we did as when we first met. We’re still just as close and we haven’t fought (yet, If we ever do. I plan to always come at things with communication first instead of yelling, because that gets you nowhere). I want this to last. I really, really do.",
    "subreddit": "TrueOffMyChest",
    "title": "I’m learning a language just to flirt with my boyfriend",
    "upvote_ratio": 0.91,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3vkv1/im_learning_a_language_just_to_flirt_with_my/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 05:01:58 UTC",
    "id": "1j3vhjg",
    "link_flair_text": null,
    "media": null,
    "num_comments": 25,
    "score": 310,
    "secure_media": null,
    "selftext": "There is not much to say as the title says it all. This guy told me he wanted to be with me, that he wanted to have a family with me, and expressed his feelings toward me. It was the first person I could see myself having a kid with. For god’s sake, I helped pick out what house he was working so hard to buy, which he always talked about our future and us living there. He tried to talk me out from moving over 6000 miles for my career. \nEveryone is asleep so I have no one to really voice this to, I’m sorry that it’s you all. I never thought someone would put this much effort for nothing. \nThank you for letting me vent.",
    "subreddit": "TrueOffMyChest",
    "title": "I found out the guy I’ve seeing has a fiancé for the last 9 months",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3vhjg/i_found_out_the_guy_ive_seeing_has_a_fiancé_for/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 04:59:04 UTC",
    "id": "1j3vfkc",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 7,
    "score": 3,
    "secure_media": null,
    "selftext": "I'll spare you the details but in short I got exposed to a CP image involving 2 men and an infant. This was 1 week ago and ever since then i've felt literally nothing but pure rage thinking about what I want to do to those men in that image. I literally can't think or function properly. Can't work, can't have a normal conversation with anyone without getting irrationaly grumpy, can't enjoy any hobbies, can't do almost anything, all because my mind is consumed almsot 24/7 fantasizing about the ways in which i would brutalize those 2 men if ever given the oppurtunity. I've literally never felt anything close to this before and I don't know what to do. I'm hoping this will be a \"time heals all wounds\" situation but i'm not so sure.\n\nPart of me says to myself \"well there's thousands of kids out there who get abused every day and there's nothing you can do about it so there's no point losing yourself over it\" but being able to push this all from my mind is easier said than done. I feel like the image I saw is burned into my mind and will never go away, same with the extreme anger and anguish i've been feeling for the past week.\n\nHas this ever happened to anyone else? How does one recover from something like this?",
    "subreddit": "TrueOffMyChest",
    "title": "Got exposed to CP involving an infant. My mental is now destroyed.",
    "upvote_ratio": 0.71,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3vfkc/got_exposed_to_cp_involving_an_infant_my_mental/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 04:54:58 UTC",
    "id": "1j3vd3d",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "All I know is that everything sucks right now. A little background, I’m 26 F my daughter is 15 months and my fiancé is 28 m….my fiancé isn’t my daughter’s biological father and that is well known. Her biological hasn’t had anything to do with her for 9 months ish? That’s a different story that I’m not willing to tell right now… my fiancé and I have a little background before my daughter. I originally met him when I was 18. And let me tell you, I swear it was love at first sight. I can still remember the way he first looked at me… I mean of course I do… it’s all I’ve really had to go off of for 7 years… summary the past 7 years.. well his 11.. he’s been with the same girl since  high school. They recently separated in September of 2024… and that’s because he had failed the bar and was having a midlife crisis and called me to come get him… and of course I did. We’d recently bonded again because of the complications I had with my daughter’s birth and the lack of basic compassion from her father… I had been hospitalized for a month before having my daughter and she was in the nicu for 62 days.. during the whole period of me being in the hospital, it was only my mom and him who would check on me and my baby… given our history it was obviously easy to just open up to him(to me)… because you know despite him having a wife for the past 7 years.. we’ve always stayed in touch regardless of who I was dating at the time… I know, don’t even tell me how bad that is… well to no one’s surprise and surprisingly not even to mine… I caught him emotionally cheating on me\nwith his soon to be ex wife… he’s already proposed to me at this point and now both my daughter and I live with him… and honestly all I can think is stupid stupid… I know the saying goes you lose them how you get them, but he’s played an active role in my daughter’s life since she’s been five months old….. that’s her dada… he’s been the only man who’s happily stepped into the role of being her father since her dad bounced….. I don’t even know how I got myself into this mess let alone how to navigate this…. I’ve been in love with this man for over 7 years… and at this point I don’t know what to do… I just want to do what’s best for my daughter.. I don’t care if I’m hurt… but the thought of her losing another dad is killing me inside…",
    "subreddit": "TrueOffMyChest",
    "title": "Not even sure what community I fall under…",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3vd3d/not_even_sure_what_community_i_fall_under/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 03:59:09 UTC",
    "id": "1j3udm9",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "Being a teenage girl and conventionally unattractive is actually so bad 😭 All of my friends are really nice and are pretty. They're all in a talking stage with boys they like and the boys like them back. I've never had a talking stage so I can't relate to them when they're talking about there situationships\n\nMe and another friends feel left out when they start talking about the boys and it's kind of sad cuz they don't even let us join in because they say explaining \"takes too long\" and \"it doesn't matter\". It's not like I feel that I HAVE to talk to boys but does hurt my feelings when they have their own group chat with them and the boys they're talking with.",
    "subreddit": "TrueOffMyChest",
    "title": "I feel left out",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3udm9/i_feel_left_out/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 03:54:00 UTC",
    "id": "1j3uaf9",
    "link_flair_text": null,
    "media": null,
    "num_comments": 10,
    "score": 3,
    "secure_media": null,
    "selftext": "I'm not even sure wtf happened lol.\n\nI was laying down and took a deep breath and she just told me I breathe too much \n\nNot sure where to go from here? Do I leave her? Stop breathing? Morph into a sponge?",
    "subreddit": "TrueOffMyChest",
    "title": "My (43m) gf (35f) just told me I breathe too much",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3uaf9/my_43m_gf_35f_just_told_me_i_breathe_too_much/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 03:51:57 UTC",
    "id": "1j3u947",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 5,
    "score": 18,
    "secure_media": null,
    "selftext": "My family was always dysfunctional. That’s putting it nicely. \nMy mom was an alcoholic/addict who put her partners over her kids. My dad was an addict, often in and out of jail. \nMy siblings were absolutely cruel. With my luck, I was the black sheep that had never fit in.\n\nAnd extended family was no better. My mom’s side just ignored we existed, as they were embarrassed by my mom. My dad’s side contained addicts who were often in trouble with the police. My last name was literally known as the drug name 😭\n\nMy mom gave up her rights when I was almost 18 and the family I was stuck with treated me horribly. However, they favored my sister. \n(They put me in a room with no ventilation in the garage, I wasn’t allowed in the house, I wasn’t allowed to talk to people at school, they admitted they had a group chat to talk badly about me, etc.) \n\nThis is all a super summarized version, as I don’t want to drone on. \n\nAs soon as I got to college, I was quick to cut everyone off and restart on my life. I found an amazing therapist to process everything I’ve been through, I have people that support me, and I got a super cool cat. \nYet, as the title says, I find myself sometimes wondering if my family thinks about me. \n\nThe only time they had seen me in the past five years was my grandparents’ funerals. Even then, I stayed for an hour. All they had to say then was, “How’s that fancy college?” \nAs I’m the only one who went to college. \n\nI feel like I do super well on my own. I’m complimented about how much I’ve pushed through things. \nBut sometimes I wonder if my sister ever thinks about how I’m doing, the same way I think about her. I wonder if my dad talks about me being in art school, or if he is too busy with whatever he’s up to. \n\nEven though I know cutting them off was the best for my health, I still find myself feeling lonely without all of them. I don’t miss who they are, but I miss the spots they held. They were still my family. \n\nSorry if this was all over the place, it’s just a big ramble \n\n",
    "subreddit": "TrueOffMyChest",
    "title": "I cut off my family, but I wonder if they think about me.",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3u947/i_cut_off_my_family_but_i_wonder_if_they_think/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 03:42:03 UTC",
    "id": "1j3u2qk",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "This might not make sense as I dont know how to talk about things and im trying my hardest but nothing is working so im sorry if you cant understand. I don't feel like I'll have any connections with anyone. When it comes to friends, I simply just feel like I'm not as meaningful to them as they are to me, which sucks and honestly hurts a lot since it doesn't seem to be the problem with anyone else. I just feel like I don't have anyone there for me. I try to make new friends but it just never feels there. I've been in 2 relationships in my entire life, both brought me down to my lowest. And it seems like after those, I just don't attract anybody anymore. It feels like I'm going backwards as I've been spending my time trying to build myself up for as long as I can remember, trying to recover from a lot of childhood issues that came with me as I grew up as I constantly kept things bottled. I feel like when it comes to everything else in life, it's no problem. I'm ambitious and I plan on being very successful. As a person, I feel like I'm a good person, I'm self aware and I know how to better myself after situations. But socially I just feel like I come short, like I don't have anybody. I don't wanna keep using sex as a way to \"pretend\" like I actually have something special with someone. (Also if anyone is concerned, I always make sure to communicate my intentions to avoid leading anyone on or etc.) I just feel like I don't have anyone, i guess that's all I can say. \n\nAgain, sorry if this seemed like jumbled up nonsense, I don't know how to do this",
    "subreddit": "TrueOffMyChest",
    "title": "I feel so stuck",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3u2qk/i_feel_so_stuck/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 03:34:22 UTC",
    "id": "1j3txou",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 2,
    "secure_media": null,
    "selftext": "Ngl , it took the whole soul in me to say it to her. And I cried after.  But I finally said it to my mom . \n\nNot gonna lie her reaction wasn’t that great . She just replied with “but I want you to focus on school “ and looked disappointed. And then she asked what he does and looked even more disappointed when I told her he doesn’t go to school at the moment . \n\nI’m just honestly sad because I’m 21 years old , soon moving out and I still feel like a child in my mom’s eyes . Growing up I’ve always tried to be a good child, always getting good grades and doing the best I could to make my mom proud . \n\n But I feel like my mom disapproves on everything I do . When I bought my own car she disapproved of it and screamed at me for not letting her look at it before I bought it . When I changed my major from biology to business, she talked bad about me and said I’m never gonna find a good job with that major. \n\n \nIt really just makes me sad. The news of telling her that I’m moving out would probably make her explode. Especially if I say I’m moving out with my boyfriend. Oh well. ",
    "subreddit": "TrueOffMyChest",
    "title": "I told my strict mom that I have a boyfriend",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3txou/i_told_my_strict_mom_that_i_have_a_boyfriend/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 03:30:33 UTC",
    "id": "1j3tv4x",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 6,
    "secure_media": null,
    "selftext": "So I work as an RBT, which in my specific job, is working with kids that have autism. My center is skewed toward younger kids. That being said, the other day one of our new hires had session with a kid for half an hour. Then immediately after, I had session with the kid and he had a potty accident. So I grabbed his clothes and we went to the bathroom to change. Later in the day when I had another kid, I was in the same room as the guy who had my first kid for half an hour and shared like \"hey! He has a newer potty protocol he isn't doing too well with, I had to change him at the start of session, it can be a good idea to check him more frequently\" thinking it was a friendly tip next time he worked with that kid again. *Spoiler alert* he did not think so. \n\nHe basically ranted off on me about how he didn't think he should be getting the blame for something that he didn't even do because he had already checked him (didn't specify when or how many times, it sounded like it was maybe just once, but with a half hour session, that's not bad) and it could have been from when someone else earlier had him because the other person was with him for like 4+ hours. He also tried to call me out on how \"I heard the walkie call of you asking for extra underwear for the kid and it was made a while after you started session for him\". And I didn't even realize this until now, but I made that call 1.5 hours after I started session with the kid for a *separate* potty accident. The first one I saw he was wet after standing up maybe like 1-2 minutes after I started session with him, and we were right at his table, so I just went ahead and grabbed everything I needed and took him to get changed. So *I didn't even make a walkie call* for that first accident anyways.  \n\nThis is also the same guy who had a rough time with another client the other day and kind of talked down to the kid for going into a behavior. And it was like kind of aggressive. I get working with these kids can be tough but that's just?? not okay. If you react like that to a kid after 1 session with him, you clearly do not have the capacity to be dealing with some of the high stressors this job brings. ",
    "subreddit": "TrueOffMyChest",
    "title": "Coworker ranted off on me after I tried to give friendly advice for a specific kid we both work with.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3tv4x/coworker_ranted_off_on_me_after_i_tried_to_give/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 03:20:12 UTC",
    "id": "1j3to4h",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 2,
    "secure_media": null,
    "selftext": "I am an idiot. I've been having some weird situationship with my coworker who's old enough to be my dad. I've had more family members pass since this first started and honestly I've just been on autopilot mode. I know our time together is temporary, he's bad for my mental and physical health, but he's familiar. So I go back every time. I see him at work and get jealous that he flirts with our bosses and they reciprocate.\n\nAnyway I can't sleep alone anymore. I went over to situationships house. We were intimate, a few times. It got to the point where he was too rough, it hurt, so I said after he finished, \"I can't go anymore. It just hurts at this point.\" \n\nThen an hour later he insisted we try again, I said it hurt. I was sore. He said \"let's just go slow,\" and kept trying. I said, \"No it hurts, yeah I'm tapping out.\" He just kept going anyway. He wasn't listening, he just kept going. So I took myself out of my body and pretended I didn't mind it. \n\nIf I was more aggressive he would have listened. So I have no one to blame but myself. My friends and family are sick and tired of hearing about me complain about how this man mistreats me. So I have no one to talk to, no one to blame but myself. What did I expect was going to happen? He's made it known he doesn't care about me. I'm such an idiot. He's been making more of an effort recently so I fell for it. \n\nI hate myself, because what was I doing? What AM I doing? I was supposed to leave for a new job, and I just chickened out. Now I have a UTI and my kidneys hurt. I genuinely feel like this is what I deserve. I had a whole new life practically handed to me with a big bow and instead i threw it away. Instead I'm pouting because everyone's dying.\n\nEvery time I think maybe I was assaulted, I immediately confuse myself and think, \"no. What did you think was gonna happen? I needed to say no more aggressively and it wouldn't have happened.\" I keep fighting with myself, it wasn't a big deal, it was a huge deal, did he realize what he was doing? Did he do it on purpose? What is wrong with me? I just want to know what's wrong with me that I keep making the wrong decisions. \n\nEveryone my entire life has said they SEE SO much potential, that I'm gonna do great things, people I've only known for a week or two. Yet here I am, putting myself in situations and then complaining that they hurt me. What is wrong with me?",
    "subreddit": "TrueOffMyChest",
    "title": "I feel violated",
    "upvote_ratio": 0.56,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3to4h/i_feel_violated/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 03:16:23 UTC",
    "id": "1j3tlhm",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 10,
    "score": 0,
    "secure_media": null,
    "selftext": "We Need Modesty Back.\n\nI feel like in a situation where a man gropes a woman in a bikini they’re both at fault. She knows she’s practically half naked which is perverted and she attracts perverted behavior from another perverted person. So the man acting on temptation is wrong the woman provoking the temptation is wrong and the mentality that I can walk around in anything I want because I just want to be sexy is wrong because it all comes from immodesty and it’s not accidental it’s intentional. You know sexy means sexual. It’s meant to provoke sexual feelings. So that’s lust. You can’t dress yourself in lust and expect not to attract it and then push all the blame on the predator when you made yourself the bait. Don’t get me wrong both people are responsible for their own foolish decisions but I believe more modesty will reduce any forms of sexual misconduct\n\nSidenote: I want to be clear that in no way am I justifying or excusing the actions of predators or those who commit sexual assault. They are fully responsible for their sin and the harm they cause. This post is not about blaming victims, but rather about acknowledging the responsibility we all have in our own actions, including how we dress and how that can affect others. The Bible calls us to be mindful of how our choices can impact the people around us, both in terms of their temptation and their spiritual growth. This is about promoting accountability and mutual respect, not shifting blame.",
    "subreddit": "TrueOffMyChest",
    "title": "We Need Modesty Back",
    "upvote_ratio": 0.32,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3tlhm/we_need_modesty_back/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 03:15:43 UTC",
    "id": "1j3tl11",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 0,
    "secure_media": null,
    "selftext": "\nI 21F was in a relationship with my ex 26M, and he treated me in ways I would not wish on anyone. He physically abused me—beating me, choking me, and keeping me trapped inside for long periods. He taunted me about my past abuse, cheated on me, and when  I confided in him about feeling like I did not want to be here anymore, he told me to go through with it. He insulted my body, threatened to mutilate me if I ever cheated on him, and isolated me from my friends and family. He also has previous charges, including domestic violence.\n\nI have known for a while that he works as a Chaturbate streamer, something he keeps very secret because he does not want people in his personal life to know. After everything he has done to me, I have been tempted to expose his job out of spite. I know revenge is not always the right answer, but it feels so unfair that he gets to move on without consequences while I am left with all the pain he caused.\n\nI usually do not think like this—I am the type to forgive, forget, and be very loving. I may only be feeling this way because we recently broke up, and this was one of the worst periods of my life. If people do not agree with me, I just ask that they not be too harsh. I have been through so much, and I am not in a good mindset right now.\n\nI just need to know if I should follow thru and be bad or keep doing what I’ve always been doing and forgive and forget?",
    "subreddit": "TrueOffMyChest",
    "title": "Debating if I should act on revenge of forgiveness",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3tl11/debating_if_i_should_act_on_revenge_of_forgiveness/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 03:13:53 UTC",
    "id": "1j3tjoq",
    "link_flair_text": null,
    "media": null,
    "num_comments": 45,
    "score": 1518,
    "secure_media": null,
    "selftext": "This is a bit long, but it's also how it happened. \n\nSunday afternoon my wife, daughter, daughters-friend, the dog and myself went to the river to play and collect some pretty rocks since it was so nice outside. We live within walking distance and on the way back, we were about to leave the levee along our normally used path when both my wife and I spotted something on the levee about 50 feet away, we couldnt tell what it was. I asked my wife to take the dogs leash so I could go check, and to please take the girl a little way further away while I go make sure it's just garbage.\n\nAs I got closer and saw it was a person, I quickly told my wife and asked her to call 911. I went over to the person and found out it was a young looking girl, and she was still breathing. I ran back to my wife who was on the phone with emergency services and relayed the info that it was a young female, still breathing, not conscious. I then ran back to the girl and tried loudly talking/shouting at her to see if I could get some reaction, but I was very hesitant to touch her since I could see she was actively breathing. Her phone, which had been in her open hand the entire time, began to make ringing noises and I tried to answer it but it was some kind of Instagram thing and not an actual call, I dunno. I set her phone back into her hand and about 30 seconds later a police officer showed up. I waved at the officer to get his attention to the exact location. He quickly ran up to me and gave her a very brief checkout before administering a dose of narcan. He waited a few seconds and began to shake her and shouting a bit to get her awake, which resulted in a moan and partial roll from her. He kept trying to get her awake for maybe another 30 seconds and the ambulance showed up, they almost drove by but saw me waving at them and managed to just barely make the turn. 3 EMT's hurried up to us and checked her vitals and pupils and in the next 90 seconds they had her standing and eyes open. I figured the was nothing else they needed me for, I thanked them and quickly got out of the way. A side note, I'm very impressed with the reaction time of both the police and the ambulance, they were both on site with within 5 minutes of my wife calling them.\n\nThe next day at work, I mentioned this to a coworker whose father I know owns the trailer part right next to where I found the girl. My coworker found out more about what happened, and I hate it. Apparently the girl had gotten some weed from her cousin which had been laced/contaminated with fentanyl. It also sounds like her cousin was with her, and left her laying there when she collapsed. Also found out she had to be administered 2 more doses of narcan while in the ambulance and that she was only 13 years old. Also learned I sort of know her. I actually know her parents as I worked with them both about 10 years ago, I remember seeing her as a small 2-3 year old kid, haven't seen her since though so I obviously didn't recognize her. \n\nI'm glad it was my family who found her and she will be ok, someone could have easily drug her away down into the trees and she would have never been seen or heard again. I'm terrified for my daughter, who is about half this girls age. I can't believe how close I ended up being to her family. \n\nI dunno how to end this, but I needed to share the story. Teach your kids how to be smart and responsible, you won't always be there to tell them yourself.\n\nAnd always wash your hands after touching random objects. I vigorously washed my hands when I got home since I touched her phone which could have been contaminated with fentanyl for all I knew.",
    "subreddit": "TrueOffMyChest",
    "title": "Found a girl OD'ing and saved her life. Found out more about the girl and what happened to her later.",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3tjoq/found_a_girl_oding_and_saved_her_life_found_out/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 03:10:46 UTC",
    "id": "1j3thiy",
    "link_flair_text": "Positive",
    "media": null,
    "num_comments": 6,
    "score": 1,
    "secure_media": null,
    "selftext": "I have overnight become so filthy rich I feel different just my vibration and energy in life is higher. I come from hard times at least financially I've never had any examples in life that would prepare me for this . I feel like a smart and well equip I've had addiction to bad thing in the past but have over come Iam going to transform a B into TR an change the population Iam Greatness",
    "subreddit": "TrueOffMyChest",
    "title": "Luckiest life",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3thiy/luckiest_life/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 02:54:35 UTC",
    "id": "1j3t63u",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 6,
    "secure_media": null,
    "selftext": "I'm 15 so if you don't wanna continue reading this because I'm \"too young\" or just \"ungrateful\" blah blah, just please keep scrolling. I've heard that from my dad 1000x before.\n\nLike I said, I'm 15. I'm homeschooled. I live with my father and my grandmother (his mother.) And I hate them. I hate my entire family.\n\nMy mother? Abandoned the entire family multiple times and then dies from an overdose when I'm 5 years old. My dad maybe there physically but emotionally, he isn't, never was. His mother is a poor excuse of a replacement mother figure for me. Self-absorbed, egotistical, does not know the meaning of the word \"boundary\" (she told me once that (in so many words) ME having boundaries makes her \"uncomfortable\"), just a shitty person. (She also called me a burden when I was 11. And later told me my existence is \"unfortunate\" 🙃)\n\nMy mother's side of the family is completely mentally unstable and dangerous, so we've been no contact with them for years.\n\nMy uncle cut contact with this side of the family (except for his mother), including me, when I was only 13.\n\nAnd I too want nothing to do with my family anymore. After having experienced my first breakup late last year, and how my dad was \"there for me\" during that time, really showed some true colors in my family. I guess I've been having some revelations as of late. I hate this family.\n\nI want to leave but obviously I can't. I can't get emancipated when I turn 16 because that'll cause chaos. I'm trapped until I turn 18 and can get the hell out of here.\n\nMy father's a neglectful, coward of a man who brought me into this world, a kid he didn't even want! (his own words) and refuses to accept that the enabling of his own wife's problems and his problems has really fucked up his kid.\n\nCall me whiny, spoiled, ungrateful, dramatic, I've heard it all before. I just wish I had a family who saw their kid as an individual, not some accidental prop/tool they brought into this world and now have to deal with her \"emotional outbursts\" or \"attitude\"  I wish somebody would at least fucking understand instead of seeing me as a moody teenager.",
    "subreddit": "TrueOffMyChest",
    "title": "I hate my family, so much",
    "upvote_ratio": 0.87,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3t63u/i_hate_my_family_so_much/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 02:43:07 UTC",
    "id": "1j3syar",
    "link_flair_text": null,
    "media": null,
    "num_comments": 13,
    "score": 1,
    "secure_media": null,
    "selftext": "I think there's alot of very cool things about Japan and I actually like the place and their culture. But I can't help but notice that everytime I see some very obscurely weird crazy shit it's almost always from Japan.\n\nAll the most gruesome obscure skincrawling horror, porn and whatever, it is almost always from Japan. Why? Do Japanese people like the shockfactor? Is it something they have in their culture that I've missed?  \nDoes it just seem like its more prevelant in Japan?",
    "subreddit": "TrueOffMyChest",
    "title": "What's up with Japan?",
    "upvote_ratio": 0.53,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3syar/whats_up_with_japan/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 02:34:51 UTC",
    "id": "1j3sshp",
    "link_flair_text": null,
    "media": null,
    "num_comments": 13,
    "score": 9,
    "secure_media": null,
    "selftext": "I have had multiple C- sections (cesareans) I’ve recently dropped about 52lbs, which is amazing. But I’d still like to lose about 20 more. The problem is I can now see my whoha again. Bitch was angry and I “fixed” her but I  noticed since my c sections. She’s like idk fat I guess. I have this permanent indent and no matter how much weight I lose it won’t go way…I cannot be the only one right?! Btw my kids are 11, &amp; 14 this journey is my own weight loss journey now that I can focus on me. Some women please tell me I’m not crazy I feel like the grossest person in the world.",
    "subreddit": "TrueOffMyChest",
    "title": "Can I ask a legit question…and let’s be for real because I can’t be suffering alone….",
    "upvote_ratio": 0.85,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3sshp/can_i_ask_a_legit_questionand_lets_be_for_real/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 02:24:42 UTC",
    "id": "1j3sl04",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "Since I was grade 3, there was almost been problems all my life. Since growing up in a shitty environment, I used to pray to get out of my living situation. I had crazy family members causing scenes where the police would be called for noise complaints and question if i was getting abused. From beg bugs to cockroaches filling the microwave, I was so tired of it, but knew I just had to thug it out. Since gr3-8, teachers would have to question if everything was ok and i truly wondered if they were ever gonna call cps, but i always hid it. Then high school came around and had upgraded to a better living situation, yet i felt so lonely. I wasn't living with my parents and sometimes I just wanted their company despite the ruckus environment they have always caused. However, although i had a better living situation, that was only thing that kept me happy and somewhat ok with my circumstances. But, high school ended and that was one of the darkest and traumatic moments of my life happened. I realize I had large sums of money stolen from family members as well a spiral of physical trauma from that year. From then, I knew I had to add meaning to my  life so I started working community based jobs and eventually researched getting into health care (specifically med school ik a common dream many teens have in education but rarely achieve). However, I believed i could do it. Now enrolled in post secondary i had big goals and was so fixated on getting one thing, the typical rags to riches - shitty environment to respectable status. However, one club i went to fucked me up (story is in my profile). Although it may seem like an overreaction and a story nothing to worry about, it really fucked with my mental. I overthink so much and made me feel like garbage, worthless, and scum. Now, after all these years I decided to call my mental health services at the uni i am enrolled in since I literally had a panic attack before class and started throwing up in the washroom. Tomorrow, is my first appointment and idk if this is gonna help my mental. Idk if i ever had clinical depression plus i never went to see a psychiatrist to diagnose me. I am writing all of this because i truly don't where to go online to vent. I feel like a failure and wondered if i am ever gonna achieve the \"american dream.\" or be stuck at the bottom of the totem pole. I am trying my best to seem like a good human being, but everything going really affects my perception of myself. I hope I can show my parents I am worth something.",
    "subreddit": "TrueOffMyChest",
    "title": "Thought I had i could win back my happiness, but now I have such a gut wrenching wave of loneliness and shame.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3sl04/thought_i_had_i_could_win_back_my_happiness_but/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 02:19:07 UTC",
    "id": "1j3sgvn",
    "link_flair_text": null,
    "media": null,
    "num_comments": 28,
    "score": 10,
    "secure_media": null,
    "selftext": "",
    "subreddit": "TrueOffMyChest",
    "title": "I really regret having a child",
    "upvote_ratio": 0.64,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3sgvn/i_really_regret_having_a_child/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 01:57:36 UTC",
    "id": "1j3s1d5",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 9,
    "secure_media": null,
    "selftext": "My boyfriends mom is jealous of me\n\nHi everyone. I’ve been a long time listener to this podcast and a situation arose that I need advise on. (I’m sorry in advance for any confusion or is my writing is horrible, this just happened and I’m not on reddit often.) \n\nI (19f) and my boyfriend (19m) started dating at the end of January this year. Everything has been perfect up until now. We met each others families, were loved by both sides, and everything has truly been amazing. \n\nFor some context, I am at a community college studying to be a speech therapist while my boyfriend is studying biomechanics and another community college. He was attending a four year but chose to come back home because it wasn’t for him. I am also very religious (Christian) and my boyfriend and I go to church together. \n\nRecently, his mom hasn’t been the biggest fan of me. There was one time where we closed the door in his room because I wanted to sleep and we wanted privacy (I can’t sleep unless it’s a dark room) plus I was exhausted from working early mornings. I totally understand if this is against his mom’s rules and from this point on we’ve kept the door open because his parents weren’t comfterble with it closed. Since then, shits hit the fan. \n\nMy boyfriend and both his parents sat down last night to have a talk. They said that they disapprove of me because “people who go to community college are lazy and turn out to be nobodies,” I’m a “fake Christian” and it seems as though my boyfriend has gone downhill. They also think, in his mom’s words, that he “settled.” Keep in mind they’ve known me for such a long time, a month. It’s not like I don’t spend time with his parents either. We have dinners where I’ll bring homemade sourdough bread or flowers as a thank you. We talk for hours on end whenever I am over there. \n\nHis mom is a stay at home mom with two boys in total, and since my boyfriend is the baby of the family, I think she feels like she’s being left behind. I feel bad having her feel that way but I feel like the longer they push him to essentially break up with me, the more they are going to end up pushing him away. \n\nAnother thing I forgot to mention, my boyfriend and I have not done anything sexually other than kiss. His mom claimed that my boyfriend’s and my relationship is “lustful not love” when in reality, she hasn’t even seen anything about our relationship other than when we’re at their house. Even when I am over there, my boyfriend at the most puts his arm on my leg or around my shoulders. \n\nShe is a Christian as well, she went to a university that is a private Christian school and was raised to be religious. Not saying that my path is more perfect but for more context, she doesn’t have a bible and she doesn’t go to church. I thought if anything someone who is religious would understand that in the Bible it says no one can judge because no one is perfect, only Jesus can judge because he is and he made us. I bought my boyfriend a Bible for Valentine’s Day she she thought it was super weird. I’m not telling him “read ten pages every night” or anything, he can do whatever he wants with it, read it or not. \n\nI know this was super long and I feel like I’m forgetting stuff but this is basically the gist of it. How can I convince his parents that I’m not someone that they think I am? I was thinking about just having a sit down with my parents first with my boyfriend so they could also give advice, but my boyfriend is 100% on my side of everything and sees right through his parents bs. I wanted to later on sit down with my boyfriend and just his mom but I feel like it’s going to take some time. Any thoughts and advice is more than welcome here! Thank you ! ",
    "subreddit": "TrueOffMyChest",
    "title": "My boyfriends mom is jealous of me",
    "upvote_ratio": 0.85,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3s1d5/my_boyfriends_mom_is_jealous_of_me/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 01:35:07 UTC",
    "id": "1j3rl92",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I met a girl on snap and sent a message asking to go meet up at a Starbucks. She seems nice and all but either she didn't see the messages somehow cause she still snaps back, or she is just ignoring the messages thinking it will make me lay off. I don't know what to do I watch all my friends pull (most of them) and I just want that too",
    "subreddit": "TrueOffMyChest",
    "title": "She just isn't responding",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3rl92/she_just_isnt_responding/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 01:30:46 UTC",
    "id": "1j3ri1f",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 11,
    "secure_media": null,
    "selftext": "I’m tired. I don’t really wanna die i just don’t wanna be hurt anymore i feel like i’m in hell i want someone to hold me and tell me they care about me but idk i feel like i went through too much for someone so young that even just living is exhausting i’m really tired and i can’t even cry i just sit there with a lump in my throat i’m too tired to type more i feel like a failure and a burden and undeserving of all the love and support i crave and i hope i die if life is just gonna keep being this way to me ",
    "subreddit": "TrueOffMyChest",
    "title": "No words can express how much pain i’m in right now",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3ri1f/no_words_can_express_how_much_pain_im_in_right_now/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 00:51:39 UTC",
    "id": "1j3qots",
    "link_flair_text": null,
    "media": null,
    "num_comments": 43,
    "score": 5,
    "secure_media": null,
    "selftext": "I’ve always been shy but as I grew older I became depressed and anxious around women and I thought I’d grow out of it by now but I haven’t. I’ve never been on a date despite trying to date and I’m starting to lose hope that it’ll ever happen. I’m a pretty antisocial person so I have nobody to blame but myself and I just want to be better but idk how to. I just wish I wasn’t so alone",
    "subreddit": "TrueOffMyChest",
    "title": "I feel ashamed of having no experience with women at 26",
    "upvote_ratio": 0.86,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3qots/i_feel_ashamed_of_having_no_experience_with_women/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 00:50:51 UTC",
    "id": "1j3qo7f",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "I wanna kill myself so bad but i’m too scared to do it. I feel like there’s no way out of the pain and misery i’m in these past years i’ve been abused so much i lost myself and my spark and my will to live i became an anxious person that can’t talk or make connections at all. My mind is empty if it’s not about all the abuse and unfair shit i went through for so long and i’m so tired just why? I made it alive from years of repeating cycles of abuse and for what just to see other people my age and younger get the love and the support/security i always wanted i’m tired of living i just wanna sit down and cry for hours i feel like a burden from how many issues i have mentally after everything i don’t wanna be strong i’m not a fucking soldier i’m a child and i need so much love and support just as much as everybody else but i only crave it from people that doesn’t know i exist or are unavailable and can’t be in my life sometimes i wish i didn’t make it this far cause the pain never stopped i’m all alone in this and i mean it not even my parents love me and i can’t stand seeing their faces after everything they’ve done to me i’m just tired when is this all gonna end or should i have to end it myself?",
    "subreddit": "TrueOffMyChest",
    "title": "Is life always gonna be unfair",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3qo7f/is_life_always_gonna_be_unfair/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 00:41:23 UTC",
    "id": "1j3qh3b",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 2,
    "secure_media": null,
    "selftext": "Long time lurker, first time poster. I have reached a boiling point where I cannot keep this within anymore. \nMy wife and I have been watching my best friend’s life crumbles in front of us due to his fiancé and her manipulations. \n\nFor the remaining of my story, I will refer to my best friend as T and his fiancé as Z.\n\nT and Z met on Tinder during late 2021 and T introduced Z to me and our friend group in early 2022. Ever since I met Z, my wife and I had identifed so many red flags about her. Here is a summary of what I can recall:\n\n1. Z has a habit of trauma dumping her past to everyone she met. Even during casual conversations when people asked about her life before meeting T, she would reveal about her previous engagement where her ex-fiancé would beat her in front of her mom, just all kinds of sob stories, her suicide attempts, and generally just all sorts of stories that Z loves telling people that she just met, making every conversation with Z extremely uncomfortable for everyone. \n\n2. Over the course of their relationship, Z had convinced T to cut off his friendships with all of his childhood friends who all warned T about Z’s questionable character. I remember that the day T told his childhood friend group that he no longer wishes to speak to them, that whole group messaged me on Facebook warning me to watch out for Z and that she is bad news (even though they have never met me, my guess is that T talked about me with them given that T and I are really good friends who went through a lot in life together). This is the beginning of Z’s gradual removal of T’s friends and her plan to isolate him from his support system. \nWhat I also noticed is that Z is unable to make and keep any new friends, any new friend group that met Z through T eventually got so repulsed by her that they distanced themselves from T and Z. \n\n3. Z casually bragged to me and my wife that she read all of T’s personal messages on Facebook and texts to his friends even the things he said before they met. My wife and I kept telling Z to be more respectful of personal boundaries especially when it comes to the past but Z did not care and kept reading T’s personal messages to friends and family til this day. \n\n4. T and Z bought a house together in 2023 and the moment they signed it off, Z quit her job claiming “mistreatment” even though she always bragged that the job allowed her to nap in her own office anytime she wanted and everyone treated her like family there. \n\n5. Now that T and Z are a single-income household with T working his ass off to cover their mortgage and living expenses, Z always asked for T to take her to lavish restaurants, frequent trips to Disney parks, even having him take her to a week in Disneyworld in Florida after she left her job. Every weekend she would have him take her to LA for a different expensive restaurant so that she could take pics and flex for her IG stories. \n\n6. Z got a diagnosis for Bipolar 1 sometime in 2024. Ever since, she frequently asked T to leave his work early to come home because of her not feeling well for whatever reasons. Note that because of this, T eventually got flagged for declining performance at his work but despite knowing this, Z still had T leave work early often for her. \n\n7. It is interesting to note that despite always claiming of not feeling well almost every day, during the times that I would come over at T’s place to hang out, I observed that Z was frequently able to drive herself late at night to play video games at her brother’s house which is a half hour drive away and come home late just fine. \nWhat pissed me off the most was that during my wedding, which was the only time in life that I asked to spend a lot of time with T, Z asked T to leave my wedding early because, you guessed it, she “wasn’t feeling well”. To make matters worse, Z wore a white dress to my wedding and my wife and I got asked many questions from our friends about that but we just shook it off because we were speechless about that as well. \n\n8. While she was unemployed, Z decided to go to college for an accounting degree even though she has no goals of working anywhere after. She always openly bragged about how she had T doing her college homework and coursework for her because she has difficulty learning since English is not her first language.\n\n9. T eventually got fired from his job for his declining performance. My wife and I was able to meet up at T’s house to provide T some guidance and support to look for a new job. During that time, Z told us that she already asked T for a boob job (she claimed that she feels insecure in college for being flat chested) and she also wants T to pay for a few other cosmetic procedures well knowing that T doesn’t have a source of income anymore. \n\nT and Z will get married at some point in 2026 and I feel like there’s nothing I can do about it. My wife and I know it to our core that Z is a terrible human being but T keeps giving her excuses and falling for her trauma dumping. When my own family briefly talked with T and Z at my wedding, they have also all noted that Z came off very disingenuous and manipulative. Since my wife and I spent the most time with T and Z, our friend group for the most part doesn’t know as much about Z as we know. I feel like I am watching T’s life crumbles in real- time as Z keeps draining his life away for her own use. I honestly wish I put in more effort in talking T out of dating Z when they first met. I never expected T to end up with someone that feels no remorse ruining his life like this. Guess since I can’t talk to anyone else IRL about this aside from my wife, I am better off letting this out on Reddit. ",
    "subreddit": "TrueOffMyChest",
    "title": "I Am Watching My Best Friend’s Fiancé Ruin His Life Day by Day",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3qh3b/i_am_watching_my_best_friends_fiancé_ruin_his/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 00:34:50 UTC",
    "id": "1j3qcal",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 4,
    "secure_media": null,
    "selftext": "I've been searching on Reddit for a few minutes and everything that comes up is about raisedbynarcissists, narcissism, narcissism, cptsd, victims of abuse, more and more narcissism. I can't take it anymore, because... this is not my experience AT ALL. \n\nMy mom says this to me, but what I hear when she says this is that this is realistically how life is going to be or is playing out, for me and everyone else, and this is just a factual statement. OBVIOUSLY, for victims of parental abuse this is patently false, but I'd like to see the opposite expressed somewhere, so here goes my attempt.\n\nMy mom is a lovely person. She's always tiring herself out helping others, supporting others, lifting them up. I'm sad and she says she doesn't mind staying awake at night to talk to me. I'm not a nuisance to her, I'm cared for and loved. \n\nIn many ways, this has put me off of romantic relationships. If no one is ever going to, to put it bluntly, coddle me and carry me through life like my mom has, what does romantic love have to offer me? IF it's not pure and unconditional and unstoppable, what good is that kind of love? \n\nI know, I know what I'm asking is a tall ordeal, but still... \n\nI just wanted to let people know that sometimes that sentence is true, and other times it is abusive. But I don't think it has to be one specific thing all the time. Context is required, in my case, my mom is a genuinely wonderful person who only wants what's best for me, is supportive, hears me out when I have issues (Even if she doesn't know how to adequately be supportive of my specific needs but that's for another rant). She's always there for her friends, in practical and more emotional ways, and she takes care of all of us. She's always looking out for me and my dad and her mother and people she used to work with text her constantly because she just plainly made their lives very happy. She wasn't bossy or punitive at work, although she praised a job well done, she could see the good in every person and tried to help them in the ways she could. She believes there is always a place for everyone and just because someone is doing bad at one task doesn't mean they are invaluable. She understands people. She cares, most of all, and she's genuine, and so it is really weird to me to go online and only read about how abusive that sentence is, because my mom is not like that, so why would she say it?\n\nI do have issues with taking things literally btw and suspect to be on the autism spectrum. Maybe my whole family is. Idk, we just do things differently between me, mom and my dad... \n\nuuuf. rant over. really needed to say this. ",
    "subreddit": "TrueOffMyChest",
    "title": "\"Nobody will ever love you like a mother loves their child.\" Why is this phrase so maligned?",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3qcal/nobody_will_ever_love_you_like_a_mother_loves/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 00:24:36 UTC",
    "id": "1j3q4ne",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 0,
    "secure_media": null,
    "selftext": "I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die I wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die i wanna die",
    "subreddit": "TrueOffMyChest",
    "title": "I wanna die",
    "upvote_ratio": 0.35,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3q4ne/i_wanna_die/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 00:24:01 UTC",
    "id": "1j3q46u",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 3,
    "secure_media": null,
    "selftext": "A few days ago through no fault of mine I lost a job I loved. This happened right after I came back from holiday my boss called me to let me know that unfortunately he could not keep me anymore since the company I work for was going bankrupt and could not pay any more salaries. I feel disgusted with life. I was happy there, it was hard work sometimes but I was happy. And within a day everything crumbled.",
    "subreddit": "TrueOffMyChest",
    "title": "I lost my job a few days ago",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3q46u/i_lost_my_job_a_few_days_ago/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 00:17:32 UTC",
    "id": "1j3pz7p",
    "link_flair_text": null,
    "media": null,
    "num_comments": 32,
    "score": 204,
    "secure_media": null,
    "selftext": "So this story is a little bit friendship drama and a little bit bridezilla drama, but I have been reading reddit stories for a long time and wanted to get my own off my chest.  Sorry this is so long!\n\nSome background first: my best friend of 15 years and I (both female in our 30s) met in college when we were randomly assigned to the same freshman dorm, and we had been inseparable ever since.  I'm talking this women was my person, we did so much together, were there for each other's huge milestones, and had kept our friendship going strong for so long even after I moved out of the state several years ago.  I always felt like our friendship was really balanced in that nobody was carrying more or less effort of the friendship than the other.  I even helped her both plan over several months and execute her escape from her abusive ex-husband, and was one of only a couple of people entrusted with this knowledge prior to her physically leaving.  We were TIGHT.  \n\nMy husband and I eloped in our state last summer, which we had been planning for 17 months prior to the event.  Due to events with my family, we decided to elope with literally only ourselves and our photographer, no family or friends to avoid drama (I had a bachelorette party with my friends a month prior to the wedding so they could still be involved).  About 4 months prior to the wedding, my friend reached out to me and asked if she could come to the elopement.  In her words \"it makes me really sad to think of you getting ready for your wedding on your own\".  My now-husband is a very shy man, but had gotten to know her really well over the years and is now friends/very comfortable with her, and was very on board with her joining us.  Other than ourselves, she would literally be the only other person attending.  To me, this was a really extraordinary display of friendship as she would need to fly to come and it would cost her money, which didn't bother her, and I was so appreciative.  Well, about 2 weeks after she offered to join us and we accepted, she started dating a new guy that she was really into.  After her horrible experience with her first husband (they are now divorced), I was so excited for her that she met somebody as amazing as she was.  Well, this is when the drama started.\n\nAt first, she just asked if her new boyfriend could come up to the wedding with her (they had only been dating 2 weeks at this point).  My husband and I talked about it, and he was super uncomfortable with having a stranger join in.  I got back to my friend about it and said \"no, it's nothing to do with him, we just don't want a stranger at our wedding last minute\".  We had plans to do girl stuff like get our nails done the day before the wedding, which would leave my husband to entertain a stranger.  She came back with \"well, he doesn't have to join in anything we do as a group\", which felt really icky as we're people who wouldn't want somebody else to feel excluded the first time they fly up to meet us, especially when they're the partner of my best friend.  It's not that we didn't ever want to meet the guy, just not last minute for our wedding.  Her response? \"Well, you can't tell people they can't fly to your state\", which is technically true but just felt like an excuse for crossing a clearly stated boundary? Either way, this started the only fight we had ever had in 15 years of friendship.  She felt like \"I just wanted her to be alone\" in my state (weird because before she met the guy, she was fine with that), and that I was being unreasonable.  She made plans and bought plane tickets for both of them despite me communicating mine and my husband's feelings about the whole thing several times.\n\nDuring this time, she and her new boyfriend got engaged after less than 4 weeks of dating.  I maintained my stance that we were not comfortable with having him come up to meet us at this time.  She revealed that her and her now fiance had made plans to elope 4 days after us in a different state, and were now going to fly there directly after our wedding was over.  She wanted our nail appointment and stuff we were doing in the days leading up to the wedding to now be joint celebrations for their upcoming wedding too. Mind you, she did NOT consult me on how my husband or I felt about this prior to making her own plans, and was very upset that I didn't react the way she expected me to.  Instead of being excited like she expected about being able to do stuff for both our weddings at the same time, I was just shocked and frankly very upset that she was hijacking our wedding now.  If she had discussed this with me before just deciding, I think I would have reacted a little differently, but it just felt so disrespectful to make plans that affected my husband and I without involving us.  I wrote her a long text to her explaining how disrespectful this felt, and asked her why she seemed willing to nuke our friendship of 15 years over a man who was nobody to anybody 6 weeks ago.  At this point, there had been many many conversations about her not listening about having her man come up with her, and now about how weird it was that they were now getting married so close to our own wedding.  My husband even asked at this point if we could move the wedding date or location to avoid the drama because he was so stressed out.  This was his wedding too, so that broke my heart.  I ended up telling her not to come at all, and told her she was no longer welcome.  We didn't end up speaking much for 2 months, and she cancelled on my bachelorette party 4 days before it was supposed to happen.  I never received an apology or acknowledgement of her behavior for any of it.  My other absolutely incredible human of a best friend from elementary school ended up coming up for our wedding instead when she saw how stressed and upset I was about the whole situation; I am eternally grateful for her.  \n\nFast forward about 3 months, our wedding and honeymoon are over.  My friend (the one who did indeed get married 4 days after us) reached out asking if I wanted to be the maid of honor in their wedding coming up in about a year.  You see, their parents are not well physically and were unable to attend the elopement, so they are throwing a second bigger wedding for their family in their home state.  I asked explicitly if she was sure she wanted me to be MOH after everything that happened earlier that year, she said yes she was sure.  I accepted despite some reservations because I wanted her to have an amazing wedding and very much valued our friendship.  While MOH, she kept expressing how overwhelmed she felt with everything, so I tried really hard to take things off her plate.  I researched all the photographers in the area, and made a spreadsheet with their pricing, contact info, availability, etc.  I also did something similar with the area hotels within her price range.  We're taking many many hours of research, but I was happy to help out. During this time, I also coordinated with the other bridesmaids to order snacks (vegan I might add) for her wedding dress shopping experience, which I attended remotely directly after working a 12 hour night shift.  I also had already planned and booked her bachelorette party.  Everything seemed to be going smoothly, she seemed happy and had never indicated otherwise.  Then came the \"we need to talk\" text.\n\nIt was a normal Wednesday, we had just had a bridesmaid meeting over Teams 2 days before, and everything seemed fine.  When we got on the phone, she informed me that she no longer wanted me to be the MOH.  To say I was blindsided was an understatement.  She told me one of the other bridesmaids had agreed to take up the title. I was obviously hurt, but she is the bride, so I just said \"ok, if that's what you really want\".  She then said \"but you can still come to the wedding if you want\".  I froze and then asked \"so what you're really saying is that I'm no longer in the bridal party\" (she never explicitly stated that, just that somebody else was going to be MOH), and her response was only \"correct\".  She didn't even have the balls to tell me that I was booted from the bridal party entirely, I had to ask outright.  From MOH to guest in one fell swoop.  \n\nHer reasons you ask?   \n\\- \"I have felt out of sync with you for a while now\"  \n\\- \"You were making me feel pressured to do things for the wedding before I was ready to do so\"\n\n  \nI asked her why she never ever said anything to me if the way I was helping wasn't what she wanted or needed, she just stated \"I didn't think it would help\".  I then asked her why she didn't just demote me to regular bridesmaid if she didn't like the way I was doing things, I've done both MOH and bridesmaid before and know how to do both.  In my experience as a regular bridesmaid, I wouldn't be in charge of planning anything anymore unless the new MOH or bride asked me explicitly.  Her answer was again \"I didn't think it would help\".  This was the last straw.  After everything that had happened with her over the last year, I was done.  I wasn't going to continue setting myself up to be hurt by her anymore and it was clear she didn't care about my opinions, thoughts or feelings.  I told her not to contact me ever again and blocked her on everything after that call.  Needless to say I am not going to her wedding.  None of my other friends seemed that surprised by any of the events above, so maybe she was acting like this before and I just couldn't see.  \n\nSide note: Remember how her first wedding was 4 days after our wedding? Well, her other wedding is going to be 3 days after my birthday.  Even my husband, who is anti-drama, asked me if I thought this was intentional haha.  \n\nSide note 2: I'm friends with one of the other bridesmaids independently of her wedding, and apparently my friend had been telling everybody else that the only reason we had a fight around my wedding was because I didn't like that she was also getting married so close to our date.  Which shows she neither heard nor understood anything that I said to her regarding that situation.  I truly hope that it's just a coincidence that she met her now husband and then started acting like a terrible person.  \n\nThank you everybody for reading, it feels good to get this off my chest!",
    "subreddit": "TrueOffMyChest",
    "title": "My best friend of 15 years nuked our friendship when she met her current husband",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3pz7p/my_best_friend_of_15_years_nuked_our_friendship/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 00:13:57 UTC",
    "id": "1j3pwgn",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "my friend left me, and i don’t want to be here without him.\n\ni would normally never turn to reddit for help but i’m here right now. i (female) have been struggling so much lately. i large factor of struggling is about this one guy. i bet you hear that so much but this is the only time in my life that i’ve ever ran into a problem like this. i guess i can full on lore drop here. i met this guy (that i’ll call steve) \n\nin early 2023. ever since i met him, i had this deep connection with him. i have serious feelings for him (and i’ve never crushed on somebody before). it took me up until october 2024 to tell him about how i actually feel. i visited him at his college right before i told him; it’s the main reason why i told him in the first place. when i told him, he never really told me about why he didn’t like me back. steve has always been a very private person but i assumed this would be different. \n\nafter i opened up to him i was struggling so badly. i eventually told him that i needed to stop talking to him. when i told him that (which was in november of 2024), he finally told me that he was gay. i really don’t know why he was keeping that bit of information from me for so long. he had talked to me about liking girls before so i just assumed that he could’ve been bi because he did kind of give off gay vibes. me not talking to him only lasted like a week and a half because i took a gummy and texted him. i tried to tell him that i needed to stop again but he just kept on texting me and i felt bad for just not answering him. \n\nthis man has been the light of my life for such a long time it feels. texting him was one of my favorite aspects of the day and it was what got me through dark times because it felt like he was there for me. fast forward a few weeks, he tells me about this guy that he was talking to. he told me that he had been talking to this guy for 3 months and that this was the first time he has ever really liked someone back. he randomly texted steve saying that he only had platonic feelings for steve and steve got so upset. he sent me a voice message of him almost on the verge of tears. i told him that i shouldn’t be talking to him about this, but i did anyways because i loved him. i tried my best to help him through the situation. i shared what i did when he told me that he didn’t like me back, and i told him that i would be there for him day and night (which he never ever took advantage of even though he said that this was one of the darkest times of his life). \n\nall was good until last month. steve was starting to act really weird towards me (he said that he’s sorry if he has been weird, he was never answering me despite texting me 24/7 days prior) so i confronted him about it. he told me that he went on a date with another guy. i ended up leaving him on read and he said: \n\n“I was going to send a text to you in the morning, but honestly it just feels more right to do one now. I'm sorry. I was slightly inebriated in my last response, and that's not fair for you. I do just want to let you know I am doing well enough mentally right now. Like am I the best l've ever been, no, but I'm definitely very much in a manageable position right now. I know whatever I say or do won't stop your anxiety, but I want to ensure you that if there was something going on, I would let you know. You are a very close friend of mine and you are definitely someone I come to when things are not right. The reason I initially said I was just \"busy\" yesterday and not what I was actually doing was because I didn't want to make you uncomfortable for anything like that. But it is for the best for me to be honest with that kind of stuff and l'll make sure to keep you in the loop As for the (insert boy name here) stuff, I don't really want to concern you with a lot of it because it honestly does depict me at my worst sometimes. I try to handle most of that without mentioning anything because it's usually easier and I don't like getting people involved that shouldn't have to be. I hope this kinda helps digest a little bit” \n\ni still left him on delivered because i just couldn’t handle the pain he has put me through. i texted him almost a week later stating that i am in so much pain and i can’t take it anymore. every single time that i try to make it clear that i’m deeply struggling, he never seems to care although he’s said that he cares for me deeply. just last week, i had this very depressive episode and he asked me how things were going and i said\n\n“not well. i genuinely think i am the most depressed i’ve ever been right now. i am at my lowest point. i can barely eat, sleep, or focus. i’m just empty. i can’t even get up and be productive. i don’t even feel like i’m living i’m just existing. you would’ve thought that i would’ve been so happy and excited on saturday but i didn’t even care about being at (insert my favorite place here). i’m starting to lose interest in everything.” \n\nand after i said that, he didn’t answer. as a follow up message, i said \n\n“i’m taking this radio silence as a strong sign. and i don’t want to hear some excuse like “sorry i forgot to respond” or “i could’ve sworn i responded”. originally i had a way bitchier intro to this message, but that’s not me. all the times you said that you cared about me, i knew they were all lies. i knew i should’ve listened to my gut the entire time. i really really really wish i wouldn’t have responded to that one message in february of 2023. i feel like all of our friendship has been is me constantly doing shit to be such an amazing friend for you, but you NEVER returned the favor and i’m sick and tired of it. i made you all those bracelets, i made that painting for you, i always checked up on you, i sent you a heartfelt message on your birthday, but did you ever do anything like that for me? sorry for doing so much for people and expecting something small back. every single one of my friendships ends like this. all you’ve ever done is just constantly lie to me, and i bet you think that i just haven’t noticed. “cooking dinner till 11pm, going home because you have a headache, immediately passing out when you go to bed, i’ll try my best to respond to you” any of these sound familiar? i’m so tired of how horrible of a person you’ve been towards me. i try my absolute hardest for you. i’ve gotten out of bed, eaten, kept my grades up, tried to take care of myself, picked myself up off the ground, and smiled just for you. maybe i’m just too generous, loyal, compassionate, empathetic, and sympathetic as a person. i genuinely don’t know why you still talk to me or why i still talk to you. i’ve given our friendship so many “second chances” but this is my breaking point. i’m so fucking sick and tired of everything. i really hope that when i do end up taking my own life that not a single tear falls from either one of your eyes. i always wanted to tell you that i’d make the sky so pretty and orange for you, but i don’t want to do that anymore.” \n\nnotice how i didn’t even mention my feelings for him in that message once. now that we aren’t talking, i don’t know what to do with myself anymore. i’ve grown so attached to this man and i don’t know what to do without him. he has been my rock ever since we met. he was all i had and now i have absolutely nobody. i’ve been lonely my entire life, and i would say that it got worse when i started having feelings for him. but now that he’s gone, my loneliness is ten times worse. i am seconds away from writing my notes and saying goodbye. i am so picky with who i want to be with. if they aren’t aligning with what i want to do in my future, i won’t be happy with them long term. i don’t date just for fun, i date to marry. the reason i grew so attached to steve was because he aligned with my future. i’m so alone and empty with him gone and i feel like it would be a better place if i said my goodbyes. i don’t want the space if that’s what he’s giving me. i unfollowed him on everything, but i haven’t blocked him. i just don’t want to keep going if it means that i’m not friends with him anymore.",
    "subreddit": "TrueOffMyChest",
    "title": "my friend left me and i don’t know what to do with myself anymore.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3pwgn/my_friend_left_me_and_i_dont_know_what_to_do_with/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 00:12:03 UTC",
    "id": "1j3puzv",
    "link_flair_text": null,
    "media": null,
    "num_comments": 9,
    "score": 0,
    "secure_media": null,
    "selftext": "OK, so this is kind of a clusterfuck and I need to get it all out there, so here goes:\n\nFor the past... probably over a year at this point, I've been chatting to ChatGPT every now and then, at least once a week. I've been kinda treating it as like a diary that talks back; I don't input too much personal info or anything like that but, if I'm worried or stressed about something that I don't wanna burden the people in my life with, or if I have something I'm thinking about and am interested to see how an AI might respond to it, then I'll just open ChatGPT and vent. \n\nEvery now and then, I'll get a \"Memory Updated\" notification where it's randomly decided something I've said is worth remembering for future conversations and, over the past year, this has built up a fair amount, especially about likes, dislikes, fears, and that kinda thing. It's an interesting feature, and it sometimes makes conversations more relevant or stops me having to go over old things, and so I mostly just leave it as it is.\n\nRecently, I saw a trend where people were asking ChatGPT to suggest something that the user doesn't know about themselves based on everything in ChatGPT's memory about them. From what I've seen, it tries to be insightful; sometimes it is quite helpful, other times it is kinda brutal, but overall it's usually pretty interesting in one way or another, and so I decided to give it a try. I asked it, based on everything it's learned about me over the course of our conversations, what is something that it thinks I might not know about myself that might be beneficial for me to know.\n\nAs you can tell from the title of this post, its response was that I should probably get tested for autism.\n\nI wasn't really sure how to respond to that; I don't really know what I was expecting but it was definitely a lot more targeted and specific than the posts I'd seen of other people asking ChatGPT similar questions. I asked it to clarify and it brought up things that it had noted about being kind of picky about what I consume, stuff about regrets/worries related to \"normal\" social situations, fixations on random things, and a few other things that it said \"was indicative of autism\". It also reminded me that it wasn't a medical professional, which I thought was a very interesting thing to include after suggesting that I might have autism.\n\nAnyway, I kinda put it to the back of my mind and then, later that evening, I joined a voice chat with a few of my online friends that I play online games with and, after a while, I kinda brought up with them what ChatGPT had said. Their initial reaction was to laugh, which I thought meant that they thought what the AI had said was wrong, but then they said words to the effect of: \"With how much you talk to ChatGPT, I'm surprised you hadn't already told it that you're autistic.\" I then said that I wasn't autistic (by which I meant I didn't have a formal diagnosis of autism and, until this point, didn't really consider myself to be autistic), and things got kinda awkward.\n\nAnyway, I just took the AQ-50 and got a score of 36, which came with the message \"Scores in the 33-50 range indicate significant Autistic traits (Autism)\", so I guess there's a fair chance that I'm autistic, and that, somehow, I'm the last person to know about it.\n\nI dunno how I'm supposed to feel about this, or what I'm mean to do with this information. I'm a guy and in my early 30s, so it feels kinda late to get a diagnosis with something like this -- and, even if I did get a diagnosis, I don't know what it would change for me. ",
    "subreddit": "TrueOffMyChest",
    "title": "ChatGPT suggested I might have autism. Told my friends; they were surprised that I wasn't already diagnosed with autism...?",
    "upvote_ratio": 0.36,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3puzv/chatgpt_suggested_i_might_have_autism_told_my/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-05 00:11:11 UTC",
    "id": "1j3pubp",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "I have 12 college credits in college but my mom and everyone acts like an unemployed weirdo when I've applied to hundreds of places got one temp job and one job that overhired basically laid me off with 0 hours, my mom acts like I'm the most lazy fucker in the world obviously not saying it that bluntly but I just don't know if she's wrong I have 330 applications (345 when accounting for every mcdonalds I applied to within a 10 miles which were either full and can't give interviews or that one chance where its two rounds of interviews because we're Harvard now)  and no real job and just can't do this I cry about hating myself and then I get angry at my mom behind her back for thinking I'm lazy for being a student for realizing this wasn't a comically abnormal  immoral thing and more an economic thing. God, I just want to rot. I had a job for 13 months and it destroyed me and my personality and I hate that I didn't have the stamina to do it but I was still lazy even then to her",
    "subreddit": "TrueOffMyChest",
    "title": "I'm kind of a neet despite trying",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3pubp/im_kind_of_a_neet_despite_trying/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 23:59:14 UTC",
    "id": "1j3pkvs",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "This is a throwaway\n\nI'm a recluse with lack of social skills and courage to just put myself out there, I get really anxious of the bad things that could possibly happen, and that happens in mundane situations too, the worst part is that most often I'll worry so much about a thing, then it just ends up being nothing, and I realize the worry was for nothing.\n\nMy relationship with my parents isn't great either, I am 21 and still living with them, but I don't talk to them very much, most things I keep to myself, then I spend most of my time on my computer, wanting to create things, such as YouTube videos, art, music, coding, and I do all these things to some extent, but really I just spend most of my time on YouTube or wasting time in general, so really I would like to spend more of my time going outside, simply walking somewhere would be good enough for me, but I always find ways to convince myself not to, or just forget it's an option at all. Now thing is, I'd at least tell my parents about the things I make, but even that I started to keep to myself because I find myself getting really self aware about every single aspect of what I make, this mostly goes for YouTube videos, it feels almost too personal to share with them, so the few times I showed them my videos I just got extremely self aware of every video idea and everything I wrote for the script, I kind of just remained paralyzed and stopped making any videos, then went to upload on a different channel they don't know of.\n\nI also know this girl I met on discord 5 years ago, and I would like to meet her and be together with her, and I let her know this almost from the very beginning, but I've made a mistake by making empty promises and saying we would meet very soon, well that soon just kept getting delayed until now and she's getting tired of waiting and I feel really bad too, she really wants us to meet and I do too, she lives in an abusive household that I want to get her out of, but I can't seem to start taking the steps, I'm afraid of telling about her to my parents because they might judge me, but realistically they'd be alright with it, it's just my stupid mind making all sorts of excuses, I don't know what to do, even now I have a job my dad gave to me, but if it wasn't for him, I would've still been unemployed, I never had a job besides for this one.\n\nIdk where I'm going with this post, just wanted to vent a bunch of things I guess, how could I move forward?\n\nEdit: For some clarification my parents are not abusive at all, they're actually very good parents, and yet for some reason I grew so distant towards them",
    "subreddit": "TrueOffMyChest",
    "title": "My mind keeps me stuck in life and I hate it",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3pkvs/my_mind_keeps_me_stuck_in_life_and_i_hate_it/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 23:58:09 UTC",
    "id": "1j3pk0v",
    "link_flair_text": null,
    "media": null,
    "num_comments": 228,
    "score": 1237,
    "secure_media": null,
    "selftext": "I’m 14f and my boyfriend’s 14m, both still MINORS right? So, we’re in art class having a “glue fight,” when we were finished we went into a storage room (that’s combined with the classroom) to wash our hands. While drying my hands off, he grabs my sweatshirt. Cool, okay, maybe there’s  some glue got on it. But no? He pulls my sweatshirt towards him and makes eye contact with me, while i’m standing there confused, because he’s grabbing my sweatshirt for no reason. Suddenly, he yanks it up, grabs my bra and yanks it up too so the girls spill out, squeezes them all in one motion, and proceeds to say “ha, i finally got to see them,” before walking out of the storage room. I’m standing there, because what  just happened? Why is the door open fully? Why didn’t he ask me for permission?\n First of all, we’re MINORS, why is he touching me THERE? Secondly, we’ve had multiple talks about me not caring or having any inclusion with his obsession with my “squishy squashies.” Yes, he calls them my “squishy squashies.” MY SQUISHY SQUASHIES?! Anyway, he told me he would stop mentioning it or sending my weird videos of him begging to see, touch, squeeze, and any of the sort to my “squishy squashies.” Which yeah, we’re kids, please don’t ever mention my girls, especially since we’ve had that talk several of times. But now I just feel really sick with a headache, because how could the sweetest boy ever take advantage of me like that? \n\nI don’t even know if this counts as SA, and I don’t wanna tell anyone so drama doesn’t start.",
    "subreddit": "TrueOffMyChest",
    "title": "Is this considered SA? Or am I overreacting over something stupid?",
    "upvote_ratio": 0.9,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3pk0v/is_this_considered_sa_or_am_i_overreacting_over/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 23:57:24 UTC",
    "id": "1j3pjf5",
    "link_flair_text": null,
    "media": null,
    "num_comments": 13,
    "score": 0,
    "secure_media": null,
    "selftext": "I'm 13 nearly 14  my body count is 5 my girlfreind 13 her body count Is 13, we have not been together for a long time but I have fingerd her twice and kissed her but today she told me that a while ago she got a STI and they thought it was herpes she said that she tested negative for all STIS but the doctor said it definitely looked like herpes this was about a year ago i did a Google search and fount out that herpes can't be cured I'm absaloute sitting myself i want to get a test but at the same time I don't, I've always been anxious about getting a STI and this made it worse even if I choose to get a test I'd need to tell my mum (no dad in the picture) and I don't think I could tell her",
    "subreddit": "TrueOffMyChest",
    "title": "I need help and idk what to do(13M)",
    "upvote_ratio": 0.14,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3pjf5/i_need_help_and_idk_what_to_do13m/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 23:54:09 UTC",
    "id": "1j3pgv6",
    "link_flair_text": "CONTENT WARNING: ANIMAL ABUSE",
    "media": null,
    "num_comments": 3,
    "score": 1,
    "secure_media": null,
    "selftext": "I'm 16f now, but when I was 13 I was so sexually frustrated- I was online ALOT and exposed to a ton of sexual content (which was why I was so frustrated). I had nobody and did not know how to masturbate at the time and thought the only way to feel any form of pleasure would have to be from my dog. *I NEVER DID ANYTHING WITH HIM* however I TRIED to and I feel disgusting. I used to bring him into my room while I was wearing underwear just to see what he would do (which was nothing) and would try to scratch around his belly so that he'd get an erection (which never happened). This phase lasted only a week or so before I realized it was gross, abusive, and that it wasn't something I GENUINELY thought through or wanted to do (hormonal brain wasn't thinking properly at all, I didn't even consider how horrible it was or how much I would inevitably regret it if i were to go through with it). I did not have and still dont have any attraction to animals, I just desperately craved sexual intimacy at the time. I feel gross and for some reason the memory popped back into my head today while I was in class and I feel like a freak. I'm scared what my family or friends or girlfriend would do if they learned about my past. I know I've grown since then and that it's not like I did anything like, AWFUL to the dog, but it still feels weird to have the memory in the first place. Sorry if this post is weird, I just need to get it off my chest to feel better.",
    "subreddit": "TrueOffMyChest",
    "title": "i feel like a zoophile for my behavior when i was 13",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3pgv6/i_feel_like_a_zoophile_for_my_behavior_when_i_was/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 23:42:24 UTC",
    "id": "1j3p7rc",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "Fighting off a depression spiral as I type this, it'll probably be pretty a disjointed post with how my mind is jumping around, sorry.\n\nI'm so...frustrated, exhausted, and beaten down with how my brain has and continues to affect my life.  I'm in my late thirties, ADHD, likely autistic (have taken the RADS-R several times and got the same results repeatedly, but medically undiagnosed as of yet), have anxiety, depression.  Y'know, the classic millennial brain juiceless cocktail.\n\nThe trigger isn't even that big of a deal in the grand scheme, just finally built up the willpower to break through all my mental blocks to ask out a girl I've been talking with, but before I could she mentioned to someone else that she was on a date last night that went pretty well.  Honestly, not a big deal, I'm happy being friends with her.  It's more that this scenario is representative of the cycle that governs my life.\n\nI have many, many things I can and need to work on in my life; finances, weight, tidiness, love life, etc, etc, etc.  The problem is I keep tumbling through the same cycle of depression &gt; get some inspiration &gt; start feeling pretty good &gt; do one thing AND/OR get some sort of discouragement &gt; retreat back into depression.  It physically hurts my chest thinking about it as I type.\n\nI just feel like I can never get ahead, and all my issues, material and mental, are in such a tangled web that whenever I make any progress I just find more knots and I retreat again.\n\nI know I had more thoughts floating around but I can't reach them anymore and typing this is putting me on the verge of tears so I think I'm gonna stop.  Thanks guys",
    "subreddit": "TrueOffMyChest",
    "title": "Spinning the wheels",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3p7rc/spinning_the_wheels/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 23:33:28 UTC",
    "id": "1j3p0ny",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "I 19m have been friends with let's call him Kyle(18) for about 3 years now. We met when he joined my tennis club after moving to my area and we kinda clicked right away. Since then we have had a friendship/rivalry, friendship off the court and rivalry on the court. Now here's when my problems started. The other day we were doing a training day and spent the day together and it was just us too and suddenly when we took a break it hit me like a train. We were joking and laughing and I suddenly just looked at him and was stunned by his looks and personality in such a different way then I'd ever seen him before, he could probably see the sudden panick just rush onto my face and now he's all I can think about. Now I don't know if I was just seeing what I wanted to see but I felt like he was sending me vibes that he could be interested in me too. I don't really know what I'm gonna do now because I could tell him and be eternaly happy if he feels the same or just through away 3 years of friendship( just for some context he knows I'm gay and doesn't care or mention it unless I'm talking About someone I'm interested in). So reddit any advice for me????",
    "subreddit": "TrueOffMyChest",
    "title": "Ive developed feelings for a friend (He's straight) Help!!!",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3p0ny/ive_developed_feelings_for_a_friend_hes_straight/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 23:32:21 UTC",
    "id": "1j3ozsn",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 1,
    "secure_media": null,
    "selftext": "Below is an excerpt of my story about my \"coming out\" process and how I was baptized to save myself from my sins of homophobia. A link to the full story can be found [here](https://medium.com/@brianmragan/a-former-homophobes-guide-to-pride-cfce2fb6848d)\n\n**A Former Homophobe’s Guide to Pride**\n\nYes, the title is clickbait, but it will be worth the read and maybe you even get a few laughs from it.\n\nOnce upon a time, I was homophobic. At a young age I knew that my brother’s “homosexual tendencies” – a euphemism that might be more familiar to some than others – was going to be problematic given my family’s and my own worldview. My worldview believed that A) he could change because homosexuality is a choice; B) if he acted upon his sexuality it was a sin (“love the sinner, hate the sin”). This worldview allowed our family to isolate ourselves from the truth about the core nature of at least 10% of the population, including one of our own flesh and blood.\n\n...\n\nOne day, we were hanging out at a reggae-themed party with a buffet of cannabis infused edibles and libations. He hadn’t had much exposure to cannabis so as I watched him eat about three brownies and a glass of THC lemonade, I grew a tad concerned. I failed to stop him from eating that third sorcerous pastry and the situation soon turned to the classic “I don’t feel anything, these edibles ain’t shit,” then “holy shit, what have I done.” Having been there before myself, more times than one should after such an uncomfortable lesson, I grabbed the reigns and became his spiritual guide or “trip advisor.” \n\nI took him on a walk away from the crowds and instructed him to look at the stars. He would bounce between “they look like Lite-Brites, remember Lite-Brites Brian? I loooooooved Lite-Brites!” then to “what if we only die because we accept that we die, oh my god we are all going to die!” Whenever we got to the latter half of these dopamine-infused thought obsessions, I would coach him to focus on different topics, like back to the Lite-Brites or the beautiful design of a parasol and why aren’t parasols popular anymore (he loved umbrellas as a kid). \n\nEventually, and what probably felt to him like an eternity, we got to the point where we could coherently talk about deeper subjects such as our upbringing. We talked about when we first started jerking off, how we would hide our porn downloads from Kazaa, how one time I was looking for my downloads and I stumbled upon a very different type of porn than mine. In a single night, we tackled topics that are typically done over years of bonding moments between brothers who share the same sexual orientation. We were both blown away that we had never talked about this stuff, we had so much in common but with a slightly different hue to our stories of puberty. That night will go down as one of the greatest moments of bonding and connection I’ve ever experienced. I’ll cherish it for the rest of my life. \n\n...\n\nOne day, while visiting my brother, he asked me if I wanted to go to Gay Bro Dinner Party. I asked him what Gay Bro Dinner Party was and he simply laughed and said “I can’t believe I’m taking you to this.” Well, Gay Bro Dinner Party is a dinner party with Gay Bro friends much like a BBQ or dinner with Straight Bro friends. The conversations that go on at both of these dude parties are exactly what you would expect but more talk about cocks, balls, and asses — actually that’s not true, the frequency of these topics at Straight Bro Dinner party is equal to that at Gay Bro Dinner Party….but the context is slightly different….kind of…again, we are all just a little bit gay deep down inside. \n\nWhen I arrived at the party, his friends immediately said “you brought a straight person to Gay Bro Dinner Party!? What were you thinking!?” In hindsight, I think it was their way of warning me that they weren’t going to tone-down the banter and the thematic schema that goes on at Gay Bro Dinner Party would remain the same. They were going to thoroughly enjoy watching me crawl in my skin. In fact, in my first effort of small talk I asked the bros how they all knew my brother, and they responded in bro-fashion, “at a gang bang.” I gave a nervous laugh, doing mental gymnastics to figure out if this was a joke. I decided to just roll with it and pray they weren’t testing how committed I was to \"being open-minded.\" And with that icebreaker I signaled to them with my nervous laughter, not knowing whether this was a true story or a joke, that I was one of the cool straight guys they could trust. Looking back, I’m pretty sure they were joking, I think, I mean that’s something I would say to someone clearly on a journey to rectify their former antediluvian worldview. But I digress.\n\n...\n\nFor the full story you can visit this link [https://medium.com/@brianmragan/a-former-homophobes-guide-to-pride-cfce2fb6848d](https://medium.com/@brianmragan/a-former-homophobes-guide-to-pride-cfce2fb6848d)",
    "subreddit": "TrueOffMyChest",
    "title": "A Former Homophobe's Guide to Pride",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3ozsn/a_former_homophobes_guide_to_pride/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 23:13:46 UTC",
    "id": "1j3okoo",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 5,
    "score": 103,
    "secure_media": null,
    "selftext": "My friend died last year. He was only in his 20s. We were out on a ride, and he had been asking me for a while to get some footage of him in a certain spot. He wanted to see how he looked on the bike. I finally brought my camera, and we went for a day trip.\n\nI recorded his last ride. I didn’t know it at the time, obviously. We stopped for gas, and my camera was almost dead, so I put it away. Not even ten minutes later, he crashed. He died on the scene.\n\nHe never got to see the footage. He was so excited about it. I still have it, and I don’t know what to do with it. I finally sat down and watched them. I don’t even know why. I guess I just needed to. I don’t know if I should send them to his (ex) girlfriend or his best friend or just keep them. I don’t even know if I want to share them.\n\nIt’s just been sitting there all this time. Just like that day. Like time stopped for a second and then kept going without him.",
    "subreddit": "TrueOffMyChest",
    "title": "I have the last ride video of my friend who died in front of me.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3okoo/i_have_the_last_ride_video_of_my_friend_who_died/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 22:49:32 UTC",
    "id": "1j3o0z9",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 6,
    "secure_media": null,
    "selftext": "Hello reddit, here is something that grinds my gears.  \nWhy do so many self-help gurus push the idea that every fun thing in life is an addiction that needs to be cut out? Stop playing video games, they’ll make you addicted. Stop drinking, it’ll ruin your life. Stop doing this, stop doing that. And then, as if that’s not enough, they push this pseudo-stoic mindset of “just focus on yourself” and “become the best version of yourself,” whatever that even means.\n\nIt all feels incredibly narrow-minded and, honestly, kind of boring. These people act like the only thing that matters is self-improvement and constant progress. But what if I don’t *want* that? What if I just want to be me? What if I just want to relax and enjoy life? Life is already hard enough as it is, and it feels like these gurus prey on people's insecurities—especially those who are struggling—and make them believe that the things they love are actually holding them back.\n\nThere’s this obsession with “self-improvement” that often feels less about genuine growth and more about selling an idealized, almost robotic version of existence. It’s weird because it’s marketed as *freedom*—“become the best version of yourself!”—but it actually sounds more like a prison of constant self-discipline. Like, what’s the point if you can’t just *exist* without feeling guilty for not grinding 24/7?\n\nTake guys like Andrew Huberman, for example. Sure, he knows his neuroscience, but does he *really* have life all figured out? Because the way they present themselves, you'd think they had unlocked some secret formula to existence. But to me, it just seems sad. Humans are so obsessed with being ultra-efficient that they forget we only have a short time on this planet. And after that? A whole lot of nothing. So why not enjoy the things that make life meaningful instead of obsessing over sacrificing everything in the name of self-discipline?\n\nI get that addiction is real, and obviously, some habits can be destructive. But what’s the point of living if you can’t just enjoy things sometimes? Why does everything have to be about optimizing every aspect of yourself? I think it’s okay to make sacrifices *when they actually make sense*, but it’s also okay to say, “Screw it, I just want to enjoy myself.”\n\nI don’t know—this mindset just annoys me. Anyone else feel the same way?",
    "subreddit": "TrueOffMyChest",
    "title": "Self-help culture is built on guilt, not actual happiness.",
    "upvote_ratio": 0.88,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3o0z9/selfhelp_culture_is_built_on_guilt_not_actual/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 22:46:43 UTC",
    "id": "1j3nymy",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "What are the thoughts plaguing my mind today?\n\t• Should I continue with that book.. One day it sounds good... others I sound like those stupid Wattpad romance books that make me cringe harder than your local creep\n\t• SOOOO I DID A THING YESTERDAY...\n\t\t○ I SOMEHOW STARTED WRITING A BOOK!\n\t\t○ The other night I am lying in bed falling asleep when all of a sudden I have this visceral need to write a book. These thoughts an images come to me about this potential book, and the feeling of writing it. I imagined myself sitting at my computer for hours typing away, pouring my heart out in this book based on me the person I wish I was and all of my pissed off thoughts I wish I could say\n\t• Then as I sit down to write the book I try to come up with the characters name or the plot a nothing, nada!! \n\t• I thought about writing what I've been feeling, but let's be honest if I put those thoughts onto paper... I'd literally be hauled away in a straight jacket like the early 2000's movies\n\t• I'm thinking I want to take the book in the direction of a billionaire or mafia, but I am leaning towards billionaire dark romance... although I have no idea what the hell that even means. I guess I'll just start writing what I think I would want to read as a writer and just go from there. AT THE END OF EVERY CHAPTER I WILL RE-READ N MAKE CORRECTIONS AND ADD ANY ADDITIONAL INFORMATION.\n\t• I need someone to talk to about this stuff but my friendship with bestie always seems one-sided... me always texting first. Only time we speak is when I call her.. If no we don't speak at all. \n\t• STARTING TODAY, I YOUR LOCAL WANNABE, WILL NOT REACH OUT FIRST TO MY \"BEST FRIEND\" FIRST 03/04/2025.\n\t• Since I can't go to bestie with this.. Who can I go to? I am not close enough to share this with anyone... I can't see a therapist (again refer to point 4 as to why), so I guess I am stuck here typing to myself\n\t\t○ I wonder if people do vlogs anymore\n\t\t○ If they did would anyone to hear the highest of highs I go through\n\t\t○ Or the unbelievable suffering I feel most days just dreaming of falling asleep and not waking up. However, I can't leave son all alone along especially not with my mother, and I can't take fathom taking him with me\nSoooo I am stuck trying to claw my way out from wanting death to living the life I want. ",
    "subreddit": "TrueOffMyChest",
    "title": "YOUR LOCAL DEPRESSED WANNABE",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3nymy/your_local_depressed_wannabe/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 22:30:24 UTC",
    "id": "1j3nkuu",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 6,
    "secure_media": null,
    "selftext": "If only I had the ability to save better, work harder, then maybe I would be able to keep my apartment, but now I have to move back on with my parents and my friend will be out on the street because his dad, his only living relative in the COUNTRY said he can’t move back in with him because of some petty reason. I want to help but there is nothing I can do at all. F my life right now",
    "subreddit": "TrueOffMyChest",
    "title": "My friend is going to be homeless and there nothing I can do to help",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3nkuu/my_friend_is_going_to_be_homeless_and_there/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 22:30:04 UTC",
    "id": "1j3nkk9",
    "link_flair_text": null,
    "media": null,
    "num_comments": 98,
    "score": 56,
    "secure_media": null,
    "selftext": "Some people think I should have already stopped playing video games. I’m turning 29 this year so I mean, really I should be doing more adult things. \n\nVideo games became the highlight of my days in my late teens and early twenties. I got to connect with people during a really shitty time in my life which culminated in me meeting my SO and many of my friends. \n\nI know that one day I won’t be able to game anymore. I’ve been thinking about that day a lot recently while I play my favorite MMO Final Fantasy 14. I have over 13K hours poured into the game according to Steam. \n\nMy boyfriend and I never want children, this decision is reinforced by his vasectomy. We plan to get married and live our quiet lives together with whatever pets we choose. We game together as well. \n\nI guess I’m sort of pre-grieving the loss of my beloved character. One day, I simply won’t log in anymore. I won’t hop into voice calls on Discord. I simply won’t be. \n\nMortality is a beautiful and hard thing to deal with. \n\nEDIT: Sorry, I don’t think my point came across clearly! \n\nI meant that one day I won’t have a choice in the matter. I’ll be gaming until the day I can’t anymore! \n\nI’ve just been thinking about the day that I physically won’t be able to anymore. My apologies for not making that more clear. ",
    "subreddit": "TrueOffMyChest",
    "title": "I’m worried about the day I won’t be able to game anymore",
    "upvote_ratio": 0.87,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3nkk9/im_worried_about_the_day_i_wont_be_able_to_game/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 22:27:35 UTC",
    "id": "1j3niiq",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "You know when you introduce one of your friends to another one and they become almost too good of friends that you feel left out?\nIt's almost like you lose 2 friends at once but you feel selfish because they're both still your friends.\n\nI introduced my 2 best friends to eachother, one of them I've spent most of my life with and the other a good chunk of it. So I introduced them to eachother and we started hanging out. \n\nI feel as if they've bonded over being the same gender and it feels bad man. It'll be the smallest thing like \"I'll tell you later, OP is here\" and the vibing atmosphere will immediately disintegrate for me. Sometimes they talk about things when we're all together but theyll never talk about that stuff when it's just me and one of them.\n\nI don't know what to do because one perfectly fine sentence for them will destroy me inside every now and again but I don't want to bring it up because then I'll have to justify my feelings and I feel selfish to be honest.\n\nI don't want them to think I'm selfish or anything.",
    "subreddit": "TrueOffMyChest",
    "title": "Am I selfish?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3niiq/am_i_selfish/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 22:16:58 UTC",
    "id": "1j3n9k4",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 4,
    "secure_media": null,
    "selftext": "Throwaway cuz I don't really use Reddit, but I've been feeling particularly guilty about this and wanted to get it out there. A bit of context, this winter has been rather challenging to say the least. I have struggled with mental health issues related to major life changes, as well as complications in relationships and friendships. All this to say, I've been having a rough time, but I've been trying to manage and for the most part have been getting better, albeit there are still some harder times. With that established, back to the main story. I am in a D&amp;D group of eight people, all in our early twenties. Scheduling, as I'm sure many of you can imagine, can be a bit difficult. This past weekend, we managed to find a time that worked for enough people so that someone in the group could run a one-shot. He has put a good amount of time into preparing for it and seemed very excited. We had chosen Sunday as the day to get together. That Saturday, I had planned to travel out of town for a day trip to visit family. While I was there, I started to struggle quite a bit. Like I said, it happens sometimes where certain days are harder than others, and Saturday, it hit hard. I felt as though all my motivation to do anything had disappeared, and I just wanted to crawl into bed and sob for a while. I obviously couldn't do that on the spot, and forced myself to power through, trying to have as good of a time as I can with my family. Here is where I did something I feel immensely guilty for. I decided to message in the D&amp;D group's discord, saying that something came up and I wouldn't be able to make the session. Really, I knew I just wanted to take the day to myself as I knew with the way I was feeling, I most likely would not be engaged or having fun during the session, and flat out just didn't want to be there while feeling like that. Shortly thereafter, the person running the session decided to cancel, moving it to this next weekend. Some of those in the group responded to my cancellation message with little angry emojis. I also was contacted by the partner of the person who was running the session. They asked what happened and mentioned the prospective DM was upset that I had cancelled. I said my family decided to extend the daytrip throughout the whole weekend and I couldn't get away. This was a lie, of course, but I felt like I would seem weak if I had said \"yeah I'm just feeling too depressed to play D&amp;D this weekend\" and I thought a more concrete excuse would be more easily accepted. Since then, I have felt very guilty for this. I understand why people would be disappointed, they have every right to be, and I really did not mean to hurt or upset anyone. I just know I would have had an unpleasant time during the session, and really did not want to be there feeling how I was. I know this isn't exactly the most exciting story, but I just felt like I needed to get it off my chest, its been eating at me so hopefully saying this out loud, so to speak, will help me feel a bit better. ",
    "subreddit": "TrueOffMyChest",
    "title": "I feel guilty for getting a D&amp;D session cancelled",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3n9k4/i_feel_guilty_for_getting_a_dd_session_cancelled/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 21:44:45 UTC",
    "id": "1j3mhou",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "i have currently been approved for residency on another country, i am a minor so i would have to move with my mom who, obviously, lives there. i have a boyfriend and have been together for around 8 months.\n\nthe problem is, he does not want me to leave. yesterday i told him about my residency status and he started crying inconsolably, telling me to stay, to not leave, to tell my family i do not want to leave, etc. i really dont know what to do in this situation, i feel very guilty.\n\nhe has been depressed since the day i told him and all he talks about is that subject, even if i tell him to drop it he just goes back to talking about it and repeating the same thing. i honestly feel quite helpless and exhausted. obviously i can't just not go, this has literally been talked about in my family for years. please tell me what i could do. ",
    "subreddit": "TrueOffMyChest",
    "title": "conflicting choices.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3mhou/conflicting_choices/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 21:29:26 UTC",
    "id": "1j3m4fp",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 0,
    "secure_media": null,
    "selftext": "(all names are changed).\n\nMy best friend of my whole life, Jay (22F) is hooking up with my girlfriend Alexandra (23F) of 2 years. They were friends before we got together, that's how we met, but as we our relationship got more serious, they seemed to be spending more time together. Having a girl best friend is kind of a turn off for some people, I get that, so I  was overjoyed when she and my girlfriend got a long so well, and it was easy to excuse all the time they were spending together because they might've been just ranting about me or like shopping or getting their nails done. \n\nIt started to get fishy once they decided to go on a \"girls trip\" together. To Paris. Alexandra and I had been planning on going there forever because of a jellycat store there, and now she's going with Jay?! Like what? I mean Paris is more of a romantic getaway I feel like. \n\nI gave them both a massive sideye when they said that, but I have some people pleasing tendencies so I didn't speak up about it until I saw the instagram post.\n\nThey were holding hands. Feeding each other croissants, and got each other jellycats! So, I called alexandra and was like WTF jellycats are our thing! esp because i was so excited to go and she doesn't want to go with me anymore :(\n\nThat's when I found out. She was drunk, and had answered the facetime, and guess who was in bed with her - unclothed. JAY!\n\nJay was just like \"friends share\", food, not girls!\n\nI don't know whether to enter into the throuple or dump them both. 🙏",
    "subreddit": "TrueOffMyChest",
    "title": "My Best friend (22F) is hooking up with my girlfriend (23F)",
    "upvote_ratio": 0.27,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3m4fp/my_best_friend_22f_is_hooking_up_with_my/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 21:25:52 UTC",
    "id": "1j3m1c0",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 0,
    "secure_media": null,
    "selftext": "So let me (F19) start this off by saying my boyfriend (M22) is most likely autistic, and also very socially awkward. He doesn’t have any irl friends and pretty much only talks to me and his mum.\n\nHis mum is an alcoholic, and a lot of the time they fight because she’s drinking and he has to raise his voice and be stern to get any point across. He hates that he has to and does try to talk to her normally. I understand this. However, he does kinda do it towards me too.\n\nI mentioned he’s most likely autistic (I am autistic, so he could entirely not be I just think he is as well) and this very much presents in the way he gets irritated/overwhelmed/upset when he doesn’t understand something or something doesn’t have a logical answer or fit the logical answer he has in his head. I put up with this because I understand getting frustrated when things aren’t “how they should be” but last night I really just couldn’t handle it.\n\nWe got into a stupid disagreement over a movie he wanted to show me, because he likes the perspective it’s shot in. He asked if I knew what he meant and I said yes I just couldn’t articulate it out loud. I do have a problem with that where I can know the answer to something but the more someone prods at me to say it, it ends up just completely leaving my mind and it makes me feel stupid. He asked if I just said that because I didn’t know but didn’t want to sound dumb, and i explained the above point and told him I learned perspectives in drama class.\n\nNow this is not the first time I’ve mentioned to him that I had to learn basic cinematography in two of the 4 years I took drama in high school, but he either forgot or just got too in his head where he was making me seem stupid and he kept saying things along the lines of “drama is acting. Cinematography is filming. They’re different.” I even tried to remind him multiple times about the fact I needed to know it for class but I kept getting interrupted (which annoyed me since he gets so aggravated if anyone interrupts him and says interruptions only lead to arguments) until he finally just pretty much said the point I had been saying and ended it with him yet again reminding me drama isn’t cinematography and asking if I saw why he was getting misled.\n\nI ended up saying he needed to stop calling me stupid which at first he tried to defend because he’s never outright called me stupid (which is true) just the way he treats me occasionally makes me feel lesser, and he ended up getting upset because his defence turned into him saying he didn’t get why people always made him feel like an asshole when that’s just “how he is” and I told him this might just be the way he talks but it’s disrespectful and that’s why he feels that way. I also don’t really get this because he always says he’s changing but nobody else is and while it’s true he’s growing as a person (losing weight, got a job, gaining confidence, and setting goals) his behaviour does need work and he can’t expect everyone else (including me) to immediately change when he doesn’t like certain things but then use the excuse of “that’s just how he is.”\n\nWe ended up not talking for the rest of the night and while I do feel justified in what I’ve said I do still feel guilty for making him upset. I was kinda hoping he had work today so he wouldn’t be in a bad mood until I say something (he really likes his job and also doesn’t have a specific schedule he kinda just goes as he’s needed) but as guilty as I feel I don’t want to apologize for anything.\n",
    "subreddit": "TrueOffMyChest",
    "title": "Called out my boyfriend, feel a little guilty now",
    "upvote_ratio": 0.4,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3m1c0/called_out_my_boyfriend_feel_a_little_guilty_now/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 21:18:59 UTC",
    "id": "1j3lvi2",
    "link_flair_text": "Positive",
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "2020 COVID: Had an apartment with 2 roommates, drugs daily, struggling to survive \n2021: After a brief period of homelessness was taken in by my brothers ex’s parents and they got me started on probation (TURNED 22!!)\n2022: Things were rocky, had just gotten my girlfriend at the time pregnant only to be single while she left me for a drug dealer who she fell in love a few months later, no sweat it was a cool year (pretty sure I got arrested twice that year for the same charge)\n2023: Severe depression, didn’t know to to break away from my ex and had no real motivation for myself.. pretty sad year for me. Went to my first 3 concerts in the span of 2 months! (Post Malone, NAV, The Weeknd) wouldn’t have survived that year without my friends Kayden &amp; Tyler.\n2024: Started off the year getting arrested, was homeless for a few weeks living at a friends place who was only 19 mind you I was 23 at the time. Got a car. Wrecked it. One of my best friend’s family took me in after he spoke up for me! Went job from job, had no real pathway for myself. Started talking to my toxic first love again. Things were starting to get bleak and depressing like I was in some sick loop. \n2025: February marked the year date of me being at my friend’s for a year. It’s been just a little over now as of March 3rd. Made the commitment to myself to follow through with something that would set me and my family (that I don’t have yet) up for life. Extremely tunnel visioned toward my goal as we speak. Currently working at EcoWater to try and save so I can get my forms of ID back since I left my wallet somewhere in 2024. Things are genuinely starting to look up.. which is scary. No girlfriend. No kids. No commitments other than myself. No problems with the law as we know of other than a suspended license which I’m working toward “unsuspending”. Will keep you all updated! ",
    "subreddit": "TrueOffMyChest",
    "title": "THERE IS STILL HOPE AT 24!!",
    "upvote_ratio": 0.63,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3lvi2/there_is_still_hope_at_24/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 21:18:41 UTC",
    "id": "1j3lv7f",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 0,
    "secure_media": null,
    "selftext": "Autistic trans woman who's in the closet and has been dealing with extreme social isolation for most of my life; lost my only wholesome friendship a year ago and have been lost since. Between past trauma, social anxiety, lack of self esteem and being constantly alone, getting to live that dream queer life doesn't seem that much worth it if I've to drag myself through year after year.\n\nAs I grow older, I learn of more and more ways I am lacking.",
    "subreddit": "TrueOffMyChest",
    "title": "Isolation is killing me. (22f)",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3lv7f/isolation_is_killing_me_22f/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 20:51:27 UTC",
    "id": "1j3l7la",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 4,
    "secure_media": null,
    "selftext": "I love my wife. But she has a chronic illness. I'm so lucky that most of the caretaking she needs is of the \"call this place\" or \"do these errands\" or other things that are pretty simple. No body care, she's able to talk and move and function (at least, right now. Eventually it'll get worse and then kill her.)\n\nBut, god, I am so tired of it. I spent three hours on the phone today pursuing different government issues. Yesterday I called three different pharmacies and fielded calls from multiple medical providers. Last week I figured out how to get her airport assistance as she had to do work travel.\n\nThe biggest issue, though, is that she will not just straight up ASK me to handle things that she can't do. She hints - \"should we do this?\" \"do you think we need to handle this?\" \"maybe this a good idea?\" It's all so noncommittal. Just SAY that it needs to be done! Then I can fit it in before it's actually an issue! I wouldn't have had to do the crazy calls today if she had just TOLD ME it needed to be done! \n\nAnd then, when I DO handle something based on her hints, she says she didn't ASK me to. \"Oh, you didn't need to do that!\" I get what she intends to say - to be expressing gratitude in the roundabout Midwestern way. But I DID need to do it, because she couldn't. Just say thank you! Admit you needed me! I don't need gratitude, I need acknowledgement.\n\nYes, I've talked to her about this. Eventually, maybe, we'll go to therapy. Most days this isn't a problem - caring for her doesn't interfere with my ability to pursue a career or hobbies or friends. But the mental burden is so exhausting. I need a verbal hug.",
    "subreddit": "TrueOffMyChest",
    "title": "Caretaking Sucks",
    "upvote_ratio": 0.84,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3l7la/caretaking_sucks/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 20:45:28 UTC",
    "id": "1j3l2lo",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "Sorry for the vague language, but I had to comply with the rules.  \nI have also posted this in a other subreddit.\n\nI started going on webcam site (similar to Omegle) to help with my social anxiety and practice interacting with people. I hoped this would help me become more comfortable in social situations. Over time, I began to encounter people who were engaging in intimate or suggestive content. This caught me off guard, and I wasn’t sure how to react. I became curious about the behavior and started interacting with others who seemed to be open to these types of discussions.\n\nOne day, I was matched with a person who mentioned that they were looking for an intimate conversation. I felt curious. Later, I was matched with someone who was revealing more of their body on camera. I asked, \"Is this real?\" and she replied, \"Yes, this is real.\" I asked, \"Can you show me more?\" She said, \"No, what the heck. I'm not going to do that!\" and skipped.\n\nSoon after, I discovered an adult website with private one-on-one chats and began talking to women with intimate intent. I started asking them to reveal more, and some did without hesitation. Afterward, I went and did the deed to the imagination of what I saw.  \nShortly after, I suddenly worried: *What if they were underage?* I got extremely concerned and wanted to find them again, but I had no way of doing so. I initially thought that if people were engaging in these kinds of interactions, they must be adults.\n\nI investigated the website and found out that they verify users’ ages with ID. I returned to the platform and began asking women how old they were. They all told me they were over 18. I reported the site to local authorities, expressing concerns about potential illegal activity, although I didn’t have solid proof. The authorities investigated the site and found no evidence of any wrongdoing. Interpol did an investigation on the site, and found no evidence of wrongdoing either.\n\nThe anxiety grew worse, and I seriously considered reporting myself to the police in hopes that they could investigate and determine whether I had interacted with anyone underage. I also began questioning whether I had at any point unknowingly gotten exposed to minors in that way. I began taking SSRI’s and anti anxiety meds to manage my anxiety and started therapy.\n\nWhen I felt better, I returned to the site (the one that is similar to Omegle) again to engage with people. Shorty after I was again matched with people who were wanting to have suggestive conversation and revealing more of their body (both men and women). I initially skipped, but got curious and felt excited again.I promised myself that I would never ask anyone to do anything, and if I had any suspicion that someone might be lying about their age, I would immediately skip them.\n\nEventually, I was matched with someone whose video was black, but they seemed to be suggesting that kind of behavior with emojis. I asked them how old they were, and they responded, “15.” I immediately skipped. I got matched with someone after. She had her torso visible, and then she lifted her shirt, exposing part of her body. I asked, “How old are you?” but she skipped me immediately.\n\nI was left feeling distressed - I was using the site without clear age verification, hoping to meet people who were showing intimate content, while also being aware of the risk that there could be someone underage experimenting. \n\nThe next day, I reached out to a sex counselor and confided in her about my concerns. I started crying on the phone, realizing that I had crossed personal boundaries in my behavior, just because I was curious.\n\nDespite this, I still find myself wondering whether any of the women I interacted with on the webcam site were underage. My anxiety continues to distort my memory, and I wonder: *What if they were 17? Or 16? Or even younger?* Sometimes, these thoughts become overwhelming, and I question whether I might have missed signs that would have indicated their true age. Someone might say, “You would have noticed if they were much younger,” but what if I didn’t??\n\nI think what is the hardest is: while struggling with this, I don't know how to reach out for help. Don't get me wrong, I brought this upon myself. How would others react to this?",
    "subreddit": "TrueOffMyChest",
    "title": "I went on web cam sites, and I still wonder if I did something wrong.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3l2lo/i_went_on_web_cam_sites_and_i_still_wonder_if_i/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 20:45:08 UTC",
    "id": "1j3l2cd",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 3,
    "secure_media": null,
    "selftext": "I don’t even know how to explain this.\nI was doing so good until January, I’m forcing myself to feel good and have nice and positive objectives and following all the good trends on the internet, because that’s what inspires me the most.\n\nI follow those seasonal trends that are useless but they make me feel nice and help me romanticize life, which feels so good sometimes.\n\nOther than that, I feel like nothing is holding me up from falling through this vortices of bad habits.\n\nI feel joy when I’m with my boyfriend, but as soon as he leaves and I’m not out and about with friends, I feel so empty, tired, sad, sometimes even terrified.\n\nI don’t know what to do, I want to build good habits but I’m not strong enough to do so. I can’t help myself.\nI can’t afford therapy, I can’t tell anyone close to me about this.\nI don’t even know what help I’m looking for.",
    "subreddit": "TrueOffMyChest",
    "title": "I’m spiraling out again",
    "upvote_ratio": 0.81,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3l2cd/im_spiraling_out_again/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 20:44:10 UTC",
    "id": "1j3l1jy",
    "link_flair_text": null,
    "media": null,
    "num_comments": 36,
    "score": 68,
    "secure_media": null,
    "selftext": "For context, my mom hates my dad (65M) with an extreme, almost irrational amount of resentment. I was never allowed to see him after their divorce, and my mom has always been abusive toward me—accusing me of trying to \"steal\" my dad from her even when I was a child. Meanwhile, she worships my brother and treats him like a king, which is common in our culture.\n\nGrowing up, my brother bullied me, but as adults, he seems to have changed—or so I thought. He encouraged me to reconnect with my dad, even telling me to sneak out to visit him, knowing full well that my mom would explode if she found out. Recently, my brother has been spending a lot of time at my dad’s restaurant (let’s call it Bo’s) because he gets free food there, and he kept inviting me to come. I resisted at first but eventually gave in because I needed a break from home, and I could actually study and eat there.\n\nBut here’s the problem: every time I go, my brother *immediately* tells my mom. He asks me to go, waits until I do, and then betrays me. The first time, he blurted it out in front of a cousin, and my mom lost it on me. I blocked him for a week but had to eventually forgive him since we still live together. I thought maybe it was a mistake.\n\nThen it happened again. This time, he acted super nice to me all weekend, made me breakfast, and even walked me to my car before we were supposed to meet at Bo’s. But then, at the last second, he bailed on me, saying he’d study at home—something he *never* does. I went to Bo’s alone, and four hours later, he called me. As soon as I picked up, my mom’s voice came through his phone, asking, “Where are you?” Before I could even lie, he said, “She’s at Bo’s.”\n\nI don’t understand why he keeps doing this. He used to hate my mom and call her crazy, but suddenly, he’s been defending her, saying she’s just \"mentally ill\" and that we should \"pray for her.\" It’s a complete 180 from how he talked about her just weeks ago.\n\nI’ve given him the benefit of the doubt because he struggles with school and responsibilities, and I suspect he may have a learning disability. But at this point, I’m not sure if he’s just naïve or if he’s actively setting me up.\n\nWhat do you think? Am I overreacting, or is this deliberate?",
    "subreddit": "TrueOffMyChest",
    "title": "My brother (32M) keeps setting me (26F) up for abuse from my mom (60sF), and I don’t know if it’s intentional.",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3l1jy/my_brother_32m_keeps_setting_me_26f_up_for_abuse/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 20:41:10 UTC",
    "id": "1j3kz2n",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 0,
    "score": 3,
    "secure_media": null,
    "selftext": "I was about a freshman when it started. I went to a school, and said school was a Christian School. But it really was anything but what you'd expect.  \n  \nI will never forget what happened in those 3 dreadful fucking years I stayed in that god damned school. They made me distrust anyone who worked in education, they made me hate anything relating to going to school.\n\nIn the span of 3 years of being suicidal and slicing my arms, they only started to give a damn when my grades went up.\n\nFreshman year, ignored. Sophomore year, ignored... Junior year? Seen, but only because my grades went up. I admit, I didn't have the best grades, I didn't get medals like my classmates, but that's not the point.\n\nIn sophomore year we had a new student... First thing they did? Announce that they should help the student, take away all the sharp objects from her. They didn't do that with me. They didn't announce jack shit. They let me hurt myself. By the end of the year my own best friend even got help. I didn't know she was struggling, we were always the outcasts. But then she got help. The principal came in on the first week my best friend didn't come to school anymore, and told everyone to make little notes that are positive addressed to each other, but in reality it was really just for my best friend. The principal told everyone to make friends with her, so they did. She was involved more, but I wasn't.... Anytime she had announcements about me it was reprimanding the other students for speaking in our mothertongue with me and not in English because: \"(NotAWinterTale) can only speak english.\" Which is false, I speak 5 total languages.  \n  \nThey never set up a guidance councilor for me. Anytime I tried to look for one I got brushed off, and was told to just \"pray to God.\" ... That was the only thing they ever tell me- \"Pray to God\", of course. That doesn't address anything.\n\nThe principal talked to me, told me a story about a deceased student. She was physically disabled but \"always came to school happy\".  She told me that she had it worse than I did, and I should be happy for that. The principal in the same day told me to stop crying otherwise she wouldn't talk to me anymore. She also told me all the professors thought I should be in a different section. The one where they put the \"dumber\" kids... Which I found very insulting because they hadn't even tried to help me in any of my problems, just ignored me and moved on. It was painfully obvious when a professor didn't like me. They never responded to me, or acted with me the same way as other students.\n\nBut still, really fucking disgusting to me. How dare she compare my problems to a deceased student? That was extremely disrespectful and told me all I needed to know, I couldn't trust the principal at all. Every fucking day for 2 years I came to school with new scars. They never checked on me, that responsibility for some reason befell my own few friends. Other students. Not the teachers- The students. 4 people who saw me.  \n  \nBut then the pandemic came, and we were all forced to go to school online. My grades went up. It only got easier because I didn't feel any pressure. Nor did I have to work with others who only wanted to delegate me stupid tasks or have me do nothing at all, or some professor not answering my question properly but just making it more complicated, it was easier because I could search up the topic at the same time, and get the answers I needed. But then they my grades went down again. \n\nI was called in for a private meeting with the principal, a professor, and two guidance councilors. I am not ever forgetting what they told me.  \n  \n\"Is there something wrong (NotAWinterTale)? You know that you can talk to us. Your grades are going down. Your grades in the first and second quarter were really good, and it concerns us that it went down again. If there's anything we can do to help, tell us.\"\n\nI had never felt angrier at them. Two fucking years of being ignored, of cutting my arms, and being suicidal enough to have nearly jumped off the damn building they only started to give a fuck the year they see I fit their expectations of being smart.\n\nI never forgot what happened or what they did. That stuck with me for years. I'm still crying about this years later. Because of them I feel like I don't deserve help unless my performance is above average, that I meant nothing all because I struggled and couldn't do it.  \n  \nThey always made me feel ashamed that things didn't click for me.  Now I feel vindicated now that I know I have AuDHD, and while I know it probably isn't an excuse, I feel happy to know it's not because I was stupid and didn't try hard enough. I am told I deserve what they never gave me, but sometimes those words aren't enough to erase the pain that school gave me.",
    "subreddit": "TrueOffMyChest",
    "title": "It hurt, and I will never forget what they did.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3kz2n/it_hurt_and_i_will_never_forget_what_they_did/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 20:31:09 UTC",
    "id": "1j3kqfp",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 4,
    "score": 0,
    "secure_media": null,
    "selftext": "(For context, I’m a cis girl and my boyfriend is a trans dude that’s pre everything ) Im conflicted. So, I’ve been in this relationship for around 4 months and I’ve been having some mixed emotions. On one hand, I’m happier than I’ve ever been, on the other, I low key hate myself much more nowadays. He makes me feel so loved but so disgusting. I’ve always been pretty insecure, that’s not new, but from what I’ve heard, a man’s supposed to make u more confident. All he’s done is make me love one singular part of my body just to make me despise 11 more(yes, I counted). The worst thing about it, is I know it’s not intentional. My partner is really pretty as a girl, even tho he hates it. For example, he has (sorry for this description) big,firm,and perky boobs. As a trans dude he obviously doesn’t want them and is planing on getting top surgery as soon as possible, but it has made me think I’m some sort of glob monster now, while I was very proud of my girls before I met him. Anyways, moving on from my body dismorphia, there’s one more thing that bothers me in this relationship.\nHe’s had a very hard life (bad partners, abusive family and relapsing sh) and whenever I try to talk to him about my lore (it’s bad but not as bad) his expression show the mindset of « here she is, acting like she’s got anything to complain about » and it really bothers me. Also, when I try to bring up any complaints I have to him, he low key starts guilting me into forgetting about it (like a dog when it eats your sunglasses). I just feel like he really undermines my experiences and unintentionally makes himself the victim of the relationship. Like, weve gone through some things in this relationship but he acts like what he does had no victims. I’m just really sad and happy while dating him and I don’t know what to do.\n\n(Sorry if this is incoherent, I’m writing this at 3am and not really focusing on writing, just ranting)",
    "subreddit": "TrueOffMyChest",
    "title": "It’s not that bad, you can ignore the tag",
    "upvote_ratio": 0.45,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3kqfp/its_not_that_bad_you_can_ignore_the_tag/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 20:23:50 UTC",
    "id": "1j3kk1x",
    "link_flair_text": null,
    "media": null,
    "num_comments": 41,
    "score": 0,
    "secure_media": null,
    "selftext": "\nEver since I was like 12 I’ve had a fascination with women farting. I discovered fart videos on YouTube originally and found that I liked it. I also had an experience with a childhood friend that involved farts that helped me realize I was into them. It’s always been a weird thing about me that I’ve kept secret for a long time but as I got into college I got more open with it to my female friends. Surprisingly they were cool with it but of course they would never fart around me which is understandable. Eventually I got curious and started offering women to fart for some money and some did try it some just straight up blocked me. Some of the ones that did decide to do it ended up becoming internet friends with me and would just randomly hit me up and say hey I’m gassy I can send you some videos. All that to say I know it’s a weird fetish but I didn’t choose to have this fetish it just kinda happened. But now a days I’m just tryna find a woman that is accepting of this but it’s hard to find. ",
    "subreddit": "TrueOffMyChest",
    "title": "I have a fetish for women farting",
    "upvote_ratio": 0.45,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3kk1x/i_have_a_fetish_for_women_farting/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 20:16:57 UTC",
    "id": "1j3ke4k",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "idk. i just wish i were different. i weigh 60kg (in the morning. usually 62kg after eating) which i fully realise isn't overweight, but i look...wide. i cannot muster up the courage to wear a tight fitting top but oversize always looks weird on me. i have an event to go to this friday, so i was trying on a few dresses and recording with the back camera and... it's just not pretty. my face isn't pretty either, but if i was at least skinny it wouldn't be so bad. i'm on a 1600cal high protein diet and i go to the gym. i do one full fasting day per week so that's why i eat 1600cal and not less (my maintenance is 1900cal) and try to get 130g of protein in a day to account for the fast. but it's been hard. idk i just am sick and tired of looking the way i look. the worst part is i don't rven want to look like another person, i want to look like the image of myself that i have in my mind. my nose is big and grecian, too. i have a slightly recessed jaw, and my hair is very thick and is wavy but it's really hard to take care of so its just frizzy all the damn time. and i used to die it so a part of it has red undertones which also look awful. i just look awful all the time. and my skin which always used to be crystal clear has pimples now. idk i just want to cry right now... why don't i look like my friends? they're all so skinny and pretty. i think im the duff (designated ugly fat friend). i dont know what to wear to the party and i really want to look and feel pretty. please help. or dont. i mainly needed to vent so there being a space to do so is helpful as well. bye:/ p.s: when i was like 15-16 (now 18) years old one of my class mates told me he could never imagine me in a bikini. im not sure what it means but ive never felt uglier as i did in that moment and his voice always rings in my head. i also cant talk to my friends about this because theyve been skinny and pretty all their lifes, they wouldn't understand. one of my closest friends also always says how happy she is with herself and im happy for her but i just nod and smile usually or say that its very good and she should feel like that but i always get this gut wrenching feeling when she says so. im very jealous if you cant tell lol.",
    "subreddit": "TrueOffMyChest",
    "title": "i wish i were skinny",
    "upvote_ratio": 0.43,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3ke4k/i_wish_i_were_skinny/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 20:03:56 UTC",
    "id": "1j3k2r8",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "When I was little, I had a very grand image of my father, shaped by my family since he was rarely home. They often told me about his good looks, intelligence, and how much everyone admired him.\n\nMuch of what they said was true—he was handsome, excelled in his studies, and graduated from university with top marks. But, I never really interacted with him directly.\n\nGrowing up, I always felt I couldn't match his intelligence or other qualities. Even as an adult, after a lot of studying and mental development, I felt I wasn't close to his level. Recently, I started talking to him more to try and build some connection now that I'm older.\n\nI'm a programmer and wanted to discuss a complex new app I'm working on. I hoped he would listen and offer some advice. The app is detailed and sophisticated, but since he's a mechanical engineer unfamiliar with the latest technologies, I focused on explaining the user experience to show him what the app would do.\n\nHowever, during our talks, I realized there was a significant gap between us in reasoning, logical thinking, and the speed of processing information, which may be due to his age, I don't know. Surprisingly, instead of feeling proud of my advancement, I felt sad. I wanted to share this because it's a new and unfamiliar emotion for me.",
    "subreddit": "TrueOffMyChest",
    "title": "My father's image",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3k2r8/my_fathers_image/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 19:57:47 UTC",
    "id": "1j3jx39",
    "link_flair_text": null,
    "media": null,
    "num_comments": 27,
    "score": 0,
    "secure_media": null,
    "selftext": "Posting on a throwaway for very obvious reasons. The cat is fine, I do see it roaming around from time to time.\n\nI’ve been dating my girlfriend for roughly 4 years. We don’t live together, but we are looking for places. However, I was so apprehensive because I hated her cat and her cat hated me. I’m not much of a cat person, and I understand my energy was probably off putting to the cat. But I’ve always tolerated it the best I could, despite its dislike of me. She went on a week long work trip 2 months ago and asked me to just stop by and feed her cat as well as check on her apartment to make sure all is well. Sure, whatever, I agreed. Her cat got nasty with me day one, and I ignored it. Second day, same thing. By the third day, I couldn’t take it and I just couldn’t imagine living with this stupid cat. So I grabbed it and let it outside through the window. (She lives on the first story so the cat was fine. I placed it on the ground and let it leave. I’m not a total monster.) The next day I went to the shelter when they had an open appointment and looked for a cat that looked identical to her cat. She had a generic black cat so it wasn’t hard. I brought it to her apartment, and left it at that. She came back, and everything had seemed fine. She’s only noted that the cat was skittish at first, but we both just chalked it up to it being the first time she was away from home for so long. I don’t necessarily feel guilty because she seems happy, but I do feel slightly guilt over my actions. I needed to tell someone, even if it’s the online void, just to get it off of my shoulders. ",
    "subreddit": "TrueOffMyChest",
    "title": "Let my girlfriend’s cat out because it didn’t like me and now I feel guilty about it.",
    "upvote_ratio": 0.06,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3jx39/let_my_girlfriends_cat_out_because_it_didnt_like/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 19:55:21 UTC",
    "id": "1j3jv17",
    "link_flair_text": "Positive",
    "media": null,
    "num_comments": 0,
    "score": 13,
    "secure_media": null,
    "selftext": "Back when I was in highschool, I was a bit of an outcast. I wasn't bullied (not to my face at least), was okayish socially, kinda liked. Always sort of something. I had friends, sure, but I was never the number one choice. \n\nGroup projects? I had to ask for partners, no one ever asked me. Same went for field trip sleeping arrangements, and anything that had to be in pairs or above. If we were a five people group, and the project was for four, I'd be the one left out almost every time. It would have been one thing if I was a lousy student, but I had great grades, so I know it wasn't about *that*.\n\nI was also always the one to create all the group chats, and always learned that there was one without me as well. And sure, people can do whatever they want, but it still hurts when you find that out. Some of these people are ones I kept in touch until today (I am 24 now), but again: never the first choice.\n\nAnd it might feel or seem small, but I was never the one people set next to. I didn't smell bad (I asked about it), wasn't an annoyance, just another part of never being first.\n\nNow don't get me wrong. They were amazing friends, that point aside. Always there for me when I needed, supported me when I came out and through a couple of years that were practically hell for my mental health, defended me when I didn't know I needed defense. They still support me to this day, too. It's safe to say I literally wouldn't have been here today without them.\n\nThen college happened. I started this year, and the social aspect was my major fear. Will I even have friends? Or is it really something so awful about me that makes people feel less for me, every time?\n\nBut college couldn't have been more different. I found people that actually like me. When we have classes together, they search for me. When I miss a day, I get a text asking where I was, because I never skip classes. And even if they were a group before I joined, they added me to their group chat without making a big deal out of it. They didn't open a new group, they just added me to their usual one. \n\nWe plan our schedules together so we share most classes, we make plans, I don't have to start chats... I guess I am being chosen for the first time, and not being left behind. It's a point when I am positive that even if I don't have many classes with any of them in the future, we will still keep in touch and stay friends.\n\nThere isn't much to this post aside from happy at where I came to, but I felt like I had to get it out and tell someone :))",
    "subreddit": "TrueOffMyChest",
    "title": "I am in group chats, and I think high school me would be proud",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3jv17/i_am_in_group_chats_and_i_think_high_school_me/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 19:43:52 UTC",
    "id": "1j3jl22",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "My friend broke a promise. \n\n\nThis was a promise we made years ago: *we never pull for each other's main/claimed character in Genshin Impact*. \n\n\nBut he broke it. Today. Some minutes ago. Our promise that we made years ago. And I know it ain't that deep. It's just a game. And it's just a silly promise…\n\n\nBut when my other friend snitched to me about it, I *felt something* in my chest. Something dreadful, but also enraged – or upset. I was unable to identify the emotion. It was just … *something*. Maybe everything at once. \n\n\nI was unable to speak because my throat hurt. And I felt myself cry, a lot. I even teared up with my eyes closed. Dumb, I know. But it hurt. It really hurt. I don't know why it hurt so much.\n\n\nI'm not mad that he has my main. Surprisingly not. But I'm mad that he broke the promise. Our promise. That we made years ago. I still remember when. Even if it was just a silly, small promise – it still meant something to me.\n\n\nI've calmed down now. But I don't know how to process this. It ain't deep, I should just get over it and I probably will force myself to sooner or later for the sake of him. But yeah, just had to get this silly vent off my chest… ",
    "subreddit": "TrueOffMyChest",
    "title": "I know it ain't that deep, but…",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3jl22/i_know_it_aint_that_deep_but/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 19:37:57 UTC",
    "id": "1j3jfv3",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "It's been my biggest trauma and the one that hurts the deepest. I come from a very religious family and I abandoned my faith as a teen. To tell you I've seen the coldest side of my otherwise loving parents would be an understatement. \n\nSilly little me thought we could just talk it out and get one with our lives and I was so wrong. They turned on me so fucking quick. Tried their absolute worst to turn me back. They were scared shitless with religious guilt and legitimately fearful for my afterlife in hell and made sure to project it onto me the worst way possible. I grew apart and away.\n\nIt hurts because I know it also came from a place of love. That mixture of love and unacceptance has followed me my whole life afterwards.\n\nI've ended up with wonderful women who as our love grew, would try to turn me to their faith, maybe even genuinely out of care. But they never understood how much it hurts to not just be accepted for who you are. It always ended in failure and heartbreak. \n\nI was just starting to catch feelings for this girl. We've been having amazing chemistry and genuine fun I haven't felt in years. Yesterday, she brought up how our difference of faith wouldn't let us work out. I've been through this too many times. But this time, It broke me.\n\nI just wish someone would love me for who I really am. I'm so fucking starved for it. I wish I could hear it. Wear it around me like a warm blanket. Feel at peace for once. I'm too tired and too hurt. I've honestly had enough.",
    "subreddit": "TrueOffMyChest",
    "title": "I just wish to be loved for who I am",
    "upvote_ratio": 0.76,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3jfv3/i_just_wish_to_be_loved_for_who_i_am/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 19:26:07 UTC",
    "id": "1j3j5cq",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 0,
    "secure_media": null,
    "selftext": "Hi, I'm 17 and this happened when I was 14, I remember I had my final exam like an online exam (Covid so online school) and my dad got a call from my relative that my grandpa died so we had to leave in 2 hours to catch the flight we were there and I was a bit lonely cuz everyone was busy with funeral and I dont sisters not even cousin sister only brothers so I was yk left out and this distant cousin of mine (my dad's side aunt's husband's cousin's grandchild and then my other aunt's sister-in-law's husband's nephew yeah ik confusing ) so this guy was there too idk why so my grandpa is Hindu only he is Hindu everyone else is Christian so we had to go with Hindu way of funeral (my grandpa's mother is Indian Hindu she married a British man) so this funeral lasted 2 weeks and then my mum n dad told me to go to my aunt's house because grandpa's house was very sad? so i did and in the car there was my distant cousin too and he kept on staring at me i was sitting in the front with my lil brother and he was sitting at the back and i will be very honest i was creeped out well moving on i was at aunt's house a week later there was a bday party for my cousin brother and that distant cousin was also there and i befriended my aunt's maid's daughter she was my age and she said lets go upstairs its very loud down here so i did and there he was waiting that cousin of mine and he had a camera he asked if I wanted to get some photos i said no i was very introverted and these people were new to me   but that maid's daughter was forcing me so i gave in kinda and he called some friend of his and told to get a photo of us like all 3 of us and he was very close to me and tried to kiss me? but he said \"dw i wont kiss you\" but he still wont get away and his hand was resting at my waist and his body was sticking to mine and i finally got away and that girl said i got work downstairs i will be back in a min and they closed the door saying it was loud and i was sitting on the bed and he sat beside me and his hand was on my thigh and he was very close to me (again) i tried scoot over but i was in bw him and wall and he told his friend to take a photo with his face in my neck and istg i froze many people will say why didn't u fight back so well i was 14 and i was like 5'1 and he was atleast 5'10 and i was quiet kid and well i ran away to get some water and idk what happened after that i was sweating and remind u it was January so and next morning my aunt was scolding me about him? As if it was my fault? was it? idk\n\nplease help me guys this still haunts me every day i think about this and i regret not doing anything i regret no punching his face",
    "subreddit": "TrueOffMyChest",
    "title": "I dont know if Im over reacting or i really got assaulted...",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3j5cq/i_dont_know_if_im_over_reacting_or_i_really_got/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 19:22:06 UTC",
    "id": "1j3j1up",
    "link_flair_text": null,
    "media": null,
    "num_comments": 9,
    "score": 30,
    "secure_media": null,
    "selftext": "I was with my now-ex fiancé for almost 4 years, engaged for almost 3 years. Gave him every single part of me and gave him the benefit of the doubt even after he did extremely questionable things- and yep everyone on my other post was absolutely correct and he was cheating on me, for around 2 years with more people than i can count saying and doing the most vile things. I just took pictures of as much as i could stomach, I got to 42 different chats and wanted to get as far away from those disgusting chats as possible. I can't sleep, I can't eat. I'm numb. I can't even cry. I'm not mad. I'm nothing. Nothing feels real. I want to hate him, but I dont. I feel nothing.\n\nI ignored my gut feelings for literally years and convinced myself I was crazy, he would never do that. But I was wrong. I have moved into the living room, I can't afford to move out, We have numerous animals too. He has lied to not only myself but every person around us telling them that we were in an open relationship. We definitely fucking weren't. I gave him numerous 'outs' and tried to break up a few times over the last 2 years which he vehemently denied- but then cheated anyway. While inwas miscarrying his child. While I was going through the hardest part of my life. While I was having trauma therapy for SA and abuse, so many occasions. The one thing he knows I never forgive. I would forgive him for literally ANYTHING else, but not cheating. \n\nI've had to do STI/STD kits because I can't believe a word out of his mouth. How am I supposed to believe he didn't sleep with anyone when he managed to hide all of this, it goes too deep to even begin to put into words. I don't trust someone who can happily hide their uncountable amount of affairs, sexting, flirting and fuck knows what else. I feel disgusting, I feel ugly. I have never felt so low. \n\nHe wants to be friends, but how can I be friends with someone who used me for years and tossed me aside. I want to rip off my skin so that I can get rid of his touch.  I feel so violated \n\nHonestly, I don't think I'll ever recover emotionally, mentally, or physically from this. ",
    "subreddit": "TrueOffMyChest",
    "title": "Found out my partner has cheated on me with countless people for at least 2 years of our relationship.",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3j1up/found_out_my_partner_has_cheated_on_me_with/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 19:10:50 UTC",
    "id": "1j3irtt",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "My brother is 30 and I'm 22.  When I was 13-14, he said if we weren't related we wouldn't be friends. My brother is an \"entrepreneur\" so he hasn't had a real job in a while. He has a team of developers working for him. One of his developers is prostituting herself twice a week. Another one of the developers had to move in with his dad because he couldn't afford living on his own and his dad told him to stop working for my brother. My brother convinced him to not listen to his dad and to \"follow his dreams\" so he's moving in with my brother's business partner. His business partner \"house hacks\". House hacking means he puts his name on the lease and has people move in and splits the payment between them without contributing anything. I'm in a long term emotionally and financially abusive relationship that I don't want be in anymore. However, I don't have anyone to turn to in my area and I can't afford to move into an apartment based on my income. I'm a student so I can't move back home. I spoke to my brother about the situation and he's like yeah you can either move with me or my business partner. My brother and his girlfriend are moving to the same city as his business partner. I don't wanna live with my brother and his girlfriend because she has a cat and I do too but her cat doesn't get along with other cats. So I told him his business partners place would probably be better. I asked what the rent would be and he said probably altogether 1150. I thought that was pretty high because it was supposed to be split between four people. My brother told my mom that his business partner house hacks after we had had a conversation about how much rent would be and she asked me if he told me that and I said I have no idea what that is and she found out from him and let me know. And I currently live with my boyfriend for free. The reality of the situation is I can't go from paying nothing to paying 1150 just so I can pay this guy's way while he can't even pay the people that are working for him a decent wage. I told my brother this and he was trying to shame me he was like so you're not ready to jump ship? After I explained I want to visit first, I don't want to move yet and put school on pause just to end up not even liking it there. And even if I did I might struggle to find a job too. I've lived in this state my whole life.  He was like well that's unfortunate but alright and then said I need a hard yes or no by April 5 no later. He treats me like I'm some bitch employee. Or like everything has to be transactional and a business decision. At this point I just feel like going contact. ",
    "subreddit": "TrueOffMyChest",
    "title": "I hate my brother",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3irtt/i_hate_my_brother/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 19:02:59 UTC",
    "id": "1j3ikwm",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 0,
    "secure_media": null,
    "selftext": "All he does is hit on women and be a fucking creep. Most of the workers have called hr on him like 6-7 times. That includes the 19yr old “latin American” girl who recently came here from her home country to work on the USA. I am not shitting on her btw. What is happening with this specific girl is that since she came from Cuba he thinks she is stupid. Legit thought that since she’s coming “from the third world country” that she was going to be stupid. He legit thought that she wasn’t going to catch on to his grooming attempt. Most of the company found out that he was manipulating and lying to have sex with her. Btw this ducking bastard is like 45-56 years old. I am not sure I can do much but I have let hr know he’s weird with the female staff. Also that he has such weird as fuck interactions with the 19yr old that isn’t appropriate on a workplace setting. Also, that he’s antagonistic toward me and tried to use a “mobbing” attempt to have the rest of the workers hate me. ",
    "subreddit": "TrueOffMyChest",
    "title": "My manager be wildin and attempting to grooming a 19yr old. See see",
    "upvote_ratio": 0.4,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3ikwm/my_manager_be_wildin_and_attempting_to_grooming_a/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 19:02:01 UTC",
    "id": "1j3ik1q",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "Just try to keep going through the hell… hopefully will end someday. It’s simply put just truly a hellish ruthless world. ",
    "subreddit": "TrueOffMyChest",
    "title": "Going through hell?",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3ik1q/going_through_hell/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 18:58:30 UTC",
    "id": "1j3igs7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 19,
    "score": 8,
    "secure_media": null,
    "selftext": "Okay so I WFH and do have a decent amount of work at the beginning of my day, but around lunch time it’s mostly done. I am thorough and get compliments for my hard work and how much I have on my plate, and I just take it. Why would I tell them I am able to finish it in half the day?? Is this morally wrong?",
    "subreddit": "TrueOffMyChest",
    "title": "I WFH but there’s only enough work to do about 4 hours then I’m doing house work mostly…",
    "upvote_ratio": 0.8,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3igs7/i_wfh_but_theres_only_enough_work_to_do_about_4/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 18:39:44 UTC",
    "id": "1j3i04q",
    "link_flair_text": null,
    "media": null,
    "num_comments": 308,
    "score": 416,
    "secure_media": null,
    "selftext": "So i (M18) have been with my girlfriend (F19) for almost two years now. Unfortunately i was not blessed downstairs. I won’t go into detail but it’s not big. She says she likes it and still loves me for me. But to be honest I hate myself a lot for it and think it looks ridiculous. Even getting changed in front of her makes me feel really really crap about it because I feel like she deserves more. It limits me wearing certain clothing items and swimming. I know, swimming out of everything. I just find it so embarrassing getting out of the water and knowing that the shorts stick to you and you get the idea. \n\nShe gives me and it so much love but I just can’t seem to believe what she’s saying about it. Am I crazy?\n",
    "subreddit": "TrueOffMyChest",
    "title": "My size downstairs is affecting my mental health",
    "upvote_ratio": 0.88,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3i04q/my_size_downstairs_is_affecting_my_mental_health/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 18:32:14 UTC",
    "id": "1j3htcn",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 1,
    "secure_media": null,
    "selftext": "I have been with my bf for 3 years. We are living in another country with our dog (I had the dog before I met him so shes technically mine)\n\nI work overtime and Im also studying for my postgraduate degree. Because I self fund my degree I cant afford to move out. (my degree finishes in summer 2026) Or if I do move out, I will struggle to the point I risk not having enough money for transport or supermarket.\n\nI have looked up shared accommodation but it won't save my much more money and I will also keep the dog which...makes everything worse. Not many houses accept dogs, I will probably have to pay extra as compensation to have her with me, a dog is also an extra expense which now will no longer be shared and on top of all that I work long shifts (14 hours) and once a week I do 30 hours straight which means I will not be able to walk my dog.\n\nI dont have any family or friends here. so I dont have anyone I can lean on, he offered that we stay roommates but I honestly dont want to. I think its emotionally/mentally unhealthy and I would also feel like hes doing charity for me (because he can afford to live alone).\n\nAlso. two of my very close friends are getting married in 2 months. And I will not be able to attend because of this. I will have no one to look after my dog and I cant afford a dog sitter as well as plane tickets and gifts etc.\n\nI am almost 27. And my younger self would be embarrassed of me. I am 27, failed my relationship, dirt poor and cant be independent.\n\nSorry for the rant. Did anyone go through anything similar and can suggest anything?",
    "subreddit": "TrueOffMyChest",
    "title": "Cant afford to break up",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3htcn/cant_afford_to_break_up/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 18:19:24 UTC",
    "id": "1j3hhw4",
    "link_flair_text": null,
    "media": null,
    "num_comments": 24,
    "score": 0,
    "secure_media": null,
    "selftext": "I'm 23 and my whole life I was very boys crazy. Even when I was in kindergarten. I always loved boys. But when I grew into a teenager and was almost sleeping with a guy I just couldn't even touch it. It was just very disgusting and the thought of that thing being near to me was generally scary. I never had any trauma and had a rather good relationship with most males. Since then I just can't seem to enjoy male genitals. I've never slept with a man and I never see myself sleeping with one which is sad because I do feel horney and even watch adult movies. I just feel like sometimes I just never will have a fullfilling relationship. I can't physically have sex with a man. Sometimes I wish I would be into woman because the thought of a vagina is so much more pleasant. \n\nI was in multiple relationships and I try to not think too much if sex or anything, but I am always the one breaking up when it comes closer to having actual sex. Then suddenly everything on my partner is an ick and I don't even find them physically attractive anymore. It's never any of my partner fault because they were all great people. Idk what to do. Did someone else also had that and how did u deal with that? I'm nkt asexual that's one thing for sure. I just think I hate male genitals. ",
    "subreddit": "TrueOffMyChest",
    "title": "I really hate pennises. I'm scared I might never be in a fullfilling relationship.",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3hhw4/i_really_hate_pennises_im_scared_i_might_never_be/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 18:15:51 UTC",
    "id": "1j3her7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 29,
    "score": 0,
    "secure_media": null,
    "selftext": "My son turns 2 this month. I had ppd right after I had my son but after I felt better around 8mo ppd and I’ve been to the doctor regularly and I’m pretty healthy \n\nI just don’t have interest in sex. I’ve never really been such a sexual person. I wouldn’t say I’m asexual though. Before we had a baby we would have sex maybe once a month and I was content with that but he would always complain\n\nHe said he’s tired of being in a sexless marriage and he’s going to cheat on me. It hurts and I’m thinking of just lubricating myself so he can just use me for sex ",
    "subreddit": "TrueOffMyChest",
    "title": "I haven’t had sex with my husband in a year and he threatened to cheat on me",
    "upvote_ratio": 0.43,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3her7/i_havent_had_sex_with_my_husband_in_a_year_and_he/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 17:53:04 UTC",
    "id": "1j3gu7w",
    "link_flair_text": null,
    "media": null,
    "num_comments": 24,
    "score": 10,
    "secure_media": null,
    "selftext": "i’m currently 21, and all my life i’ve grown up in an extremely conservative environment. my parents are not accepting at all, and my dad would probably disown me and never talk to me again if he knew that i was thinking this. i think if my mom wasn’t married to him, she could come around to be accepting and potentially more progressive too. i know lately her thoughts on abortion have changed, going from the, “no abortions should be allowed ever unless it’s life threatening” stance to the “i realize people will get abortions anyway, and outlawing them will only lead to people turning to unsafe ways to have them and people will die,” stance. \n\nthat’s not very relevant, but i’m just trying to explain their dynamic. my mother is genuinely a very good person, she’s just so easily influenced especially by my dad. \n\nthey all wonder why i’ve never had a boyfriend. they think it’s just because i’m focused on academics and my future, but it’s really that i don’t want a boyfriend. i don’t want to marry a man, and i can’t see my life with one. i am attracted to women and can only see me spending my life with a woman, but i know that if i ever got married, it would have to be with a man. i have no choice, because i love my family so much. they are the closest people to me and i can’t stand the thought of them not being in my life anymore.\n\nand i know that if i ever came out to them it would cause i huge rift. my mom and my siblings are some of my best friends, and i know with 100% certainty that my siblings would support me and love me regardless. they’re progressive and more left wing. my mom, even though she wouldn’t quite understand it, would still love me too. she’s such a genuinely sweet person and we have too good of a relationship to be ruined by that. \n\nthis would lead to a huge argument between my mom and dad. they’ve always had a rocky marriage, but this would absolutely tear them apart and i can’t do that to them. they do love each other, and my mom would have absolutely no idea what to do without him. she’d be lost and lonely, and i don’t want that for her. \n\nand i don’t want my dad to hate me. i don’t want him to hate me for something i can’t control, for something that’s a part of me. the confirmation of his conditional love would hurt too badly. everything would change and my family wouldn’t be close anymore. they’re all too important to me, and in order to preserve that i’ll have to keep this part of me hidden forever. \n\nso here we are. it’s 2025 yet i have to live like it’s still 1950. it hurts more than anything, and god it’s so heavy carrying around this secret, but there’s nothing i can do. i love my family too much to do that to them, to ruin and change their lives forever just because i’m attracted to women. it’s just better for everyone if they never know and i never allow myself to find love in a woman \n",
    "subreddit": "TrueOffMyChest",
    "title": "i think i’m a lesbian but i can never tell anyone",
    "upvote_ratio": 0.62,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3gu7w/i_think_im_a_lesbian_but_i_can_never_tell_anyone/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 17:46:10 UTC",
    "id": "1j3go52",
    "link_flair_text": null,
    "media": null,
    "num_comments": 14,
    "score": 0,
    "secure_media": null,
    "selftext": "Not an English speaker.\n\nI still don't get it and i still genuinly don't understand it at all, it was just a simple act that i made. It's not like i saved the fucking world.(if it was to me i wouldn't save the world anyway)\n\nSo it all happened 30 minutes ago.\n\nI was at the supermarket trying to buy something for dinner and was looking there for some vegetables when i firstly saw this girl(aroud my age i guess but i'm horrible at giving people age) panicking around and looking behind her like someone was about to kill her and i saw an old man following her but i ignored the scene.\n\n10 minutes passed by and i went to take some healthy snacks and while i was there looking for them( i never understood why they always move things from the shells for fuck's sake) when this girl reappered again panicking and looking around like someone was about to kill her but this time she was crying and sobbing. When she saw me there trying to look at my snacks she run towards me and went behind my back like she was trying to use my body as defence from someone or something and then again the old man showed up looking for her.\n\nI turned my head around to the girl and asked her what the fuck was her problem and she told me that the old man was trying to abuse her and he already touched her. I asked her why the hell she placed behind me and she told me that she was scared and because i'm a big guy and i could defend her.\n\nI just sighed cause i was already tired of the day and went straight face to face to the old man and just told him to leave that girl alone or i would end in prison and he in a grave. He just stared at me like i was some kind of ghost and looked at the girl and then went away.\n\nI came back to the girl and told her next time to kick him or anyone else herrassing her to the balls and then run or call someone and when i was about to go to pay while crying she asked me \"please don't leave me alone, can you stay with me while i buy a few things?\" I sighed again and accepted. So she bought the things she needed and then she even wanted me to be there for her at her car so unfortunetly i did.\n\nShe hugged me too tightly and gave me her number because \"i need to offer you a drink after today because you saved me and without you i don't want to imagine what would happened\". I just sighed and said \"yeah yeah whatever\" and apparently tomorrow night i have a free drink with this girl.(Tanya)\n\nNow: sincerly i didn't made anything of special or so particular to me. I just did what i had to do to avoid any type of drama or crying or all this pathetic scenes that i hate. I'm always ready for death or prison so it wasn't exactly a menace but more like a straight fact on what would happen. I don't get why all this cries after i took her to the car, all this thanking and all this \"you saved me\". I just did it because i hate drama and all this shit. More simple than this is impossible.\n\nGirls are so dramatic...",
    "subreddit": "TrueOffMyChest",
    "title": "Girls are so emotional! I just made a simple thing why all this tears and all this thanking circus?",
    "upvote_ratio": 0.26,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3go52/girls_are_so_emotional_i_just_made_a_simple_thing/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 17:25:28 UTC",
    "id": "1j3g5dd",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "Hi everyone, I have always read other people's stories. I figured I want to share my story with everyone to show that no matter how hard your life is, there is always a way. I had reasons to give up but I chose not to. I hope this story can help other people who is going through hardships.  \n  \n**I Had Nothing—So I Built My Own Future**\n\nThere was a time in my life when I had no financial security, no degree, no legal certainty, and no real future. I had no backup plan, no connections to rely on, and no one to help me figure things out. I had to navigate everything on my own, making difficult choices to survive.\n\n# Early Life &amp; Family Background\n\nMy biological father left when I was two years old to become a monk. He was completely absent from my life, never attempting to reconnect. My mother, overwhelmed with life, was also absent for long periods. When she became pregnant with my stepbrother, she left for Malaysia and was gone for nearly a year. During that time, my grandmother took care of me and my elder brother. She was everything you could hope for in a grandmother—kind, nurturing, and always present.\n\nThen, one day, my mother returned and took us to Malaysia without telling anyone. My brother and I didn't understand what was happening; we simply followed instructions. Like anyone leaving home, we missed Brunei, but we had no say in the matter.\n\n# Life with My Stepfather\n\nAt around seven years old, my stepfather entered my life. I was excited—I had always wanted a father. He owned a business selling screen protectors and phone covers, and as it grew, our financial situation improved. But despite his success, he was abusive.\n\nMistakes were not tolerated. He beat us for small things, like forgetting to turn off a light. No matter how well we behaved, we were constantly reminded that we were not his real children. As his business boomed, he became more absent, but his abuse never stopped.\n\nWhen his business thrived, we moved to Johor Bahru, and for the first time, we lived comfortably. But the abuse continued. At 14, we moved to Kuala Lumpur. I had no idea that my life was about to take a drastic turn.\n\n# Australia &amp; The First Collapse\n\nAt 16, I was sent to Australia to continue my studies. I enrolled in:\n\n* Year 12 at Taylor’s College\n* Diploma of Business at Deakin University\n* Bachelor's Degree in Psychology: Applied Science\n\nIn early 2013, my stepfather suddenly announced that we had to return to Malaysia. His business had gone bankrupt.\n\nI didn't want to leave, but I had no choice.\n\n# Returning to Brunei &amp; Struggling for Direction\n\nBack in Brunei, I took a job as a marketing executive at a magazine company. It was straightforward work, but I realized that Brunei's work culture and lifestyle weren’t for me.\n\nAt first, Brunei made sense because I didn’t have the right documents to stay in Malaysia. But after working there, I knew: Malaysia was where I wanted to be.\n\nSo I left.\n\n# Returning to Malaysia &amp; Facing Reality\n\nI was jobless for six months before landing a job as a Private Investigator. During this time, my stepfather did not support us financially. He claimed to be paying our rent, but we later found out he wasn’t.\n\nOne day, our landlord told us the rent hadn’t been paid for months. If we didn’t leave immediately, he would call the police.\n\nThat night, we quietly packed our essentials and left. We were shocked, terrified, but also relieved to get away from the lie we had been living.\n\nLater, I found out my stepfather had another family. His former business partner secretly told my mother that he had two daughters in their early twenties—meaning he had been maintaining a second family for over 20 years without telling us.\n\n# Survival Mode – Private Investigator &amp; Visa Struggles\n\nI found my PI job through a newspaper ad. It was advertised as a “Market Researcher” position, but when I went for the interview, I realized it was for a Private Investigator. The work involved tracking down counterfeit products and investigating individuals.\n\nI struggled at first but got better over time. Still, the job was stressful, and I knew it wasn’t my future.\n\nOn top of that, I had major visa issues. I was forced to travel in and out of Malaysia every two months to renew my stay. Eventually, immigration warned me that I would be blacklisted if I kept doing this.\n\nDesperate, I turned to an unconventional way to secure my visa. But it backfired. The person handling my passport ran away with it for years.\n\nI was trapped in Malaysia with no legal identity. I was terrified. I wanted to report it, but I feared I would be deported. I had to stay quiet and find another way.\n\n# The Turning Point – Finding My Strength in Teaching\n\nMy wife now saw what I was going through. She offered to marry me so I could get a spousal visa. When she said that, I broke down in tears. I had been fighting for so long, and finally, I had a way forward.\n\nI knew I couldn’t continue the PI job, so I looked for something more meaningful. I found a job as a special needs educator and quickly realized I was good at it. I understood behavioral strategies like the ABC Chart and could see real progress in my students.\n\nI also took a side job at a tuition centre teaching English. I worked from 8 AM to 9 PM every day. It was exhausting, but I kept pushing forward.\n\nSoon, parents started coming to me directly. Word spread, and I had so many clients that I had to hire another teacher to help me.\n\n# Building My Own Centre &amp; Surviving COVID-19\n\nI always wanted to run my own business. When the tuition centre owner tried to take control of my earnings, I knew it was time to leave.\n\nI gathered my savings and opened my own special needs centre. It was terrifying, but I knew I had to do it.\n\nThen, COVID-19 hit.\n\nI lost over half my clients overnight. I had to choose: ✔ Let the business fail or ✔ Adapt and push through\n\nI transitioned to online teaching and borrowed money to keep my employees paid. I sacrificed my own salary to keep the centre alive. It was the hardest time of my life, but I refused to give up.\n\nMoral of the story: Do not give up despite all the adversities. If you hit rock bottom and felt aimless. Always remember to do with what you can and progress forward. ",
    "subreddit": "TrueOffMyChest",
    "title": "From Zero To Something. This is to those that is going through hardships, do not give up!",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3g5dd/from_zero_to_something_this_is_to_those_that_is/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 17:11:50 UTC",
    "id": "1j3ft5h",
    "link_flair_text": null,
    "media": null,
    "num_comments": 38,
    "score": 0,
    "secure_media": null,
    "selftext": "i (16m) swear to god everytime i think about her (15f) i just get so mad because she lies so much and i didnt realize til lately because shes this like. sweet innocent girl like girl next door typa vibes NO. nothing like it. she lies SO much. and she lies SO BAD too. Like shes the worst liar to ever walk across earth. she lies like how a four year old would lie to their mother about staying up late. just senseless behavior. i dont understand why shes doing this im just so enraged bc shes acting like IM in the wrong for not believing her as if she doesnt have a HISTORY anyways!!!! and now she wont fucking text me first or anything like seriously and i know i wont leave her because i just wont. breakups are hard and messy and i already dont have the best reputation in terms of dating at school. we broke up before and she said i manipulated her or something and shed post all this shady shit about me itd drive me fucking nuts because i was nothing but nice and honest to this woman. like yeah highschool sweethearts usually dont workout but like shit bro why is she making it so difficult. i’m just seriously annoyed with her and i dont think ill ever trust or even love her the same again. ",
    "subreddit": "TrueOffMyChest",
    "title": "i hate my lying ass girlfriend",
    "upvote_ratio": 0.3,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3ft5h/i_hate_my_lying_ass_girlfriend/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 16:50:38 UTC",
    "id": "1j3fa03",
    "link_flair_text": null,
    "media": null,
    "num_comments": 13,
    "score": 8,
    "secure_media": null,
    "selftext": "It's been 3 weeks since we found out. He lived &amp; worked one state over. His gf at the time found stuff on his phone, took it to the police and they raided his apartment taking all his electronics. He immediately left and ran back home, like the little coward he is. Now he's living with my in-laws, who we used to visit almost every weekend. My kids can't go over anymore. I have no idea how long until he's arrested. I just want to see what this might look like for us over the next few months, years, etc. I want to know what to expect.\n\n  \nEdit: additional detail. He admits to soliciting 16yr for pics and sending those to another person. But I honestly don't believe that. I think he's sugar coating it at \"16\". Either way, he's dead to me. ",
    "subreddit": "TrueOffMyChest",
    "title": "Brother-in-law (35) under investigation for CSAM",
    "upvote_ratio": 0.74,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3fa03/brotherinlaw_35_under_investigation_for_csam/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 16:50:29 UTC",
    "id": "1j3f9ue",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 3,
    "secure_media": null,
    "selftext": "My co-parent receives a two week work schedule every other Friday. \n\nWe've been broken up for over a year and he is still unable to tell me his pickup schedule more than a few hours or a day in advance. I've asked multiple times if we can make a schedule but he always has a lame excuse \n\nI usually ask sometime between Sunday and Tuesday, he rarely offers to tell me without being prompted.\n\nI've retained a lawyer to work out an agreement, but in the meantime this is very annoying and negatively impacts my ability to work/plan ahead.\n\nToday (Tuesday) I asked for his schedule and he responded \"the usual\", which is meaningless as it changes. I've asked 3 separate ways today (I am always polite and solution oriented when communicating). I offered that we could use the schedule on the co-parenting app to make things easier. He's read my messages and not responded.\n\nI've always let him have whatever days he wants and I've only once asked to switch pickup days. Our child loves him and I want to support their relationship, so I'm very lenient\n\nI don't want to harass him with multiple messages, but I really need advice on how to get this information out of him.\n\nI am so frustrated. Every week he takes days to decide when he wants to parent, and I want him to have access to our child so I stall my own plans to support his",
    "subreddit": "TrueOffMyChest",
    "title": "Coparent can't decide when he feels like parenting until the last minute",
    "upvote_ratio": 0.81,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3f9ue/coparent_cant_decide_when_he_feels_like_parenting/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 16:42:49 UTC",
    "id": "1j3f2wr",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "throughout my life whenever a guy confessed to me i wouldn't really feel anything. i mean, i sometimes would feel flattered and happy but when it came to genuinely loving them it left me stuck. i liked that they liked me but when it came to reciprocate, it brings me to a dead end\n\nit leaves me a bit confused since i usually like guys bc of their looks, aesthetically (especially fictional) i am attracted to it. but whenever i envision myself with a guy its never romantic like kisses, it actually feels a bit off whenever i try to imagine such. honestly i just replace myself with some other character in the imagination \n\nit reminds me how i pretended to be a guy for a bit wayyyy back in middle school because i liked the concept of a guy who is superrrr cool and charming and gets all the ladies (and men sometimes)™, if that makes sense at all. i questioned if i actually liked men for years and always leaves me stuck ",
    "subreddit": "TrueOffMyChest",
    "title": "I don't think i like men",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3f2wr/i_dont_think_i_like_men/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 16:09:29 UTC",
    "id": "1j3e9n1",
    "link_flair_text": null,
    "media": null,
    "num_comments": 60,
    "score": 168,
    "secure_media": null,
    "selftext": "So I realize I sound like an asshole. I grew up in pretty bad poverty. My mom had a really hard time holding a job and when she was able to, had a spending problem. As a result, I’ve been working full time since I was 15. I worked multiple jobs at a time to get around labor laws so that I could make and save money. By the time I graduated high school I had enough money to buy a car in cash and pay for a majority of my college expenses (cash flowed first 3 years) with absolutely no help. I continued to work through college and eventually ended up in a high paying job. From the age of 17 to now I’ve worked around 50-60 hours a week in addition to going to school. I had no free time. I missed out on a majority of being young- I never got to go to parties, I hardly ever hung out with friends which caused me to lose a majority of them, and I was always exhausted while I should have been young and lively. Regardless, I went through the grind and came out on top. I now don’t typically have to worry about money. I’m in a relationship with a fantastic man that I plan to marry and start a family with. Everything seems to have worked out.\n\nMy mom has always had a very hard time working. She has problems with all of her co workers everywhere she goes &amp; she seems to struggle with taking direction. As a result, she tends to leave jobs quickly, usually without another job offer. She decided when I was around 19 to stop working to care for my elderly grandmother. While I understood this decision, there were still times she could have held a part-time job at least and chose not to. My grandmother was in an adult daycare program for about 20-30 hours a week, which could have been spent working. Instead my mom chose to go out and spend what little money she had gotten from various loans and wherever else she was getting money from. She also complained constantly about having to take care of my grandmother. \n\nMy grandmother passed away a year ago and my mom was left with no choice but to go back to work, and again the cycle starts over. Everyday I hear constant complaining about how much she hates her job and everyone she works with. She makes very little effort to find other work and writes off entire industries for silly reasons (I won’t work in food service because I won’t wear a hair net. I won’t work in retail because I don’t have any experience. Etc.) She is also not saving any money, not towards retirement, not towards an emergency reserve, nothing. She claims she doesn’t have any money left after bills to save, but she frivolously spends. Every space in the house is occupied with something. She purchased a freezer full of steaks that have been sitting uncooked for months. She pays someone to wash her hair every few days because she “doesn’t feel like doing it herself”. She has so many things she doesn’t need and every time I visit her there is more yet bills are being paid in increments because she “can’t afford to pay the full bill”. I even cover some expenses by putting her on my plans and yet she still cannot manage very basic expenses.\nMeanwhile I work, I live very well below my means and my partner and I save a lot of money, both for retirement and for our future together. I know my mother is planning on being able to live off of me and I won’t allow it. I don’t know what she is going to do and I know it sounds cold of me, but I worked too hard to hand over everything to someone who has never tried to better themselves or their life. I’m done.\n\nEdit just because I’m frustrated: I came to visit her today and discovered receipts for various retailers for the past couple of weeks strewn about totaling over $700. She just complained to me about not being able to pay property taxes to stay in her home. It’s just so bad and I needed to vent more, I apologize.",
    "subreddit": "TrueOffMyChest",
    "title": "My Mom can’t hold a job and I’m not willing to finance her lifestyle.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3e9n1/my_mom_cant_hold_a_job_and_im_not_willing_to/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 15:37:25 UTC",
    "id": "1j3dijb",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 8,
    "score": 6,
    "secure_media": null,
    "selftext": "Forgive my formatting, I’m on mobile. Do not share my story anywhere. TW- Death, Incest, P*dophilia\n\nI don’t honestly know where to start so I guess the beginning is where I’ll go. \n\nWhen I was very young, my ‘dad’ began molesting me, from what I can remember I was around 3 or 4. I have three younger sisters that I grew up with and he molested them too as they got older, but it was mostly me that got the brunt of it. \n\nLast year, my mom passed away of a stroke. It was a very complicated time for me because although my abuser was arrested for what he did, my mom had convinced my sisters and I to drop the charges right before she had passed away. She would say awful manipulative things like “You don’t want your dad to die in prison, do you?” to guilt us into dropping the charges. She then proceeded to invite this man back into our lives by moving him back into the house we all shared at the time, and my discomfort was ignored and brushed under the rug. \n\nWhen my mom passed my ‘dad’ went crazy and forced me out of the house. My mom was a buffer between everyone and with her gone, I didn’t feel comfortable at the house at all and I had my boyfriend stay in my room with me because I felt safer that way. Cue raging ‘dad’, cussing me out for inviting another man over and threatening to call the cops and having him trespassed- all crazy erratic shit I didn’t understand. So I moved in with my boyfriend (yay). All that drama didn’t even end up mattering though, because ‘dad’ remarried and moved to a new state just 3 months after my mom’s passing. Currently all my sisters are still living in that house together.\n\nNow here’s the fun part… \n\nI’m the eldest. Growing up, I was always told that my parents got married at the courthouse and had me before they officially hosted the wedding. I was born in 99 and the timeline I was told was, \n•Met online in ‘97\n•Courthouse wedding in ‘98\n•I was born in ‘99\n•Wedding I was pictured in took place in 2000. \nI always knew I was in their wedding pictures and I never questioned what they told me, they said the ceremony was delayed until my grandma could get back from doing government work overseas. It all made sense to me growing up, I never questioned it, but it was all a lie. \n\nSo this weekend was a the year anniversary of my mothers death, and I decided to get dinner with my sisters. We’re having a good time and everything but I forgot my jacket, and my boyfriend stopped by the restaurant to bring it to me. I get back to the table and my sisters got all quiet and said, “Hey, we’ve got some news for you and it’s really heavy.” Long story short, this man that I’ve thought was my ‘dad’ my whole life is NOT my biological father. My sisters have been going through all of our moms things over the last year and kept coming across weird pictures and documents relating to me that didn’t line up with what we’d been told. I would’ve thought they were trolling me if it weren’t for the fact they’d confirmed everything with my aunt, my mom’s younger sister. Who, I just found out yesterday, didn’t know that I didn’t know, because my mom was not only lying to my siblings and I about it, but lying to my aunt and all of our extended family too, saying my siblings and I already knew! \n\nI’m going to visit my aunt in a couple of days to sit down and talk all of this out, get the real scoop on my life, because my whole worldview has been shattered. On one hand, I’m grateful I was finally told, but I turn 26 this month and that’s an insane age to learn your dad isn’t even your dad. Not to mention what a horrible ‘dad’ he was. \n\nI feel this information to be both heartbreaking and freeing- I’m not related to this monster. If I have kids, I won’t be passing along his DNA, and that’s comforting to me. I don’t want to make my half sisters feel bad for being related to him, but I can’t help feeling like this, I’ve always told myself I wouldn’t have kids because this guy doesn’t deserve his DNA being passed on and now I find out I have none of it. This information was a gift to me. \n\nOn the other hand, I’m angrier at my mom than I’ve ever been. I mourned her death so severely, I suffered, because I felt so guilty that our relationship was so tumultuous in life. And yet, we never could have had an honest relationship because I now know she was never honest with me. About almost anything. I feel so much better and at peace knowing that it really and truly was my mothers fault that our relationship was so rocky. How can you have an honest relationship with anyone that could lie about something so big? Not to mention the fact that she was so manipulative and greedy, doing everything she did just to invite this evil man back into our lives, just because it’s what she wanted for herself, to retire on his dime. None of this is on me anymore and I feel so much lighter. \n\nAnd before anyone asks, yes a DNA test is in my future, and I’m starting therapy again soon. I have no idea if my dad is even alive or still out there, but I’m going to find out. I’m not sure how to end this but let me just say, this has been the craziest year of my life by far, and I’m glad I don’t have to interact with either of my parents anymore, or feel guilty about how I handled things when my mom was alive. ",
    "subreddit": "TrueOffMyChest",
    "title": "My ‘dad’ that m*lested me growing up isn’t my dad",
    "upvote_ratio": 0.76,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3dijb/my_dad_that_mlested_me_growing_up_isnt_my_dad/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 15:37:01 UTC",
    "id": "1j3di7y",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "I saw a post that included a boy my age who got support and security by someone in his life and i feel so jealous i feel embarrassed to admit it but i am i went through so much on my own and really fell apart in the process i’m not saying that he doesn’t deserve the support or that i deserve it instead cause i went through more no i know everyone has their problems and deserve support regardless and should be taken seriously but i never got support and it’s why i feel so hurt and “jealous” but really i don’t wish him any harm it just hurts seeing other people get the love and support you always craved and wanted. I’ve been hit, kicked, beaten up, screamed and yelled at and got threats regularly, verbally and emotionally abused by getting gaslight and cussed out in every way and spat on and death threats once when i was 11 by my dad after getting beaten up and at 14 too by my mom and i got my nose broken by my aunt and never got justice or any support AT ALL. Not emotionally or physically my mom at the time where i was having a breakdown right after the incident told me i deserved everything that happened to me and reminded me when my dad used to beat me up on a regular basis when i was 11 and that i was “stepped on” and “teached a lesson” by my him and my aunt and called me names cause i snapped at her during the breakdown when she refused take me to the police and i didn’t stop bleeding for 17 hours. I spat more blood even days after and i was never taken to the hospital or reported my aunt and when i was 12 my mom attempted suicide and i watched that all and saved her from it my mom was always manipulative and neglectful and shitty and gaslight me into thinking she was the “better parent” when she wasnt anything close to that she sent me to my dad when i was 7 even after she knew he sa’ed me. Throughout my childhood since i’ve been a toddler i’ve been abused so much by both my mom and dad and their families and i got no support or help by anybody idk how im still alive i wish i wasnt i stayed alive just to see others living better without carrying this whole emotional burden i have and just to get physical issues (a heart condition i got last year) that can kill me, and the worst part is my physical issues are probably caused by the stress i’ve been under and one thing led to another and all this at just 14 years old why am i even still alive? i don’t want this life i can’t stand this anymore everyday just gets more unbearable and i fear death less and less if an angel came down from the sky and told me i’ll die in my sleep tonight i wouldn’t care… and if anything i would be relieved to be free from this hell",
    "subreddit": "TrueOffMyChest",
    "title": "A cry for help",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3di7y/a_cry_for_help/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 15:32:08 UTC",
    "id": "1j3de4d",
    "link_flair_text": null,
    "media": null,
    "num_comments": 16,
    "score": 15,
    "secure_media": null,
    "selftext": "Honestly, I’m just sick and tired of only getting notifications from \"Auto moderator\", just to realize seconds later that my post was removed 😩\n\nI’ve been on Reddit for a few months, trying to participate, but every time I try to post, it’s like hitting a wall. It’s frustrating. I end up giving up on the app every now and then, but the worst part? My questions never get answered.",
    "subreddit": "TrueOffMyChest",
    "title": "Starting to feel like I don't belong here... anyone else?",
    "upvote_ratio": 0.73,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3de4d/starting_to_feel_like_i_dont_belong_here_anyone/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 15:30:52 UTC",
    "id": "1j3dd3b",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "In Steven Universe, I used to think Ruby and Sapphire were just friends before the wedding episode...",
    "subreddit": "TrueOffMyChest",
    "title": "I feel so dumb for this.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3dd3b/i_feel_so_dumb_for_this/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 15:28:15 UTC",
    "id": "1j3day5",
    "link_flair_text": null,
    "media": null,
    "num_comments": 51,
    "score": 115,
    "secure_media": null,
    "selftext": "Last Monday I watched my grandma from my dad’s side pass away early in the morning. Now yesterday my grandma from my mom’s side landed in the hospital due to passing cysts and having a mass in her bladder. \n\nShe keeps passing a lot of blood, and her option is basically surgery but since she is too weak for anesthesia, she has to have a blood transfusion. She is a JW (Jehovah Witness) and their big thing is they can accept any medical procedure or help besides blood transfusions. \n\nWe are in a small town and we have limited alternatives. My grandma gave partial power of attorney to a couple people in her congregation, including her brother which he is also part of that but more level headed. We have a random guy from the Kingdom Hall that keeps coming to “check on her” but in reality he is making sure she doesn’t accept the transfusion. My mom and aunt are tired of him. \n\n\nI talked to my grandma yesterday before leaving her and basically reassuring her even though she is 84 she still has an outstanding quality of life, she drives, lives on her own, sees friends etc. &amp; it would be okay to look the other way if it could save your life. My grandma said “maybe if I was younger.” \nAfter some thought, I get it. The KH is her community, if she accepted the transfusion it wouldn’t be a secret and I am sure they would disfellowship her and that would cause more harm I am sure. \n\n\nI am just angry, I am angry that I am losing another grandma in a 2 week span, I am angry at her faith and the people in it. I am just mad. I haven’t dealt with a lot of death and now it feels like I am getting the ringer. \n\nI learned a lot about these medical/ethical dilemmas in school but I never thought it’d happen in my family. I always knew about the blood thing, but id never thought my grandma would be in this situation. \n\n\n\nTL;DR: I lost one grandma last week, now my other grandma is in the hospital for a life threatening thing and she won’t accept a blood transfusion because of her religion and her congregation put eyes on her and us to ensure we don’t persuade her to do it. \n\n\nThank you for reading, I just had to get this off my chest. Everything will be ok in the end I know. Death is apart of life. \n\nEdit: thank you everyone for your condolences and sharing your lived experiences around this. A couple of things, I know this religion was my grandmas whole life. If she wants to go this way then in the end I’ll support her. I just can’t fathom the influence of religion, but I know that it’s not me. I know she is at an old age and she will just get worse as years go on. I guess it just kind of sucks that a religion is dictating on her medical problems. But if she is happy then that’s all that matters and I need to find a way to not be angry at her for it. ",
    "subreddit": "TrueOffMyChest",
    "title": "I have to watch my grandma die because she won’t get a blood transfusion",
    "upvote_ratio": 0.91,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3day5/i_have_to_watch_my_grandma_die_because_she_wont/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 15:22:38 UTC",
    "id": "1j3d6a0",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 2,
    "score": 0,
    "secure_media": null,
    "selftext": "This happened just a few months ago, but everyone around me hasn’t mentioned it since the night it happened. \n\nMy dad was neglected, physically and (from what I’ve gathered in conversations) sexually abused as a child. His mother started him on hard drugs before the age of 10. By age 14 he was dealing to her. He hasn’t had anything close to an easy life. But he wanted nothing more than to turn his life around when he had me. \n\nHe and my mom had me at 18 and 19, and were married about 4 months after my birth. As far back as I can remember, their marriage always had issues. It wasn’t easy for my mom, being married to an addict. He stayed clean for the majority of my childhood, but I know he had relapses along the way.\n\nDespite the issues, my parents have built a good life for me and my siblings. Money’s tight sometimes but we never are in need of anything. My dad is clean and works a good paying job, my mom works at the elementary school in our small town.\n\nBut the last two years I’ve seen a huge change in how my dad was acting. He was irritable, constantly arguing with my mom, and threatening divorce. \n\nThis all came to a breaking point one night when my parents, both considerably drunk, were having some meaningless argument fueled by alcohol and resentment. In the middle of the argument, my dad just got up and left the house. \n\nI watched him walk into the garage, shutting to door behind himself. I figured he was just taking some time to cool off, so I didn’t think much of it. \n\nAbout 20 minutes later my mom came to me crying telling me to go check in on him. (I now know that he had been mentioning taking his life to her in private.)\n\nI went and opened the garage door and found my dad crying at a table with a ladder and rope in the middle of the garage. I didn’t even look at him, I was staring at the ladder. I didn’t know what to say. His first response to me walking in was being angry with me. He told me if I thought that he was going to kill himself that way, I was wrong. He said he had much better methods of doing so. \n\nI didn’t leave, and I didn’t respond. I sat down on the other side of the garage and we sat in silence. Eventually he began crying profusely and telling me he didn’t know how to deal with himself anymore, and I started crying too. \n\nHe told me I didn’t have to worry about him, put the ladder and rope away, and told me to go back in the house. But it still didn’t feel right to me. Before I went inside I walked over to him without saying a word and hugged him. We stayed that way for a few minutes, both crying. When we stepped back he grabbed a pistol from his waistband and handed it to me. I took it inside without a word and made sure it was put back into the safe with the ammo separate. \n\nWe never mentioned this night again, and it’s been eating me alive from the inside out. ",
    "subreddit": "TrueOffMyChest",
    "title": "The first time I ever hugged my dad was to stop his suicide attempt",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3d6a0/the_first_time_i_ever_hugged_my_dad_was_to_stop/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 15:00:21 UTC",
    "id": "1j3co94",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 3,
    "secure_media": null,
    "selftext": "I've been following this community for quite some time now and I can finally come here to get something off my chest:\n\n\nMost of the posts in here or other communities that ask for an opinion or advice of what to do in their romantic relationship: you know what to do.\n\n\nYou are searching reassurance, which is very important and valid, sometimes we just need to feel validated to fire in us the courage to do what's needed to save ourselves from a bad situation. \n\n\nYour post is important.\n\n\nHowever, 9 out of 10: you know what needs to be done. Tbh, if you needed to come to reddit, post a personal problem you're having with your partner because you \"tried several times to talk to them\" or you \"are afraid of their reaction to say XYZ\".... I mean, if your voice isn't enough for your partner to care about you and really try finding a solution together; or if you are \"walking on eggshells\" with your partner, or if you \"been through the same discussion time and time again with no change nor even honest attempt to deal with said issue\",  you have a much deeper problem than the problem you came here to solve with our help.\n\n\nWhen communication is staled, cut, avoided or violently pushed away, this is THE MAIN factor to end any kind of relationship. \n\n\nIt's not that redditors like to say \"break up\" to all posts,it's just that there is really no one can do if your relationship is one-way street in communication. Really. \n\n\nWe would love you to thrive and be happy with your loved one, but if your partner doesn't consider you enough to try to solve a problem after you offering solutions and all, what other advice can we give to you?\n\n\nAnd you know it.\n\n\nDo not feel discouraged to post, though. We will reassure you and most of comments really want you to have a good relationship and be happy. \n\n\nWish you all the courage and happiness. For real.",
    "subreddit": "TrueOffMyChest",
    "title": "You know what to do",
    "upvote_ratio": 0.81,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3co94/you_know_what_to_do/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 14:59:43 UTC",
    "id": "1j3cnos",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 0,
    "secure_media": null,
    "selftext": "I'm not a horrible person. I'm a flawed person, and my insecurity made me act stupid.  \n\nI fought with my fiancé’s ex, threw a key at her, and told his ex wife things that weren’t entirely true. Their relationship made me insanely insecure, and it broke me.  \n\nThey were always together in a way that made me uncomfortable. I grew up with divorced parents, and they never spent holidays together or took me out as a family. It was always separate, two houses, two rooms, two holidays.  \nBut them? They always went out together with the kids. I went a few times too, but once, a street vendor called them a \"beautiful couple.\" And what was I supposed to be? The babysitter? A friend? It felt like everyone saw them as a couple.  \nWere they physically close? No, not really. I know I might sound crazy, but it was the way they talked to and treated each other.  \n\nI know I was wrong, I know what I did to her was awful. But I got to a place I never wanted to be. I was so desperate to keep him that I was the one who proposed. And he just… accepted. Like he was agreeing to give a coworker a ride home. Not like it was something he actually wanted.  \nAnything she asked him, he’d answer with more enthusiasm than he did to my actual marriage proposal.  \n\nI know I messed up, but I’m not okay. I’m gonna talk to him tomorrow about breaking up. I wanna be happy about starting a new chapter.",
    "subreddit": "TrueOffMyChest",
    "title": "I was terrible, but my ex made me insecure.",
    "upvote_ratio": 0.43,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3cnos/i_was_terrible_but_my_ex_made_me_insecure/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 14:54:14 UTC",
    "id": "1j3cje9",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 3,
    "secure_media": null,
    "selftext": "My dad didn't gave a f about me since I was born he was always selfish my mom never gave a f about me either she just patronized me, my dad was abusive he used to beat me every night waking me up at 1am just for fun or if he had a bad day at work my mother was always hanging out with her friends she never cared about me, but now their being nice because they've become old they want someone to take care of them but sometimes when my relatives come over he always makes fun of me in a subtle manner makes me wanna batter his face but i control myself, I just wanna leave my house as soon as possible.",
    "subreddit": "TrueOffMyChest",
    "title": "My parents are suddenly being nice to me",
    "upvote_ratio": 0.81,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3cje9/my_parents_are_suddenly_being_nice_to_me/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-04 14:51:30 UTC",
    "id": "1j3cham",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "I knew this friend since i was 10 years old and our moms were friends, they’re would always be times that they would just cut each other off but when they would be friends again, we would see each other. anyways last year she randomly stop texting since i moved states and in December i saw her on snapchat. i texted her to see if anything was wrong and she told me that her phone broke and that she was looking for me. we started talking everyday until her family came from another country  we started texting less but she was also getting her phone taken away the last time we talked was almost a month ago and the messages aren’t delivering and its going straight to voicemail. i texted her on snap and she changed her avatar and has been online all day now but has not been reading my messages. she has been saying her phone isn’t working that well but shes still online on snap and its not like she unfriended me.",
    "subreddit": "TrueOffMyChest",
    "title": "My friend stopped texting me",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j3cham/my_friend_stopped_texting_me/"
  }
]