[
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 10:43:48 UTC",
    "id": "1j5kpxw",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "When I was 17(F), I met someone. A woman. Online. I never met her in real life, even years later. We only spoke on the phone once for an hour (years later). It was basically a purely texting relationship. \n\nIt was a blogging site, one of those where you just wrote an online diary, basically. We hit it off as conversation partners, but it wasn’t more than that for around a year. We didn’t even talk that often, but when we did it was magical. She was much older than me, and I knew it from the beginning. She was 31 when we met. It was weird for me to talk to someone older, but it just worked, and I didn’t think about it much, so I rolled with it. We talked almost exclusively about a shared hobby. \n\nA year later I was having a complete breakdown. It was my first major mental health breakdown. I think I was just lost in transitioning from school life to college life. I suffered alone for a year (I didn’t really have a support system), and after that, I decided to open up about it in my online diary. I didn’t know what I expected, if I expected anyone to care. But she suddenly supported me. She talked to me a lot. She said she had been through the same things, so she understood what I was feeling. And that’s how it started: she explained to me A LOT about how mental health works. When I was a teenager, I didn’t “believe in mental health”. Till it bit me in the ass: I mean, I had this major breakdown, and suddenly, my “nonexistent” mental health incapacitated me. I had severe fatigue, panic attacks, even diarrhea. So, the woman basically taught me some basic concepts, explained some basic things to me. I started to read up on therapy, psychology, we’d discuss issues. \n\nIt was also magical: she just got me. I’d never had the privilege of having anyone in my life who understood me, gave me a manual to myself. I internalized my family’s approach of ‘you’re just a lost cause hysterical little shit, and there’s nothing left to do with you but ignore you when you get difficult’. And with her, I suddenly understood that I wasn’t hysterical. That my feelings had a cause. That I could actually fulfill my needs, and there would be no breakdown. So, she taught me how to relate to myself in a healthier way, how to be on my side, always. And the best part? She never actually lectured me on anything, never made me do anything, never got mad at me for not trying anything. And she was always respectful to me despite the age difference. She never played the ‘I’m older and I know better’ card, even though she was definitely older and knew better. She just explained how things work (for her, and how she thought it worked for me, too because we’re so similar), and I could take it or leave it. She just treated me the way that I understood how to treat myself. Like, she’d do or tell me things that’d calm me down, or help me get out of despair, or a panic attack, and I made a mental note ‘oh, that’s what I need when I’m having a panic attack. Yes, this works for me when I’m overwhelmed. Ok, that’s what I’ll ask for when I need support next time’. \n\nI think I was going through this very major and life-changing breakdown for about a year. My health was never the same after that (still isn’t, 13 years later), but I was slowly learning to live with this new version of myself. I felt more stable, but I still needed a lot of support. And she was there. I don’t think I’d be alive or (relatively) sane right now if it wasn’t for her during that first year, if it wasn’t for her guidance and gentleness. I really had no one, especially no one who understood me like she did. She’s the one who made me try therapy. Not by talking about it (she never went to therapy herself), but a couple of months after we started talking about my mental health, I was reading some posts about therapy, and understood that what I felt with her, I could find in therapy. And I got really interested in it: with her, I couldn’t ask for more or for a more stable presence. With a therapist, I could get that presence for an hour a week on a regular basis. Well, I never found that therapist with whom I had this magic. Never found anyone even remotely not hurtful, actually (I have a bad trauma from therapy by now, tried 20 therapists). The woman was really the only person in the world who got me to relax and listen to her without fighting and rejecting right away. Others would just trigger me hard, trigger a defensive response and then hurt me when I couldn’t accept what they were saying, even though I was fighting myself hard not to push them away. With her, it felt like she was going through the minefield of my psyche, knowing exactly where to go and where not to go and how to neutralize at least some of the mines without setting an explosion off. And the most awesome effect was that the neutralization usually had ripple effect: she’d make one small thing feel slightly better, and I could feel the chain reaction of things correcting themselves months later, things that were unrelated to the first conversation.  \n\nIt went on for years. I mean, she wasn’t my therapist, but… We talked about our lives, hobbies, mental health. It was always the older-younger dynamics, but not in a bad patronizing way: she’d just explain things, but she never pushed. She never said that because I’m younger I don’t get to have a different opinion. Never laughed at me. Never tried to make me respect her. She didn’t need to: I’ve never respected anyone like this in my life. She doesn’t have a conventional successful life: never married, never moved out of her family’s apartment, she didn’t even work most of her thirties (for reasons I didn’t fully understand but never pushed her to share). But I respected her more than anyone who had all those. She was very smart, driven, understood things deeply, always treated people with respect, everyone, she had this quality of attracting people to her, like, she didn’t wait for anyone to start talking to her (like I did), if she saw someone she found interesting, she’d just initiate. And she treated vulnerability with care. Doesn’t matter what happened between us, doesn’t matter if I hurt her (unintentionally. I’d never do anything bad to her intentionally), doesn’t matter what was happening — she never used any one of my open wounds, never chose to set any of the mines just to hurt me back. And she could do it at any moment. She spoke my language, she knew how to put things exactly in a way that her words would have the most effect, so she could destroy me. She never ever even tried in all those years. Not even when the relationship went sour and she was annoyed with me for years. She’d snap at the small things (once she started aggressively attacking me in a discussion about Harry Potter… Not me—my thought process. That’s when I knew it wasn’t just a rough patch but truly over), but she never went for my traumas. Not even when she didn’t enjoy me anymore. \n\nAs I said, the way she treated me had a ripple effect, fixing things without her even trying. Through the years, the way she treated me, talked to me, I developed that inner compass as I call it: basically, this feeling that in my life, I’m the one who always knows best. Even if I make mistakes, I’m still the one who knows best, and I’ll course correct if I make a mistake. I don’t mean that I feel that I’m always right about everything — just in my life, in things that concern me. It was very different from what my family told me: you’re incapable of anything, you should listen to us, you don’t have a brain. That inner compass made me finally start living my life. Not what my family thought was best — what I felt like doing. And the most beautiful part of it was that these things were not what the woman wanted either. They were truly mine. I moved to another country — something I always wanted. She clearly couldn’t understand my decision, but that didn’t matter. It was mine. I started speaking another language (English) more because that’s what I always wanted, and she couldn’t understand it either. And it didn’t matter. I knew what I wanted. And a thousand choices like that that she watched me make and kept her mouth shut enough. Because of this inner compass, I feel like there will always be a part of her in me, wherever I go. \n\nAs I’ve said, the relationship went sour. With years, I understood that this dynamics of her keeping me at arm’s length (I never knew much about her, her struggles, she never let me support her) doesn’t work for me anymore. And I wanted to actually talk on the phone, actually meet her. All I could get out of her was one phone call, and after that she was always “not in a good place” for a call. I finally was brave enough to admit to myself that I wanted more of her (and that I’m an equal in this relationship and an adult, too, so I have the right to pursue it), and wanted to have a relationship. She was vague about it. And then her reaction made me not sure about it, too. At some point she did try to rely on me more, and I didn’t get it, I guess, and it hurt her immensely (and when I understood that I hurt her, it was hard to forgive myself: she was someone I NEVER wanted to hurt. Not for any reason). And then we talked about everything — the dynamics, my feelings, our wants and desires — and just like that it was over, slowly, quietly, not really too painfully (and immensely painfully for me at the same time, but, I mean, she didn’t really hurt my feelings. I was just hurting because it ended). It was 7 years after we started talking. \n\nBut I could never forget her. I’d text her sometimes, just to know how she is. Nothing too personal — just to know if she was ok. She’d get annoyed at me for that. I couldn’t really understand why… She’d say something about me “trying to be a people-pleaser and showing that I still care when I don’t”. At some point, I asked her if I should stop texting her because I clearly annoy her. She said yes. I tried. I tried for two years. And then I texted her again and said that I’m not a child anymore (I was 28 at the time), and I don’t want to live in a world where we don’t talk. We didn’t have to be best friends, but I was certain we had to talk. Sometimes. About anything. At some point. And she agreed. It was weird, and I was the one texting her mostly. And then it fizzled out. \n\nI never talked to her about it. There was nothing left to talk about, nothing left to say. But I still think about her when something good happens in my life. When something bad happens, and I handle it like a capable adult without falling apart. When I manage to choose myself instead of caving in. \n\nYesterday was one of those days I couldn’t keep it in (the last one was a year ago, and she did acknowledge it, even if briefly). I texted: “Hey, it’s one of those days when I can’t help it but want to wish you the best. So, here I am, wishing you the best. You’re incredible, and I feel so lucky to happen to live on this Earth when you exist”. She read it immediately, and… left me on read. I’m not sure why. She used to tell me that she doesn’t know what to say when people tell her good things, and she used to do it with me, too. But she usually acknowledged it. Now she didn’t. Did she think I was weird for texting it? Did I make it awkward? Was it too much? I guess I’ll never know. But ChatGPT told me to try and write it in a journal, so, here I am, on this sub, trying not to bother the most magical connection of my life with my gratitude. \n\nI’ve been in love; I have parents; siblings (well, cousins); I’ve had best friends. And this connection was everything in one: an older sibling who’s almost like a parent who’s also my best friend and with whom I’m absolutely in love. She was my first adult love: the love when you don’t just fall for someone because you think they’re perfect, but the love when the more you see the imperfections, the more you respect and love the person. You understand how difficult their life is, and respect how beautifully they’re fighting and what a strong and capable person they are despite all their limitations. \n\nMy life (and mental health) are in no way perfect. I’ve made a lot of mistakes, some of which I won’t ever be able to fully correct. But the peaceful moments that I have, the good things, the authentic parts of my life, the parts where I feel like I’m living my life and not someone else’s, I owe to her. ",
    "subreddit": "TrueOffMyChest",
    "title": "I feel such deep gratitude towards someone and can’t share it",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5kpxw/i_feel_such_deep_gratitude_towards_someone_and/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 10:22:49 UTC",
    "id": "1j5kfc0",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 2,
    "secure_media": null,
    "selftext": "I lost my best friend to suicide in November. I feel so alone. I have my partner and sure he's also my best friend, but I need my best friend that I can fuck around and be immature with, the person I can talk to about my partner and confide in. 12 years by my side gone in a second and I never saw it coming. Now I'm 30, I don't know how to make friends like that anymore, I don't think I ever can, definitely not one that was like him.\n\nIf you're suicidal reach out, you have no idea how badly it fucks those of us left behind.",
    "subreddit": "TrueOffMyChest",
    "title": "Officially lost",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5kfc0/officially_lost/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 09:59:10 UTC",
    "id": "1j5k39v",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 1,
    "secure_media": null,
    "selftext": "Hi Reddit,\n\nI’ve been struggling with something and I’m feeling really self conscious about it. I (19 M) have always been aware that my penis is very small (well below average) and It’s something I’ve been insecure about, but I’ve tried not to let it define me. Recently something happened that made me feel way more insecure than I’ve ever felt. \n\nI was with a girl I’ve been talking to recently and we decided to have sex but during she said “I don’t know how to say this but I can barely feel anything. I was expecting something else” The way they said it wasn’t outright mean, but it felt so dismissive and made me feel like I wasn’t enough. It really got to me and now I’m stuck thinking about it all the time.\n\nI’ve always known I’m smaller than most guys but hearing a comment like that from someone I was intimate with really knocked my confidence. I’ve only been with 1 other girl and I was self conscious about it with her but we both had a good time for the most part. But after that comment I’m constantly worrying that I’ll never be enough for a future partner and that my size will always be a problem.\n\nI really don’t want to let this comment affect me, but it’s hard to move on from. Thanks for reading my post and I’d love to hear from anyone with advice to help move forward and feel better about not being well endowed. ",
    "subreddit": "TrueOffMyChest",
    "title": "Feeling self conscious about my body after a comment made while intimate",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5k39v/feeling_self_conscious_about_my_body_after_a/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 09:30:08 UTC",
    "id": "1j5jo2t",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 0,
    "secure_media": null,
    "selftext": "I’m so tired of life, my entire life I have been abused and struggling, I was finally doing better and got hit by a car causing me to lose my job. I’m stuck with a man who sexually and mentally abuses me because I can’t get a job to get away from him, I don’t have family anymore either.. I’m just so tired.. ",
    "subreddit": "TrueOffMyChest",
    "title": "I just want to give up…",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5jo2t/i_just_want_to_give_up/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 09:08:46 UTC",
    "id": "1j5jdja",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "The one person who was always there for me was a girl i had fallen for. She was the first one in years that made me actually feel this way about someone. She was loving caring and amazing and she would drop everything for me. If texted her she was there but today she was distant. And i know why. She told me she didn't have the same feelings and i know that and i have to be okay with that and I'm trying to. But it's really difficult to. She started talking to this new guy and I'm pretty sure they went out today because she looked so nice in the one snap i got from her. It was her going out look. And the only time she doesn't instantly respond to me is when she's out with someone like that. If it's one of her girlfriends she's normally really quick and talkitive with me still. And it sucks. It really hurts and she called today to say she had a birthday gift for me which is nice because i don't really celebrate my birthday i don't like making a day about me but it's such a kind gesture. And i could tell she was really happy in her voice. And she said she had a good day and wouldn't tell me why which means it's probably the guy. And it's not like she's hiding that fact i asked her not to tell me about him and those experiences because it made me feel bad and insecure but honestly i don't know if hurts worse not being told but it still feels bad. Anyways I'm really lonely feeling right now and just wanted a connection from someone and nobody is there to answer me it seems. All the people who i used to be able to pick up and talk to whenever whenever don't respond to me anymore and when i reach out in a time like this just to feel a small connection nobody is there. And i feel so alone and I've never felt this way. I've always been happy alone but it's so different this time and i don't like it. It's been a couple nights I've felt like this but this just feels so bad in an empty way. ",
    "subreddit": "TrueOffMyChest",
    "title": "The time i feel like i need it the most i don't have anyone there for me.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5jdja/the_time_i_feel_like_i_need_it_the_most_i_dont/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 09:05:42 UTC",
    "id": "1j5jc5t",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 2,
    "secure_media": null,
    "selftext": "Like the title says, I’ve never been on a date. Women have expressed interest in me + I’ve had past relationships but they were all long distance. Which means I’ve never gotten to take a woman out for dinner or coffee. Here’s the kicker tho, every time I tell someone that I’ve never been on a date, I get a variation of “no way” or “you’re lying” or “how?”. \n\n\nGetting these types of reactions means that I am good looking to an extent I guess, but it hasn’t translated to any dates. I will admit tho, I am a late bloomer, I was bullied mercilessly as a child, was fat then skinny and now I’m in the middle which is nice.\n\n\nI know I need to put myself out there more but every time I do so I get burned rather quickly, in spectacular fashion I may add. I’m also afraid of rejection which doesn’t help. My luck isn’t the best either, and considering how unavailable people in my city are, I guess it makes sense. I just feel so far behind my peers, I feel weird.\n\n\nI get everyone has their own timeline but at the same time, when most people your age are in committed relationships or going out on dates, it’s hard not to feel unloved/unwanted in addition to feeling like you’re behind.\n\n\nI also wonder if I should ever tell a woman this when (not if) the day comes? Will she be turned off? Will she be weirded out and think to herself “what’s wrong with this guy? How has he never been on a date?” \n\n\nThank you for reading and take care.",
    "subreddit": "TrueOffMyChest",
    "title": "I’m almost 22 and I’ve never been on a date",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5jc5t/im_almost_22_and_ive_never_been_on_a_date/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 09:04:41 UTC",
    "id": "1j5jbok",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I (22F) recently found this out and honestly have no one i can tell that won’t look at my dad in a weird way. I’ve always had my suspicions but i wasn’t sure what i was suspicious about. I knew he had done some pretty tame things like drink and smoke but whose dad hasn’t? In a way this more just confirmed that he has cheated. I’ve also always been a sneaky person, when i was younger i would always listen through the doors and behind walls whenever my parents would fight, just so i can know everything and see how transparent they’d actually be with me. I’ve just always been nosy. A while back I was maybe 13 or 14, me and my family decided to upgrade all of our phones. When each of us transferred all of our information to our new devices some of the applications pop up. And at 13 i was the most chronically online emo loser who grew up in the 2000-2010s era so i recognize a grindr logo when i see one. That day my dad did look a bit like he knew that i saw but he probably thought i didn’t know what it was he had on his phone. I just told myself maybe i thought i had seen that logo, and left it alone, until now. Tonight after my nightly routine i forgot my hair ties in my parents room so i decided to sneak in there while my dad was asleep, and his phone was unlocked with a chat opened. Like i said….im nosy. I didn’t see anything but i 100% knew it was grinder because i saw the logo. I did take a photo while his phone was open too , i dont know why but something was telling me to! I also wasn’t sure if this was something my mother knew of and just never said anything. Just because i feel like it’s her natural response to something like that. I love my dad, he’s still a father to me and my siblings, and he works hard. This doesn’t make me hate him but it does slightly piss me off because all i can think about is my mom and how much she doesn’t deserve her husband doing something like this.\n\nAs of right now i’m not sure what i’ll do. I just wanted to get this off my chest because i know it’ll weigh heavy on me if i don’t tell some one. I feel like if i tell my friends they might pity me just because this situation is just so weird and honestly i feel like freaky stuff like this doesn’t happen in anyone else’s family LOL.",
    "subreddit": "TrueOffMyChest",
    "title": "found out my dad had a grindr account",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5jbok/found_out_my_dad_had_a_grindr_account/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 09:02:28 UTC",
    "id": "1j5janh",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 5,
    "secure_media": null,
    "selftext": "Three years ago, I experienced strong health issues regarding my digestive systems. Basically, I was unable to eat, and had diarrheas (all evenings from 6pm, which is very weird, your digestive system ain't supposed to work that way)\nI had tests running, and nothing worked. Nor they found what I had (I had like deep tests, including bloods and cameras in my stomach).\nIt caused a depression (or the depression caused it? Who knows?). I was belittled by my GP who was like \"you've got nothing dude you're fine, in fact you're overreacting\". (I was willing to kill myself at the time because I had no hope I'd able to have a normal life)\nThen, I changed my GP, she gave my antidepressants, and it went slowly better. I finally recovered after like 8 months in hell. I was able later to enjoy my life.\n\nNow, as I am about to do something thrilling in my life for a few months, symptoms are back. It's been one month. I'm unable to eat, and I want to puke like a lot (like I have no appetite at all, I have dark thoughts, eructations...) Don't know why, might be after a COVID infection I had (but like I've had 6 of them till 2020 so I don't know). Or a changing environment. I left my city.\nIt's bad, but that time I got antidepressants quick, whereby I hope my symptoms will get better. I searched on the Internet, might be dyspexia. \n\nSi if anyone is experiencing something similar (or generally troubles with their intestines yk), you're not alone. We are a lot struggling with a society that does not understand us. I always had the feeling that, for people, when you don't have something killing you like cancer, it's no big deal you are overreacting and complaining for nothing.\nCancer is terrible, worse for most of them, but our troubles count. Especially when you can't enjoy a meal, a party, or just hanging out with friends because of that.\n\nGotta wait one week for the effects of my antidepressants, we'll see. The only good thing is that it disappeared one time, so it can disappear again.\n\nBless you guys, ",
    "subreddit": "TrueOffMyChest",
    "title": "People with digestive malfunctions, I understand you. Lots of people do.",
    "upvote_ratio": 0.86,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5janh/people_with_digestive_malfunctions_i_understand/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 08:46:40 UTC",
    "id": "1j5j3ag",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 4,
    "secure_media": null,
    "selftext": "Just here to vent. \n\nI (29m) have never had any real friends. I've always just had people that I know. Now, I'm at the point where I realize that I don't have anyone at all. I thought that I had friends at various points in my life, but they never stuck around for one reason or another. They were only \"friends\" with me out of convenience, meaning that they didn't have any of their actual friends around and buddied up to me to pass the time. Then there were those who were only \"friends\" with me to get what they wanted out of me before ghosting me or flipping out when I stopped providing what they wanted and ditched me. Those \"friends\" who wanted rides or money or favors that monopolized my time and resources to the point where trying to tell them that they were asking too much of me made them lash out. Those \"friends\" who wanted everything from me, from a listening ear to a walking atm, but who wouldn't do nearly the same thing for me. Those \"friends\" were some of the worst, but, honestly, the worst ones were those who tried to buddy up to me because they \"felt bad that I was all by myself\" because friendships built out of pity have the least amount of respect for the one being pitied. \n\nHonestly, I'm tired of it. I'm tired of feeling and being alone in crowded rooms. I'm tired of not having anyone around who cares about me and actually wants me around. I'm tired of being made to feel like it's a chore for others to talk to me. I'm tired of caring more about others than they do for me. I'm tired of being so lonely. \n\nI haven't had any real social connections in years and it's, obviously, starting to get to me. I just want to have people to talk to about random, every day crap. Or, better yet, I want to have people to have serious conversations with about the universe and life or whatever over a bonfire or in a random spot in the middle of the desert on a clear, star filled night. I want to have people who don't look at me funny when I say we should go on a random adventure to a museum that I think looks cool or some gimmicky attraction that I found that looks like it would be fun. I like gimmicks and museums and want people around who aren't going to call me weird for liking them and wanting to go experience them. I want someone to go fishing with who isn't going to say they're bored every five minutes or tell me we should just go to a bar because \"it's the same thing.\" It's not the same thing and I don't drink. I just want to have people around who take as much interest in me as I do in them without calling me or my interests weird or creepy or boring or lame. \n\nI want to go to museums and attractions with people. I want to go on random adventures to random places; maybe go randonauting or urban exploring- there's plenty of places to see. I want to go fishing with people. I want to watch football and baseball with people; maybe even go to a local game together. I want to have people who'll play basketball or badminton or Pokémon Go with me. I want to go bowling and to the arcade and to the put-put spot with people. I want to play billiards with someone who isn't going to call me creepy for loving to play it. I want to drive around aimlessly listening to true crime podcasts or creepypastas (Creepsmcpasta specifically) or just with people who'll share music with me and not call my taste in music weird or old-fashioned. I want to go have lunch in my car in the Sonic stalls with someone (don't know why, it just sounds like it'd be fun). And on that note, I want to have someone who's willing to go try new food places with me. I want to have someone to talk to about anything and everything. I want to be able to talk to someone about who's the best Robin or how Anissa is the worst character in Invincible (even worse than Immortal). I want to have someone to talk to about some random occult things that I read about or saw on the internet. I think it'd be kinda fun to pull out the Ouija board or some tarot cards or something. I want someone to share random fun facts with me as much as I like to share with them. I want to be tagged in random posts on social media or actually have someone acknowledge that we did something together or, better yet, have people who'll want to take pictures with me without telling me that I ruined the picture by smiling weird or just telling me that they don't like taking pictures with me. I want to have a barbeque by the pool in the summer; maybe throw a football around in the street. Or maybe have some random potluck and I'll make some Currywurst for people to try. I want people to teach me some of the languages that they speak or maybe want to learn one with me or I'll teach them some German. \n\nHonestly, as long as I had someone around who would share with me what I share with them, then that would be enough. Looking back on what I've already written, none of that would actually matter in comparison to just knowing that I had a friend. But, writing this all out and venting just makes me feel pathetic. It makes me feel even worse than having my family question me when I go out because I don't have friends so why am I out. That hurts on it's own, but the vibe of desperation that this seems like feels worse than that. I don't know. I've gotten this far, but it feels like none of it even matters and there's no point regardless. I'm just that person who doesn't have friends and it's just one of those things that needs to be accepted even though it hurts. It is what it is. It's really not like it matters anyway because if the rest of this year plays out how I'm expecting it to, I won't be here by this time next year anyway, so that just makes it easier, I guess. So, why not vent and ruminate for a while and see how I feel later on? Maybe things will be different and I'll feel differently. Plus, thinking about everything makes me think that I'm just better off alone regardless, but, even then, it doesn't make the pain of that loneliness go away, so at least having some type of outlet helps in it's own way. It's better than nothing and just keeping all of this bottled up at least. ",
    "subreddit": "TrueOffMyChest",
    "title": "I'm Tired of Not Having Friends",
    "upvote_ratio": 0.84,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5j3ag/im_tired_of_not_having_friends/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 08:42:54 UTC",
    "id": "1j5j1hh",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 2,
    "secure_media": null,
    "selftext": "I don't feel better, i don't see any positive thing in life. I didn't made any progress and I still feel the same. I believe staying alive was a mistake.",
    "subreddit": "TrueOffMyChest",
    "title": "One year ago I wanted to kill myself, I didn't do it and I belive it was a mistake",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5j1hh/one_year_ago_i_wanted_to_kill_myself_i_didnt_do/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 08:38:15 UTC",
    "id": "1j5izbf",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "Why do I not panic when most do or when I \"should? In fact, I thrive. \nI've been put in and witnessed some of the most extreme situations(because of my career and childhood)\nI witnessed one of my closest friends get shot recently. \nMy reaction is what is now bothering me. \nI was calm. Remember every single detail. Never panicked. \n",
    "subreddit": "TrueOffMyChest",
    "title": "What is wrong with me?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5izbf/what_is_wrong_with_me/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 08:32:49 UTC",
    "id": "1j5iwrt",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 1,
    "secure_media": null,
    "selftext": "We've been together for 10 months and living together since November, splitting bills. My bf is autistic and I pretty much brush off many things to that, but I'm starting to think he has no idea what love is.\n\nI'm 100% sure he thinks he loves me, I'm helping him a lot and we're basically the only people for each other in the whole country. It's pretty comfortable for us to live together.\n\nBut nothing besides his own thoughts and life is interesting to him. He speaks 99% of the time. He never shuts up, ever. When I talk, he interrupts me and when being called out, says he can't understand when it's the time for him to talk and when not. Sometimes he'll also tell me what I said was boring. Can you truly love a person if you don't give a shit about anything else apart from yourself and your thoughts?  ",
    "subreddit": "TrueOffMyChest",
    "title": "Is my bf incapable to love?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5iwrt/is_my_bf_incapable_to_love/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 08:27:47 UTC",
    "id": "1j5iuc7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "Hello everyone,\n\nI am a Sudanese civil engineer currently residing in the UAE. I am actively seeking scholarships, assistantships, or any financial aid. I've been admitted to ASU for an MS in Civil Engineering (water quality &amp; scarcity). Studying in the USA has been my dream, but securing funding has been extremely challenging, especially given the current situation.\n\nI have contacted over 60 professors and applied to multiple universities, but funding remains uncertain. With the ongoing conflict in Sudan and limited opportunities, I am struggling to find a way forward.\n\nI am afraid that even if I secure funding, I may not be granted a visa due to the war in my country.\n\nIs it possible to study there given these circumstances, or should I give up?\n\nIf anyone has insights or advice, I would truly appreciate it.\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "Feeling hopeless - seeking guidance on funding for graduate studies",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5iuc7/feeling_hopeless_seeking_guidance_on_funding_for/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 08:26:24 UTC",
    "id": "1j5itoh",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I just wanted to put this out there and hopefully someone can read it or relate, or share any advice, or whatever. i spent a very long time getting out there and getting a big group of friends, just for them all to leave, i’m okay with finding new friends, and have been looking for a long time, but the truth is, \n\nit wouldn’t usually bother me, but I can’t help but feel so bitter and mad about it, like I can’t really shake it. I’ve been looking everywhere around me, but same for jobs, I literally can’t find any social groups near me. (Multiple websites, social media groups etc.) Like i said, I just wanted to put it out there, at the very least someone will be able to see this.",
    "subreddit": "TrueOffMyChest",
    "title": "All my friends left.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5itoh/all_my_friends_left/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 08:25:57 UTC",
    "id": "1j5itfh",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 1,
    "secure_media": null,
    "selftext": "\nThrowaway cos yeah personal stuff.\n\nI (26m) plan to break up with my girlfriend (26f) next weekend.\nWe have been together for around two and a half years and we just dont really have anything in common, our conversations are frankly boring, she is a lovely girl which is why this has been the hardest decision ive ever had to make but i think its for the best.\nI spoke to her a couple weeks ago about a few things that were bothering me and sex was one of them and it made me realise that it was a different level of priority for us, for me its quite high and im very much experimental in that department and would love to try things but she just doesnt. And im not going to get her to do something shes not comfortable with or doesnt want to do. We also spoke about how id like to see more effort and enthusiasm during sex from her as i felt a bit like my pleasure wasnt that important which isnt a great feeling let me tell you, and she hasnt really put any more effort into it minus the absolute bare minimum.\n\nIf im completely honest, im terrified. Im scared of what the future will be, scared that I wont find someone else, scared about hurting her which is the last thing I want to do is hurt her but I also need to take care of my own happiness. This is my first proper relationship and girlfriend, I've never had to break up with someone and im so scared.\n\nMy minds still a bit mad trying to process my decision so sorry if this doesnt read very well.\n\nEdit: more things to get off my chest jesus sorry. \nI do still love her, and this yoyo effect I'm feeling of wanting to break up then doubting has made me feel so numb scared and empty I feel so lost. Each time my girlfriend messages me today it hurts so much i really do care for her but, i just don't know if I'm doing what I did early on and ignoring things that obviously do bother me because I've got complacent. ",
    "subreddit": "TrueOffMyChest",
    "title": "Im breaking up next weekend with my girlfriend of 2.5 years",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5itfh/im_breaking_up_next_weekend_with_my_girlfriend_of/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 08:03:59 UTC",
    "id": "1j5ij2t",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 36,
    "score": 567,
    "secure_media": null,
    "selftext": "TLDR; I am a sex worker and I let a client get too obsessed. He threatened suicide when I ended things with him and I went to the police on the off chance he was serious. It turned out to just be another ploy to try and get me to talk to him. \n\nLet's preface this with I am an independent sex worker. I do in person sex work by the hour and it's my job because I enjoy it and it gives me a lot of financial security.\n\nMy best friend, \"Celia\", also does sex work and we share notes about the job, and even have the same clients on occasion. \n\nShe met \"John\" first. John is an obese 300lb man, early 30s, and a high maintenance client. He was very recently divorced because he cheated on his high school sweetheart wife with another friend from high school. He left his wife, only to have his new girlfriend leave him about a month later for another man. Why did he cheat on his wife? Because she had \"gained so much weight that he no longer found her attractive\" (I saw photos of her, she was barely overweight. He on the other hand nearly doubled his weight since they got married). \n\nJohn is a home inspector for an insurance company. He makes good money by inspecting a high volume of homes, but part of the job is using all the data collected to write personalized reports on each home inspection. When John was married, his wife did the reports for him (this was illegal because the information is supposed to be confidential, but he was able to get away with it because they lived together and she used his work PC to help him out).\n\nSo he left his wife, then his girlfriend of two months left him. He was desperate to get her back any which way, and knew she needed money, so he offered to pay her to do the reports for him (which worked out because his wife was no longer willing to do them). He figured out a way to log into his work from her PC, trained her up, and used his position as her boss to make her spend as much time with him as possible so he could potentially win her back (he would only ever pay her in person, for example, and coerce her into spending hours with him before he paid her the money). This isn't important to the story, it just gives background information on his history of inappropriate relationships and manipulating women. \n\nIn the meantime, he started seeing escorts to fill the sexual void. Eventually he met Celia and very quickly fell into limerance. For the first time since his ex girlfriend left him, John had a new woman to obsess over. He shared his whole life story with Celia, texted her all the time, and visited her more often than he could afford. She found him exhausting to see (he had strangled dick syndrome from a porn addiction, and struggled to get off, but would urge her to keep trying). He talked constantly about himself, overshared about his childhood trauma, and would stay longer than he paid for, forcing her to have to kick him out each time. She set boundaries about him texting her so much and taking so much of her emotional energy, but he kept breaking them. \n\nSo she enlisted my help. I have a few more years experience under my belt, and felt confident that I could handle his neediness. After she talked me up, he agreed to meet me. \n\nThe appointment was a success. I was able to work around his strangled dick problem and he began to see us both regularly. But it became obvious that he was obsessive and inappropriate. He talked about Celia non-stop and shared personal details about their time together with me. He also shared private details about his ex-wife and ex-girlfriend. \n\nWhen he saw Celia, he talked about me and overshared in a similar way.  It made her very uncomfortable and she set boundaries around it. He didn't abide by the boundaries, so she fired him. \n\nHe was devastated... But I was able to distract him and help him process the heartbreak. He felt betrayed by her, because she treated him as a client and he felt like he deserved better treatment. I gently defended her actions, but not so much that it would offend him.\n\nBy this point I was earning steady money seeing him, so I didn't want to risk jeopardizing that cash flow. \n\nI could see that he needed the full girlfriend experience, so I gave it to him. He was very insecure so I often needed to reassure him that he could count on me, that I would be a stable person in his life, so long as he kept paying my rates for time together. I allowed him to take me to dinner off the clock occasionally, and texted him back on occasion (I didn't get triggered by his incessant texting in the same way as Celia).\n\nIt worked out pretty decently for a few months. I felt like I was meeting his needs, and he seemed happier and more stable. Unfortunately, my carefully set boundaries started to erode. He didn't see me as an escort anymore, he saw me as a sugar baby... Then as a girlfriend. He told me he loved me. Often. He started celebrating \"anniversaries\" for us and booking me for holidays.\n\nI, too, found his company exhausting. The whining, the complaining, the bad decisions, the love bombing, the delusional thinking.... It started to be too much. I felt like I was wearing a thick mask while I was with him, forcing myself not to show my disgust. I hated the way he bragged about how much money he made, while breaking the rules to do it. I hated his \"nice guy\" syndrome and how entitled he felt to attention from women. I hated the way he would eat dairy despite being lactose intolerant. I hated the way he binged on McDonald's after eating a large dinner with bottomless cokes. I hated the way he touched me and kissed me. I hated the self obsession, and the victim mentality he had. \n\nI couldn't stand his inability to take any personal accountability in his life. I eventually learned that despite making over 300k a year he was completely maxed out in debt because he had a gambling addiction in addition to his sex addiction. He learned to count cards at the casino and managed to con a younger card counter (I think he was only 21) into lending him tens of thousands of dollars to \"invest\" into being an advantage player at the casino. Unfortunately John lacked discipline and lost everything on slot machines. To his credit, he is planning to pay the kid back, but learning about this made me incredibly nervous and I started to get the sense that I was in over my head. \n\n I hated the way that he would talk about being sexually abused as a child without warning in excruciating and disgusting detail. I hated that he would rather spend money he didn't have on escorts and gambling than see a therapist. \n\nI felt gross and drained for hours or even days after seeing him, and would sometimes have to turn down other work because I didn't feel up to it. \n\nThe last straw for me happened Feb 16. We were supposed to see each other on Valentine's day, but I fell ill with the flu a few days earlier. He complained every day while I was sick and pestered me, dangling the money for my overnight fee over my head. He wasn't able to schedule another overnight until March, so if I didn't see him by Sunday, I would lose out on the $2000. Also he just really really really needed to get laid, and if I didn't see him, he'd go see another escort. \n\nSo, still feverish and really fucking ill, I let him come see me. \n\nIt's important to note that the first time he booked me for an overnight, he touched me in my sleep. This is a hard NO for me, and I let him know. Subsequent overnights, he did not cross that boundary. But this night, I woke up again to him assaulting my body in my sleep. My heart was racing and I felt so violated that I wanted to cry. I didn't want major confrontation, so I just pushed his hands away and told him I was still trying to sleep. But I spent the rest of the night on high alert, only able to doze for short periods of time. \n\nAfter that, I knew it was time to stop seeing him. Because we planned our appointments for each month up to two months in advance, it did not seem appropriate to simply ghost him. I struggled to find the right way to end it. I knew he was obsessively attached to me and it would be chaotic no matter how gently I tried to let him go. \n\nThen an opportunity presented itself. He saw another escort and fell asleep in his car in her parking lot. He woke up to the police questioning him and searching his car and phone. He cracked under pressure and admitted to paying for sexual services. He told them about me and about her. They chose not to arrest him or press charges, but when he related all the information to me, I decided to seize this excuse to stop seeing him. I told him that for my safety I did not want him to ever contact me again. \n\nAt first he said he understood and said goodbye. And then for the next five days, he bombarded me with texts and emails. He also sent YouTube videos of him crying and begging, snot dripping. Or drunk and begging and crying. Then sober and matter of factly laying out the reasons why my fears about his interaction with the cops was unfounded. More texts, more emails from different accounts. \n\nI responded to none of it. It made me feel even more disgusted by him, honestly. I hoped that he would eventually tire and just go the fuck away. \n\nThen he emailed me a suicide note. I didn't receive it until nearly four hours after he sent it because I was busy working. It stated that by the time I received it, it was already too late to stop him. But then three hours after the email, he sent me a YouTube video suicide note, which seemed fishy. \n\nIt has my already frazzled nerves in shambles. I worried that I could somehow be found responsible if he was found dead and they traced the cause back to me. \n\nI eventually gave in and called the police. I posed as a girlfriend and I hoped it would be a one and done call, but they kept calling me back for more information (I knew his address and full name and vehicle) and they wanted copies of his suicide letters. \n\nThey tracked him down and it turned out he was absolutely fine. He just wanted me to talk to him, and was willing to do anything to make it happen.\n\nI guess the cop successfully conveyed to him that he needed to stop harassing me, because the emails, texts and videos stopped. He did message my friend, but she told him the same thing the cop did - that he had to stop harassing me through her or else we'd go to the police. \n\nI wish I had ignored his suicide note. I feel tricked and I'm still angry about it. ",
    "subreddit": "TrueOffMyChest",
    "title": "I wish I had ignored his suicide note",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5ij2t/i_wish_i_had_ignored_his_suicide_note/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 07:31:30 UTC",
    "id": "1j5i389",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 3,
    "secure_media": null,
    "selftext": "Why the fuck does it. How am I supposed to gain the fucking karma if I can’t fucking comment. Do you really expect me to comment on some fuckass subreddit I have no interest in just to gain karma? What the fuck1?\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "Why does not enough karma to comment exist",
    "upvote_ratio": 0.59,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5i389/why_does_not_enough_karma_to_comment_exist/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 07:28:13 UTC",
    "id": "1j5i1na",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 18,
    "score": 93,
    "secure_media": null,
    "selftext": "My sister (f 30), has been with her baby daddy(m 30) for about 15 years now. He’s very much an abusive, manipulative, disgusting person that feeds off of people’s weaknesses. They’ve been together quite literally half her life, since she was in high school and at the time I was about 12 years old. At first he was an amazing brother in law and did all the cool stuff that comes with the brother territory. Then once I reached 14 all hell broke loose. I won’t go into too much detail but my sister’s baby daddy sexually assaulted me from from the ages of 14 until I was almost 17. Her and I had a huge falling out after the fact due to her denying it ever happened even though she was there for a few of the occurrences. He’s a very violent man and has even attempted to murder a misbehaving dog by strangulation that he had owned. I always had a sneaking suspicion that he had been laying his hands on my sister but after two days ago, my suspicions have been confirmed. A few days ago I got a call from my nana(f 71) stating that the baby daddy had beaten my sister pretty badly. He blackened her eye, busted her lip, attempted to strangle her(he left hand prints on her neck), and beat her in the stomach with a broom handle. In a panic, she managed to get away, escaping to a neighbor woman’s house a few blocks away. After he tried searching for her in his pickup truck, he then called my father and stated she was missing. He even tried filing a missing person report for her. Unfortunately for him, my sister had already contacted the authorities and notified them of the attempted murder. The cops escorted her the next day to get her two children from him and she’s currently in a women’s shelter until my nana can get to her. \n\nI don’t wish what she went through on anyone and I hate that she even had to endure any of that. I can only imagine the turmoil and sorrow she feels. Especially having been with someone for so very long. The problem I’m struggling with is setting aside my pride and being there for her in her time of need. We haven’t spoken in 5 years. At this point we’re two very different people.  I think back to me being that scared 14 year old that no one believed or cared to stand up for. I had messages and physical marks on me at the time and the adults failed me. I know she was a victim too, but it’s hard for me to forget her part as well. Any advice would be much appreciated, but please be kind. Thanks Reddit. ",
    "subreddit": "TrueOffMyChest",
    "title": "My sister’s now ex-boyfriend/baby daddy was my abuser.",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5i1na/my_sisters_now_exboyfriendbaby_daddy_was_my_abuser/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 07:25:40 UTC",
    "id": "1j5i0en",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "Life is so expensive nowadays, and it feels like no matter how hard I try, I will never be able to afford the kind of life I want. Moving out seems like an impossible goal, and even if I manage to get my own place, I worry that I will still be struggling just to make ends meet. When I think about the future, all I can picture is an endless cycle of stress, waking up, going to work, barely making enough to feed myself, coming home exhausted, and then doing it all over again the next day. It feels like I will be stuck in survival mode with no time or money to actually live.\n\nI want more than that. I want to travel, to see the world, to experience things beyond the daily grind, but I cannot afford to. I am happy right now, but I know childhood does not last forever, and that terrifies me. What happens when it is gone? What happens when I am on my own, facing a future that feels like nothing but work and struggle? I do not want to live just to survive. I want to spend the one life I have being truly happy right up until the moment it ends, but right now I cannot see a future where that is possible.\n\nI think I might just join the military so I can feel something, and if that goes well, I could get free college. But I don’t know, everything about the future seems so unappealing.\n\nWhy am I a rainbow Child and why did the condom have to break, I don’t want to be here.",
    "subreddit": "TrueOffMyChest",
    "title": "I really don’t see any point in living past eighteen",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5i0en/i_really_dont_see_any_point_in_living_past/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 07:08:27 UTC",
    "id": "1j5hrwp",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 21,
    "secure_media": null,
    "selftext": "Preface, this happened around the holidays, which is the only time I’m ever around my mom. We have little to no contact outside of when I visit my siblings.\n\nI (26F) told my mom that I think my boyfriend (28M) is going to propose to me.\n\nShe responded with “Can you wait so I can recoup some money after your sister’s wedding?” Not a “congratulations” “i’m happy for you” nothing positive at all. I immediately shut down and stopped talking about it. It’s been on my mind a lot recently because my sister is no longer in that relationship (he was an abusive alcoholic) and my mom doesn’t understand why it’s still bothering me.\n\nI would never allow her to even attempt to pay for it because she would hold it over my head forever. She doesn’t attempt to speak to me or have a relationship with me, she doesn’t speak to him at all, she would try to control everything about it. She honestly probably won’t even be invited at this point, but it deeply bothered me that it was somehow made about my sister.\n\nThis is the same woman that didn’t tell me that my cat had passed after having him for 10 years and refused to even talk about it or acknowledge it when I was upset about it. She has been unkind my entire life, but like.. what?????",
    "subreddit": "TrueOffMyChest",
    "title": "My mom always prioritizes my sister in the weirdest ways",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5hrwp/my_mom_always_prioritizes_my_sister_in_the/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 06:59:44 UTC",
    "id": "1j5hng3",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "Ok! I’ve just gotta get this off my chest…I am still pretty good friends with my ex as we have know each other since 8th grade and we are on good standing. See the problem is that when we broke up it was because he was making some choices that were really not great for our relationship. So, I have gone on several dates as a now single woman after 4 years of dating him and I feel guilty. Like I feel like even though I am single and I have broken up with him it feels like I’m cheating or lying by omission because I have gone on dates and made out with other guys. Like I still care for my ex but unless he can work out his problems I just can’t see a future with him romantically which sucks. I feel like me trying to sort out my feelings and date for fun would crush him if he found out I’ve kissed other men as I had only had one other partner before him. Ugh it’s been eating me alive anyways I just had to get that out to the world and not keep it inside anymore.",
    "subreddit": "TrueOffMyChest",
    "title": "Weird dynamic with my Ex",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5hng3/weird_dynamic_with_my_ex/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 06:56:19 UTC",
    "id": "1j5hlsy",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 3,
    "secure_media": null,
    "selftext": "\nI’m a 23-year-old guy (turning 24 in August), and I feel like a complete failure. Depression has been a constant in my life, and I’m pretty sure there’s something seriously wrong with me mentally. I’ve never sought professional help never in my life. Instead, I’ve coped by abusing drugs like MDMA, LSD, and and ket, weed every single day since I was 14. It’s been my crutch, but it’s not working anymore.\nI’ve never had a real girlfriend, though that’s not even my main issue. The real problem is I can’t stay consistent with anything working out, holding a job, nothing. Today, I was supposed to get up and go to work, but I just couldn’t be bothered. I bailed. It feels like my brain is fighting against me. I’m suicidal 24/7. When I hit these lows, they last about three months, then I get a month of “normal” before it crashes again. Right now, I’m in one of those dark phases, and it’s so bad I’m genuinely debating whether to end my life today. I don’t know what to do anymore.\nMy body’s a mess too I go from fat to skinny and fat to skinny again, stuck in this weird in between because of how depression screws with me. I’ve felt like this my whole life, and I’m terrified it’ll never change. I’m getting older, life’s getting more harder and serious, and everything’s so damn expensive. I have no ambitions, no goals. I never went to school. I blow all my money, I’m in debt, and I live alone. I feel like a corrupt soul. I say I believe in God, but I don’t really. I’m a fake religious person, a fake human.\nMy friends are starting to ditch me because of how I am, and I don’t blame them. I’ve had enough. I feel like death is the only way out of this hell because I can’t imagine dragging this on until I’m 28, 35, or older. It’s already unbearable. My mom’s tried to help me so many times, but she’s given up too. I always end up back at square one, no matter what. I hate myself so much.\nI guess I’m posting this because I’m desperate. Has anyone been here and gotten out? I don’t even know where to start.\n",
    "subreddit": "TrueOffMyChest",
    "title": "I hate myself and feels like I’ve given up without trying",
    "upvote_ratio": 0.81,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5hlsy/i_hate_myself_and_feels_like_ive_given_up_without/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 06:18:51 UTC",
    "id": "1j5h23j",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 3,
    "secure_media": null,
    "selftext": "Its the middle of the night and I've just woken up. I feel guilty. \n\nYesterday I traded my car in for a new truck. The heat wasn't working in my car but the dealership never noticed. I actually went to a few dealerships and none of them noticed the issue,   which seems weird because its winter and I'm in Canada. \n\nSitting down with the salesman, he never asked me if there were any issues with the car and when he asked if they could check out the car I let them. I don't feel like I tried to hide the issue but I really hoped they wouldn't notice. Now that I got my wish I don't feel real great about it. \n\n",
    "subreddit": "TrueOffMyChest",
    "title": "I traded in a car. The heat wasn't working.",
    "upvote_ratio": 0.8,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5h23j/i_traded_in_a_car_the_heat_wasnt_working/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 05:52:45 UTC",
    "id": "1j5gnd5",
    "link_flair_text": null,
    "media": null,
    "num_comments": 60,
    "score": 103,
    "secure_media": null,
    "selftext": "Not to sound whiny or anything. I'm in my early 20s and it wasn't a \"you have 6 months to live\" situation. Super high rate of surviving and all that. I finished my treatment last Fall and now I'm just here, stuck at home, recovering.\n\nI'm alright, physically. And I don't expect people to put their lives on pause just because I got cancer. But it's like I beat it and the moment just passed. I know it's not that important to other people and in the grand scheme of things, it's just a blip in a whole lifetime.\n\nFor me, though, I'm missing out on a whole year of college and it was going to be my last one. I'm at home and depressed, feeling mentally worse than I have in a while. I'm covered in scars on my torso that will never go away. I'm happy I'm alive and all that, but I guess I didn't realize that cancer just isn't a big deal if you live or it's not one of the more well known ones.\n\nI've just got no one to talk to about it, I guess. In a literal sense I do- my friends and my family. But not really. They don't care that much and then I feel like I'm dragging it out. So, I just finished some late night cleaning and now I'm feeling a bit sorry for myself. A little pathetic and I'm not quite sure what to do now. \n\nAnyways, congrats to me for beating cancer! 🎉",
    "subreddit": "TrueOffMyChest",
    "title": "I survived cancer and no one around me really cares",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5gnd5/i_survived_cancer_and_no_one_around_me_really/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 05:47:00 UTC",
    "id": "1j5gk86",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 43,
    "score": 425,
    "secure_media": null,
    "selftext": "I don’t understand, i told you he sexually abused me and all you could say to him was “it’s old, she forgives you. Don’t tell your dad”. \n\nWe all still stay in this house together because you won’t leave him EVEN after i told you what he did to me. \n\nI can’t even leave my room because of him. I’m a prisoner in my own home. 22, with no ID or job. You’re either too “broke” or “busy” to help me get my life in order so i can leave this shithole, but yet you have money and time to buy him beers and weed? \n\nIt’s taking everything in me not to end my own life, my cat is keeping me sane. ",
    "subreddit": "TrueOffMyChest",
    "title": "My mom’s boyfriend raped me from the ages 8-12 and her decision to stay with even after i told her fucks me up so bad.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5gk86/my_moms_boyfriend_raped_me_from_the_ages_812_and/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 05:06:36 UTC",
    "id": "1j5fwwv",
    "link_flair_text": null,
    "media": null,
    "num_comments": 287,
    "score": 6093,
    "secure_media": null,
    "selftext": "Ok. When I first met my girlfriend I noticed she sometimes made misjudgements but I didn’t think much of it. Now that we been together 2 years I realize how stupid she is. That might sound harsh but that’s the only word I can think of. We will go downtown to some place she wants to go and she will walk down a street and be like “oh wait wrong way” then walk down another street and be like “oh no wrong way” then walk down another street and be like “oops wrong way again”. It’s horrible, she has no sense of direction and I feel so stupid following her around.\n\nShe also talks in circles which makes me so angry. Like for an example yesterday she asked me, “do you want a burrito for dinner?” Then I replied we don’t have the ingredients for a burrito so I’m going to eat the food we have in the house. She then asks, “oh so you don’t want a burrito?” So I thought maybe she bought ingredients for a burrito so I said sure I’ll have a burrito. She then says, “ok but we don’t have the ingredients for a burrito”. Like YES I KNOW THAT.\n\nHer stupidity makes me treat her worse which I hate because I don’t want to be rude to people but sometimes the way she talks and acts just infuriates me. I also feel more slow and held down when I’m with her. Like when she makes a dumb decision I’m usually around her so I have to help her correct her mistake. \n\nAnytime I do something alone I feel a huge wave of happiness go through my body because I don’t feel held back from her behaviour. Overall she’s a good person but I honestly don’t think I can continue a relationship with her. Her misjudgments cause me so much financial loss and general stress. ",
    "subreddit": "TrueOffMyChest",
    "title": "My girlfriend is beyond stupid and I feel like I might have to end the relationship",
    "upvote_ratio": 0.9,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5fwwv/my_girlfriend_is_beyond_stupid_and_i_feel_like_i/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 05:04:42 UTC",
    "id": "1j5fvs8",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 2,
    "secure_media": null,
    "selftext": "I’m 15(f) and I live with my “parents”. I have this wonderful dog named Richy, he’s the best thing that ever happened to be but my parents have a rule where he can’t go inside the house, he’s an outside dog. It’s been raining a lot where I live- I’m talking like crazy winds and rain. I asked multiple times if my parents can let Richy in because he can get cold and lonely out side and the response I get every time is “no, don’t ask again” or they say I’m being dramatic about him and that he’ll be fine. To mention Richy has a little space under the balcony and in the laundry room which is right underneath the balcony but it’s still very cold there . I think the way my parents treat Richy is unfair there have been multiple occasions where Richy has gotten hurt and has been neglected, for example when he was a puppy a brick fell on his paw and he was limping for weeks and my dad refused to take him to the vet. As I’m typing this the rain is getting far worse and the wind is howling.To all the dog owners out there do you guys leave your dog out in the rain? ",
    "subreddit": "TrueOffMyChest",
    "title": "Am I being over dramatic about my dog?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5fvs8/am_i_being_over_dramatic_about_my_dog/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 05:01:13 UTC",
    "id": "1j5fth6",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 26,
    "secure_media": null,
    "selftext": "First of all, I want to apologize for my poor English since I’m doing this through a translator. I’m a 19-year-old guy who has had pectus carinatum his whole life. It has brought me a lot of teasing and stares, and even though I have the mildest case, I have a small banana-shaped protrusion on my sternum. I’ve wanted surgery since I was 14.\n\nAs a first option, they wanted me to wear a compression brace for a year, which is complete nonsense. I knew it wouldn’t fix what I have, and even the doctor said so. I fought for years to get surgery until one day they took me to the sub-capital to see a doctor. The doctor told me it was a very mild case and that the surgery was very simple: they would cut two cartilages, push the sternum inward, and that was it. This happened in June 2024. I was very excited about the idea of having a normal chest.\n\nMy experience with this condition has been horrible and has caused me a lot of insecurity. Every time I wear a t-shirt, the lump is noticeable, making me look much fatter than I actually am. I’ve been training for five years, and it’s horrible to see how I can’t make progress in my chest because this damn protrusion sticks out—it’s all I’ve seen in the mirror for five years.\n\nGoing back to what I was saying, my parents postponed the surgery until 2025. I got angry with them and gave them an ultimatum: “Either I get the surgery, or I leave the house.” I want to clarify that this was the only thing I was asking for, the only thing I wanted. I’m the youngest child, and I have a 29-year-old sister who is studying her second degree because she realized that the first one wouldn’t get her a job. My father has always helped her with her apartment and university expenses. I’ve always known she was the favorite, and I wasn’t asking for much—just this surgery.\n\nToday we went to see a doctor in our city, and instead of agreeing with the previous doctor, he said they would have to break my abdomen, cut all the cartilage, and insert a prosthesis. I suspect this was all planned because my father is a doctor, and I have a feeling he talked to this doctor to make me change my mind or to have an excuse to say no. I walked home because I was so angry at them. I’ve been fighting for this surgery for about five years, and they found the perfect excuse to deny it.\n\nTonight at dinner, I ate in my room. I’m so tired of them—they are the most vile, cruel, and arbitrary people I know. I hate them for making me go through my entire adolescence and now my adulthood with this lump in my chest just because they don’t want me to have surgery. They have no idea how much I’ve suffered or how much I wish with all my heart to die. I wish I could just wake up one day and no longer exist in this horrible world. I hate the parents I got, and I hate my sister for being the favorite. If I could, I’d take a gun and blow my brains out so I wouldn’t have to endure this anymore—but I will make them pay. As soon as I get a job, I’ll leave this place and never speak to them again. When they’re old, I’ll put them in a nursing home—and I’m being generous. I should let them rot in their own filth.\n\nI’ll update if there’s any news.",
    "subreddit": "TrueOffMyChest",
    "title": "I hate my parents for not letting me have surgery for pectus carinatum.",
    "upvote_ratio": 0.89,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5fth6/i_hate_my_parents_for_not_letting_me_have_surgery/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 04:56:11 UTC",
    "id": "1j5fqf1",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 6,
    "score": 3,
    "secure_media": null,
    "selftext": "I don’t have anything going for me. Nothing at all. I no longer have any dreams or ambitious.  People who say “you aren’t damaged” are lying; but I only see that in movies. No one actually cares in my life.\n\nI am so tired of waking up. My self esteem is shot so I don’t go out. Bullying from my dad, family, school, people I just care about and shit. Its so engrained in my bones. My friends never told me I was mean to them, I was teased at home. I thought it was normal.  But its just kinda settling in just how abused I was. I am broken. Theres no way out for me. The life I want to have is impossible. Nonexistent. And everyday I blame myself for it.\n\nI find myself thinking of death more often. Realizing the few friends I have shouldn’t have to deal with my messiness. I am suppose to be an adult, but Im so childish. Im a failure just like all my nothing ass brothers and sisters. I just  hope when I have the nerve to finally end it they are worse off than me.\nIm evil and Im bitter. They destroyed it. We could’ve been a family. But it was easier to hate and abuse instead of just getting rid of me and I just ended up hurting people I cared about most.\n\nIm sorry my friends whom have forgotten me. I didnt know I was being abused. I didnt realize I was hurting you so badly; but I wish you could’ve told me, but its also my fault for nor providing you a safe space . I hope when or if you see my missing posters; or obituary(tho I doubt I’ll have either) my demise makes you smile and alleviates and hatred you have for me.\nI never forget your faces or your voices. ",
    "subreddit": "TrueOffMyChest",
    "title": "Im a loser and honestly I feel I deserve it",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5fqf1/im_a_loser_and_honestly_i_feel_i_deserve_it/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 04:46:16 UTC",
    "id": "1j5fkiv",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 0,
    "secure_media": null,
    "selftext": "My partner (20NB) wants to get my (19F) name tattooed. We’ve been together almost 3 years at this point. My opinion is that they should wait, if even getting it at all. I have every intention of staying with them but I couldn’t in good conscience let them get my name tattooed this young. They’re upset coz they’ve been wanting to do it for like a year now and I keep saying wait. I’d prefer if they did it for us to at least be married but they don’t want to wait that long. I suggested maybe a few years nd they got upset. Idk I don’t think I’m wrong for this. I wouldn’t feel good about letting them do something I myself wouldn’t even do right now, although they’ve said they don’t care if I get theirs tatted or not",
    "subreddit": "TrueOffMyChest",
    "title": "My partner wants to get my name tattooed",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5fkiv/my_partner_wants_to_get_my_name_tattooed/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 04:44:45 UTC",
    "id": "1j5fjlk",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 3,
    "secure_media": null,
    "selftext": "Every time I get close to someone, my mind starts obsessing over them, and I absolutely hate it. This is the third time it’s happened, and I feel like it’s destroying me because, with the first two, I ended up pushing them away, and we eventually became strangers again.\n\nRight now, I’m obsessing over a really close friend in our small friend group of three. We’ve known each other for almost three years, give or take, and we’re so close we even refer to each other as “siblings.” But recently, something changed ad I've started obsessing once again. I can’t stop thinking about them. I always want to talk, hang out, or just spend time with them. And when they spend that time with someone else, I get jealous to the point where it physically hurts and I even feel betrayed in a way.\n\nBefore you think I’m completely nuts, I know this isn’t okay. I don’t start arguments, and I never tell them how I feel because I know I don’t have the right to control who they spend time with or talk to. I would never want to make them uncomfortable or make them feel like they owe me anything. But that doesn’t stop the thoughts from eating me alive. I cannot help but wish I had them all to myself.\n\nSometimes, instead of hanging out, I’ll say, “I’m tired” or “I don’t feel like going out,” when in reality, I do want to spend time with them—but I just can’t handle it mentally. So instead, I drive alone late at night, trying to escape the overwhelming thoughts.\nI don’t want to lose yet another person because of my own obsession. I am trying my best to stop, but so far, I’ve made little to no progress.",
    "subreddit": "TrueOffMyChest",
    "title": "I hate how I obsess over people I care about, and it’s ruining me.",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5fjlk/i_hate_how_i_obsess_over_people_i_care_about_and/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 04:43:06 UTC",
    "id": "1j5fikp",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 4,
    "secure_media": null,
    "selftext": "I didn't care how much sleep I lost each night. I never got tired of hearing her voice, or seeing how pretty she looked each time she smiled or laughed. I wonder if she knew just how beautiful she looked when she talked about something she loved. Everything with her felt new and exciting as if I was experiencing love for the first time all over again. \n\nThe nights are too quiet now. I still check my phone, knowing her name won't appear. I scroll through old messages, replaying our conversations, and wonder if she thinks of me. If she does, I hope it brings her a smile, the way those memories always do for me. And if not, that's alright too. Because I know, in that time, we shared something truly special, a spark of pure joy that I'll always cherish. \n\nI don't know when or if I'll ever see her again, but I know this for sure: she was one of the best moments of my life. I hope she knows that she is still deeply loved and profoundly missed.",
    "subreddit": "TrueOffMyChest",
    "title": "The nights are too quiet now",
    "upvote_ratio": 0.84,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5fikp/the_nights_are_too_quiet_now/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 04:37:17 UTC",
    "id": "1j5ff3g",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 15,
    "secure_media": null,
    "selftext": "my family has fallen on rocky times. my dad lost his job a number of years ago and picked up a job in a new field that he also recently lost. \n\nmy mom is the only one with a stable income and i try to help as much as i can but she confided in me that unless my dad goes back to work before his government assistances runs out that we’re probably going to have to sell the house i’ve grown up in and lived in my whole life \n\ni’m very scared that we’re going to have to sell and move.\n\ni also have pets which is scaring me that we might have to rehome them if we have to move. \n\ni’m terrified my whole life is going to change and im not ready for it. i’m hardly an adult, this is all so much and im genuinely terrified and worried about what could happen",
    "subreddit": "TrueOffMyChest",
    "title": "my mom just confided in me that we might have to sell my house",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5ff3g/my_mom_just_confided_in_me_that_we_might_have_to/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 04:34:14 UTC",
    "id": "1j5fd9g",
    "link_flair_text": null,
    "media": null,
    "num_comments": 21,
    "score": 0,
    "secure_media": null,
    "selftext": "From now on I will force myself to think of lesbian stuff as disgusting. I will no longer engage with any of that sinning behaviour and I will find my way back to Christ. I will remind myself that it is gross, it is sinful, and it is dirty. This behaviour is mutant-like and abnormal. As of now I still feel no attraction for men but I will get there through Christ for heterosexuality is natural and normal.\n\nI was lucky to be born Catholic. I was lucky to have been taught what sins are from early on to avoid the consequences that include eternal suffering. This is nothing but another trial. This is the only way to be accepted by Christ and my family. I will choose to keep the peace in my family. I beg for forgiveness from the lord for I have strayed. I was wrong for being tempted by the devil. Although I will not harm anyone else, gay is gross.",
    "subreddit": "TrueOffMyChest",
    "title": "From now on I am no longer into girls as a girl. I am going back to Christ and I strive to be homophobic to myself.",
    "upvote_ratio": 0.23,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5fd9g/from_now_on_i_am_no_longer_into_girls_as_a_girl_i/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 04:31:05 UTC",
    "id": "1j5fbdy",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 5,
    "secure_media": null,
    "selftext": "You weren’t happy with me. It felt like whatever I did would never make you happy. I hadn’t felt loved by you in a long time. You say you love me, but why didn’t you act like it? I tried to show you love and you didn’t want it. There’s only so much I can do before I can’t anymore. \n\nYou say you miss me. But you never talked to me. You hid all your feelings from me. We’d go to therapy and it felt like an attack on everything I did. It felt like anything and everything I did was wrong. \n\nI was always the one in the wrong. \n\nBut what about the things you did that hurt me?\n\nYeah I’m good at compartmentalizing. I’m good at bottling up my feelings to make others comfortable. It didn’t feel like you cared that I was doing it since it gave more room for you to talk about how you were feeling. \n\nI gave so much of myself to you. \n\nDid you really love me?\n\nOr did you just love the idea of me?\n\nSomeone to listen to you and ask how your days were and what? Why didn’t you do that for me? I wore myself out trying to make you happy. Happy with me. Happy with you. Happy with literally anything. I couldn’t do it. \n\nI miss the days that we could sit and talk for hours. I miss the days that you would smile when you saw me. I miss the days that felt like you truly loved me. I miss the days that we were actually friends. \n\nBut maybe it wasn’t real. Maybe it was the attention I gave you? Or the gifts? Or maybe I was a distraction? Something shiny and new. Uncharted territory. I don’t know. \n\nI don’t know what you’re telling people. That I broke it off? That I did this and that and whatnot? You blocked me so it’s not like I can try to support you. Not that you were accepting of my support over the last year plus. I really tried. And it felt like you just didn’t care. \n\nI shouldn’t have looked you up on here. I noticed you blocked me days ago. You didn’t tell me where you were moving-not that it’s my business, but it really sucks being completely blocked out by someone who is saying they love me. \n\nLoved me. \n\nMy heart hurts. And I can’t even talk to my best friend about it. \n\nYou wanna know why I’ve been talking to her? Because my world revolved around you. I stopped talking to my friends. All of my friends. Because you were my world. But I was just a bother to you. An annoyance. A burden. \n\nI needed someone to talk to and she messaged me. She wasn’t a bad person so I don’t know where you got that from. If anything, I was the bad person in that situation. I let you be mean to her. I let you do what you wanted because I thought you were my forever. But you didn’t think I was your forever. You don’t treat your forever the way you treated me. How are you so okay with just disappearing on me?    \n\nI truly hope you can find happiness. I wasn’t the one for you and that’s okay. I hope you can show love to the next person you find. Not as a rarity, but strong and unwavering. Love them with everything you have, because you deserve love and to love. \n\nI just wasn’t enough. \n\nI wasn’t ever going to be enough. \n\nI just wish you’d have told me sooner. ",
    "subreddit": "TrueOffMyChest",
    "title": "Hurt",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5fbdy/hurt/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 04:21:46 UTC",
    "id": "1j5f5h7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 8,
    "score": 0,
    "secure_media": null,
    "selftext": "Basically as the title says. I(29f) have always had a smaller butt. I’m curvy and I look like I should have a big butt from the front, but I just don’t. I have big boobs and nice curves, but this one thing just keeps me honestly hating myself, especially with how worshipped big butts are in today’s world. Sucks for us little butts due to genetics. Sometimes it’s honestly made me not want to live because the love of big butts is all over the media, and is the beauty standard. My husband tells me he loves my butt, but I know deep down he probably wishes I had more. ",
    "subreddit": "TrueOffMyChest",
    "title": "I’m so insecure about my small butt in a world of bootylicious peaches",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5f5h7/im_so_insecure_about_my_small_butt_in_a_world_of/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 04:14:46 UTC",
    "id": "1j5f159",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 5,
    "secure_media": null,
    "selftext": "Basically the title, I 22F am going to visit the city I’ve always wanted to move to. I want to visit not in a tourist way but staying in the areas where it would make sense for me to live in. I will decide if it is a fit for me and if it is I will start going around and looking for jobs. I have an idea how to get a place there (finding a sublet for a few months and eventually trying to lease). I have lived in a similar city so I have an idea of how to go about it. I currently live with my dad and I have come up with a complete lie to tell to him I am visiting my college town to see friends for a birthday. I am going 1000 miles away from there 😭 I have lived with my dad for the last year and I’ve enjoyed it but I need to be alone, I feel like an adult and I want to act independently and be able to be myself. I just feel like he will be angry that I am going to this city when I live with him because if I can afford to do this then I should be helping out more. I will be honest I partially took a term off so I could focus on moving out because I find this more important at this point in my life. I do not think I can be open about it since the city seems “unrealistic” in his eyes. The last time I moved when I went to college he said “you’ll be back in a year” and when I had to move back due to tuition issues he said “I told you so.” I didn’t stay with him for long that time but I bounced back. This time when I move I wouldn’t have to worry about tuition, I would be focused on making sure I make 3x or more on rent (which is why IF I like it I will be looking at jobs) and be able to figure my life out as woman in my 20s. I am so excited, I guess I wanted to share my excitement to go with someone so I’m doing it with the internet. I know this sounds like I’m more anxious which I am but I know I’m doing the right thing. ",
    "subreddit": "TrueOffMyChest",
    "title": "I’m going to visit the place I’ve always wanted to move to and I’m not telling anyone",
    "upvote_ratio": 0.74,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5f159/im_going_to_visit_the_place_ive_always_wanted_to/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 04:11:27 UTC",
    "id": "1j5ez5s",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "i honestly really should probably talk abt this bc it honestly was actually pretty tramuatizing, enough that i feel like i may have locked away some memories of what happened bc of just how awful some of the experience was\n\nmy memory is somewhat spotty bc of how scary it all was but ill try my best to explain\n\nmy friend had a Halloween party at her house\n\nwe decided to play something that involved running, which was a rather stupid decision as everything was slippery and dark outside\n\ni was running near/on ground that was steeply raised up a bit for a buliding to be bulit flat on\n\ni slipped and fell, despite the mud, when i instinctively reached out to brace myself by putting my hand out towards the top of the small slope i got hurt, really really badly, i had never been in such pain before, i dont remember how quickly it arrived exactly but it was pretty quick to show up\n\ni started crying a soon as the pain hit and the girl i had been running behind took notice and from what i can remember asked if i was ok, the other girls i was playing with eventually noticed and the escorted me to the house and to my friend's mother who is a vet/vet tech\n\nshe wrapped it in blue vet wrap in the kitchen and asked if i wanted to go to the doctor, and child me refused out if fear of possibly having to get surgery and probably bc i didn't want to inconvenience anyone, the vet wrap was uncomfortable and irritating but honestly the splint i got for a broken foot abt 2 years ago was worse, and it was by an er doc too, and while child me had to experience that awful splint, the vet wrap did make my hand feel better, i felt like i could pick it up and move it safely\n\nso i ended up staying inside sitting on one of their couches in the living room and resting my arm on the arm supports, watching tv with my friend's mom, i wasnt rly interested in the show but that was the least of my worries then, i think at one point she brought me food, like a hotdog or smth, which had ketchup bc my autistic ass wouldn't eat meat unless ot had ketchup on it\n\nthe other girls went outside after everything calmed down somewhat, tho my friend stayed a bit longer from what remember to make sure i was ok\n\neventually they came back inside for an event i forget if it was planned or started bc it was dark and I was stuck inside\n\nbasically it was a game where someone would get wrapped on toilet paper to become a mummy, they included me in it by loosely wrapping parts of my arm/hand that i was willing to move\n\nand then we eventually all went home, i dunno when any of this next stuff happens exactly but ill try to explain it in order\n\ni was cyberschooled then and at first i was fine... until i needed to write something, im right handed and my right hand was the one that was injured\n\ni remember my mom yelling at me because i refused to use my right hand and i think i asked if she could write for me, she told me to use it and i remember crying and saying \"I cant! I cant!\" i tried to move it even slightly in order to try obeying what she said but the pain was terrible, horrendous, unbearable, i cant think of words that can extensively describe how much pain i was in\n\ni dont quite remember it all but i think when i tried to use my left hand to write i was yelled at too, and my mom minimized my pain by saying smth along the lines of \"it isnt that bad\" and i was also condescendingly asked if i wanted to go the doctor which i again refused fearing surgery and also bc having my parents yell at me made me upset\n\nall this time i remember i still had that blue vet wrap on, my hand was shaking and in so much pain, i forget if my mom did the usual \"let me feel it\" thing but if she did i most definitely refused and probably yanked it away, based on the fact I still had that vet wrap on i think it was probably the next day\n\ni was allowed to write with my left hand but not without being scolded, i remember writing down things in notebooks for fun with my left hand, and i even decided that a character id made had my left hand's handwriting, i eventually got better writing with my left hand and honestly really had fun with it\n\nwhile i wrote and did things with my left hand i also did not use my right hand or bend my wrist, at least i did as little as possible, i kept on using the vet wrap to stablize it until it wouldn't stick no more, then i found some wrap i has gotten from when i sprained my leg and so i it instead, and remembered how i treated my sprained leg, used that was refrence for resting my hand and also didn't move it bc it was painful\n\ni dont remember much else abt the recovery, i think i stopped wrapping it and started using my right hand again as soon as the pain lessoned, which probably was after like a month or two perhaps? ik it takes longer for a broken bone to recover but the pain does go away pretty quickly honestly, i remember my mom expecting me to recover from my \"sprain\" in about a week and was upset i still refused to use it and instead write with my left hand\n\ni did keep on writing with my left hand sometimes for awhile after that just for fun, which ironically probably helped my right hand recover lol\n\ni dont quite know how long after it was but i think it was a decent chunk after but within the same year, i once again slipped and fell and i forget which handi landed on but based on the pain and how caught myself (the same way again) i think it was my right, which i once again assumed was a sprain, but only a minor one, so i again pulled out the wrap i had and i think for abt a day or 3 days wrapped my hand, i remember not having much pain and wondering if it still needed wrapped the next day, but i still ended up keeping it on i think\n\nand until i was a teen it never hit me that the pain i feltin my bones was not a normal sprain thing but probably a broken bone, and it really hit me after a horse broke my foot 2 years ago that yea, that probably wasnt a sprain... bc like it was while less pain, that pain i got from my broken foot felt literally like a lesser version of the pain i felt in my hand when i was a kid\n\ntbh im not completely sure if i did break my hand as ive never rly had it inspected for past breaks, unlike my foot it doesn't rly act up when the weather changes or from overuse etc, at least i think so? i never rly took notice of anything like thay as a kid because i was never aware or looking for anybpain related to broken bones, so im open to anyone suggesting its something else, not for legitimate medical advice as well, ik i shouldnt get it from here and its already healed, just out of curiosity, i wonder if it was like a pinched nerve maybe, but it didnt feel like one at all (ive unfortunately had and continue of have pinched nerves in my neck 🙃)",
    "subreddit": "TrueOffMyChest",
    "title": "I treated my for a broken hand/wrist as a kid and didnt know/realize it until i was older (very long read oof)",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5ez5s/i_treated_my_for_a_broken_handwrist_as_a_kid_and/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 04:02:45 UTC",
    "id": "1j5etqw",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "Strange title, I know, but I dated this guy in high school, and at the time I didn't think I was in love with him. The thing is that every guy I've been with since him hasn't measured up. He's the guy I compare every other man to. He's the only person in my 31 years of life that actually made an effort. He always respected me and my boundaries. He accepted everything about me. He's the only guy to actually plan a date with me rather than putting in the minimum effort of asking me which restaurant I want to go to. I broke up with him because I didn't feel like I was good enough for him. He was on the football team and I was an awkward emo kid. I blew him off at first because I had been asked out by another football player as a joke a couple weeks prior. So for our entire relationship I just kept waiting for him to reveal that it had all been a joke too. My first real kiss was an uncomfortable situation that felt pressured and forced, and I know that had it been with him it would have been so natural. I lost my virginity to someone who had zero respect for me who broke up with me because his dad said he should play the field. Itbshould have been him. I married someone abusive and ended up divorced by the time I was 27, and now I have a child with someone who I live with and still only see on weekends most of the time because he would rather play videogames all night and sleep all day than actually put in effort with me and our child. Hs bf and I hooked up years ago when we were between relationships and I psyched myself out again thinking I wasn't good enough and ended up blowing up on him over something that could have been easily talked through. I know that we are both adults and therefore totally different people now, but I find myself thinking quite often weather the new him would like who I've become. I'm so badly damaged by a string of toxic men when I had the perfect guy for me and screwed it up multiple times. He's my one that got away, and it's my fault because I pushed him away.",
    "subreddit": "TrueOffMyChest",
    "title": "I realize now I loved my first bf",
    "upvote_ratio": 0.4,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5etqw/i_realize_now_i_loved_my_first_bf/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 04:00:17 UTC",
    "id": "1j5es1z",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "Autistic af &amp; feeling ...emotions? \"Happy\" has always felt fake. I feel very happy &amp; can't process it.\n\nDude fixed one thing I hated about myself &amp; now I'm GOING CRAZY trying to ... like... idk, accept the exception of contentment &amp; warmth?",
    "subreddit": "TrueOffMyChest",
    "title": "I got my tat fixed &amp; feel.... REALLY feel things",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5es1z/i_got_my_tat_fixed_feel_really_feel_things/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 03:36:27 UTC",
    "id": "1j5ecgo",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "I agonize over my life. I am officially married but basically no relationship or sex in about 5 years.  My husband is bipolar and treats me like crap even though I am the sole supporter in a tropical country.  I have a business and work my ass off to support my legal husband and 23 year old daughter. She works now so not so much support. While in my home country I stay with a friend of the opposite sex and pay rent albeit not anywhere near market rent. When I am in my home country I pay my way.  But my “friend” definitely likes me. He made advances on me and because he did so much for me I almost felt to secure my life I needed to reciprocate or I would be on the street. My “husband” has never shown me he really cares. He is bipolar and I was emotionally and physically abused for years. I met my friend and moved in.  I run a business in my home country and travel back a lot to tend to biz.  I never wanted a relationship with anyone but felt guilted into it or I would be on the street. I could not afford an airbnb and needed to stay with my friend. Well he made advances and me feeling pressured went along with it to secure my and my family’s well being. I care about this person a lot but am not willing to give up my life in my tropical country.  I have 5 dogs that I cannot take to my home country and could not afford to live there. So I let the relationship continue. I feel major guilt every single day of my life. I do not want to lead this other relationship on but know I will be homeless when i go back.  I broke it off because the guilt was too much but he still is hanging on hoping I come back. I want to live in my home in my tropical country with little to no stress with my dogs. My husband and I have separate rooms and do not have any intimacy for at least 5 years. My issue is my husband has worked really hard to improve. He is an asshole but less and less. My “friend” in my home country is a good guy but very insecure. I do not want to hurt anyone but it is inevitable. He does things for me without me asking and then holds it over my head. I am so torn. He lives in a dog free building so no way to take my babies there. I don’t know what to do. I never wanted this chaos. My life is upside down. I want to just do myself in and end it but my two kids 23 and 30 are my best friends and their lives would be destroyed so thats just not an option. I hate my life so much. I want my kids and my dogs. I wish my life was easy. ",
    "subreddit": "TrueOffMyChest",
    "title": "Am I a horrible person",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5ecgo/am_i_a_horrible_person/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 03:30:15 UTC",
    "id": "1j5e89y",
    "link_flair_text": null,
    "media": null,
    "num_comments": 29,
    "score": 0,
    "secure_media": null,
    "selftext": "Please pause the pitchforks. We listen and we don’t judge. \n\nI (25F) accidentally hooked up with my cousin (38M) a decade ago. We didn’t grow up close, we barely even knew each other. One summer, I was visiting extended family, and he invited me out. Things got wild, we blacked out, and when we blacked back in… well, let’s just say we were already mid-hookup.\n\nMorning-after panic set in. He was married, so we never spoke about it, and I went back to my city. End of story. Or so I thought.\n\nFast forward 10 years. Out of nowhere, I get a call from him. Turns out, his life imploded spectacularly—divorce, addiction, hitting rock bottom. I had no clue, since we live in different countries now. He needed a fresh start and asked if he could crash with me for a couple of months.\n\nAnd, well… we fell in love. Not drunk, not an accident this time—real, actual, “I-want-to-build-a-life-with-you” love. We’ve been together for two years now, still long distance, but talking about marriage.\n\nI want to come out to our friends and family but he thinks it’s not a good idea. We are not going to reproduce so I don’t see any logical problem with it.\n\nWhat even makes a relationship “normal”? We didn’t grow up as family and if we had matched on Hinge instead of a DNA test, nobody would care.\n\nAm I wrong?",
    "subreddit": "TrueOffMyChest",
    "title": "I’ve been in a long distance relationship with my cousin for 2 years and I don’t think it’s weird",
    "upvote_ratio": 0.25,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5e89y/ive_been_in_a_long_distance_relationship_with_my/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 03:16:29 UTC",
    "id": "1j5dysx",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "At school a kid was pushing me and messing with me. I honestly didn’t care that much, but for some reason, I just reacted and slapped him without really thinking about it. I wasn’t even mad, so I don’t know why I did it. Now I feel bad and kind of confused about why I reacted that way. Has anyone else ever done something like this without meaning to? Why does this happen",
    "subreddit": "TrueOffMyChest",
    "title": "I reacted without thinking and slapped someone. Has this happened to anyone else?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5dysx/i_reacted_without_thinking_and_slapped_someone/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 03:15:31 UTC",
    "id": "1j5dy51",
    "link_flair_text": null,
    "media": null,
    "num_comments": 813,
    "score": 14319,
    "secure_media": null,
    "selftext": "I (32m at the time) am a big dude of 2m and 120 kg (6'6\", 250 lbs in drunk pirate units) and had to have surgery on my calves because of varicose veins. So the day of, I was told to get completely undressed and put on the generic open back gown, which due to my frame made me look like Donald Duck, if you know what I mean. I was led to the or by a nurse and placed on a cold metal table. They administered some local anesthesia to my legs and after about 10 minutes laying naked in a cold, brightly lit room waiting to be sliced up, the 2 doctors strolled in. I was very anxious, cold, and self conscious, so I just stayed still.\nNurse: Anesthesia was given, patient ready.\nDoc1: (walks to the table) wow, big fucker and such a small dick.\nDoc2: Haha.\nMe: WHAT???\nNurse: (panic) oh no, you have the wrong patient file, this one isn't the fully sedated one. He is awake.\nDoc1: ...\nDoc2: ...\nMe: WHAT???\nSo yeah, nobody said another word to me for the rest of the operation, just 200 decibels of awkward silence while they ripped veins out of me. It felt like Ricky Gervais wrote this scene. I should have walked out, but I was too shocked to even think. When they were done they exchanged quiet words with the nurse and quickly walked out. It was a bit shocking, but I quickly laughed it off.\nI mean, they weren't WRONG, but man... Some people.\nEdit: this was 10 years ago, I am fine. ",
    "subreddit": "TrueOffMyChest",
    "title": "Surgeon made fun of my penis",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5dy51/surgeon_made_fun_of_my_penis/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 02:57:43 UTC",
    "id": "1j5dlzv",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I've just come out of a 3 and a half year relationship that has resulted in two beautiful children. My ex fell out of love with me and decided to call it quits. I don't blame her, I've struggled with my mental health and been more than a little complacent with my management of it.\n\nWhile I'm not ready for a new relationship any time soon, I struggle to see how anyone would want to be with me in the future. A single dad of two. I feel like they'll assume something is wrong with me. Like, \"Oh he has two kids and they still left him, what would I be getting into? Red flag.\" or \"Why is he single? Why didn't they want a family with him in the end?\"\n\nI honestly just feel like my dream of a stable relationship or a full, happy family is just dead and buried and don't know how to feel about it. I don't feel desirable or attractive and I feel like my situation puts me at a disadvantage.",
    "subreddit": "TrueOffMyChest",
    "title": "I don't feel like anyone will ever want me again",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5dlzv/i_dont_feel_like_anyone_will_ever_want_me_again/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 02:50:33 UTC",
    "id": "1j5dh76",
    "link_flair_text": null,
    "media": null,
    "num_comments": 12,
    "score": 2,
    "secure_media": null,
    "selftext": "Simple as that. I am waiting to have enough to retire, the closer I get to my goal, the harder it is to tolerate the job.\n\nI simply can’t stand it anymore. The sound of notifications, performance reviews, corporate language, team activities all is just torture for me.\n\nThe work takes the joy of my day to day life but gives me very good money….\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "I can’t stand my high paying job anymore, I also feel bad for not having the guts to quit",
    "upvote_ratio": 0.62,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5dh76/i_cant_stand_my_high_paying_job_anymore_i_also/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 02:41:54 UTC",
    "id": "1j5dba8",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 1,
    "secure_media": null,
    "selftext": "I love my boyfriend so much. I wanted to make friends but he always got upset and said it wasn’t needed, and eventually I stopped talking about it. Eventually I stopped wanting friends at all, and I figured I could be happy with just the two of us.\n\nNow he’s joined an organization and is always busy, and he’s making a lot of new friends. I am alone. Now he wants me to make friends so I can stop crying to him about how lonely I am but it’s his fault I’m this way. I can’t just turn a switch and be like him. He’s given me so much anxiety around the idea.\n\nI’m so angry. It’s so unfair. I don’t understand why I put up with it all, and why I keep putting up with it now. ",
    "subreddit": "TrueOffMyChest",
    "title": "My boyfriend said I wasn’t allowed to have friends and now I’m alone",
    "upvote_ratio": 0.66,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5dba8/my_boyfriend_said_i_wasnt_allowed_to_have_friends/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 02:33:32 UTC",
    "id": "1j5d5iw",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 3,
    "secure_media": null,
    "selftext": "The past almost two weeks, I’ve felt my depression coming back. There isn’t always a reason it happens, just comes over me when it feels like it I guess. I don’t know what I like to do anymore and my energy has really been lacking also. Along with my self esteem. I am feeling really bad for my boyfriend now because of my depression and how I may be coming off. I’ve been more anxious and also not knowing what to say or not having the energy to talk as much. This is the first time my depression has started “coming out” since we’ve been together and even though I know I can talk to him and he would be 100% supportive. I don’t really know how to explain how I’m feeling so I’ve started pretending I’m okay when really I feel like I’m being held under water. I also feel like my low energy, not talking as much is making our relationship boring for him maybe? I want to see him and be with him. Even if we’re just laying together, especially if we’re just laying together cause that’s almost all the energy I feel like I have right now but I keep thinking, he didn’t sign up for this and shouldn’t have to go through me feeling and being this way. I think this is more of venting than asking for advice. I don’t want to scare him off with how much/bad my depression can get. ",
    "subreddit": "TrueOffMyChest",
    "title": "What should I do?",
    "upvote_ratio": 0.81,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5d5iw/what_should_i_do/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 02:32:19 UTC",
    "id": "1j5d4ph",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 0,
    "secure_media": null,
    "selftext": "I have a problem.i am not a people person.\n\nI am introverted.\n\nI can’t stand people.\n\nWhat can I do?",
    "subreddit": "TrueOffMyChest",
    "title": "I am not a people person.i am an introvert.",
    "upvote_ratio": 0.4,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5d4ph/i_am_not_a_people_personi_am_an_introvert/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 02:20:21 UTC",
    "id": "1j5cwfj",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 2,
    "score": 0,
    "secure_media": null,
    "selftext": "I actually vomited because of this.\n\nShe got drunk today and we were discussing my transition (I'm FtM) and she commented in *detail* about how my crotch looks and how much she likes it.\n\nShe hasn't seen me be willingly naked in front of her since I was a toddler, let alone since I started my meds.\n\nI asked how did she know about it and she admitted she \"took a peak\" when I was asleep.\n\nSeveral months ago I had a vivid dream where she was on top of me, touching me and herself. All this time I thought it was just some fucked up dream.\n\nI can't believe she violated me like this, but I can't say I'm surprised. \n\nIt's not the first time she's done such things to me. ",
    "subreddit": "TrueOffMyChest",
    "title": "My mom just admitted that she raped me when I was asleep when for months I thought it was just a dream.",
    "upvote_ratio": 0.42,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5cwfj/my_mom_just_admitted_that_she_raped_me_when_i_was/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 01:53:19 UTC",
    "id": "1j5cdlf",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "theres this dude in my class i thought was really pretty (I am AroAce and experience aesthetic attraction) and I thought was really cool and i really wanted to be his friend, but im super awkward so idk how to go about it. i tried talking to him more, showing him my stuffed animals, and tried to get him to actually care abt what i was saying, but he just doesn’t. like he’s not mean, but he doesn’t really respond much, and when he does it's always \"nice\" \"cool\" \"fire\" and i don’t even think he realizes i wanna be his friend. for some reason i got way too attached to him and i started overthinking everything, like what i was doing wrong, and why he didn’t care. i was just embarrassing myself. i was zoning out at the end of class, (my friends said I was disassociating) and they told the counselor. (They didn't know why i was so unresponsive) anyway i got pulled into the office with a sheriff officer and two counselors and they were asking me all these serious questions abt my mental health and my home life and asked to check my arms, and i felt so stupid. like i wasn’t even upset over anything actually serious, it was literally just bc some classmate doesn’t care about me. and now i just feel even dumber bc i don’t even know why i got so attached in the first place. I feel like I'm wasting so much of my energy on him. I just want him to like me but I'm pretty sure he finds me weird/annoying. has anyone else experienced this? how do i stop getting so emotionally attached to people who dont even notice me?",
    "subreddit": "TrueOffMyChest",
    "title": "I get attached to people to quickly",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5cdlf/i_get_attached_to_people_to_quickly/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 01:31:50 UTC",
    "id": "1j5byqh",
    "link_flair_text": "Positive",
    "media": null,
    "num_comments": 10,
    "score": 118,
    "secure_media": null,
    "selftext": "im just laying here in bed on my day off work listening to my girlfriend playing emo music from the early 2000s and singing extremely off key in the living room. i love her so much. ive never loved another person like this before. i have such terrible body dysmorphia/an eating disorder and she never fails to make me feel like such a stud too. we met on instagram in 2023 and have been together for around 2 years now. we were long distance until november 2024. we live together now and its so nice being able to go on errands with her and we had a nap today with our cat and rewatched Jurassic World. when i get off of work shes just there. after 20 years of being constantly traumatized its just a breath of fresh air. im so lucky to have her",
    "subreddit": "TrueOffMyChest",
    "title": "i love my girlfriend",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5byqh/i_love_my_girlfriend/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 01:29:42 UTC",
    "id": "1j5bx5n",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 5,
    "secure_media": null,
    "selftext": "This is the first post I've ever made of reddit, so please be patient. \n\nI (19) have been diagnosed with severe depression and really struggle being clean. My depression stems from trauma from my mother, being verbally, emotionally, and physically (rarely, but still) by my mother (39). My room is frankly disgusting. My bed is littered by trash, clothes, and stuffed animals, I haven't seen my floor in over a year, and every surface (nightstand, TV stand, dresser, ect) are messy and filled to the brim. I lose everything and my closet is overflowing with junk I've never used. I don't enjoy doing much except listening to music and watching cartoons. \n\nIt sucks because I want to be better. I am very clean, I shower daily and wear deodorant/cologne, but my room is a mess. I hate it, and it makes me hate myself even more than I already do. I have a therapist, but I rarely see her, and I'm scared to tell her this about me. I have a full time job and people love me, I'm very organized and happy at work. No one would ever suspect I have a terrible room. The only thing I keep clean is my pets' cage (rats). I feel so embarrassed and ashamed, I never have friends over. I want to be better so badly but I don't even know where to start. \n\nSorry it's long, I just am really struggling and any advice would be helpful. ",
    "subreddit": "TrueOffMyChest",
    "title": "I have a depression room and the guilt is killing me",
    "upvote_ratio": 0.86,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5bx5n/i_have_a_depression_room_and_the_guilt_is_killing/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 01:15:51 UTC",
    "id": "1j5bn88",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 4,
    "secure_media": null,
    "selftext": "So, I'm from a very close-init family, we love each other a lot and have always been together. My grandma had three children, uncle A, uncle B, and my dad, and then grandpa had a child with another woman, uncle C. This is about uncle B.\n\nI don't like his current gf. She immediately trauma dumped on my grandma to gain sympathy, then proceeded to imply she was old and getting forgetful and clumsy (grandma's perfectly fine, she's as healthy as they come), then she brought along her son she had with another man, who I have no trouble with. She herself isn't bad, but the way she and her son behave is weird, because it's like they're not a part of our family, they just kinda live there, and I have the feeling that she wants to kick my grandma out and have the house to herself, which isn't possible because it's decided 50/50 between uncle A and uncle B, but she's tried to buy the other half to uncle A, who firmly refused, because once they both pass away, the house is mine.\n\nThe worst part about all this is my uncle's behavior since she arrived. He works with my mom at a local restaurant, nothing fancy, its main target are the broke college students nearby, but they get paid well. My mom had a cousin of hers working as a waiter there, and he wasn't the best, but hey, acceptable,  but uncle B decided to start saying that he was more trouble that its worth, and that his girlfriend's son should work there, my mom firmly refused. My grandma has anxiety of going out on her own for years now and since she only lives with uncle B and his girlfriend, she constantly relies on him to get medicine or to just go out, and he's been getting extremely rude with her for no reason whenever she asks to go out, yelling and saying \"he needs his own time too\". We threw a party for grandma's birthday a while ago, and you'd expect him to sit with his mother, but no, he went and sat with his gf's family, completely ignoring grandma. I fell and got hurt pretty badly a while ago, and everyone called me and asked of I was okay, but him? Not a peep. \n\nMy last straw came a few days ago, my mom suffers really bad anxiety/panic attacks sometimes and he caused her one. Long story short, he missed work without calling in advance and my mom had to cover his shift and then tried to reprehend him because she's the manager of the restaurant. He completely flipped out and said something along the lines of \"leave, it doesn't matter, (gf's name) can replace you\", and my mom got really mad, and said \"I don't want to have anything to do with you as work or as family, you're never stepping foot into my house again\". \n\nNow I love my uncle, but his gf has completely ruined everything, I don't like her, I see her and I feel angry, but I can't do anything because I'm forced to interact with her, and you'd think my lack of warmth would tell her to not talk to me, but she talks to me as if she was my aunt, SHE'S NOT, and I genuinely wish I could just make her go away and make things go back to normal. I want my family back.",
    "subreddit": "TrueOffMyChest",
    "title": "my uncle's girlfriend is tearing my family apart",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5bn88/my_uncles_girlfriend_is_tearing_my_family_apart/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 01:09:08 UTC",
    "id": "1j5biby",
    "link_flair_text": null,
    "media": null,
    "num_comments": 14,
    "score": 21,
    "secure_media": null,
    "selftext": "I work in security. My job is just the constant variation of the same thing. Go to X and watch Y. For example, my job for the past few months has just been to watch a fence for 12 hours straight.\n\nIve been working 50 - 60 hours a week for two years doing this sort of work and it's extremely mind numbing. There's no challenge, there's no getting better at my job. I am a body. That's it. Anybody, literally anybody, could do this job.\n\nAny attempts to move into a higher position have been shot down because someone more senior wanted it or my employer decided to hire outside the company. Looking for a new job feels hopeless since it seems like no matter what I take, I'll be taking a significantly lower pay (something I can't afford to do). I can't even go to school part time to move into the industry that I want to because I don't have a consistent schedule.\n\nI feel like I'm trapped working this job and it's sucked me dry of any passion or desire to engage with hobbies I used to love or to go out and try to make new friends.",
    "subreddit": "TrueOffMyChest",
    "title": "I have the easiest job in the world and everything feels pointless as a result.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5biby/i_have_the_easiest_job_in_the_world_and/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 01:06:56 UTC",
    "id": "1j5bgq2",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "He touched me as a child.\n\nIm so happy hes dead.",
    "subreddit": "TrueOffMyChest",
    "title": "TW sa",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5bgq2/tw_sa/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 00:53:47 UTC",
    "id": "1j5b783",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "I've been doing some thinking about all the conversations I have had with people and I think I have a issue with coming off as \"authentic\" or \"comfortable\". I met this guy online he was really nice I gave him my phone number and we hit off, we have been talking for two days the second day we call I remember he said \"oh!, someone is calling me bye!\" and I didn't think anything of it but uhm I haven't really heard from him since I texted him and he kinda left me on read and I texted him again I don't think he bothered looking at the message and I think I don't want to believe that I had just got ghosted but I think I did? And I don't blame him really because I don't know how to talk to people. I've noticed that I overshare and I can be awkward and maybe I make people sad when I talk to them but at the sametime I don't know how to approach people, or how to really make connections so I just blurt things out and I can see why that would drive someone away that kind of thing is so tiring to deal with. I also noticed when we were talking to him he said now you sound more relaxes or more comfortable or you're not trying too hard and i've got that a lot, I don't know what that meana though because sometimes thats how I genuinely act, I guess because i'm so awkward some of the things I say come off as forced but I can't help it and I don't know what to say really and I don't want to interview people and be like, oh so you like this? and this? and that? how do you feel about this? asking a ton of questions. I also was talking to someone before this guy not ina romantic sense but I think I made things awkward with that person too, I think I made them sad and I didn't mean to but it just happens sorta and I don't notice until like a day later or so and its like damn I shouldve approached it like this or like that. And even when i'm trying to talk with new people I always overthink what I want to say, I LITERALLY WAS OVERTHINKING WHAT I WANTED TO SAY TO BOOK A HAIR STYLING APPOINTMENT LIKE COME ON, thats just pathetic that it took me 3 days to ask my stylist how much is this or how do I get to her studio because I was ovethinking what I wanted to say and because I felt embarrassed and ashamed. And I started to realize that even my bestfriends don't really know what to say to certain things I say so its an awkward silence before I have to be like so uhm ahaha sorry about that!! and I have to make a stupid joke or something because I know they don't know what the hell to say and I made the whole convo awkward. I haven't even spoken to my bestfriend of 5 years, in which I should be thr most comfortable speaking to in like 5 days because i'm trying to think of something to talk about, again this is so pathetic and I don't know why im like this, it shouldn't be hard to talk to people but for some reason for me it is and it just makes me kinda angry and kinda sad and jealous because everyone makes it seem so effortless to talk to people and have a regular convo where you're like \"AUGH I SHOULDNT HAVE SAID THAT IM GONNA PUT MY HEAD IN A WALL!!\".",
    "subreddit": "TrueOffMyChest",
    "title": "I don't know how to talk to people and I think it drives them away.",
    "upvote_ratio": 0.76,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5b783/i_dont_know_how_to_talk_to_people_and_i_think_it/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 00:46:54 UTC",
    "id": "1j5b24x",
    "link_flair_text": null,
    "media": null,
    "num_comments": 15,
    "score": 0,
    "secure_media": null,
    "selftext": "So, towards the end of summer last year, my coworker (26m) and I (24f) went on a date and ended up fooling around a few times after that. I had had a huge crush on him for a while and was so excited to finally go out with him. The date was super nice, but the hookups were unexpectedly really good. I don’t have a lot of experience whereas he does, and he knew that, and he let me take control of the pace and the things we did which made me feel comfortable enough to try stuff with him I hadn’t done before. Unfortunately, life stuff happened all at once, and he ended things like two weeks after the first date. I was crushed. I was hurt, disappointed, confused, and quite honestly, very sexually frustrated. I really, really liked him, and we had gotten very intimate very quickly with the expectation that there would be a lot more to come, and then all of a sudden, it was over. I felt like I was left high and dry.\n\nThe thing is, a couple of months ago, we basically ended up confessing over text that we both still wanted each other in that way and almost made plans to meet up again, but more life stuff got in the way, and we both agreed that it would still be a bad idea to do anyway. But now every time I see him at work, I can’t help but think about the things we said and did, and how much I want to do it again. The fact that I know that a part of him still desires me in that way is kind of driving me crazy. I could torture myself overanalyzing every normal conversation, every glance, every little interaction.\n\nIt would very likely be a terrible idea to do it again, and it would probably end worse than it did the first time, but the feelings just won’t go away no matter how much I remind myself of these things. I am down so, so bad for this guy.",
    "subreddit": "TrueOffMyChest",
    "title": "I desperately want to hook up with my coworker again.",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5b24x/i_desperately_want_to_hook_up_with_my_coworker/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 00:35:30 UTC",
    "id": "1j5ati4",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "So I recently exposed a narcissist but my situation is very different and I can’t find anything online about this situation. So I came here for potential outcomes. \n\nSo back in 2023 of March I started talking to this guy and he knew me from my childhood (we were not best friends we just saw each other in passing during our middle school years) and it went well at first. (It only lasted two weeks) While we were getting to know each other I got on his IG and saw this girl constantly posting on his page but he never paid her any mind and of course I asked and he denies it. But he must have sensed that I was hot on his tail so he decided to end things but still wanted to be friends even though we were never friends but I just said ok. What he didn’t know is that I knew I was blocked after I questioned him about the girl on IG so I made a fake page to see what was up. And even though he said he wanted to end things he was still keeping in touch with me. Even though I’m blocked on his IG so in April 2023 I saw him with that girl and he she got him to move down there with her. He is originally from my city and this girl lives in the DMV area. And with me investigating I realized that it’s a money thing so basically this guy is a prostitute she buys him stuff and he agrees to be her bf. So of course I wanted revenge but I wanted to wait until it was unexpected so for a whole year I gathered information on this girl and realized she may be a narcissist. With my digging on this girl I got her phone number driver license address email you name it I got it. And I tucked it away. So in March of 2024 I made a fake number and pretended that I knew her from one of the colleges she went to but I told her that I wanted to stay anonymous. And she went for it and all I did was expose her bf for being with me. I also wanted to add that had I not been hot on his tail he would have continued to date me. And when I found out about the girl I cut all communication with him and he found a way to contact me and wanted me back and I told him no. He even told me he never wanted us to stop talking but he needed help from this girl and I had all that in the screenshots. And you best believe I sent them screenshots to her when I was hiding behind the fake number. This girl really wanted to know who I was so I decided to give her a call and actually reveal myself and we were on the phone for 27 mins. Mind you I recorded our conversation as well because I don’t trust this bitch. But while we were on the phone she talked bad about her bf and her bf family and I did defend the family because I actually know them. Because the city we are from is small. And at one point in time I was close with the guys cousin. She said really bad things about the bf mom too. And I didn’t like that so I spoke up and I think she could tell I wasn’t going for any of her lies because I knew she was lying. And I’m sure she didn’t like that. I actually got off the phone with her because she wouldn’t let me go. So the day after I spoke to the girl her bf called me screaming at me and accusing me of all these things I didn’t even say. I couldn’t even get a word in but I knew she was going to lie so I wasn’t tripping because in my head I was going to get my lick back. Fuck this hoe. The guy wasn’t even mad that I hurt gf feelings he was mad that I lied on his family and said bad things about him. Which I didn’t say anything bad about him or his family. So after I took a verbal beating from this guy I just said cool. But I wasn’t done yet. So I waited for about six months so now we are in September 2024 and from March of 2024 to September 2024 I kept my eye on them and I watched her crumble because she is very transparent on the internet and the bf broke up with her while she begged for him back because he realized that she lied on me and she must have found me on social media because she changed everything about herself to mimic me. Mind you when I spoke to her in March of 2024 she claims that he begs her but social media says otherwise. And between March of 2024 to September of 2024 this girl and her friends and her momma started to bother me because apparently I’m the reason why her bf won’t speak to her and I still keep calling her bf and pulling him away from her but I haven’t seen that man since March of 2023 nor have I spoke to him the only time I spoke to him was in March of 2024 and that’s because he yelled at me. So in September of 2024 I reached out to him I unblocked him on IG (in case you are wondering he did block me first on IG but unblocked me on IG to get in contact with me because I had him block on everything else then when he asked for a second chance and I told him no I blocked him on IG and he been on that list since September of 2024 and then I blocked him again because he is a dick) and sent him all the details of the conversation I had with the gf. I even revealed to him that I was behind the fake number but he told me to leave him alone so I said ok bet and changed my number and reblocked him on IG. But what I banked on was how much he liked me so I knew he was going to read and listen to all the things I sent and within three days he started calling my fake number (because he couldn’t get in contact with me because I changed my real number) so I deleted my fake number and got rid of my social media account because he had his family look for me too. He also offered to send me money to talk to him but I declined. And of course I’m still watching this all play out on my fake pages and again because she is so transparent on social media she is having a breakdown because he now knows the truth and she can no longer lie on me to him at least. But he is stupid anyway because why would you believe a liar with no proof but I guess because she is a narcissist and the guy isn’t good at setting boundaries. I never been involved with a narcissist well I don’t think I have been and I think it’s because I’m too outspoken and I have no problem getting into a fights. I promise you this is not what the fuck you want but overall I’m a pretty peaceful young lady if I do say so myself. Anywho, this girl is upset that not only is he furious with her but also his family is happy that someone was able to finally expose her for the liar and manipulator that she is (I didn’t know that his family didn’t like her) but apparently she plays victim and uses this guys insecurities and her money so she can get her way and this relationship was going on for years. I’m basically the hero. But I wasn’t done with this bitch yet so I got my black ass on Twitter and put her on blast so much so she lost a lot of followers on social media and her momma is off of social media completely because her momma was bothering me too. And I did this a few weeks ago me exposing this girl on Twitter. So now I’m satisfied. But I wanted to know what happens when you expose a narcissist? I wasn’t the one being manipulated but it was like I was the defender of someone who was being manipulated. And I came here to see if I could get any info because I couldn’t find anything. ",
    "subreddit": "TrueOffMyChest",
    "title": "exposing a narcissist",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5ati4/exposing_a_narcissist/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 00:25:36 UTC",
    "id": "1j5am4f",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 63,
    "secure_media": null,
    "selftext": "After countless of procrastinating, I ended up telling my mom I was sexually exploited by a man many years older than me. She was honestly very supportive, and let me go on with the police investigation.\n\nTomorrow I'm getting my messages forensically checked between me and him, and oh god am I shitting myself. The messages I had with him were VERY sexual, and I feel guilty as I kind of just let everything happen as I liked the attention. I know everything will be okay, as it is apart of their job, but it still scares me that someone will be checking these very intimate messages. There's also the fact that someone's gonna have my phone for a while, and will be able to check my stuff which is also making my heart pound.\n\nFor anyone who went through a similar experience with their phone being forensically checked, how'd it go?",
    "subreddit": "TrueOffMyChest",
    "title": "Getting my messages with my groomer forensically checked tomorrow. I'm terrified.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5am4f/getting_my_messages_with_my_groomer_forensically/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 00:16:36 UTC",
    "id": "1j5afht",
    "link_flair_text": null,
    "media": null,
    "num_comments": 9,
    "score": 24,
    "secure_media": null,
    "selftext": "Not an English speaker.\n\nI miss you bastard! I miss laughing with you, i miss those non sense conversations or those men conversations about girls. I miss hearing your laugh, i miss you being an asshole all the time, i miss you being a clown to cheer me up. I just wish to give all the money i have to have you here with me and your daughter for just 1 minute. I still remember the time when you were always at my parents house for that sniping game and i always beated you making you angry as hell. I miss those days in school when you never left me alone being in troubles. We were very different, you a fucking clown and me, like you used to call me, \"mister perfect douche\".\n\nBelieve me bro it was... it was a fucking torture seeing you in that hospital bed fighting with cancer and knowing that you couldn't win this time. You couldn't see it but when you died a part of my heart broke. Even when you asked me to take care of your daughter( Sofi) like she was mine i was in a mix of emotions. Scared and honored. You didn't deserved cancer(and your ex to leave you in your weakest moment) believe me when i say that i always wished to take it instead of you. You had a daughter, a gf and a life to be build brick by brick while i was just trying to figure out what the fuck to do with my life. 6 years passed by and i might sound repetitive but i wish you would be here for only 1 minute to see that your best friend tried and is trying his best for your daughter, i wish you would be here to see how much she is grown and how absolutely sweet and kind she become.\n\nYou bastard left me! And even now while i'm writing this you are making me cry you asshole. 6 years bro, 6! I still miss you like the first day.\n\nI just hope you are somewhere happy, calm and with 0 regrets. I wish too you are still practicing at that sniping game cause when i would be there with you the match would be a must!\n\nI saw an old photo of us today when we were 7 and like always together! Don't worry bro we will always be together and we will always be in troubles together like a team.\n\nI miss you asshole!",
    "subreddit": "TrueOffMyChest",
    "title": "I miss you asshole of best friend. I hope you are in a better place now.",
    "upvote_ratio": 0.9,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5afht/i_miss_you_asshole_of_best_friend_i_hope_you_are/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 00:12:29 UTC",
    "id": "1j5acjl",
    "link_flair_text": null,
    "media": null,
    "num_comments": 32,
    "score": 530,
    "secure_media": null,
    "selftext": "Landed a monster win playing games on Stake recently. Like, six figures monster. Not \"fuck you\" money but definitely \"fuck this\" money. No debt now. Fat emergency fund. Future looking secure for once.\n\nBut I literally cannot buy myself anything without feeling like I'm committing a crime?\n\nWent to get a decent laptop since mine sounds like a jet engine - stood in Best Buy for 20 minutes before panicking and leaving empty handed.\n\nTried ordering takeout yesterday instead of meal prepping. Canceled the order twice before finally letting it go through. Then felt sick the whole time eating it.\n\nGrew up poor. Like, generic cereal in a baggie poor. Guess that shit sticks with you even when the circumstances change.\n\nAnyone else hit financial stability and still feel guilty spending on basic comforts? Like my brain is programmed to think broke thoughts no matter what my bank account says.\n\nIt's exhausting. I've friggin EARNED this money (even if luck was involved), but can't seem to actually use it without spiraling.\n\nHow the hell do I fix my brain so I can enjoy what I have?",
    "subreddit": "TrueOffMyChest",
    "title": "I feel guilty spending money on myself, even when I've earned it",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5acjl/i_feel_guilty_spending_money_on_myself_even_when/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 00:03:20 UTC",
    "id": "1j5a5pt",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 0,
    "score": 9,
    "secure_media": null,
    "selftext": "my roommate has not been in a good place mentally for the last few months. She drank a little too much tonight and apparently cut her finger with a nutella jar. We saw blood on the floor, I was the first one to go into her room. She was laying there, not moving and blood over her floor and bedsheets.\nShe‘s okay now as it was just a little cut but for a few seconds i thought she had done something to herself. She already kind of laughs about it now because nothing really bad happened but I can’t forget the utter fear I felt when I saw her laying there. I feel like I am still in shock and i don‘t know what to do \n\nsorry for any mistakes, english is not my first language \n",
    "subreddit": "TrueOffMyChest",
    "title": "I thought she was dead",
    "upvote_ratio": 0.86,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5a5pt/i_thought_she_was_dead/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 00:01:18 UTC",
    "id": "1j5a43o",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 3,
    "secure_media": null,
    "selftext": "I (31F) dated my ex (37M) for exactly 4 years. We started in May 2020 and broke up for the last tkme on May 2024, and I say the last time cause he used to break up with me alot, like ALOT (I stop counting after the 40 something time at about two years of dating).\n\nYes, the relationship was a bit toxic, he's a narcissist,  and I'm not saying this just cause I think so or a video told me. He told me from start, he went to therapy and the therapist told him he has signs of narcissistic disorder, adhd and other things.\n\nBut the thing was that, we loved each other so much, I know he loved me, and I loved him to death. Theres a lot of bad memories and shitty things he did, I wasn't the best eaither. He was really jealous, possessive and over protective, and I'm very sociable so yeah, it was a problem, but I knew he loved like he never loved anyone.\n\nLast time we saw each other was in June for my birthday cause he broke up with me one week prior, then we stopped talking, talked again in July and since then we have gone zero contact.\n\nSometime I feel so chill and feel like I moved on, but I still think about him every single day, EVERY SINGLE DAY, and there's days I miss him so much and want to talk to him, every time is getting harder and harder to not contact him.\n\nI wish he would call me, but I know he won't, and I know this is for the best.\n\nHow do you get over someone you thought was the love of your life and thought you were going to marry that person? ",
    "subreddit": "TrueOffMyChest",
    "title": "Can't forget my ex",
    "upvote_ratio": 0.81,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5a43o/cant_forget_my_ex/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-07 00:01:16 UTC",
    "id": "1j5a42p",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 0,
    "secure_media": null,
    "selftext": "I know some people are gonna be like “well then why are you with him?” \nBut truthfully I never really ever cared up until now. \nI think it’s embarrassing that he likes girls stuff with their butts all out and clearly looking for attention. Not only that but it definitely makes me insecure because in my head I think that he likes that, and even if he tells me he doesn’t and that I’m overreacting over a “like” … it just still makes me feel that way. My advice is if yall have a girlfriend don’t like other girls stuff because it can definitely create some type of insecurity within the relationship. \nAnd I know not all girls care, but I just think it’s important to respect no matter what. \nThat being said. I am now single :)",
    "subreddit": "TrueOffMyChest",
    "title": "I hate that i get insecure over my bfs likes!",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5a42p/i_hate_that_i_get_insecure_over_my_bfs_likes/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 23:52:51 UTC",
    "id": "1j59xpo",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 10,
    "secure_media": null,
    "selftext": "31F nurse in a very toxic environment.\n\nI’ve been denied a promotion twice in 6 years.\n\nI feel my growth has been stunted, no room for promotion, I’m not learning anything more. The staff are bullies. I’m being bullied by three seniors who are ganging up on me. Higher ups told me to be quiet basically when I reported it. \n\nI’ve been run down, chest infection after chest infection, extreme fatigue etc then I went off sick five weeks ago after being told to shut my mouth basically and I’ve been fine since. In a good head space, no fatigue etc. \n\nI’ve job searched every day. No suitable roles as I am specialised theatre nurse. All I keep seeing is clinical assessor/Pip roles and I’m at such a breaking point with my role that I am close to going for that one and it’s hated by people and run by private companies who can sack you at  any time. \n\nI have to return back to an environment where the people are nasty, where the seniors are out to get me (and they are) and where I no longer feel I am learning, improving or getting anywhere. No amount of effort I put in works there anymore, and I’ve tried my hardest. \n\nI’ve even contemplated leaving nursing entirely but no other role pays the same and I cannot afford to retrain for something. \n\nI have a mortgage, pets to feed, bills to pay and now I have to accept the fact that i have to stay in this place for longer until I find somewhere else and even then, work never let me leave for an interview. I have to stay in my work prison and serve a never ending sentence. \n\nThe last day before I went off sick I genuinely contemplated driving my car off the bridge on the way home. Now I have to go back. My doctor said he’d give me a paper for more time off as he understands the pressures. But I don’t know what’s the best thing to do. I’m grateful I have work and have a job, I just wish it was filled with a lot nicer people where I could have a fresh start. ",
    "subreddit": "TrueOffMyChest",
    "title": "I’ll have to face the fact I have to stay in my awful, toxic job.",
    "upvote_ratio": 0.87,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j59xpo/ill_have_to_face_the_fact_i_have_to_stay_in_my/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 23:45:44 UTC",
    "id": "1j59s2n",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 18,
    "secure_media": null,
    "selftext": "I worked at three of the biggest influencer marketing agencies over the last decade, and now that I don't, it's finally safe for me to speak the truth without risk to my career - I need to expose that whole industry as a scam and no one is talking about it..\n\n\"Influencer Marketting\" agencies make almost all their money NOT from sponsorships but from influencers paying them monthly fees to FIND them sponsorships that never happen. I was shocked each time I got a new job at a new \"influencer marketing agency\" to discover they all work the same way- colleagues who mentioned it were fired or made redundant. It's kind of like a pyramid scheme... Out of thousands of influencers paying monthly \"subscription fees\", almost no sponsorships actually happened in the years I was there. All of our workload was dedicated to finding more influencers to sign up rather than sponsorship companies.\n\nThink about it- why would we need sign ups in the first place if we can find sponsors? We'd obviously take a cut of sponsorship as that would make more money- right??!! What's going on is dishonest &amp; takin advantage of the poor.\n\nMost people think that a large following of 500K+ followers, makes that person wealthy. The reality is that 99% of people with 500k followers on insta and tiktok (and in many cases, youtube shorts), make nothing. I’ve worked with influencers sleeping in cars, couch-surfing, living below the poverty line for years, incredulous to the fact they aren't making anything, while my colleagues persuaded them to continue building a following and that sponsors were \"just around the corner\". We would be told to persuade these people to by dangling carrots like this. Many of them worked 20 hours a day to build a following- often from uplifting or positive content- and weren't narcissists- it is not a pleasant life, and I knew of so many like this.\n\nI don't like how the industry is taking advantage of these people. Websites like SocialBlade are hilarious - the number of times I've seen them claim people are making $500K+ per year but in reality, they're earning nothing... It happens all the time.\n\nThe key is that most audiences aren't monetisable no matter how big they are, and the ones that ARE monetisable (e.g. \"technical\" topics), are nigh on impossible to persuade sponsors to bite because they're all so stuck in the past (they think of social media as something \"free\" and will only pay to advertise on TV or via traditional routes).\n\nTo make things worse, 99% of companies reaching out just want free advertising. They offer “exposure” or a cheap free product and refuse to pay. They all think that someone with a large social media following is a philanthropist millionaire, or can eat \"free products\", didn't work full time to build that following, and doesn't need income.\n\nMeanwhile, marketing agencies exploit this situation by selling influencers false hope and taking their money with no return. It has to be biggest public perception vs. reality mismatch I’ve ever seen.. on such a grand scale.\n\nNo one is talking about this. Agencies won't talk about it because their income comes from maintaining the lie. Influencers themselves won't talk about it as they fear it might destroy their chances of getting a sponsor in future (which is never going to happen!!). So I had to get this off my chest, now that I don't work for them anymore. I'm frankly amazed these \"companies\" haven't been shut down.\n\nI'm sorry but I can't name myself or the companies for obvious reasons, but they're all the same (afaik), and I can't give examples of specific social media accounts for similar reasons unfortunately. Therefore, you don't have to believe me on this, but I speak the truth &amp; just happy to get this off my chest.\n\nMy advice to you if you're unable to find sponsors for social media following:  \n\\- Don't waste any more time on it. Views can't pay your bills. Don't waste your life..  \n\\- Don't trust any social media \"marketting agency\" that requires a monthly subscription fee from you (if they are genuine, they'll operate on a percentage of sponsorship deals that they obtain for you - NOT a monthly fee from you)  \n\\- Don't trust when anyone tells you \"you're just marketting wrong- it's impossible to have no income on 500k followers\" - they don't know what they're talking about unfortunately. Most influencers even in the 500k braket make NOTHING, but none will admit it for fear of it sabotaging their future chances.  \n\\- Spend your time re-skilling to do something else that will make a living, don't fall for this scam.  \n\\- Even monetisable accounts with monetizable topics are VERY HARD to get sponsors for, that's why so many don't have a sponsor for years.  \n\\- Don't fall for the \"if I get a big following I will automatically find ways to make an income\" trap\n\nThere. Off my chest!",
    "subreddit": "TrueOffMyChest",
    "title": "Influencer Marketing Agencies Are a Scam – I Worked for 3 of the Biggest Ones",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j59s2n/influencer_marketing_agencies_are_a_scam_i_worked/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 23:45:17 UTC",
    "id": "1j59rp2",
    "link_flair_text": null,
    "media": null,
    "num_comments": 13,
    "score": 0,
    "secure_media": null,
    "selftext": "Hello everyone, i 22f seem to get overwhelming amount of attention from guys in their 30s and i just dont know how to feel about it. I live in a small ish community where everyone pretty much knows everyone or has heard of them at least. In addition to that, theres not many people my own age to pick from around here unfortunately. \n\nAnyways, i think i could count at least 5 guys in their 30s who have approached me or expressed interest/flirted with me. Mind you, im newly 22 and already get told i look like im 17. Im not completely opposed to dating out of my age range, but are there things i need to worry about with this? Is it a predatory thing? Is it guys lusting over a younger girl to fulfill some kind of fantasy? \n\nHas anyone else gone through this? I kind of like the idea of an older guy but it is also a bit weird to think about especially from the outside. Any input is appreciated! ",
    "subreddit": "TrueOffMyChest",
    "title": "Why are guys in their 30’s attracted to me?",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j59rp2/why_are_guys_in_their_30s_attracted_to_me/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 23:40:37 UTC",
    "id": "1j59o42",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 12,
    "secure_media": null,
    "selftext": "some of you might already be familiar with my profile, with my story. I was sexually assaulted a while ago and I really thought I had it figured out. I don't. I'm not going thru all the details of that again but I posted it here a few days after it happened, you can look on my profile if you want to know. \n\nAfter my last post, I went along with many of your recommendations, I took pictures of the bruises, I warned all my female friends bout his conduct, blocked him everywhere and even told my sister about it (not exaclty how it happened, just that I was feeling scared most of the time and that I was SA'd, I didn't wanted to go into detail with her). \n\nAnd I thought, I really did thought, it was all going well. For the past week, I had not thought about him once, I had not cried bout it anymore, I was healing, I think. But today I overheard someone talking bout him. \n\nActually, I heard them talking bout me. \n\nOne of my friends - that was in the party I was SA'd at - kind of has a crush on me and everyone knows it even tho he never told me upfront. Today, I overheard some of this guy's friends saying how much of a bitch I was to be with someone else in front of him. I wasn't \"with someone else\" I was being assaulted. I was crying, I was asking him to stop. \n\nI didn't knew he saw it. I didn't knew any of them saw it. And now I feel dirtier than ever. Yet at the same time, if they saw it why didn't they stopped it? Why didn't they helped? \n\nI want to rip off my skin, to burn it so deep there won't be an inch left of what the man who sexually assaulted me touched. And yet now there's also this dreading feeling that they would still view me as nothing more than a bitch. I feel like I can't breath, like I can't ever run away from how tainted he made me, how dirty and broken he made me. Everytime they look at me all they see is my assault, and they think I chose that, think I am a whore. I can't deal with that. I don't know what to do.\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "my friend tried to rape me, I don't know how to move on and my friends think I'm a bitch",
    "upvote_ratio": 0.88,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j59o42/my_friend_tried_to_rape_me_i_dont_know_how_to/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 23:33:19 UTC",
    "id": "1j59il8",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "How to cope with a boyfriend who has phone/computer addiction? \nOr more accurately help him out of this?\nIt's feels like he's not here in real life except when I open my mouth repeatedly. If i don't say anything at all, we wouldn't barely spend time or talk with each other. \nEvery fucking minute when we not interact he's on phone or go straight to his computer. He can't literally live or do things without his phone. Like cooking food, cleaning, walking the dog and more things. \n\nAt this point I don't feel seen, good enough or loved. Sometimes I feel like he only wants me to be there on his terms when he's bored of the technology ",
    "subreddit": "TrueOffMyChest",
    "title": "Invisible/alone in my relationship?",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j59il8/invisiblealone_in_my_relationship/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 23:23:40 UTC",
    "id": "1j59b23",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 2,
    "secure_media": null,
    "selftext": "Throw away account so no one sees this. \n\nI have been working really hard the last 5 years or so to improve my life. \n\nA little background about me- I come from a low-income, below poverty line house hold. Grew up in housing during my childhood. Majority of my family including cousins are either on social assistance, housing, drug addicts, alcoholic, ect. \n\n6 or 7 years ago, I was on social assistance myself. I didn't finish high-school. I was drinking daily. Ended up in an abusive relationship. Managed to get a cleaning job. \n\nSince then I've gotten my GED, partially went through college, ended up building a career before I completed college, am now a program manager on my way to making 90k a year in a field i love that feels like I'm making a difference in people's lives, in a happy loving fulfilling relationship where I live with my partner, we plan to buy a house soon and are thinking about marriage and kids. I have a car. I've essentially hit all of the life goal milestones I wanted to hit by the time I was 30 and more (I just turned 30 a few weeks ago). I've been to therapy, ive been on a good medication for my mental health, I've done the work.\n\nI feel like my life is finally on the right track. Because of this, I've finally been able to shift my focus to more \"shallow\" or less important things that have been kinda low on my radar. \n\nFirst let me say, I love myself - not in a self centered kind of way, but I appreciate that I'm resilient, goal oriented, determined, am empathetic to peoples experiences, and I have a lot of love to give. And I have a lot of respect and compassion for myself- just as I do for others. \n\nWith that being said, my appearance has always been something that's bothered me. I've always had bad skin, I gained quite a bit of weight over the last 4 years- and I'm just not in a place where I feel good about how I look. So I've decided, this year, that's what I'm going to work on. I've bought more professional clothes, started my skin journey to help with my skin texture and acne scars and redness. And planning on getting my teeth fixed. Getting a good hair regime. And controversial- i decided id try ozempic. My insurance is covering it so essentially it's like why not? Why wouldn't I give this thing a try to support me in losing weight and feeling better about my appearance. It's not that I think I'm UGLY I know I'm not- i just feel like I haven't really taken care of myself and I'm working on it. \n\nAnyway long story short- I feel like I'm getting some much push back randomly now. And the more I think of it the more I realize how much push back I've gotten generally on decisions I've made. \n\nMy dad once said how will you live on your own your on welfare (this was 7 years ago before I met my boyfriend and 3 months before I got a fulltime job as a cleaner and my own apartment)\n\nMany times as I've changed jobs to move up and learn more I've gotten aren't you scared? Are you sure you want to do this?\n\nAnd now from some family members and old friends its - wow that treatment is a lot of money, I've heard so many negatives about ozempic etc. My own mother has issues with me improving the way I look for some reason.\n\nI just don't understand it. I would never try to put someone down for bettering themselves in anyway. It's actually almost hurtful.\n\nOf course I realize I don't have to and won't listen to others on my life choices, because my choices have gotten me to where I am today. I guess I'm just venting because it feels like the people who don't even make decisions try to influence yours. \n\nAnyway thats all haha.",
    "subreddit": "TrueOffMyChest",
    "title": "I'm tired of people who don't even make decisions in their own life trying to make mine.",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j59b23/im_tired_of_people_who_dont_even_make_decisions/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 23:22:40 UTC",
    "id": "1j59a9z",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "It was only a couple of months between his first doctors visit and finding out it was terminal. all of this has moved incredibly fast, and I don't feel capable of talking about it much. In the few times I have mentioned it to other people, I'm always very calm. I'm very calm when I see him, too. I just can't seem to cry about it when you'd expect me to, but then I break down at random times. \n\nHe's a lot older than me, so if I ever thought about it, I probably would've guessed he'd die before me. But not like this. Not this soon. \n\nI'm not family or anything, or a really close friend. there are people who have known him for more than a decade, and I have to be some kind of blip in his life, having only really been his friend for a few years. In a way, it doesn't seem like I have any right to be upset about this. Not when he's got actual family and friends who are as close as family. but here we are. \n\nthe thing is, like, my own parents are...fine, but fell short in a lot of ways. i'd never, ever admit this to anyone i know, but I did/do see him as kinda a parental figure. Or, at the very least, a trusted older adult. Someone I could be honest with and rely on, which is pretty rare in my life. He looked after me a bit. Now I'm trying to look after him. I don't think I'm doing a very good job of it, but I'm doing my best to do as much as he'll let me. \n\nI feel so worn thin. I'm trying so hard to be here for him, and also be here for my best friend who's going through a rough time mentally, and my family, and also work and have my own life and not go absolutely fucking insane. i don't know. this is more important than anything else i could do. I'm just so tired and sad and i'm not sure i deserve to be but there it is. I want to tell him that he's important to me, that this is really fucking me up, but i have no idea where to find the words. I don't know that the right words exist. I'd give anything to fix this. If I could die instead, I would, but that's not how cancer works. I don't know. I'm tired and right now I just desperately want things to be okay, or to not have to be the strong one for once, but who else is gonna be?\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "friend is dying of cancer, can't tell almost anyone about it",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j59a9z/friend_is_dying_of_cancer_cant_tell_almost_anyone/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 22:55:24 UTC",
    "id": "1j58nr5",
    "link_flair_text": null,
    "media": null,
    "num_comments": 8,
    "score": 0,
    "secure_media": null,
    "selftext": "Hi everyone, \n\nLast summer I 22F met a man on this app who is 45M. The day after we met online we had a phone call and ended up spending nine hours on the phone! The following month he flew out to see me and I spent that whole weekend with him. We had an instant connection and even nine months later things still feel really great. \n\nHim and I live only a few states apart so for the past nine months we have been traveling a lot just to see eachother. We have been traveling back and forth so much that this weekend is our 20th visit with eachother and we have spent roughly 100 days together in person! \n\nWhen we first started seeing each other I didn’t tell anyone because I was too afraid of the judgment people would say. I have no clue how people in my family or community might feel about our age gap. Overtime it just got more and more involved but I still did my best to hide my relationship from everyone.\n\nThis upcoming May I need to find a new place to live and I don’t really have many options. The best case scenario is for my partner to move to my state and for us to live together. That is a realistic plan for us but the only issue is that I don’t think I can hide that from my friends/family. I am also starting to think about just telling them since there are times where it is hard to have to hide my relationship, especially when it’s such a big part of my life. \n\nI am really worried about what my family might say. I am worried they will look at me in a negative light. I know that it’s just their opinions but it isn’t easy to feel judgment. I am really stressed and confused on what the right decision is. \n\nAny advice would be greatly appreciated 🤍",
    "subreddit": "TrueOffMyChest",
    "title": "I’ve been in a secret relationship for the past 9 months and I’m afraid to tell my family",
    "upvote_ratio": 0.43,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j58nr5/ive_been_in_a_secret_relationship_for_the_past_9/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 22:54:56 UTC",
    "id": "1j58nd7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 18,
    "score": 35,
    "secure_media": null,
    "selftext": "Probably gonna delete this soon as I just wanted to get it off my chest and have no one to talk about this with. I’m sorry if this is too explicit.\n\nKinda embarrassing but I have a personal porn account on twitter just for reposting videos that I find hot and stuff like that, probably my fault as this stuff is the wild west but I’ve had that account for almost 3 years and have NEVER seen any CSAM EVER. \n\nI only watch videos of adult couples who are promoting their stuff so that type of thing never pops up. \n\nOne of the accounts I follow but never really see had been sold and taken over or something and reposted a sexually suggestive video of a girl that was very obviously young as fuck like 12-13.\n\nI clicked on the original account to see if all the videos were like this and it was literally just a bunch of young girls maybe 10 to mid teens with some in EXTREMELY explicit situations. \n\nI was absolutely disgusted and reported the account IMMEDIATELY and the account that reposted the video.\n\nThen worst part is that the reposted video had over 1k likes and 350 reposts, I looked at the reposts and it was HUNDREDS of GROWN ASS MEN and a bunch of fake OF accounts with hundreds of thousands of followers (obviously not run by whoever’s pictures they’re using) just mindlessly reposting whatever. \n\nI’m just disgusted, this is the type of thing you hear about but never really see for yourself. I can’t stop thinking about those poor young girls and how they must be feeling and how they hell they were taken advantage of to get into that position. Also the poor young girls who were probably groomed into sending explicit vids and don’t know those videos are floating around on the internet, or perhaps they sent them to another teen and they got leaked. Sad and disgusting. I hate this world. 🤮 \n\nI know this is partly my fault for watching porn online but it honestly jumpscared me seeing that, I don’t really watch porn that much anymore but this has scarred me for sure. 🙃",
    "subreddit": "TrueOffMyChest",
    "title": "I saw CSAM on “X” today and it just ruined my day and pissed me off",
    "upvote_ratio": 0.78,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j58nd7/i_saw_csam_on_x_today_and_it_just_ruined_my_day/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 22:26:17 UTC",
    "id": "1j5805v",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 1,
    "secure_media": null,
    "selftext": "I really don’t have anyone to talk about this to so I’m just gonna share this here. \n\nA year ago I (20M) was at a party with some of my friends. At the party there was this really pretty girl, I’m talking people’s heads were turning when she was walking by. We were alone at the snack table and started talking (I don’t remember much details), the conversation went really smoothly and at the end she invited me to go to a rap concert with her. I politely declined as it’s not my genre of music.\n\nThe party went on, everyone got slightly drunk and the girl invited me to dance with her. At some point the dance became kind of intimate (to the point she wanted me to „grab her ass” jokingly)… so  ofcourse I excused myself and went to get a drink. \n\nAt some point me and my friends went upstairs to chill on the couch, later in the evening the girl joined us and squeezed in right next to me. Some time passed and it was getting late so people began to fall asleep. I wanted to go find a bed for myself but it turned out the prettiest girl I’ve ever laid my eyes on fell asleep holding onto me, snug on the hoodie over my left ribcage. Being the awkward fuck that I am I just spent the night with one arm parallel to my body and the other on top of the couch as to not hug her without consent. \n\nMy memory has never been the greatest so I probably left out some details, but generally our chemistry when talking was great. \n\nIn hindsight it seems pretty obvious she could have been kinda into me (or she was jus being nice, guess we’ll never know) \n\n",
    "subreddit": "TrueOffMyChest",
    "title": "Im so dense, she was flirting with me (I think)",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5805v/im_so_dense_she_was_flirting_with_me_i_think/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 21:41:05 UTC",
    "id": "1j56y05",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "I fuck up everything good in my life. I had the most amazing guy and I fucked it up. \n\nI’m a miserable, depressed piece of shit. With no self esteem and severe social anxiety. \n\nMy life sucks. I ruin everything for everyone including myself. I drain the happiness and fun out of everything. I don’t know how to laugh, be myself or make jokes anymore. \n\nI take several medications. Nothing helps anymore.\n\nI had multiple shots at my dream job and I fucked every last one of them up. \n\nI’m 25 with no future and no friends. All of my college friends moved away and forgot about me. I don’t have any friends. The only time I get a text message is when my medications are ready. \n\nI’m stuck at home being a caregiver for my sick mother. Who sometimes still controls me like a child. I have too much guilt to leave her behind and go else where. \n\nI have no money, no license (bc I’m too much of a pussy to get behind the wheel), no car. Nothing. \n\nI’m not a normal girl. I hate dress clothes, don’t want children, no make up. Only video games, superheros and having a potty mouth worse than a sailor. I’m clingy, rude, no social skills, and can be loud. Who would like that? Even my own fucking dog hates my guts.\n\nMy boyfriend dumped me, my soul cat of 17+ years just died, I knocked my front tooth out which won’t be fixed for another 2 months, I live in a shitty apartment with insanely loud neighbors to where I can’t sleep at night. Shall I go on?\n\nIt’s been 25 years of miserable years and bad luck. If I didn’t have bad luck, I wouldn’t have any at all!\n\nMy life is gonna end at a ripe old age with no one that cares about me or would even come to my funeral. I’ll be alone and miserable forever. \n\nIn the end, it’ll always just be me, myself and I. \n\nI feel at least a bit better getting that all out.. ",
    "subreddit": "TrueOffMyChest",
    "title": "I’m a failure..",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j56y05/im_a_failure/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 21:52:31 UTC",
    "id": "1j577p6",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 3,
    "secure_media": null,
    "selftext": "English is not my first language\nFormat from mobile\nAll my life I felt like I was weird, I felt like I forgot things, that I couldn't empathize with people, my imagination was strong when I was a child and that's why I felt like no one could understand me, I'm currently 30 and after so much time I received the test that finally removed my doubts about what condition I had, I would believe that I had some kind of autism because of my behavior, but what I discovered left me devastated and I don't feel like I can talk to my family about it. I have mild cognitive impairment and although there are guarantees that I can continue with my life, the truth is that with the pace of life I lead it feels very difficult, I don't have the family support that I would like and at this moment if I tell them my condition they will use it to criticize me instead of supporting me, I feel like a failure for not being able to do what others could, what I expected was some guidance and now the only thing I hope is that I don't develop Alzheimer's or Dementia and lose the memories or what I once was I simply feel that I lost something and although for many it is insignificant, for me it was  One of the hardest news I have ever received in my life.",
    "subreddit": "TrueOffMyChest",
    "title": "I waited for more than 20 years for this result and I am not happy",
    "upvote_ratio": 0.81,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j577p6/i_waited_for_more_than_20_years_for_this_result/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 21:27:07 UTC",
    "id": "1j56m70",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "cause i just had a massive argument with my dad about phone limit times and we were talking 3 HOURS HERE. ngl i dont think its that long at all and i only used it to call w my friend even though i had to end it mid call cause he bursted into my room and started yelling at me for being on my phone for too long like it was after dinner time and i even did the dishes today and i was just having my free time. i rarely have my own times since im only allowed to use my phone for an hour and a half everyday but today was an exception cause it was my long distance friends birthday and i just wanted to celebrate it with her.",
    "subreddit": "TrueOffMyChest",
    "title": "how long do yall use ur phone",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j56m70/how_long_do_yall_use_ur_phone/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 21:18:33 UTC",
    "id": "1j56eve",
    "link_flair_text": null,
    "media": null,
    "num_comments": 42,
    "score": 0,
    "secure_media": null,
    "selftext": "cause guys i honestly dont get it like my parents can see what app im on, how much time i spend on that app, what websites im visiting and they said that i cant use more than 15 mins of tiktok per day and i think its insane please let me know if it is nornal\n\n  \nthe app they use is called family link and i think its time for me to like get over them and learn myself how to limit my phone time cause i literally cannot live with my tiktok time limited with 15 mins and the whole device an hour and a half everyday",
    "subreddit": "TrueOffMyChest",
    "title": "is it normal for parents to control your phone when ur 14?",
    "upvote_ratio": 0.11,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j56eve/is_it_normal_for_parents_to_control_your_phone/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 21:03:17 UTC",
    "id": "1j561yb",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "I dont know if it technically counts as self harm, but everything makes me mad. Games, my family, loneliness, etc etc etc. I've hit my wall so much that I have to change how I hit it. I think a part on my wrist might be broken, so now I have to use my knuckles. I reached out to 988 and they suggested taking it out on a plushie. I only had one and it's in pieces now, so back to the wall. I wish I could go to therapy so fucking bad, but we cant afford anything. I wish I was raised by people who made me feel comfortable enough to talk about my problems, but the most they would tell me is that im stupid for hitting myself and the walls.",
    "subreddit": "TrueOffMyChest",
    "title": "I cant stop hitting my wall",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j561yb/i_cant_stop_hitting_my_wall/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 21:01:47 UTC",
    "id": "1j560mr",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "I, (21 f)am dating my high school sweetheart again after years of not seeing or speaking to each other. \n\nWe met working a shitty fast food job in high school, and I fell in love with her almost immediately. She’s smart, so fun to be around, made me laugh and made me feel genuinely loved and appreciated for the first time in my life. I felt more confident, more comfortable around her. Not to mention she’s also the most gorgeous person i’ve ever seen. \n\nWe dated for a bit, and then she broke up with me towards the end of our senior year. I was heartbroken, and went off to college still processing and dealing with the breakup. As silly as it sounds and I know most people think this with their first love, but I really thought i was going to marry this girl. We chatted on and off throughout my freshman year, just normal shit like “hey how are you doing” and “we should catch up” before I finally decided it was finally time to fully move on and forget about her, so I blocked her on everything that summer, and deleted her number. \n\nWhile i still thought of her from time to time, I wasn’t angry or hurt about the breakup anymore, I had accepted that 17-year-olds know nothing about love, and all I can do with heartbreak is learn from it. \n\nFast forward to the beginning of my junior year of college, and I’ve dated on and off for years now and was in the process of trying to end a terrible long term relationship. I drove from college to my hometown, around 3 hours, to be with my friends after ending things while my new ex blew up my phone with calls and messages telling me what a horrible person i was for breaking up with her (I was not, she treated me terrible and refused to listen to me when I had an issue). \n\nMy friends and I decided to grab food and hangout in my car in one of the parking lots in our hometown. We pulled in, and I saw my first Ex’s car. It had a very distinctive bumper sticker, so I knew it was her. I didn’t get out or try to say anything, but my heart skipped a beat. I really truly believed I would never see this girl again. I debated reaching out, but in the end I unblocked her on snapchat and reached out with a simple “hey! were you at x lot the other night?” and we spent a few weeks catching up and then hung out for the first time in years. \n\nShe told me she missed me, and had always regretted the way things ended between us. I had no intention of trying to date again when I reached out, but I admit I did miss her too. That was about 9 months ago, and one thing led to another and now we are fully back together and it’s been amazing. \n\nI know it’s only been three years since we broke up originally, and I will say that I still don’t know anything about love. I’m a different person than I was in high school, and so is she. She makes me feel like the most beautiful person in the world, and i’ve never come close to feeling this way for anyone but her. All I do know is that as long as I’m able, I will do my best to love her the way she deserves, because as far as i’m concerned she does the same for me. I can’t help but wonder how my life would be different now if we hadn’t gone to that one parking lot that night. \n\nThank you for reading, xoxo",
    "subreddit": "TrueOffMyChest",
    "title": "I think i believe in fate because my first love came back into my life",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j560mr/i_think_i_believe_in_fate_because_my_first_love/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 20:41:09 UTC",
    "id": "1j55iu5",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 66,
    "secure_media": null,
    "selftext": "30M. I’ve been insanely busy this past week to the point that I basically forgot that rubbing one out is a thing one can do to chill out. Between work and life throwing me curveballs at every turn, my brain has felt like pea soup for the past 24 hours. \n\nLast night I was so insanely horny that I couldn’t stop thinking about my coworker who could like me but could also find me repulsive for all that I know. Genuinely thought about texting her and asking if she wanted to go out sometime. Probably would’ve led to some pretty bad shit for me, and I love my job too much. \n\nFinally today I had 10 minutes and was able to fully clear my head. Now I feel so much more at ease and all the things I have to think about don’t seem so threatening anymore. Phew! ",
    "subreddit": "TrueOffMyChest",
    "title": "Thank fuck for post nut clarity",
    "upvote_ratio": 0.91,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j55iu5/thank_fuck_for_post_nut_clarity/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 20:37:59 UTC",
    "id": "1j55g68",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 27,
    "score": 1149,
    "secure_media": null,
    "selftext": "today I found out my mom was murdered. blunt force trauma to the head that lead to brain bleeding. she had a migraine for 11 days and vomited daily. I had no idea she was sick. she passed in july of last year, and the county I am in is so backed up that the medical examiner took 8 months to get back to us. we all assumed it was a fentanyl overdose that she may have come in contact with because one of her friends was an addict. it turns out that she had no drugs in her system.\n\ni’ve been waiting for 8 months. i’m only 20. my dad hasn’t been around at all for my whole life. my mom picked terrible men. her whole life has been around horrible men. she was raised being beaten by her father by anything and everything possible he could find. she married a man who got addicted to crack, my father. she then married another man who cheated on her the entire relationship with other men. the final man, a man who had stolen from her in a relationship prior and who has killed 2 of his previous partners indirectly, took her, too.\n\nthe only answer it could be is that the final man took her from us. he had never killed them exactly, but both of his previous wives were completely clean before they met him. 5 and 7 years later, they both died of a heroin overdose.\n\nI cut off my relationship with my mom in 2019 due to something I was a victim of when I was younger by the man who cheated on her with other men. he did some fucked up things. a lot of fucked up things. he let a lot of fucked up things happen to me under his supervision. I had caught a disease from what he did/let happen and decided to move in with my grandma because I did not like the man she was now with, the man who (may) have killed her, the final man. I had no contact with her after I got a restraining order.\n\nshe and I had started to get along for once in 4 years. I had hugged her (albeit halfassedly) for the first and last time. she cried and cried. I don’t know what I would have done if she were to have passed and I didn’t get on good terms with her again.\n\nI wanted to see her succeed in her life. she spent all of her life desperate to be shown that she was worthy of being loved. I tried to show her before she passed, a few months before, that the way I had loved her growing up was enough proof that she was worthy of love. that if she can say she isn’t worthy of it, then my love I showed her as a kid meant nothing. she finally started to understand.\n\nwe were going to go to college together. I wanted to help her get her GED. to start going to school. to make the loser of a boyfriend she has had for years go work instead of making her work 2 part time jobs being disabled and still not being able to make the rent. he did nothing for her other than steal from her and hurt her.\n\nI had to protect myself by moving out those years ago. she didn’t want to listen when I knew he was bad news. i’ve known since I was 14. I just wish I could have done something to save her. I wish he never met her. I wish I could have been there to stand up for her when he hit her.\n\ni’m terrified. i’m so scared of being angry. I don’t know how to deal with the fact that someone took her from me. she was my everything for years. someone so cruel took her from me and made her be in pain. no one knew he had hit her. no one knew her migraine was not just a migraine. she couldn’t tell anyone or go to the doctor because she would have to admit he hurt her. again.\n\ni thought I processed it all when she died. but being told today that she died due to blunt force trauma and brain bleeding makes me feel like I lost her this morning. I don’t know what to do. I don’t know how to feel. I feel like my world just broke. again. and now I have to deal with detectives, with getting information, with anything that I can do to help them investigate.\n\nI just want my mom back.",
    "subreddit": "TrueOffMyChest",
    "title": "today I found out my mom was murdered.",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j55g68/today_i_found_out_my_mom_was_murdered/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 20:33:34 UTC",
    "id": "1j55cg2",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "Not much to describe honestly… \nJust wanted to get it out. But I’m in love with a boy since the 4th grade… \nBtw I’m a college student now… \nHe’s in a different country now and I’m in a different one…\nAnd I kinda just wanted to let it out, and maybe see if anyone else has gone through the same… \nIt’s been 11-12 years, but I’ve never been able to tell him…\nAnd you know the worst part is that I know that I love him, because he’s respectful, smart, caring, kind and just an overall amazing guy… \nBut idk why, I’ve just never told him… \nNot asking for advice or anything… I’m just putting it out there. Maybe someone might relate? ",
    "subreddit": "TrueOffMyChest",
    "title": "This boy that I like…",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j55cg2/this_boy_that_i_like/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 20:33:10 UTC",
    "id": "1j55c34",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "I'm a 21-year-old trans woman. I realized I was transgender some four or five years ago, and I have been on Hormone Replacement Therapy (HRT) for almost a year. I suffer from anxiety and depression and was diagnosed with Cyclothymic Disorder. So yes, I deal with body dysmorphia and gender dysphoria. I won't deny that it likely fuels a lot of my feelings. \n\nBut despite that, I am extremely self-conscious of my weight. And you'd think I'd be fine with it. I support body positivity heavily and would not ever judge others about their weight. Weight is not a proper scale of health, nor should it be tied to your self-worth; weight is weight. It only ever seems to be myself that I judge for my stomach. \n\nI have a potbelly. When I look in the mirror, all I see is my too-large stomach. And how it doesn't match the body that I'm SUPPOSED to have. And I do everything in my power to hide it because it causes me so much embarrassment. I wear high waisted skirts and pants, I'll tighten my belt just a little too much to tie it in, and I'll wear shape wear all so I don't have to acknowledge it. It makes me feel like less of a woman. Which I know is stupid. Women come in all shapes and sizes. Hell, my girlfriend is plus-sized and she's the most attractive woman I've ever laid eyes on. And yet, I still can't help but compare myself to other women, who have flat stomachs and small shoulders. \n\nI can never stick with exercise long enough to see any results. I like eating unhealthy, sugary foods. I eat a lot, in part to help my chest grow bigger, as HRT affects new fat distribution. I like to eat. And I live in the south, so you KNOW the food here is good. I'm terrible at forming habits. It feels like no matter what I do, I'll never have the body that I actually want.\n\nSo, sometimes, I wish I had an eating disorder. I've TRIED to give myself an eating disorder. I wish that I could go days without food and let my stomach shrink, just so I can finally look the way I want. I wish I could live on scraps of food. But I can't. Food is always there, mocking me until I finally give in.\n\nAnd the worst part is that I feel like I can't tell anybody. I can't talk to my girlfriend about it because it's a trigger for her own weight dysphoria. I have no friends I can talk to about it, and I'm terrified to talk to my parents about it. I hate the way my body looks and I wish I could just force it to look the way I want.",
    "subreddit": "TrueOffMyChest",
    "title": "I sometimes wish I had an eating disorder.",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j55c34/i_sometimes_wish_i_had_an_eating_disorder/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 20:26:13 UTC",
    "id": "1j555we",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 7,
    "score": 1,
    "secure_media": null,
    "selftext": "I used to be a single mom, full-time student and I had a difficult (yet fulfilling) job. I took a research opportunity, and that is where my life fell apart. When I got back home from the research experience (July 2022), I no longer believed my son was my own…I pushed through it, but eventually his father raped me and I couldn’t hold it together anymore. I left everything behind and moved to Hawaii with 2 suitcases and no real sense of reality or self. \n\nNeedless to say, I did it…I was able to craft a normal-ish life. I’m renting a room, I have a good job where I’ve proven my work-ethic, a few solid friends, and pets to keep me company. That being said…the delusion of my son not being mine never actually went away. \n\nI tried and failed to reestablish contact a few times over the last few years, but that part of my brain has never come to terms with it. I don’t exactly know where I went wrong, and now I’m living my own life…but it just feels like an unfinished story. \n\nI don’t know why or how the delusion came to afflict me…but it fucking sucks. I cannot talk about it with other people, and have instead just deflected any questions about my son in a light that makes it seem like my choice, even though nothing is further from the truth. \n\nI’ve tried professional help, but after being told to get better at eating shit by my last therapist…I guess I’ve just resigned myself to living a life of altered reality, where nothing makes any sense but hey at least I’m not homeless. \n",
    "subreddit": "TrueOffMyChest",
    "title": "I’m living with Capgras delusion",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j555we/im_living_with_capgras_delusion/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 20:21:18 UTC",
    "id": "1j551or",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "so, I have three cats and they are my life. I almost want to spend all my time with them. if I am outside I am already missing them. they really became my identity. I can’t control my obsessive behaviour towards them and I am talking to them, hugging them, petting them, making the best and most healthy dishes for them. I can’t help that I just love them so much I can cry about it. my boyfriend says that I am all about my cats. like people say as a joke crazy cat lady but I am afraid I am really one. actually I love that I am like this but I also have the feeling people found me weird and boring and doesn’t follow me with this. maybe I need help or advice? ",
    "subreddit": "TrueOffMyChest",
    "title": "I’m obsessed with my cats",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j551or/im_obsessed_with_my_cats/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 20:20:52 UTC",
    "id": "1j5518x",
    "link_flair_text": null,
    "media": null,
    "num_comments": 8,
    "score": 0,
    "secure_media": null,
    "selftext": "so i’m F 21 and I just went to the gynecologist for the first time and so I got my first breast exam and pap smear done. pap smear was not bad at all for those worried about it, literally the worst part is how like intrusive it is having someone being literally so close to you in that way when you don’t know them. but anyways after she did the breast exam and i had to open my legs up a bit for the pap smear i thought i might’ve been a little wet. i just don’t get why i would be cause it was honestly very uncomfortable for someone i don’t even know to be touching my breasts so thoroughly, i was not enjoying it in any way i was just uncomfortable and it was really awkward. i just wanted to know really if its like normal that i think i got wet from it. i could be wrong though i dont know i couldn’t feel myself or anything but i do think i was",
    "subreddit": "TrueOffMyChest",
    "title": "i think i got wet after a breast exam?",
    "upvote_ratio": 0.3,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j5518x/i_think_i_got_wet_after_a_breast_exam/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 20:10:06 UTC",
    "id": "1j54s03",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "Basically, the title, here's some context.\n\nI (F19) and my best friend D(F19), have been close friends since elementary school. The summer before COVID me and my parents moved to South Florida for the start of high school, and still we talked everyday. We would talk on Facetime for hours, fall asleep on the phone, play multiplayer games, and watch movies through shared play together. We got through college app season together, first jobs, and she was the first person I came out to. I've never had a sibling, but I'll always call her my sister. Even though we've practically been 1000+ miles apart for almost 6 years, she's always my #1 call. I tell her I love her everytime we hang up. \n\nD is in college in New Jersey for nursing, and just recently started sessions with a psychiatrist. She is actively on medication for depression and sleep.  She's always been a very introverted person, but recently she has been telling me that she's been going to different club meetups and parties. I was excited for her because this was a chance for her to make some friends and get out more. We downloaded Life360 together and I told her to keep her phone charged, text me when she got back, and have fun.\n\nI'm not dumb, I know kids are drinking alcohol and smoking at college events. Personally, I've made a life choice to stay away from that crap, but I don't hold judgment to my friends and others partaking. However, D has skipped the little white claws and high noons and started drinking straight vodka and tequila whenever she goes out. At first, when she told me, I just assumed she was taking a little shot here and there and calling it a day. However, some of her friends who know me and our relationship have let me know via Insta that she's drinking to the point of blacking out and keeps multiple bottles of alcohol in her dorm room. I've called D and told her that she's turning into an alcoholic, that she should stop going out as much, and that drinking leads to more destructive behaviors. She brushed me off and called me judgemental and stuck up. She's even blown off our gaming nights to go smoke with her friends. \n\nLast night she texted and told me she had to call me about something serious. She told me that she was drinking alone last night to the point of wanting to kill herself.  Her roommates had found her called the police and she was brought to a psych ward. She told me that the police and her dad found out about the alcohol and that she ended up coming out to her dad unintentionally. She’s also been lying to her psychiatrist and has been skipping her meds. She said she's been admitted and was calling to let me know so I wouldn't worry. I just told her that I love her like always, and that I'm glad she's still here. \n\nBut after getting off that phone call, all I could think was “I fucking told you so. I told you the dangers of drinking and you ignored me.” I’ll I feel is anger. I feel angry that she would think that way about herself and want to leave me and her parents and her little sister. I’m angry at her on campus “friends” who observed this behavior and didn’t stop it. They let her get this bad and I wasn’t there to help her. It kills me that I’m halfway across the country and can’t afford to see her and make sure she’s okay. And most of all, I’m upset that if she ended up killing herself, I wouldn’t be able to do anything about it. I’m just her former middle school friend on FaceTime a million miles away.\n\nI haven’t cried or felt sad and I’m not sure if this is normal.",
    "subreddit": "TrueOffMyChest",
    "title": "My best friend tried to off herself yesterday night, and I still haven't cried",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j54s03/my_best_friend_tried_to_off_herself_yesterday/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 20:06:44 UTC",
    "id": "1j54p4q",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 2,
    "score": 0,
    "secure_media": null,
    "selftext": "TW: Violence and threats\n\nI work at a care home for people with various physical and mental disabilities. The one thing I absolutely hate is how passive management is with the participants. They let them make any decision they want even if it ends up with someone falling down the stairs with little to no consequences.\n\nThe one guy they are horrible with and let him get away with anything. He is extremely violent and has hurt me and others on numerous occasions. The only consequence he faces is when he breaks things he just doesn't get to use it till it's fixed or replaced. Which is nothing, the worst part is this guy is smart and knows he can do whatever he wants and get away with it.\n\nThe worst time I experienced this was when me and another staff took him out to buy him candy with his own money. He wanted to buy a knife (it was a butter knife) and we said 'no'. It took alot just to get him away from the knifes and out the door. We managed to get him some of his candy and as protocol we gave him some. Still mad with us daring to say 'no' he threw the candy at me and tried to run back to the store to \"get the knife so I can stab you f*ckers\". I had to do a hold to stop him from going too far and hurting someone else. However the hold we are trained to do doesn't restrain both hands so they decided to scratch at my arm hard, to the point I was bleeding. It took a long time to calm him down and get him back in the car. The part that broke me was the fact he wanted me the one shaking and crying to apologize and my coworker who did nothing but call management to let them know what was going on also tried to get me to apologize. I couldn't cause I went completely non-verbal and just got in the car. I missed a week of work cause I was terrified of that participant and was locked up in my room. I filed a report for injuries, but nothing came of it.\n\nNow I just hate the participant. I'll never do anything to hurt or try and upset him, but I will always hate him and wish for his downfall.\n\nOne thing I want to note is that I understand alot of the people I work with can't control how they act. This one in particular also struggles to control their anger. However I've seen them handle 'no' from their parents and staff he likes and he was completely fine. He just doesn't like me and gets upset any time I ask him to do something or deter him away from dangerous things (I'm not rude about it I always ask very nicely I'm just not a guy or pretty enough so he hates me).\n\nTLDR: I despise a guy cause he can get away with anything he wants, including hurting others and he knows it.",
    "subreddit": "TrueOffMyChest",
    "title": "I hate one guy at work",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j54p4q/i_hate_one_guy_at_work/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 19:57:51 UTC",
    "id": "1j54haw",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 2,
    "secure_media": null,
    "selftext": "Last year, I think I was sent an email in December saying that I \"needed to send proof of income\" effectively tomorrow. It was also a \"2nd notice.\" assuming the 1st one was lost in the mail. I was already gathering that for a different service, so I just made copies of the pay stubs, waited an hour, and turned in everything asked. That is when I was told that I had been Flagged for something involving income and needed to see a medicare insurance adjuster. I wondered if any were available and was told no and that I needed to come back tomorrow or call in.\n\nI asked if I could make an appointment but was told none were available, as \"due to holiday training and staff shortages, we are unable to fill requests for appointments at the moment.\" However, I would \"put a note in my file that it was a late notice.\"\n\nI asked if I could get an extraction as I never received proper notice. I was then told, \"Also, due to staffing shortages and holiday training, we cannot do extractions, nor can we, as we are not responsible for lost or delayed mail.\"\n\nShe then told me that the best option was to come in at 7 in the morning to be the first in line. I told them that I work tomorrow and can't come in. I was told I didn't have to, but it would be at the \"small penalty\" of losing my medical and dental through California. So I did that and was one of the first 15 people waiting in line for the doors to open in cold, rainy weather. I got a ticket and waited for about an hour, thinking I could make it to work on time at 1030am. I sat and told them I was there for a medical adjustment with a medicare insurance adjuster.\n\nI was told they were not one and that the hour's wait was to set an appointment. I was told I could have called or come in earlier to have a specialist set it up. I told them I tried yesterday, and there were none available. I was hit with, \"Well, it's not my fault you poorly planned this. Seeing as you had 2 weeks.\" I told them about the late notice and a note in the file. The man eye-rolled me and just scribed out the latter on my ticket. Telling me to expect my number to be called again in 2 hours and that in the future to be \"more mindful of prep and time management.\"\n\nI called my boss; he was surprised but was cool with me coming in later as long as I kept him updated. And so I waited as eight became 9 and 9 became 10. I checked in as it should be around time for the meeting and was told due to a lack of adjusters today, there will likely be unseen delays. So I had just to wait, and I skipped breakfast to get there, messing with my phone and eating some of the fruit offered there. I messaged my boss every half hour as he was skeptical that any department could wait this long.\n\nby the 11 or 12th hour of the day, they started giving out parking passes as the parking lot had a two-hour limit and needed one. There was a small argument between one of the managers and staff members about whether they should ask the ones here over the limit just to move their cars as they technically violate the parking code, and we shouldn't be encouraging that behavior. a 3rd staff member had to step in just to hand out the passes.\n\nSo, by the 13th hour and a half, when I was falling asleep and wondering how much of my shift I would have left, someone poked me in the face and told me to look up. A new number had popped up. It was mine.\n\nI go through the door with paperwork in hand to see the Ajestor about what the problem was. It turns out they wanted to know if I had SSI payments and asked why I didn't have any from SSI. I told her that I wasn't on SSI, and she told me that was the problem. When applying for Calcover, I marked down that I had a federally recognized disability, autism. So they wanted to see if I was making too much for the program; when I didn't show any SSI payouts, i was flagged for possible fraud and they tried to ask me in person if I had any other forms of assisted living payouts or financial aid. I told them i was disqualified due to being able to work.\n\nSo the adjustor told me that next time, I needed to uncheck that box as legally, for health care, I didn't have a federally recognized disability as it implies I'm getting federal aid. So I waited nearly 6 hours for a 15-minute meeting asking me not to say I have autism on a federal level.\n\nMy god, why do we put people through this?",
    "subreddit": "TrueOffMyChest",
    "title": "waited 6 hours for a 5 min with human services",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j54haw/waited_6_hours_for_a_5_min_with_human_services/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 19:54:14 UTC",
    "id": "1j54e9w",
    "link_flair_text": null,
    "media": null,
    "num_comments": 31,
    "score": 0,
    "secure_media": null,
    "selftext": "For context, last night I (16f) had sex with a guy that i met for the first time (17m) and we both like each other. The only problem is that he came in me multiple times with no condom but i’m on birth control (vestura or whatever) but i can’t stop thinking about the chance of me being potentially pregnant.\n\nTMI: my privates have also been very sore and bleeding throughout the day and i’m in mild pain because of it down there. I’m not exactly sure what to do because the last time i had a pregnancy scare (i was 15) my parents raised hell, wouldn’t support me and said if i was to be pregnant then i would have to keep the kid even if problems arise. \n\ni’m not sure what to do.\n\ntldr; protected but also unprotected sex, pain and blah blah idk",
    "subreddit": "TrueOffMyChest",
    "title": "I could possibly be pregnant and i’m not sure what to do",
    "upvote_ratio": 0.29,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j54e9w/i_could_possibly_be_pregnant_and_im_not_sure_what/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 19:35:12 UTC",
    "id": "1j53y93",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 25,
    "score": 3,
    "secure_media": null,
    "selftext": "I was just a kid. Just a fucking kid. And yet, somehow, I still feel the weight of it like it happened yesterday. Like it’s still happening.\n\nI didn’t understand it back then—I only knew that something felt wrong. That I wanted to run but couldn’t. That I froze. That my body didn’t feel like mine. That someone I should have been safe with took something from me that I didn’t even know could be taken.\n\nAnd now, years later, I still carry it. In the way I shrink when someone gets too close. In the way certain touches make my skin crawl. In the way my heart races at memories I never asked for. In the fucking guilt—as if I should have done something different, as if I should have known, as if it was ever my fault.\n\nI want to know—does it ever go away? Do you ever stop feeling like something is wrong with you? Do you ever stop feeling like your own body is some kind of graveyard for what happened?\n\nIf you’ve ever felt this—if childhood left you with scars that no one can see—talk to me. Tell me I’m not the only one.",
    "subreddit": "TrueOffMyChest",
    "title": "Can You Ever Heal from What Happened as a Child?",
    "upvote_ratio": 0.71,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j53y93/can_you_ever_heal_from_what_happened_as_a_child/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 19:29:57 UTC",
    "id": "1j53tt6",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 9,
    "secure_media": null,
    "selftext": "I don't really know what to make of this, and I don't really have anyone to talk to about it. I (23F) started my master's this academic year and was brought in as a graduate assistant in one of the academic advising offices on campus. Our office has a new director who comes from a high school administration background and relatively new advisors (two of them, both have been here five years max).\n\nUntil yesterday, I didn't know why the previous GA left her role. She clearly left in a hurry because my office (her office) still had wall decorations, cork boards with posters and flyers, supplies, and cabinets chock-full of folders with papers, guides, flyers - you name it, it's here. It looked like the place was already in use is what I'm getting at. She created entire binders about our department's programs and even fully stocked the supply closet that we have. I knew she hadn't left due to graduation, it had to be either right before she graduated or she hadn't renewed her contract, but I didn't know why. It's not really my business, but I was curious and wanted to be sure it wasn't for something nefarious.\n\nSo, my suspicions rise when a classmate of mine, M, recognized the office that I said I'm a GA for (a handful of us are GAs, most of them for our college, but me in this advising office) and she brought up that she used to work there in undergrad until she graduated last year. M started asking about names from when she was there, and it became apparent we've had a lot of staff changes in less than a year. I thought, \"Interesting, I wonder why?\" She also did not like most of the people (advisors/director) who are/were here. I kind of shrugged it off, figuring that she probably just had some bad experiences or that the leadership prior to our current director was suboptimal, because I liked my coworkers. Naïveté on my part, I'll admit.\n\nBut something hasn't quite left me since that day: M said the previous director, let's call him Colin, resigned after being caught in a relationship with a student. I took this with a grain of salt because I hadn't heard that, not even from the other student workers who like to gossip, and M had made it clear that she didn't enjoy the office atmosphere.\n\nThings came to a head for me yesterday, when I met with the current director to discuss some issues with the website. Things progressed to how she doesn't like how disorganized the supply closet currently is, and her plans to clean it out with our administrative assistant over spring break. She mentioned having so much stuff left behind by the previous GA, like thick binders of who-knows-what, and not knowing what to do with them. They're multiple 5-inch binders stuffed to the brim.\n\nBringing up the GA snowballed until Director casually mentioned how my coworker, let's call him Andrew, one of the two advisors in our department, was the one caught making sexual advances - and *toward the previous GA.* They had gone out for drinks after-hours (unsure if it was with a group), and he had texted her inappropriately about hooking up. The then-director, Colin, received word of this but didn't want to do anything about it. He was promptly fired for his inaction once an actual, full-blown Title IX case opened against Andrew.\n\nThe GA left after this incident and no one has seen her since. She left everything behind. Her friends harassed the office to try and hold Colin accountable, but it wasn't until the case was opened that action was taken.\n\nI'm in shock and just don't know how to process these instances. *He* came onto my predecessor, yet she left, and he is still working here. I don't even know if she's graduated, but it makes sense now why her stuff was left behind and why nobody talks about her aside from the student workers who don't know the truth.",
    "subreddit": "TrueOffMyChest",
    "title": "TIL that my coworker had a Title IX case against him - from my predecessor - and he's still here.",
    "upvote_ratio": 0.74,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j53tt6/til_that_my_coworker_had_a_title_ix_case_against/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 19:25:14 UTC",
    "id": "1j53puu",
    "link_flair_text": null,
    "media": null,
    "num_comments": 20,
    "score": 5,
    "secure_media": null,
    "selftext": "Hi everyone, I just need to vent out.\n\nI am 26 F, and my boyfriend is 24 M. We met through this girl who is our mutual friend. They are roommates. But since last year, it has been a bit up and down between all the three of us. It all started when my ex suddenly showed up at my door wanting to talk. But this girl friend of mine got angry at me because I asked back the money I am owed back, and went and told my boyfriend that my ex showed up, we “talked” and some other stuff. This caused a major break in between our relationship, and I only knew about this recently that she was the one who ratted me out when it wasn’t her place. I would have told him, but she went ahead and told him adding unnecessary untrue details to it.\n\nWe had some misunderstandings, and we moved past that. But as of now, she seems to be becoming more possessive of him, though she has her own boyfriend. She expects him to take her out everywhere, doesn’t include me, and he seems to be doing it. But when I ask him, it’s always reasons and excuses. \n\nShe still owes me a little around $600, and I am honestly scared to ask her about it. They have been doing a lot of video calls, texting constantly and I know it may be nothing but I just cannot digest the fact. I know I need to be more trusting but I feel like a third wheel in my own relationship. He expects me to adjust to this, but why should I be adjusting in MY relationship.\n\nYesterday night, I questioned him about it and he came to hit me. I got shocked that he raised his hand on me when I asked why did he video call her. He keeps saying I am more important to him and I am his first priority but I just cannot understand why he would get so angry when I questioned about it. This was the third time in a row he raised his hand on me. But later consoled me. I asked him to choose between me or her, he said he is in a situation where she is his roommate and he cannot do anything. I hate the fact that she is so touchy around him, I just hate it. \n \nI trust him that he wouldn’t do anything behind my back like sleep with her, but I just cannot let it go. I am still in shock from yesterday night. I feel like I lost all my friends because of him, I don’t feel like I belong with anyone and I don’t even have anyone to talk about this that I have to vent it out on Reddit. \n\nTL;DR my boyfriend seems to be involving our mutual friend a lot into our relationship and seems to be choosing her over me.",
    "subreddit": "TrueOffMyChest",
    "title": "Boyfriend seems to be choosing our mutual friend over me",
    "upvote_ratio": 0.78,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j53puu/boyfriend_seems_to_be_choosing_our_mutual_friend/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 19:04:11 UTC",
    "id": "1j537hs",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 5,
    "score": 1,
    "secure_media": null,
    "selftext": "I often have this nightmare where my mind convinces me that the dream I’m having is a memory and in it, I’ve killed someone.\n\n I vividly remember stalking them getting them out to a secluded area and brutalizing them. I wake up, genuinely believing that this is something I have done and then blocked out of my mind I find myself searching for evidence in my waking life of this person that I have allegedly killed and I can’t really tell if it’s just a sign of my terrible mental health or something that other people also experience.\n\n  I’ve had the dream on an almost weekly basis for the last five years in my dream it’s always the same person that I have killed and it’s always the exact same way it is downright terrifying to me because although every piece of tangible evidence  proves that I did not have the time or the ability to pull off something this heinous there is a little voice in the back of my mind that wonders what if?\n\nIt’s gotten so bad I’ve started looking through missing persons posters trying to see if I can match the person in my dreams to a person in real life and  I’m terrified that one day I will find a match .",
    "subreddit": "TrueOffMyChest",
    "title": "Am I a Murderer or just Mentally ill?",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j537hs/am_i_a_murderer_or_just_mentally_ill/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 18:54:52 UTC",
    "id": "1j52z34",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 1,
    "secure_media": null,
    "selftext": "I F 21 and my boyfriend M 22 have been together for 7 years, we recently took a break a year ago to explore life but decided to get back together cause we missed each other. My problem is that I love him more than life itself but I need to cut it off, he feels like a friend and not a partner and our life goals don't align anymore and just generally I don't think I want to be in a relationship anymore. I know that makes me the ass but I can't figure out how I should navigate telling him. I don't want to lose him and he's made it very clear if we separate again he will have nothing to do with me but it's not fair to string him along when the feelings have fizzled out for me. Any advice on how to navigate telling him is very appreciated \n",
    "subreddit": "TrueOffMyChest",
    "title": "Not in love anymore? 21f 22M",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j52z34/not_in_love_anymore_21f_22m/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 18:54:15 UTC",
    "id": "1j52yjk",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "I’ve always wanted to live life on my own terms, but my Muslim Arab parents make it feel impossible. Even though I’m an adult, they still try to control every aspect of my life my career, my choices, even how I spend my time. The moment I push back, I’m met with guilt-tripping and emotional manipulation: \"You’re disobedient.\" \"You’ve dishonored us.\" \"I will never forgive you until the Day of Judgment.\"\n\nAnd many of the things they react this way to aren’t even that big of a deal. For example, I’ve always wanted to cut my hair short, but my mother made it clear that if I ever did, she wouldn’t forgive me and that it would be a a sin hanging over my neck until Judgment Day. Even something as small as asking them to knock before walking into my bedroom turns into an argument, as if having basic privacy is an act of rebellion.\n\nAnd if not through words, they use threats. They tell me they’ll force me into marrying someone against my will or that they’d lock me in a room if I disobey them. Even if they don’t act on these threats, just hearing them is enough to make me feel powerless, like my life isn’t really mine to control.\n\nIt feels like their love is tied to control as if I can only be a \"good\" son or daughter if I follow everything they say without question. Their obsession with obedience and authority makes it impossible for them to see me as an independent person. It’s as if my life belongs to them, and any choice I make for myself is seen as betrayal.\n\nI know they believe they’re acting out of love, but it doesn’t feel like love. It feels like a cage. It’s exhausting to constantly be torn between my own happiness and their expectations. I’m tired of feeling like my worth is tied to how obedient I am. I just want to be allowed to make my own decisions without fear, guilt, or the weight of their disappointment crushing me.\n\nWhat hurts even more is that when I try to talk about this, I’m always met with the same dismissive responses: \"They’re your parents, you must obey them no matter what\" Society expects the owns who go through this to just accept it, as if their love should come with conditions and control. But I don’t want to spend my life suffocating under obligations I never agreed to. ",
    "subreddit": "TrueOffMyChest",
    "title": "The obsession with control with Muslim arab parents",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j52yjk/the_obsession_with_control_with_muslim_arab/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 18:52:41 UTC",
    "id": "1j52x4u",
    "link_flair_text": null,
    "media": null,
    "num_comments": 32,
    "score": 8,
    "secure_media": null,
    "selftext": "Hi everyone, I really need some advice cause this is insane, I live in a fairly small country and recently I began dating someone (like it's been 7 months) we get along great and everything is fine, i was out shopping with my mom today and she pointed out someone to me and told me they're my cousin. I'm literally speechless, the person she pointed out is literally the brother of the individual I'm dating, I tried asking how we are related and I doubt it's a close relative, most likely distant and they are not directly related to me. None the less I feel sick and I'm just really uncomfortable, I plan to speak to them about it tonight cause I'm thinking of ending things, I don't think i can continue dating them and I'm glad i found out relatively early on. \n\nI'm confused about how i should feel i know it's not my fault because I didnt know but it still makes me feel disgusted.\n\nI need advice on how to cope with this. \n\n** EDIT: please read the comments before answering, for those of you who want to know, I'm not going to be with this person in any way, shape or form, I was not in a relationship with them we were just going on dates and that. I'm not interested in being with any one remotely related to me. \n\n",
    "subreddit": "TrueOffMyChest",
    "title": "I found out I am dating my cousin",
    "upvote_ratio": 0.83,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j52x4u/i_found_out_i_am_dating_my_cousin/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-06 18:49:00 UTC",
    "id": "1j52twe",
    "link_flair_text": "Positive",
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I have been struggling with depression and bipolar for years but being back with loved ones (family, friends and lover) made me realize how loved I am. There has been some added responsibilities and I learned how to be more compassionate and empathetic after 10 years of living abroad. Some years, alone. \n\nI don't believe life gets better before. Now I discovered that it does get better but not in a typical way where suddenly your career, health, relationships would work out at the same time. There will be some tests that would drive me insane but I knew I would pull through. \n\nMaybe when I'm 40 I would be back to square one but the lesson I learned before will always be relevant. \n\n",
    "subreddit": "TrueOffMyChest",
    "title": "Road To Recovery",
    "upvote_ratio": 0.99,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j52twe/road_to_recovery/"
  }
]