[
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 16:51:40 UTC",
    "id": "1j839v2",
    "link_flair_text": "Positive",
    "media": null,
    "num_comments": 4,
    "score": 26,
    "secure_media": null,
    "selftext": "For most of my adult life I have dreaded getting a driver's license. I don't like driving and never felt like I needed it.\nWell, as I said in my title I love driving with my mom and would always ask her to drive me somewhere, go shopping with me, or just to pick something up. I almost never \"needed her\" there, I just like sitting in the car and playing cool new music that she might enjoy, as I have a bit of a more 'modern' music taste. This is always a positive experience and I love her so much. I even got her into TOP and she said we have to go to a concert some day.\nEventually I finally felt the need to have my own license and grow up as it were, and I did it. I still ask her to drive with me, and recently I even explained to her that the reason I ask her to drive me around is because of all of the above. I simply like just the two of us listening to music and talking (I even dislike the fact that my brother sometimes comes with us hahah, but it's fine, we all have good times).\nShe was really happy to learn this, and I'm looking forward to me becoming the designated driver and her DJing.\n\nAs I am finishing up this post we are getting ready to go run some errands and I'm really content.\nThanks reddit for reading this happy nugget of my life, and I'm glad I could share.",
    "subreddit": "TrueOffMyChest",
    "title": "I love driving with my mom and DJing for us, and now the roles are slowly switching. I feel so wholesome",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j839v2/i_love_driving_with_my_mom_and_djing_for_us_and/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 16:46:45 UTC",
    "id": "1j835ph",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 4,
    "secure_media": null,
    "selftext": "",
    "subreddit": "TrueOffMyChest",
    "title": "I wish there was an anxiety med that works just has good as alcohol does.",
    "upvote_ratio": 0.71,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j835ph/i_wish_there_was_an_anxiety_med_that_works_just/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 16:12:48 UTC",
    "id": "1j82bj4",
    "link_flair_text": null,
    "media": null,
    "num_comments": 11,
    "score": 0,
    "secure_media": null,
    "selftext": "When I was younger I used to steal my siblings teeth that they placed under their pillow for the “tooth fairy” idk why I did it but once I had a few teeth in my collection I found it very exhilarating. \n\nIn 5th grade my parents got called into the school because they found out that I was using my lunch money to pay kids to remove their loose teeth. I successfully extracted 4 teeth before being caught. I was in trouble but it was also a moment of “oh a silly entrepreneur boy” thing. I kinda got a pass. The teacher even joked that perhaps I have career in dentistry. \n\nIn middle school I got caught again.. the elementary school was attached to our middle school and I was convincing the much younger kids to give up their loose teeth. I’d give them snacks or candy as a trade and they were happy to oblige. I was in much more trouble this time and my parents made me attend therapy. I played it off as an interest into wanting to become a dentist.. but really there was something about taking a tooth and keeping it that was so exciting. By this time I was building quite the collection. My parents never learned that I actually kept the collection of teeth. And now they’re both dead anyways.\n\nIn high-school I slowed down quite a bit. I focused mostly on my studies. Freshman year was rough. I witnessed a fistfight that left another student with a tooth that was almost knocked down, a lateral incisor, 23 (on the bottom) it was kinda just hanging there. The guy was in my class and we were acquainted so I went to help him. When I saw how loose it was I just reached in and grabbed it. It just came right out. Everyone was shocked and I ran… pretty cringe moment and everyone treated me like a weirdo after that. By junior year they seemed to forget.. I even had some dates. I subconsciously would target women in sports or heavy party girls because they tended to either lose teeth quicker or have dental issues. It worked in my favor on more than one occasion. \n\nAfter highschool I worked on going towards dental school but quickly realized it wasn’t for me. The science behind it just didn’t interest me.. I really just wanted to perform extractions I had no care about restoration. So I kinda just floated around working odd jobs. I collected a lot of dental tools that I would use on friends and family and women I would date. \n\nToday, I have 97 teeth total. About 49 of them are baby teeth. Most of which I have taken when I was younger. Some were from the children of the women I’ve dated. When they have a sore tooth it saves a lot to just do the extraction ourselves and we turn it into an adventure game with the kids. The rest are adult teeth I’ve collected over the last decade+. The majority of these I obtained consensually. \n\nI plan to continue dentistry as a hobby. My dream would be to open up a clinic in maybe Africa or India or something where I do extractions for free. That way I’m helping out but also enjoying myself at the same time.",
    "subreddit": "TrueOffMyChest",
    "title": "Ive been collecting teeth my whole life and I practice dentistry as a hobby.",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j82bj4/ive_been_collecting_teeth_my_whole_life_and_i/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 16:11:46 UTC",
    "id": "1j82aov",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "My wife's in a trip with some of our close friends and I'm kinda losing my mind over it.\nI was supposed to be at this trip but for some unforeseen circumstances (my mother which I haven't seen in 7 years since I moved to another country was able to come) I chose to stay at home, but since we had everything booked already we found it nonsensical for her to not go, specially since the trip was with our group of close friends.\nThe thing is FOMO has been killing me, and I find myself checking the socials of our friends and hers to see if they posted anything so I can get a glimpse of what they're up to or even get a glance at my wife.\n\n\nI do not regret staying behind, for these days with my mom have been amazing and it has been great to be able to give my full attention to her, but I can't help being a little down about it.\n\n\nI'm essentially posting this here to vent because I didn't want to \"spoil\" my wife's trip with this or my mother's staying with me with this information and all the friends I'd vent with ARE on said trip.",
    "subreddit": "TrueOffMyChest",
    "title": "Hate this state of mind",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j82aov/hate_this_state_of_mind/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 15:56:57 UTC",
    "id": "1j81xiq",
    "link_flair_text": null,
    "media": null,
    "num_comments": 11,
    "score": 26,
    "secure_media": null,
    "selftext": "I am not sure if I am too sensitive or overreacting but I recently treated my family to an all-expense-paid trip. Of course, I was super excited to share the news when I have finalised the tickets, hotels, itinerary, etc.\n\nWhat surprised me is that, when I told them, they seemed...indifferent and uninterested especially my mother. My parents love to travel and we almost always do it yearly but now it confused me because why don't they seem happy now that I am paying for everything?\n\nWhat even hurt me more is they wanted to tell our extended family members and their friends that this was all organised and paid for by my partner! I couldn't understand why they just don't want people to know it was because of their child? Or why tell them at all? They're not part of the trip anyway. But they did scrap the idea in the end so there's that.\nHowever, during and right after the trip since they post so much on socials, family and friends kept asking how much they spent on the photo of food they posted, or the places we've been to, or the places we've stayed at, and seeing their response \"LOL you don't want to know\" or \"Oh, it's expensive\" led me to the decision that I am not taking my family on another vacation anytime soon.",
    "subreddit": "TrueOffMyChest",
    "title": "I don't know the appropriate term to describe my parents.",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j81xiq/i_dont_know_the_appropriate_term_to_describe_my/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 15:49:17 UTC",
    "id": "1j81qth",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 2,
    "score": 0,
    "secure_media": null,
    "selftext": "my mom was walking past my brothers room (17) and he was talking on the phone with one of his guy friends and talking about how he watched his friend have sex with a girl. i think they might of taken advantage of her at a party or something, maybe drunk or high. my mom is doing nothing and is completely ignoring it. my brother also hates women and is an incel",
    "subreddit": "TrueOffMyChest",
    "title": "my brother said some weird stuff",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j81qth/my_brother_said_some_weird_stuff/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 14:47:34 UTC",
    "id": "1j80bit",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 2,
    "secure_media": null,
    "selftext": "So this is rant/storytime about a toxic friend, who is still in my life and I’m unable to remove her. Lets call her Sara. So I met Sara in the 1st year of my college through my ex-roommate (Lets call her Jane) Jane and Sara were in the same class so one day she came to visit Janes room, where I lived too. She immediately started talking to me very excitedly and telling about herself, and asked for my Insta acct, probably because me and her both are from the same religion, Jane isn’t. So then we started hanging out often, all three of us and she also started meeting my other friends from college etc. Sara lives with her brother, they’re both studying here. Fast forward a few months, and that’s when it started getting unhealthy. She started acting very possessive and would get upset over me hanging out with other friends without inviting her, or posting stories etc. She would even get jealous when I went out with Jane or posted stories with her (she was my roommate ofc we would have fun together and be close). When a few times me and Jane have fought, she would always come and tell me things like yeah she is like that lets go out etc. instead of trying to reconcile us. I think she enjoyed it when I would have disagreements with my other friends.  \n  \nApart from the possessive nature, she is very cheap in money matters. Whenever we would go out to eat or have tea or anything, she almost never paid. And if she ever did she would ask me to send half of it. She would use this trick where she wouldn’t order anything, and if I did she would eat from it. And if said to pay she would say that she didn’t even order anything or she just tasted my food. If we ever made plans for the movies or any other activity, she would beforehand say I don’t have any money expecting any of us to say we will cover her, and if no one said that and we went without her she gets upset. She then once caused such a big misunderstanding between me and Jane that we didn’t speak to each other for 6 months and started living separately. We have started talking again now but live alone and not together. Jane still doesn’t speak to Sara and probably won’t ever, which I think is good for her. \n\n\n\nShe also has this habit where she would just take my stuff. My parents live abroad and they would send me chocolates, or some food items available abroad, suppose they have sent 2 packets, she would just come pick up one and say Im taking this. Now, I am a person who can’t say no to someone like this when they ask me for some food item or something, I don’t know I try but I just can’t bring myself to it. She then started asking for my other things too, which are not 2 packs or just anything. Like she once saw my aloe vera gel and said oh I want it what will you do of it, or even my plates and cups, hair brush, anything she would just say oh I am taking this, I have not given any of those to her. I have told her that no I need it, but she would still insist, it was very tough for me to have those arguments. She once even asked for a gift that was given to me by my fiancé (his apple earphones) and said oh I need these, I said no he gave them to me why would I let you take it, and guess what she was upset about it. But she wouldn’t stop. There are so many such incidents. One that has stuck with me is when I brought chocolates for her from abroad, and I asked her to give me one from the pack and she straight up refused saying they were hers. I was baffled that how could she refuse me chocolates that I brought her??? It was so cheap.  \n  \nSo these are all small things and in the past few months some pretty serious and big things she has done, which are:  \n  \n1st - She absolutely ruined my birthday. So my fiancé (Lives in another country) had planned a celebration at a fancy restaurant with all my friends, as a surprise for me. He reached out to Jane to help prepare for the surprise as he couldn’t manage effectively from so far away. When Sara found out that he reached out to Jane and not her, she got mad and upset about it, that why she wasn’t asked and also cause she and Jane don’t speak to each other. She made a fuss about it and on my birthday, in the restaurant she sat there, making a faces, didn’t eat anything at all, wasn’t talking to anyone and also whispering comments to someone either about me or Jane. I asked her several times what’s wrong and she just said nothings wrong and continued behaving like that. Everyone saw that it was affecting my and everyone else’s mood so they kept asking her to cheer up but she didn’t. She didn’t even eat a single bite of the birthday cake, also constantly made faces didn’t smile for once the entire time and left. The next day I confronted her about it and she said she is sorry and she was upset why she wasn’t chosen by me. I said my fiancé planned it all and I didn’t know about it but she said I probably knew how could I not know. I told her that she ruined my day and she texted me ‘I’m so sorry’ with the hands folded emoji, making it a sarcastic mean sorry.  \n  \n2nd - This incident happened a few days ago and has really made me think that I have had my last straw now and this is getting so so toxic. So she had borrowed money from me which she was supposed to return last month. When I asked her for it she said she doesn’t have it and sent me a small amount and said she will send me the rest later. I said okay. Now a month has passed and Im really broke right now and need some money. So I texted her asking her to send me the rest of the money, she said to me again that she doesn’t have any money. I said why not, even I don’t have money and I need it, please ask your parents to send It or do whtever but please give me my money, at least give me half back as I am in need of money right now. But she just said that I don’t have money, I will give it when I have it. I asked her when will that be and she said 4-5 months!! That’s when my college comes to an end and I will be literally leaving the country, that’s when she wants to pay me back. Its also not a huge amount which she can’t arrange out of nowhere, she also has had time of several months but is still not returning my money. I argued with her for around half an hour over text asking her to give my money back now as I need it now and not months later. I even gave solution that she can pay me little by little each month at least but she plainly said no I don’t have to all of it. I dont know how to get the money now. AND CHERRY ON THE CAKE IS ever since I asked her the money back she is UPSET with me. For asking my own money back!!! When I need it!!! She didn’t say she’s upset but she isn’t sending me any reels as she used to, stopped reacting to mine, doesn’t send snaps, which all she does when she is upset. I just don’t understand where she gets the AUDACITY to be upset here?? I should be the one upset as she is not giving the money back. I feel like this is literally the last straw. Theres so many more things she has done but I cant write all of them down here or this will be too long.  \n  \nNOW I KNOW WHOEVER READS THIS WILL ASK ME WHY I HAVENT ENDED THE FRIENDSHIP, now that is because we have been friends for the past three years and my whole family, my fiancé, my in-laws they all know her and they ask about her frequently and ask if we’ve been hanging out and how is she and everything and I’ll be passing out college in the next three months and after that I’ll be moving to another country and probably won’t see her anymore maybe once in a blue moon in a lot of years, but we won’t be meeting again I think so. So I just wanted to avoid any drama since the past six months I have been thinking that I should just let it go because it’s just a few months and I don’t want to create the drama and I don’t want the fuss of explaining all the family members of why I don’t speak to her anymore and all that but I think this is just getting so much out of hand. Even now she is still in my life, thinking that it’s just three more months and it’ll all be done but I don’t know anymore if I should end it now or wait. All this time I’ve been such a good friend even after she has done all of this I continue doing things for her. I continue trying to help her whenever she needs. I lent her the money after she did all that fuss on my birthday. And yet, she is like this. This is very very toxic.",
    "subreddit": "TrueOffMyChest",
    "title": "Toxic friend still in my life, dont know if I should end it",
    "upvote_ratio": 1.0,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j80bit/toxic_friend_still_in_my_life_dont_know_if_i/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 14:40:54 UTC",
    "id": "1j805wd",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 2,
    "secure_media": null,
    "selftext": "Don't get me wrong. It's not their mental health pushing me away. It's their complete lack of effort to do anything to fix it, instead relying on me to.\n\nIt's been seven years of my partner's mental health declining into crippling depression and I've stood by their side, doing everything I can to support them. Everything one person could possibly do to help lift their feelings of worthlessness. And I'm exhausted. It's bringing me into a new low of apathy towards everything due to not being able to invest in myself or my mental health. \n\nYears ago, they agreed to seeing a therapist, a hormone specialist, everything. I've nudged them to get on track, suggested they get out, be more social, constantly trying to lift things from their day so they can feel less overwhelmed. Trying to remain in a constant state of positivity (trying, I definitely don't, I'm human but I fake it as much as one can for the person they love) to no avail. It's now to the point where anything i try is met with \"That's not what I need\" or \"that's making me worse\" when all I offer is reassurance and support.\n\nThey haven't made any forward movement in seeking professional help. Multiple promises and agreements over the years but nothing. Now it's to the point where I'm met with excuses every time I ask how it's going. I never push, never get aggressive with it.\n\nI'm at the end of my rope. I've spent so much of my own energy in trying to be there for them, that I've lost myself. I'm exhausted, I'm depressed and I don't seem to get any support at all when I voice how I'm feeling.\n\nI don't think I can do this anymore. ",
    "subreddit": "TrueOffMyChest",
    "title": "My partners mental health is pushing me further away",
    "upvote_ratio": 0.76,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j805wd/my_partners_mental_health_is_pushing_me_further/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 14:19:44 UTC",
    "id": "1j7zp6l",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 2,
    "score": 23,
    "secure_media": null,
    "selftext": "I should feel happy. I just wanna feel something. \nIt has been years that I‘m feeling out of touch of life. \nYears that I considered taking my life. Years of pretending everything’s okay. Years of isolation. \n\nWhatever I do, I can‘t be mentally present. I‘m always dissociating or in panic mode. \n\nI hate myself, even tho I shouldn‘t. \n\nI know my past isn’t my fault. I’ve been in therapy since the age of 6. Nothing helps. And when I’m trying to express my feelings to those that I love, they dismiss me. Even my husband.\n\nI think the only thing that could help me is to not exist anymore. Maybe I would be finally free and not live on autopilot forever. \n\nI really feel permanently broken. I am sorry. ",
    "subreddit": "TrueOffMyChest",
    "title": "I feel numb even after my wedding",
    "upvote_ratio": 0.8,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7zp6l/i_feel_numb_even_after_my_wedding/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 14:02:09 UTC",
    "id": "1j7zb6f",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "I think I'm defective. I don’t think I’ve ever truly felt connected to people or even to myself. It’s as if I’m living my life through an out-of-body experience, like there are two separate versions of me: my consciousness and the person maneuvering my body, interacting with the world. When I look in the mirror, I barely recognize the person staring back.\n\nEver since I became self-aware( around six years old) I noticed I didn’t feel the way others did. My classmates mingled effortlessly, forming bonds that I lacked the vocabulary to describe. But I could sense the absence of that feeling in my own life. My parents loved and cared for me deeply, and I knew that. I loved them, too—I’d cry for them, seek their attention, I was obviously attached to them.But something wasn’t right. It was as if there was a glass wall between us. I could see them, they could see me, but I couldn’t feel them.\n\nThis feeling—or lack of it—persisted. I was always aware of it, and it bothered me immensely. It confused me. I could feel emotions for others, I could empathize, I could care, I could love. But I couldn’t feel them.\nEventually, I got sick of wondering and started asking people about it. I thought maybe everyone felt this way but just never spoke about it. Like a hush hush kind of thing. Each time, I carefully watched their faces as I explained. People’s expressions would shift in tiny, quick ways—so subtle they’re almost undetectable if you didn't pay close enough attention. And every time, I saw the same reaction: a scrunch of the face, a flicker of confusion, discomfort, or even judgment. It was never positive. Then, their words followed: \"Im not understanding what you mean?\" \"How so? You clearly feel connected to people like XYZ.” (who do you think are telling how I feel???) Or my favorite: “That’s normal.”\nI know for a fact this isn’t normal.\n\nThis brings me to why I’m writing this. I’ve had friends, I’ve had partners. I’ve felt deep emotions for them. But I never felt one with them. They would tell me how connected they felt to me, how deep and natural it was. And I would lie—because I didn’t want to hurt their feelings. But deep down, I knew I could never reciprocate the feeling. I was attached to them, yes, but in a way that often turned toxic and possessive. That’s not a real connection.\n\nThe best way I can describe this lack of connection is like wearing thick gloves. I can still touch things, still interact with the world. But I can’t feel  anyhing. Like the softness of wool or the rough ridges of a rock—nothing compares to the feeling of interactiing with the world with your bare hands. My gloves, though, seem to be stuck. Glued onto my hand. \n\nI truly believe I’m defective. \n\n",
    "subreddit": "TrueOffMyChest",
    "title": "I've never felt a true connection with anyone in my life.",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7zb6f/ive_never_felt_a_true_connection_with_anyone_in/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 13:56:56 UTC",
    "id": "1j7z6wp",
    "link_flair_text": null,
    "media": null,
    "num_comments": 235,
    "score": 2409,
    "secure_media": null,
    "selftext": "I struggle a lot with body image, being overweight and having ALOT of body hair. I've never been in a relationship and the loneliness weighs on me alot. I also just struggle to make friends because of social anxiety and extreme paranoia.\n\nI've always been bi-curious but kept it to myself in fear of retaliation by my extremely conservative family. When I finally moved to college, that stayed until this morning. I finally built up the courage to not only get back on dating apps (I have 0 luck there too) but also try Grindr. I make a profile and started trying to talk to people around my age. One person I had a small convo with before they asked me to send a d\\*ck pic. I was nervous but replied with it.\n\nAll they said was \"Ew\". That's it. Nothing else. Just ew. And honestly? It destroyed me. I've missed all my classes today because I've just been crying, desperately shaving all my body hair (I thought they may be referring to that) and desperately looking up weight loss surgeries and loans for it. I already work out 6 days a week, and while I don't have stylish clothes I've worked on making myself look put together. I've tried so hard to be the best version of myself, and the second I send something extremely vulnerable, I get called gross. It almost reminds me of back in high school, where girls would make throw up noises when I showed any interest at all.\n\nI don't know. I don't know what to do.\n\nEdit: Spelling ",
    "subreddit": "TrueOffMyChest",
    "title": "Sent a nude and they said \"Ew\"",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7z6wp/sent_a_nude_and_they_said_ew/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 13:14:41 UTC",
    "id": "1j7ybiz",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 0,
    "score": 3,
    "secure_media": null,
    "selftext": "My whole childhood was a blur due to all of the abuse I had to endure from my sister. It all started around when I was in kindergarten and she was in 6th grade. I remember her holding me down in my mother’s closet, punching me in the face repeatedly. She would hold my head underwater when we went to the pool until I almost went unconscious. She would chase me and my mom around the house with any weapon she could find and she ended up stabbing me with a knife in the stomach at some point. This and more all went on for years until she moved out after she graduated high school in 2020. \n\nAt some time between 1st-3rd grade, I was SA’d by her. She would make me watch pay gorn with her then she would make me kiss her also lick her chest and her downstairs. She would make me and my (disabled) little sister shower with her and one time she also made my little sister lick her. I spoke to my cousin about this and similar happened to them. They also witnessed my sister’s abuse on many occasions. \n\nFast forward to today, I am 17, my sister is 23, and she moved in with me, my mom, and my little sister after the hurricanes along with her fiancée(F22) and their son(2). They originally were just evacuating but they decided that they weren’t going back. They were supposed to move out within a month but it has now been 6 months. They reside in my little sister’s room so she now shares a room with my mom. The whole house is being taken over and I’m tired of biting my tongue. \n\nLast week, I was about to take a shower and I noticed a pretty big mess my nephew made. There were crushed eggshells spread all over the carpet along with stickers and price tags (my mom runs an antique business) I asked my sister to clean it up and I go take a shower. I had just gotten out and there were even more messes that were made. There were crushed eggshells are still there. I go to the kitchen and there were magnets covering the floor which were also in the dining room. The cat’s water had been dumped out and there were three towels in the garbage. I asked my sister what had happened (she’s sitting on the couch, on her phone). She says something along the lines of “my son was just playing”. I asked her to clean it up and she said “I’ll do it later”. The thing is, she either never cleans or she does it half assed. So, I texted my mom pictures and basically told her that these messes were made, my sister isn’t cleaning it, and I’m not gonna be the one responsible for it. My mom calls my sister and she immediately starts yelling at me saying, “WHY WOULD YOU TELL MOM MY SONS MAKING A MESS?” “DONT TALK ABOUT MY SON LIKE THAT” I tell her that it’s not her son, I understand he’s a toddler, but she has to be responsible for that. My mom calls me and I go to leave to my room. I noticed my sister following me and out of the corner of my eye I see her threaten to punch me. I turn around and say “girl don’t even” then she punches me in the face and we tackle each other to the ground. My mom was on the phone the whole time and was telling her to get out of the house. She wouldn’t leave and kept arguing with me saying stuff about how nobody helps her and she will never talk to us again but the thing is, she has lived in three people’s houses rent free, including ours. She asks everybody for money and they send her money. Our family has helped her so much and she is so ungrateful and entitled. My mom gets home from work and tells her that she needs to get a hotel for a few days before they can come back and have a conversation about this all. \n\nThree days pass and it was the most relaxing three days of my life. I deep cleaned the house and discovered how much damage she has caused to our house (holes in the wall, paint splattered on everything, just everything being nasty). \n\nThe day has come that they come back. My sister has to work so she drops off her fiancé and their son first. I talk to her about everything and we seem to be on the same page, she witnessed my sister hit me and argue with me. Time passes and everyone is home now. We tried to talk but my sister wasn’t engaging and was just staring off into space. At this point, no one is mad anymore we just want to work through this bump in the road, but my sister, oh no she was pissed. She denied everything and acted like she didn’t do anything wrong and kept asking for proof of everything that we talked to her about even though everyone knows what happened. She leaves and goes to their room. \n\nI leave and go to my room but I can hear my sister talking to her fiancé about everything through the wall and she acted like she had no clue about anything. She said she didn’t see my sister punch me and was just telling my sister what she wanted to hear. This pisses me off so I tell my mom what’s going on and we go to their room to stop the twisting of the story. My sister had nothing but hateful things to say to me, but what really got me was that she said I never have her back when I say I do. I really have had her back so many times there are so many things that I have never told another soul because she asked me to. I tell her that and she’s still denying and lying. I figured that the only way I can prove to her that I in fact did have her back and to get it through to her that she needs to stop lying and be accountable for her actions, was to tell her darkest secrets. I started tame and told my mom the reasoning why my sister got jumped a few years back. My sister acts oblivious. I as her if she wants me to keep going. She says she doesn’t care, so I tell her fiancé about how she cheated on her with a man less that a year ago. Of course she denies it but I had proof. I pull up text messages of her describing everything when it happened and she still tried to deny it. \n\nShe and her fiancé start arguing which causes my sister to run away. She would do this all the time growing up, if she got caught doing something bad, she would run away but she would come back an hour later, but keep in mind this is a 23 year old adult were talking about. We found her sitting on the street talking to a random man and we bring her back home. She keeps threatening to off herself, which is another tactic she used as kids. \n\nAt home, she starts arguing with my mom and I, saying that everyone hates her and that I ruined her life and I only said that out of spite. I told her exactly why I did it but she’s not having it because when she makes up a story in her head, she will stick to it. \n\nMe and her fiancé go to the gas station to blow off some steam and we talked the whole time. She talked about how my sister would try to do “nasty stuff” to her but she didn’t want to because she had a gut feeling that she was cheating and she was right. She also said that when she didn’t want to do anything, my sister would try to force herself into her. Her saying this triggered my memory of the SA that happened when I was a kid. I told her about it and she said she believed me. \n\nWe get home and I figured I should probably tell my mom about the SA. I had hidden this from everyone because my sister always threatened me and by the time she was no longer a threat to me, I had blocked out that memory. This whole situation just resurfaced everything. My mom was horrified and at this point no one knows what to do but my sister needs to get out of the house. She has no one to go to because she ruined everyone’s trust. She has no money because she can’t save for shit. We decide to sleep on it because at this point it’s like 1 am. \n\nI couldn’t sleep for the life of me but the next day, this all continues. The fiancé repeated everything I told her to my sister and of course she is denying everything and calling me a liar who is just out to get her. Not only that, but her fiancé is denying everything that she told me, such as my sister forcing herself onto her. Their stories for everything keep changing but mine has stayed the same for everyone. \n\nAll day my sister was talking shit about me. It’s so bad that I can’t even be in my own room because I can hear them talking through the wall. As of now, I’m sleeping on the floor in my mom’s room. If I’m not in the same room as my mom, they will talk shit to her. Despite all of this, my mom believes me and my one story, along with all of the proof I have. I haven’t been this enraged since I lived with my sister as a kid. It feels like I’m living with squatters from the worst roommate show. I have zero privacy and I can’t breathe without someone making something up about me. \n\nI don’t know what to do, this is still going on as of right now. I’m currently on spring break so we have time to deal with this but we don’t know how and if they’re still here by the time I go back to school I will go insane. I have no where to go to because all my family lives in another state. I can’t live like this. There’s a lot of details I missed but it’s just too much and my brain is scrambled. If anyone has any advice, please help. ",
    "subreddit": "TrueOffMyChest",
    "title": "Living with my abusive sister",
    "upvote_ratio": 0.81,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7ybiz/living_with_my_abusive_sister/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 13:13:57 UTC",
    "id": "1j7yb06",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 3,
    "secure_media": null,
    "selftext": "I think ive been cursed. I moved to a new place 4 months ago hoping for a fresh start, away from family and my old life. I had,what i had hoped, was a solid job offer that might turn my life around.\n\nNow 4 months in,its such a huge lie. I live in a tiny space with a roommate, because company housing and all that jazz. I dont even have a closet to my name. We share a room and bed so tiny I'm scared im gonna fall off of it. There's no privacy, i work almost 70 hours a week, i barely manage to make friends and my coworkers are pieces of shits.\n\n The people here hate women so much that they make random complaints about them. I got called to my boss' office because apparently they heard fighting from my cabin,WHEN I DON'T EVEN TALK TO ANYONE!. The manager of the hotel i live in apparently complained that i screamed at the housekeeping, newsflash,i stay awake for 3 hours after work and dont even stay home for the weekends. They just straight up lied and for what? I cannot wrap my head around any possible reason why they would do it.\n\n I stay out of everyone's way and yet trouble finds me. I went to a concert back in January with a guy who i thought  could be my friend, but he turned out to be a jerk when i got drunk and he tried to take advantage of me. Then i decided I would go to concerts alone,and i got a can of coke thrown at my head. Fun times y'all.\n\nHow does it feel for someone to be tested at every moment of every day like this. For no reason. I live in such a dump there's 0 privacy. I work for so long hours that i barely even have the energy to stay awakeet alone pick fights with housekeeping (wtf).\n\n I feel like such an idiot because this is the best job i could get right out of college, i can't afford to take a break and go find  something better. Every move we make is guarded and recorded here, i can't even bring a guy around to my place because one,its apparently not allowed, and two, who brings a guy to a shared accommodation? I feel like im 14 and living with my parents.  Everyday my will to live is chipped away, i am constantly stressed. And now the cherry on top in someone's making up stories about me. How do you defend yourself from incidents that never happened?\n\nI know its such a rant but truth be told i regret waking up everyday . I hate seeing the people around me,i hate living with constant fear of what might go wrong, who i might accidentally offend by existing. At this point i keep myself alive as a social experiment, to see how much a person can take.",
    "subreddit": "TrueOffMyChest",
    "title": "I think I've somehow been cursed",
    "upvote_ratio": 0.72,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7yb06/i_think_ive_somehow_been_cursed/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 13:13:52 UTC",
    "id": "1j7yaxt",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "When I was no older than 7, my family and I used to go eat at this place quite frequently. It was relatively cheap and food was decent. \n\nWe lived in a city with quite some homeless people and oftentimes a few of them were hanging around waiting for money. \n\nAnyway, this one time we were eating and started hearing this commotion. We went to check what was up and it was a homeless guy being quite upset at the counter. \n\nHe had saved up some money to buy himself a meal, but was a few euros short and staff had thrown out the food he was going to buy. (It was a buffet style diner). He was so upset and I felt so bad, I asked my parents to get him a new plate. We didn't have a lot of money, but my parents still agreed. \n\nMy mother and I went back and told the staff we would buy him a new plate. \nTurns out, it had been the last portion of that specific dish and they had just thrown it out. So, of course, he became very upset again. \n\nIn the end, we bought him another meal and he thanked us profusely. We didn't sit with him though, which I hope we had. My father didn't speak the language and my mother is deaf, so it probably would've been very awkward anyway. \n\nAnyway, it's not a sensational story. I just sometimes get reminded of it and then get upset for a few minutes. I really wish we'd sat with him. He was probably in need of some company and just someone to talk to. \n\nHe had saved up for probably days to get this one dish he really wanted and he never got it. \n\nI hope he was able to get out of that situation and eat that dish another time. ",
    "subreddit": "TrueOffMyChest",
    "title": "Just an old memory I wanted to share",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7yaxt/just_an_old_memory_i_wanted_to_share/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 13:12:21 UTC",
    "id": "1j7y9vs",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "\nMaybe you were young. Maybe you didn’t know better. Maybe no one told you that some lines should never be crossed.\n\nBut what about now?! Are you still a minor?! Do you still believe that being younger at the time means you were automatically forgiven?!\n\nLet me be clear..No, you are not forgiven\n\n\nWhen I was 17, my 15-year-old cousin tried to touch me while I was sleeping. His mom knew. He got yelled at.\n\nEveryone else moved on. I didn't. I still remember that day, how scared he made me. Every detail. My aunt never talks about it. I tried to forget but I can't.\n\nI realized, I won't be okay until he says sorry. To my face. He needs to say, \"What I did was wrong. I'm ashamed. I think about it every day. How could I do that to my own sister?!\"\n\nWatching him laugh and carry on like nothing ever happened.. it infuriates me. I don’t want him to suffer but he doesn’t get to erase the past, not when he’s grown and fully aware of what he did. The worst part?! He even speaks about morality, about respecting women, as if he’s never betrayed those very principles.\n\nAnd I know I’m not alone in this. Many of you haven’t forgotten either. It’s a nightmare..\n\nSeeing him makes me sick. His words are like a joke. I want to scream, to tell everyone the truth about what he did. Because of him, I’m still afraid of men. I flinch at even the gentlest touch, even from friends. I sleep alone. I can’t bring myself to say yes to a date, no matter how kind the guy is.. because deep down, I know I have nothing left to give.\n\nI don’t feel normal anymore.\n\nI’m exhausted by the questions…\n\"Why do you only have female friends?!\"\n\"Why do you act so distant around men?!\"\n\"Do you hate them?!\"\n\"Are you a lesbian?!\"\n\nMaybe I am. But even if I were, it would still be better than living in fear of men.\n\nI want to confront him, to demand answers.. but I hesitate. He’s still family. Maybe he wants to forget, maybe he carries his own guilt and yet, a part of me wonders… what if speaking up hurts him?!\n\nSo, I ask this now.. to every brother who has made his sister’s life a living hell…\n\nDo you truly regret what you did?!\nAre you ashamed?!\nHave you ever wanted to face your sister and ask for her forgiveness?!\nDo you even seek to be forgiven?!\nIs the person you are today real, or just a mask you wear?!\nIf your sister confronted you, how would you respond?! How would it make you feel?!\nDo you, like us, carry this weight and long to set it down?!\n\nI just want to know.. how do you all feel after everything?!\n\nBecause I feel devastated. Even after all these years, I still can’t forget.\n\nI wonder, is there even a single man in this world who has sincerely apologized for this?! Who has taken responsibility, helped his sister heal and given her a chance to live a normal life again?!\n\nI want to believe that no one is beyond change, that people can choose to be better if they truly try.\n\nIs that too much to hope for?!\n\n(If any of this resonates with you, then please.. apologize to your sisters. Understand that we still carry this weight.. even when we smiled, even when we pretended to have moved on for the sake of the family...)",
    "subreddit": "TrueOffMyChest",
    "title": "To every brother who crossed the line, who took advantage.. I have a question for you.",
    "upvote_ratio": 0.42,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7y9vs/to_every_brother_who_crossed_the_line_who_took/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 13:11:51 UTC",
    "id": "1j7y9is",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "I graduated university 2023 with a 2:1. I have worked in retail/hospitality since I was 18. I’ve struggled for years with severe mental health issues. I finally got better and wanted to start my career about August 2024. I started volunteering and applying to jobs. My mum passed away 2 months ago. \nI have so much time, and I should be grieving, but I feel this immense pressure to get a good career and prove to myself my life is worthwhile. Nobody pressures me except myself. My mum never cared, as long as I was happy. Same with my partner, my friends. But I have put so much of my value into what my career is. I feel ashamed to work in hospitality and I don’t know where it’s came from. I’m going insane thinking about how I’m wasting my time every day that passes. I’m scared that when I do get a new job, it won’t fulfil my needs to be ‘successful’. Maybe it’s because im in my mid 20s and I just have no idea what the fuck I’m doing. I guess I just needed to rant. \n\nThank you ",
    "subreddit": "TrueOffMyChest",
    "title": "My value is in my career and it’s driving me insane.",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7y9is/my_value_is_in_my_career_and_its_driving_me_insane/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 13:08:19 UTC",
    "id": "1j7y6y5",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 7,
    "secure_media": null,
    "selftext": "So I (25m) had been close friends with my ex (25f) about 10 years since early high school. We just hit it off, we were different people but we just understood each other and got along really well. \n\nNot long after high school, we realised we had feelings for each other and that we wanted more than friends, and we decided to give it a try. We dated for about 6 months and it just felt natural, probably since we had been close for a long time. \n\nShe is a strongly religious individual, as is her family, and that was never an issue for me, and she had assured me that although I wasn’t as religious (I’m a raised Catholic but not to the extent), this wasn’t a dealbreaker. It was part of our friendship to tease each other about our levels of faith.\n\nThat is until she broke up with me via phone call whilst I was visiting family, saying that she needed someone who could share her religious beliefs with. Naturally I was heartbroken and when I returned home, we spoke and she reaffirmed this further. We broke up and that was that.\n\nAcross the next 3 years I learned to move on, initially my mental and emotional state was rough but I learned to improve myself. I could say proudly that I wasn’t the wreck I was afterwards.\n\nI found out about 6 months ago that she was dating someone else and had been for about a year (small town, everyone knows everything). At the time I was really happy for her (despite everything, she was still my friend for a big chunk of my life) and I ended up messaging her and telling her that. \n\nThat is until earlier tonight, while stalking on Facebook I saw that she had gotten engaged to this guy, and all I felt was sadness and jealousy, like someone had turned back the clock 3 years on my emotions, feeling like rubbish that it wasn’t me with her still.\n\nImmediately after that I felt so guilty, like a horrible human being for feeling this way. I have no right to, we both moved on with our lives. I don’t even want to message her again, let alone want to be with her again.\n\nI’m just so disappointed in myself that all the hard work I had done across 3 years has gone down the drain\n",
    "subreddit": "TrueOffMyChest",
    "title": "My Ex got engaged, I’m upset about it and I feel horrible for being so",
    "upvote_ratio": 0.69,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7y6y5/my_ex_got_engaged_im_upset_about_it_and_i_feel/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 12:55:30 UTC",
    "id": "1j7xxzs",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 2,
    "secure_media": null,
    "selftext": "I (F26) constantly feel guilty about eating anything. I count every single calorie, and honestly, it's exhausting.\n\nI’m from a Southeast Asian country where most of my peers are naturally small and skinny. Even if they eat a lot, they either don’t gain weight like I do or lose it effortlessly. At 5’8” and 150 lbs, I don’t think I’m that heavy. Yes, I’m on the heavier side compared to the people around me, but I carry most of my weight in my chest, which only makes me look even “fuller.” On top of that, I’m considered tall for a woman here, so I always feel like a \"giant.\"\n\nPeople,friends, strangers, family freely comment on my height and weight, and not in a good way. My family, especially, constantly gives me unsolicited diet advice, tells me I’ve eaten enough, and makes jokes about my body. But the worst part is my mom. She’s obsessed with having a \"perfect-looking\" daughter, and to her, that just means being pretty and skinny. My academic achievements, my promising career—none of it matters. To them, I’m just \"the fat one.\"\n\nBecause of this, I’m always forcing myself to choose the “healthier” option, trying to burn off every calorie I consume. I religiously log everything into MyFitnessPal and limit myself to 1,000–1,500 calories a day, on top of working out. But no matter how much I restrict myself, my weight won’t drop anymore. It’s frustrating. I just want my mind to quiet down so I can enjoy a meal, but I feel like I’m not even enjoying my life anymore. People still see me as the \"giant\" friend or the \"oversized\" girl in the family, and no matter what I do, the comments never stop. If I ever defend myself, I get dismissed as being “salty because I’m fat.”\n\nI love food. I love cooking and baking. But I’ve realized that I’ve been trapped in this toxic cycle of diet culture for almost **13 years**. And after all this time, people still won’t stop commenting on my body. It’s made me start hating the things I once loved. I hate my reflection. I hate the small portions I force myself to eat just to fuel my body. And sometimes, when the guilt gets too overwhelming, I purge—not even after binge eating, just after a regular meal. I’ve even told my mom about it when she criticizes my weight, but she just stares at me and says I must be lying because I’m “not losing any weight.”\n\ni tried brushing everything off and thinking as long as i'm eating healthy and my body is healthy then it's okay but this is every single day, and some days it gets to me...and is mentally stuck in there.\n\nI don’t know what to do anymore. This is mentally draining, and I just feel stuck. If you have any thoughts and or advice, I’d appreciate hearing them.",
    "subreddit": "TrueOffMyChest",
    "title": "I feel guilty eating anything",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7xxzs/i_feel_guilty_eating_anything/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 12:49:57 UTC",
    "id": "1j7xuap",
    "link_flair_text": null,
    "media": null,
    "num_comments": 248,
    "score": 5522,
    "secure_media": null,
    "selftext": "Tl dr; My marriage isn’t over, but I don’t think it will ever be the same. \n\nFirst, thank you to everyone that replied and messaged. I read every single one. I appreciated the hopeful comments and identified with the harsh ones. I’m no angel in this story. \n\nSo some extra info - my husband has a very high intensity job, and travels frequently. I took over the bills so nothing would get lost in the shuffle when he was away from home and he could focus on what he needed to focus on. (Insert joke here, right). \n\nI wad a complete wreck last week. I barely slept, was physically anxious, and was both absolutely dreading Friday but also couldn’t wait for it to just get here already. Fortunately my husband was on a work trip and my kids were busy with basketball, friends, theatre, etc and were barely home. I barely ate and lost like 3 lbs that I’ve been stuck on. Not recommended for a diet plan. \n\nFriday we planned to each work a half day then have some lunch and look at our budget for the year. Tax returns were pretty decent and my husband got a good annual bonus, so it made sense to see what was what. He was already talking about throwing some in a CD or investment and I just felt ill. \n\nFriday comes and he comes home with In’n’Out and a chocolate shake for me and I just … lost it. Full on sobbing. It freaked the hell out of him, and took me like ten minutes to get myself under control. Then I spilled it all. I started with “I love you and I’m sorry” and just let fly. That wasn’t my plan, I had a whole thing written down to make sure I didn’t miss anything and it didn’t matter at all. \n\nTo his incredible credit he just sat there in shock and listened. Then he definitely under-reacted and went directly to “we’ll fix it together” mode. He wanted some time to absorb what I’d said and then wanted to work through our accounts one by one to see what was actually up, and he wanted to do this alone, then we’d come up with a plan. \n\nI let him be and just did some cleaning and laundry. After maybe 45 minutes I heard him leave the house with a door slam. I wasn’t about to chase him down after he asked for space to process. I did look at the computer and it was a list of all our outstanding balances. \n\nTo everyone guessing figures, here you go:\n\nI assumed it would be 60k based on my rough math, but I had forgotten a couple I had on autopay. \n\n$96,000 in debt that he had no idea about. \n\nHe messaged me a while later that he was going to stay by his mom for the night and would be back to pack a bag, and that he would rather not talk yet. I respected that and made myself scarce. \n\nHe came home the next day and we manufactured some time alone to talk by sending the kids out to run errands. The oldest can drive and loves any excuse. \n\nThe heart to heart was basically this - I fucked up royally here, but he shouldn’t have checked out completely and let it get to this point. He is going to take over our finances. We’re going to do a HELOC or second mortgage for all the recurring stuff and buckle down HARD. We will review everything together at least twice a month. We will do marriage counseling together. \n\nI agreed to absolutely every term and condition. I honestly thought he wasn’t going to come back. Things are chilly at best right now, and I am so desperately sorry and sick over the hurt I caused. At the same time there is a deep sense of relief that, whatever happens, I’m no longer lying about it and everything is out in the open. \n\nMaybe he’ll still decide that he can’t move on, but I’m going to own whatever happens. \n\n",
    "subreddit": "TrueOffMyChest",
    "title": "UPDATE: In five days I’m coming clean - and it will probably end my marriage",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7xuap/update_in_five_days_im_coming_clean_and_it_will/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 12:43:04 UTC",
    "id": "1j7xplq",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "I grew up with my mother, who was a single parent. She had chosen to leave my father due to his alcohol and pill addiction. Shortly before I was born, she was granted disability pension because she was born with a spinal defect that made her physically disabled. In addition, she had repeatedly been to the psychiatric emergency room in the 1970s, likely due to being placed in foster care as she was born out of wedlock.\n\nToday, I know that I had undiagnosed ADHD that hindered my schooling, but this was not noticed by either the school or child and adolescent psychiatry. Despite having countless interactions with the school, child psychiatry, and social services to find a sustainable way for my mother and me to live together without harming each other. (Today, I have met social workers who are surprised that I placed myself in foster care when they hear what I went through as a child, and they say that things would have been handled differently today...)\n\nAfter struggling hard in elementary school to get into the high school program I wanted, my life was turned upside down when I found out that my father was sober (and had been for a few years) and that he hoped word would reach me that he wanted to contact me. So, just as I was about to start high school, I suddenly had a father again, and we were to try to establish a relationship despite barely having seen each other since I was two years old. At the same time as I was getting to know my father, it became untenable for me to continue living at home with my mother, and together with social services, my move away from home (with the help of social services) was being prepared at the age of 17. Shortly after the decision had been made, and I had moved in with my girlfriend and her family in a state of panic, my first major setback arrived.\n\nMy father passed away in his home, and I had to take care of going through and packing up his home (as well as his workplace), while also having my room at my mother's and the half of the household goods she had saved for me during my upbringing, so that I would have something resembling a home when I moved out. My uncle took care of my father's hunting weapons and his car, but the rest was left for 17-year-old me to handle, contacting private individuals and authorities, and announcing his passing. Not to mention the feat of improvising a funeral without any idea of what my father's taste or preferences were and any wishes he might have had for the ceremony. I still remember that I actually had a fever at his funeral.\n\nWe fast forward a few years to when I surprised my mother (our relationship improved immediately once I moved out) by taking her to be in the audience of her favorite TV show. That's when an idea was born in my head: TV/film, that's what I want to do! I came home and started researching how to get into the industry and saw that there were some educational programs I could apply for. But to get into these, I first needed to complete my high school studies. So I did, and then I applied to various programs until, after 2-3 years, I finally got into one.\n\nThe problem with the program was that it was over 200 km (roughly 125 miles) from my hometown, and I prepared to move to the location by myself to start my studies. But it turned out that my partner chose to join me in the move. Meanwhile, my mother had gradually worsened, and at that time, it was nice to get away from her gradual decline. Her memory was getting worse and worse. The program I had been accepted into was a two-year program, with the first year focusing on theory and most of the second year dedicated to practical training. But before we were to go out on internships, we had a short film to complete first. On the second to last day of filming our short film, my second major setback arrived (and at that time, I didn't know it would last for a long time).\n\nDuring filming, one of our actors collapsed and passed away during the ambulance ride to the hospital. I was responsible for the sound during filming and had four different microphones running, which captured the sounds the person made before they fell to the floor and we rushed to begin CPR while waiting for the ambulance. By some miracle and some trick filming, we managed to finish filming and could focus on the internship period.\n\nThe problem was that 90% of media production takes place in the capital, so a move to an already overcrowded city was the next step. After much searching, I found a place to live, or so I thought. It turned out to be a scam, and when I confronted the person and said I didn't want a lot of things ordered in my name, I was threatened with murder (the continuation of earlier mentioned setback).\n\nI managed to shake it off and made it to the capital and started my internships. But when things were running smoothly and the engine was at its hottest, the setbacks decided to hit hard.\n\nAs an unpaid intern trying to break into the industry, it was natural to say yes to everything, to be the one who fixed everything. Especially if you had gotten an internship at the same production where I had previously taken my mother. After a few weeks, the situation (saying yes to all and everything and at the same time having an undiagnosed ND-disorder) became untenable, and the supervisors chose to terminate my internship. I became so unwell that I sought help at the psychiatric emergency room, where they determined that I was burned out from what had happened. I then chose to move back to my partner to lick my wounds and recover. But barely a week passed before my sister called and informed me that my mother had collapsed and been taken by ambulance to the intensive care unit. Because her medication, including blood thinners, had been discontinued, she suffered multiple blood clots, which ultimately led to her death.\n\nWhile we were at the hospital and watching over her, knowing that she didn't have much time left, my partner chose to declare that 11 years together was enough and that she didn't think she could or wanted to continue. This was said when we were only a few meters from my dying mother. Once my mother passed away, it was almost Christmas, and we rushed to arrange a funeral to get it done before the year ended. At the same time, a process began to divide our 11-year life together.\n\nI started looking for a new place to live, and six months after my mother passed away, I moved, and a year of rehabilitation and sick leave to recover began. When I slowly started to feel ready again, I got a media job in the new location and began to feel that I could spread my wings again and actually aim for the capital again. So I did. I got a long-term temporary position, and there I was informed that even though it was a temporary position, it was for a function that was needed Monday to Friday, day in and day out, as long as the channel was broadcasting. This temporary position and this \"promise\" came five months before reports started coming in about people getting sick in China with symptoms like persistent cough and high fever. Eight months after I had started the temporary position, my service was terminated in favor of the permanent employees in the company.\n\nAfter arguing with the authorities to get my unemployment benefits (which felt like half the country was doing at the same time), I found an ad for a position 220 km (ca. 137 miles) north of the capital, and I packed up my belongings and left. I took a chance and hoped it would work out this time. I arrived and managed to work through the probationary period before COVID-19 hit with a new wave of illnesses, and people were afraid to hire permanently, which resulted in me being unemployed again, now in a much smaller location.\n\nNow, misfortune also began to take a toll on my finances, and I needed to take my first loan. A few more months passed, and a new opportunity opened up at the company I had worked for before the pandemic, but this time 490 km (ca. 305 miles) south. Again, I packed up my life and moved south. This time, everything felt good. I felt satisfied, and my new boss and team were happy with me. But then came the date when my probationary period was to turn into permanent employment. My boss checked with my colleagues and found that they were happy with me, but that I sometimes \"disappeared\" when I finished my tasks, and that I sometimes had difficulty reading social situations. This became the basis for their decision not to continue my employment, and the same thing happened again! (Later, it was determined that I have ADHD-I, and that the boss's decision was therefore discrimination based on disability.)\n\nLife repeat it self and I moved again and this time, it was a move of 200 km (ca. 125 miles), and to make that move even possible (and to cover previous expenses), I had to take a loan of approximately 20,000 USD (or about 18,000 EUR). Once there, I got a job where I stayed for two years before I realized there was no room for me evolving and I had to make the choice to go back to school (this time focusing on IT/networks/servers). This time, I had just turned 36 when I started studying again, and I was the second oldest in the class and felt like a fossil compared to my classmates. However, this time I had worked and pushed through an NPF (Neuropsychiatric Disability) assessment and now have a diagnosis of ADHD (inattentive version), and I know that with that, I have the right to help in my daily life, both in school/work and privately.\n\nToday, the debt is down to about 15,000 USD (or about 13,500 EUR), and I see a glimmer of light on the horizon. But at the same time, I know what it has cost me to get here, and that it will take time to reach the metaphorical tunnel. But I also feel an immense frustration that \"no one\" has taken the responsibility they should have.\n\nI know very well that I can't do anything about the situation today, but despite that, I can't help but retrospectively grieve that my ADHD was not discovered and diagnosed earlier. Who knows? Then I might have completed my high school studies and gotten into higher education earlier, and actually had a few years in the job market and stayed in the boat when the metaphorical waves came. Sure, I would have certainly gotten soaked and at times felt close to going overboard, but I wouldn't have fallen into the water like a mitten at the slightest ripple of waves, as I did in reality.\n\nSo, besides feeling deprived of \"everything\" that people usually do in their twenties, like traveling, working as an au pair, and partying, I haven't had the opportunity to experience all of that. And now I've met a partner who has already done everything they want to do as a \"young adult\" and who is well established in the job market and who, shortly after we met, was able to buy their first apartment. And here I stand, feeling stupid, unfinished, and \"late to the game\" in general when it comes to life. Add to that that my partner wants to start a family soon, and I who had hoped that after my education I would hopefully get a job and then do a forty-year-old's version of what I missed in my twenties – no, then I'll instead “have” to start a family, and instead of spending money on vinyl records I now may have to focus on buy teething toys and baby bottles, and instead of planning and comparing trips, I'll instead sit and compare preschools, and then when one is found, start planning for the enrollment of the child. It feels like I'm being deprived of life, and part of me feels incredibly selfish, while the other sees it more evolutionary and I realize that I have it better than, for example, a praying mantis male, who, if he's not in the game, dies after reproduction is completed. The question is just exactly how big the difference is?",
    "subreddit": "TrueOffMyChest",
    "title": "When Life Gives You Lemons, You Get a Mountain of Debt and a Late Diagnosis",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7xplq/when_life_gives_you_lemons_you_get_a_mountain_of/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 12:40:11 UTC",
    "id": "1j7xnq4",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 16,
    "secure_media": null,
    "selftext": "Because atleast being alone isn’t so damn painful. Because i always end up attaching myself to people way too easily and falling for them. I don’t want the pain of being in love with someone i can’t fucking have. I don’t want to overthink every damn thing. I don’t want to make up bullshit fantasies in my head. I don’t want limerence. I don’t want any of this bullshit. I don’t want any of this fucking pain. It’s hurts so bad. ",
    "subreddit": "TrueOffMyChest",
    "title": "being alone is better.",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7xnq4/being_alone_is_better/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 12:39:58 UTC",
    "id": "1j7xnjs",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "For months now I've been hanging out daily with 2 people (all of us are adults in our 20s). Now I should say its not in person, we hang out on call and play games. I'm not going to say too much just in case but they are everything I look for in someone. Sometimes its just us hanging out and I long for those times, sometimes we scroll on insta or TT, everytime they call me my heart jumps and I get excited, just the thought that they think about me drives me crazy. I've never felt like this before with anyone. They are perfect but i worry that I'll never be what they want, I don't want to hold them back either plus I dont think i fit into what they look for. I hurt so much when i see them because i know I'll never be with them. I plan to take this secret to my grave, I hope I don't have to but thats where I'm at. In a way I hope they see this post cause I know they have reddit but I don't think I'll be that lucky. ",
    "subreddit": "TrueOffMyChest",
    "title": "I really like my friend",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7xnjs/i_really_like_my_friend/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 12:38:44 UTC",
    "id": "1j7xmst",
    "link_flair_text": null,
    "media": null,
    "num_comments": 31,
    "score": 0,
    "secure_media": null,
    "selftext": "There are many things about my body that I hate, I'm not tall, I'm not good looking, but what makes me feel the worst is the size of my penis, not being well endowed is depressing, shameful, humiliating and emasculating to me. I will never be happy with my body, because of my size ",
    "subreddit": "TrueOffMyChest",
    "title": "I'm depressed and suicidal because of how much I hate the size of my penis",
    "upvote_ratio": 0.4,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7xmst/im_depressed_and_suicidal_because_of_how_much_i/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 12:30:55 UTC",
    "id": "1j7xhpa",
    "link_flair_text": "Positive",
    "media": null,
    "num_comments": 5,
    "score": 3,
    "secure_media": null,
    "selftext": "So let me first start this with saying that I have a horrible history of moving way too fast in relationships. I'm very introspective, have ADHD, and have dated enough to actually know what I want. On the flip side I also have an awful history with relationships. I've been cheated on, used and left, and downright just ignored and ghosted on many occasions. I know in some cases it's through *some* fault of my own for moving fast. \n\nAnyways, with my current girlfriend, we're long distance. We met in person for the first time on a weekend trip and found out we have great physical chemistry on said trip. Our trip was two and a half weeks ago and we became official the night we returned to our homes. Before the trip, we had been in the talking phase for around ten days and we have been nothing but compatible the entire time.\n\nWe haven't had even the slightest hint of an argument (not for trying to avoid them we just get along extremely well), she treats me better than literally everyone I've ever been with, and she is the most supportive and understanding woman I have ever had the pleasure of being with. She's scared of us burning out and we have both decided to take it emotionally slow so that we can enjoy ride.\n\nBy the time our next visit happens, it will have been over a month of us being together and I have been thinking about telling her that I love her on the trip but I also still want to wait until *she* also feels sure about me. We've got another trip planned for after this one already and for that one it will be a week (I'm helping her move) so it's not like I don't have the time to let it sit more. \n\nAaaaaaaanyways, thanks for reading this, whoever did actually read it. I just needed to get it out into the universe so I could clear my head",
    "subreddit": "TrueOffMyChest",
    "title": "I think I'm in love with my girlfriend",
    "upvote_ratio": 0.72,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7xhpa/i_think_im_in_love_with_my_girlfriend/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 12:20:58 UTC",
    "id": "1j7xb9i",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 5,
    "secure_media": null,
    "selftext": "Very random, i just dont know who else to tell.\nI'm (f26) pansexual and came out 3 years ago when I made it official with my first girlfriend after one year of flirting awkwardly and a whirlwind friendship\nThe relationship itself was toxic and we didnt last long but through our one official month I came out to my four older siblings and my mum. (Yes in hindsight way too much way too fast)\n\nI'm from a very conservative christian household and it was very hard for my mum to understand and accept this part of me. Even though she only showed it with worry and reassured me without asking that she loves me always, I could feel a difference.\nI felt a disconnect to her the last years and havent really dated again cause i'm a bit scared of her reaction, considering I strongly feel like dating girls or nb folks. (Besides that i put dating on the backburner after the catastrophe with my ex)\nBut this weekend we just had a random conversation about a present I got from a date once and she said \"that man or woman must have really liked you\" It was so casual but I feel an inner peace since she said that. It feels like she tries and starts actively to be more open minded.\nShe is the most wonderful, loving and understanding person and I really hope I can be more honest with her again.\nI really think some things about how she sees the world have changed and I'm so happy right now.\n\n",
    "subreddit": "TrueOffMyChest",
    "title": "Sometimes change shows itself in the little things",
    "upvote_ratio": 0.86,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7xb9i/sometimes_change_shows_itself_in_the_little_things/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 12:20:44 UTC",
    "id": "1j7xb3h",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 0,
    "score": 16,
    "secure_media": null,
    "selftext": "TW: Abuse and SA content\n\nWhen I (20f) was around 7 years old a new girl moved to my school. We ended up being in the same grade and class together. She wasn’t overly talkative or outgoing but she was super sweet and friendly. We ended up getting closer and I found out she had two siblings, one younger and one older and that she just lived with her mom and her mom’s boyfriend. \n\nShe stopped coming to school often after the first year and when she did show up she would hide herself in sweaters even if it was super hot outside. I didn’t really notice anything out of the different because I was a kid but I think the teachers started noticing because they had mentioned it to higher staff and her mom ended up withdrawing them from school.\n\nWhen I was around 10 news came out that the three kids were getting physically and mentally abused by their mother and her boyfriend, there was even accusations of SA towards the one girl I knew from the mothers boyfriend. I remember reading that he had committed murder and was on the run and that he was two provinces away from where he committed the crime. \n\nThey ended up catching on the where he was when he was with my friend’s mom and him and the mom decided to bail and move somewhere far. They left the kids behind and luckily their father caught on and came and got them after years of not seeing them. The poor kids were alone in the house for 2 months before being able to reach out, the kids said they were too scared to leave home even though their mom and her boyfriend were gone. \n\nThis is the shorter end of the story but this happened just over 10 years ago and I think about it every day. I hope she and her siblings are doing well. ",
    "subreddit": "TrueOffMyChest",
    "title": "I went to school with a little girl who was abused and I think about her every day.",
    "upvote_ratio": 0.92,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7xb3h/i_went_to_school_with_a_little_girl_who_was/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 11:50:19 UTC",
    "id": "1j7ws5d",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I genuinely believe I’m in some kind of a show or some shit like that where I get fucked over and over again, I’ve had this thought for as long as I can remember and obviously I know it’s not truth but everything seems to perfectly placed to screw me in some ironic or metaphorical way that I can’t accept this is all coincidental, either god hates me, an entity or some shit is constantly plotting against my back or it’s just karma.\n\nI want to live, I really do but it seems like I was cursed or some shit, everything backfires against me and I’m not exaggerating, you might think this is  ridiculous but I’ve been writing in a diary everyday and when reading it back it just seems like everyday got some wacky shit that rolls me over, a few days ago I got the police called on me because I sold something on vinted and the distributor lost the parcel, result? I didn’t get neither the money, nor the parcel, nor any kind of compensation, while this was the worst thing to happen to me this last month this type of shit happens daily, I just can’t handle it, it’s not even like I focus only on the shit parts of my life I try to stay positive but I just can’t when everything is ass, because it’s very rare to something good happen to me, the last good thing wrote on my diary was when I got a refund for something I wasn’t expecting them to give me refund and many people giving me “happy birthday” when I wasn’t expecting many people to do it, but these things are more than a month ago.\n\nI never had a good long period in my life, either being abused by my parents, heartbroken by my first (and only) love, father “abandoning me”, losing my dog, losing my siblings, having shit grades all the time regardless how hard I try, discovering I got ADHD/autism, bullied, dealing with hairloss as a teen, and now feeling like I’m alone since I lost majority of my friends, I know there are many people who got it worse than me but it still doesn’t neglect my suffering, plus the feeling that this is misery porn and someone is laughing at this shit happening is constant, I really want to enjoy life and live happily but it just seems life doesn’t let me, I know life has ups and downs but my life is just constant downs, many people will say “it will be better” but I’ve told myself that endless times and it’s only gotten worse regardless how hard I try to make it better, I just can’t handle this anymore I feel cornered all my life and even if I can make my life a better one (which I really doubt it) I will still have the mental issues that these experiences gave me, I don’t see no future for me.",
    "subreddit": "TrueOffMyChest",
    "title": "I feel like my life is a written misery porn",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7ws5d/i_feel_like_my_life_is_a_written_misery_porn/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 11:37:09 UTC",
    "id": "1j7wkkr",
    "link_flair_text": null,
    "media": null,
    "num_comments": 16,
    "score": 1,
    "secure_media": null,
    "selftext": "I am a 25 male and have a what was a very good male friend of around 2 years I met at work who gets touchy. I am a pretty muscular/well-built person, and he grabs my ass and pecs often, and when I say no, he makes an upset face and drops his shoulders and pouts. But he keeps doing it even though I am visibly uncomfortable, and I never reciprocate this kind of behavior to him.\n\nIn another instance, we were at a festival, and while under the effects of MDMA he grinded his crotch on me for a couple of seconds. I didn’t pay attention to it at first, but after some months I realized all this makes me extremely uncomfortable and I feel like it is sexual assault. As far as I know he rarely did this to others, and only really me.\n\nI now try to avoid him and his messages, as I feel uncomfortable being around him, and don’t really want to continue being friends. He's somewhat integrated into my current friend group although not much and I'm worried about future plans that might include him, and his girlfriend has always been kind to me and listened to my past trauma and issues, so I feel bad not interacting with her either. Am I valid in my feelings? What should I do?",
    "subreddit": "TrueOffMyChest",
    "title": "Was this assault or am I over reacting?",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7wkkr/was_this_assault_or_am_i_over_reacting/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 11:30:52 UTC",
    "id": "1j7wgza",
    "link_flair_text": null,
    "media": null,
    "num_comments": 12,
    "score": 1,
    "secure_media": null,
    "selftext": "Before I get to it, I wanna say , I do have friends IRL but they're just shallow friends, that I only hang out with for fun, if I tried getting a little deep with them they'll get disgusted, the good friends I'm talking about here are two friends that I made online and they both left for no reason.\n\nThe first one is a girl from another country, that I've met in a game, at first our friendship revolved on Playing together, but with time we became close and she opened up to me about her depression and struggles with life, I also opened up to her and we comforted each other. She invited me to talk on discord, and so on we kept talking about fun stuff and life, after a month she just blocked from everywhere, I still don't know why. I tried contacting her through her friend and she just acted out cold and that's it, I keep thinking about why she did that (could be because I was annoying and message her a lot, could be because I was too depressing for her..)\n\nThe second one is also a girl from another country, and this one I got really close with cause I told her about my experience with the first one, I tried to avoid the mistakes I made with the first one, she invited me to talk on Instagram, we would talk for hours and all night, our conversation would go from laughing to talking about hobbies and life, we would tell stories from our childhood, and.. she also opened up about her problem and tried my BEST to comfort her and it worked, she tried to get me to talk but I just refused, with time and as we got closer I give in and talk and she was soo supportive,  we continue talking for a month with almost the same energy until one day she also blocked me from everywhere, I don't understand I made sure I don't pressure her, I give her the space to want to talk to me, yes I might of messaged more but I made sure she not busy I even end a conversation if I sense that she needs to study. I tried reaching out for her from another account, and she said \"nothing personal don't overthink it\" I asked for a reason but she didn't answer so I just said it was nice knowing you, she said \"me too\",  what have I done wrong, I was supposed to make her a birthday gift and sent it to her because she did the same, but it took both of us time, that can't be the reason I told her I'm still working on it, my only hypothesis is that she didn't like someone being too close with her, she wanted to be alone again and she didn't want to make me feel bad so she just blocked me, she didn't block me from the second account yet, should I send her this thing or not\n\nI don't know if I can get close with people again after this, I feel like just staying alone for the rest of my life.",
    "subreddit": "TrueOffMyChest",
    "title": "Every good friend I make ends up leaving me",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7wgza/every_good_friend_i_make_ends_up_leaving_me/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 11:07:00 UTC",
    "id": "1j7w3u3",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 1,
    "score": 5,
    "secure_media": null,
    "selftext": "I miss my old store and I’d give my left arm to go back to it. I bend over backwards every night to make sure everything is as perfect as possible even when running on a skeleton crew. Moving to a bigger store meant I was supposed to have 3-4 people closing at night, not just two of us. Mid shift doesn’t respect me as a manager, and they half ass everything they do which sets night shift behind so bad that I’m leaving at 2am and not 1:30am like I’m scheduled (and I don’t get overtime, in fact, I will get written up for going into overtime). If it’s not one issue that I’m being yelled at for, it’s another. It’s getting to the point that I can’t eat, can’t shower, can’t enjoy my day before my shift because I know I’m just going to get slammed and the people that are supposed to prep for night shift just don’t give a shit. I ask them to do tasks that they’ve been doing for 2 years and they know it needs done, and they will do it in such a shitty way that I didn’t realize was possible. I dread waking up because I know I can’t just say “ok, OP, only 5 more 8 hour night shifts to go before your 2 days off!” Because it’s draining me. I’ve lost almost 20lbs because of stress and not eating before or during or after work. I can barely afford groceries and I don’t even have the time to go grocery shopping anyway because all of my time goes to that place. I’m hopeless, I’m a shell of a person and I am in so so so much pain. If I could just lay down and stop breathing and give up I would, and it’s all motivated by this job. It’s torture and I can’t do it anymore. ",
    "subreddit": "TrueOffMyChest",
    "title": "I hate my job",
    "upvote_ratio": 0.79,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7w3u3/i_hate_my_job/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 11:06:07 UTC",
    "id": "1j7w3d0",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 6,
    "secure_media": null,
    "selftext": "...and they looked fabulous!\n\nMy wardrobe consists of mostly black. It certainly helps my confidence helping out my figure, yet I have often felt pressured to avoid the color/dark tone when attending weddings as a guest.\n\nI see men in black suits and black dress shirts at weddings all the time. I certainly never wear a black veil, and my fabulous little black cocktail dress with sequence would be completely inappropriate for a funeral, so I'm not sure how it can be interpreted as a code for \"disapproving of the marriage\" espeically for an evening event.\n\nSome recent weddings I have been invited to have been quite expensive to even attend. It is worth it for a good friend, so I definitely also bring a nice gift.\n\nWhen I am obligated to, in addition, buy a new dress to fit a theme as a guest and never wear it again, I often just RSVP no.\n\nJust wanted to get this off my chest. I have heard that many think its an oldfashioned rule. Unfortuantely, I have had opposite results offline.",
    "subreddit": "TrueOffMyChest",
    "title": "A couple of friends wore black to my wedding...",
    "upvote_ratio": 0.76,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7w3d0/a_couple_of_friends_wore_black_to_my_wedding/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 11:05:22 UTC",
    "id": "1j7w2xo",
    "link_flair_text": null,
    "media": null,
    "num_comments": 81,
    "score": 681,
    "secure_media": null,
    "selftext": "I (M25) proposed to my girlfriend (F24) of 2 years. She said no and then confessed she had been cheating on me, including fucking one of my friends earlier that day. I wanna burn their fucking houses down I’m so fucking angry.",
    "subreddit": "TrueOffMyChest",
    "title": "Proposed to my girlfriend",
    "upvote_ratio": 0.98,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7w2xo/proposed_to_my_girlfriend/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 10:58:46 UTC",
    "id": "1j7vz5l",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 8,
    "score": 0,
    "secure_media": null,
    "selftext": "for context, i was in a really toxic and abusive relationship back in 2023. \n\nthat i ended because it was abusive, i felt like a sex doll and then there was the forced “fwb” situations, if i didn’t do it then things wouldn’t be great with my ex (mtf). now a days there’s been no contact for many months \n\nthis is an ex i reported to the police because she sexually assaulted me over a year ago. the police didn’t help and recently been crying about her and missing her a lot.\n\ni don’t know why i miss my ex (who didn’t treat me too well…) , i tried to love and focus myself a lot. tried to distract myself, just a lot that i can’t think from the top of my head now \n\nit’s possibly the loneliness really and been single ever since, possibly because she was the only person who wanted to date me at the time\n\ni just need advice for this to go away\n\n**(please don’t mention therapy/counselling, i don’t want to talk about it and tried it many times)**\n\nedit: i am not a guy",
    "subreddit": "TrueOffMyChest",
    "title": "i am missing my ex badly who has hurt me",
    "upvote_ratio": 0.44,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7vz5l/i_am_missing_my_ex_badly_who_has_hurt_me/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 10:42:58 UTC",
    "id": "1j7vr3j",
    "link_flair_text": "Positive",
    "media": null,
    "num_comments": 128,
    "score": 0,
    "secure_media": null,
    "selftext": "I'm drinking rn. So the past 1-2 months have been pretty good. I met him in early February, we clicked immediately. We fell in love from the first day we met eachother, the night prior to be specifically. I met him on Tinder, he said he is a virgin. I did not expect to.. take it that far with him but we did use a condom to be on the safer side. I kept it safe with him as much as I could. I had been hurt before, with my first and only relationship. He is the total opposite of my ex. He loves me like Gomez loves Morticia.. he loves me like Beast Boy loves Raven. I don't know why I'm here ranting about this, but I took his virginity. Having a hard time to believe it, in this day and age?.. I lost my virginity to my ex when I was 13. I keep thinking back, wishing I saved myself for him. He's my type, everything I look for in a guy. He's more mature than my 30+ year old ex. But yeah, we have been dating since March 8th. He told his family about me from the first day we met. They call me his sweet heart. Total opposites him and I..  he dresses up like a grandpa, and I dress up like a goth with my corset and boobs showing.. idk.. but he is so perfect. I introduced him to my family the first night we met. He's like day, and I'm night. Everyone loves him. He wants to sign a love contract with me.. he keeps making me fall for him more. Idk what I will do if I ever lose him, I can't imagine losing him.. we just clicked from the first moment we met. The looks in his eyes now, how he couldn't hold eye contact with me at first.. he'd always look down, or look away. 🥹 It was so cute, and still is. He calls me Mama and Mommy. He makes me want to be a lover girl again, he makes me want to be vulnerable.. he makes me feel things I've never felt before, he makes me feel something real. That's about it. Thank you for coming to my Ted Talk.",
    "subreddit": "TrueOffMyChest",
    "title": "(Rant) I took my BFs virginity today.",
    "upvote_ratio": 0.48,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7vr3j/rant_i_took_my_bfs_virginity_today/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 10:22:26 UTC",
    "id": "1j7vgpc",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 4,
    "secure_media": null,
    "selftext": "Before any important conversation, I play out every possible scenario in my head. I practice my responses, prepare for different outcomes and make sure I won’t say anything stupid.\n\nThen the actual conversation happens, and I somehow say the worst possible thing**.** Like my brain just deletes the script and hands me random words instead. I don’t know why I do this, but I walk away from so many interactions thinking, *Well, that was embarrassing.*",
    "subreddit": "TrueOffMyChest",
    "title": "I rehearse conversations in my head but still say the dumbest things",
    "upvote_ratio": 0.71,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7vgpc/i_rehearse_conversations_in_my_head_but_still_say/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 10:03:57 UTC",
    "id": "1j7v7kp",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 3,
    "secure_media": null,
    "selftext": "I had a really disturbing dream last night, and I feel like it carries a strong meaning. It was incredibly vivid, and I felt an overwhelming sense of guilt and horror throughout.\n\nThe dream:\n\nI was sleeping in a hammock in the hall of my apartment building in my hometown when an old woman and her friends surrounded me, claiming that she had left her jewelry—one necklace and three rings—on my hammock. While I was still half-asleep, I found the jewelry, but she kept grabbing at me, searching for it. I hid the pieces because I wanted to keep them.\n\nLater, I ended up returning only the necklace, which was worthless, at the building’s front desk, but I kept the rings for myself. This threw me into a huge moral dilemma.\n\nThen, I spent what felt like an eternity waiting for my food delivery. When I finally went to pick it up, I found the delivery guy lying on the ground in a pool of blood, his legs completely crushed. Cars kept driving over him as if he wasn’t even there. There were two other bodies, crushed beyond recognition, one of them a child.\n\nI was with David (my childhood best friend, a doctor) and Sophie (my best friend, one year behind me in med school). David went to help the injured. Meanwhile, Leo (a former friend I used to do reckless things with) appeared, but he only walked beside me. We greeted each other, exchanged glances like we had things to catch up on, but we didn’t actually talk.\n\nAs I walked back to my apartment, still holding the rings in my mouth, I decided to give them to the front desk guy. But when I got there, the usual porter was gone—this one was heavily tattooed, someone I didn’t recognize. Instead of taking the jewelry, he encouraged me to keep the rings and spend all the money on cocaine. He handed the rings back to me.\n\nThen, I got home, and my “family”—but it wasn’t my real family, it was The Sopranos—walked in. Their presence made me feel emboldened to keep the jewelry. I put the rings on my fingers.\n\nBut then the old woman appeared again. This time, she confronted me directly and took the rings from me.\n\nThe entire dream was extremely vivid. I felt a crushing sense of guilt, and the violence of the crushed bodies was horrifying—I could smell the blood and flesh mixed with rain, and I could hear the families crying in the distance.\n\nAt some point—either in this dream or another one—I also remember seeing my father. It was from a time before he was bedridden, before everything went downhill. He died when I was 19 after a 3 year long battle with cancer.\n\n⸻\n\nContext that might be relevant:\n- I’m a last year medical student and a (maybe recovering) polyaddict. I’m like a week totally clean from everything except nicotine (ketamine and weed were the last drugs I used), maybe three weeks clean of a mild to moderate opiate habit. Coke isn’t really my thing but I had a conversation about my addiction with my roommate and can’t stop reflecting about my use ever since.\n\n- David is my childhood best friend, now a doctor.\n\n- Sophie is my best friend, one year behind me in med school.\n\n- Leo was my main companion for reckless behavior, including drugs. For whatever reason he suddenly cut me and another friend off but recently started sending memes like nothing happened. For the first time, I’m considering cutting him off completely.\n\n- I’m currently watching The Sopranos.\n\n\nThis was one of the heaviest dreams I’ve ever had, and I can’t shake the feeling that it means something important.\n\nImmediately after I woke up I felt the urge to register it. I was calm, just felt like an uncomfortable dream, but as soon as I started reading ChatGPT’s output on its meaning I had a legit anxiety attack, I’ve had like 5 LEGIT attacks in my life and this one was textbook. Hyperventilation and a physical urge to cry even though I wasn’t feeling really emotional. \n\nThis hit me hard man. It reeks of psychoanalysis so much it’s comical.",
    "subreddit": "TrueOffMyChest",
    "title": "I had one of the most disturbing dreams of my life",
    "upvote_ratio": 0.72,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7v7kp/i_had_one_of_the_most_disturbing_dreams_of_my_life/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 09:37:13 UTC",
    "id": "1j7uunf",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 23,
    "secure_media": null,
    "selftext": "This is an update to a post I made back in October (it’s the only other post on this account if you want to read that first) I just wanted to thank everyone who responded and helped me realize it wasn't my fault. All the kind words have been incredibly helpful. \n\nIt's been 5 months so buckle up because there's a lot to say. \n\nthis isn't exactly the update I'm sure most of you hoped to get. It's definitely not the one I thought I'd get.\n\nI haven't received justice. I probably never will. \n\nIn my last post I mentioned how I wasn't sure how my employers would react if I were to tell them I was assaulted. Since then, unfortunately, another employee I work for was harassed and after months the harasser was fired. Now I know they'd take it seriously, but the difference is that I don't have proof.\n\nI did kinda end up telling G. He had asked me to work with Z and at first I agreed, but after almost having a panic attack just thinking about being near him, I finally got the courage to say that I didn't want to work with Z. I didn't go into detail, but G changed my schedule so that I wouldn't have to. \n\nA couple of days after everything, I was on instagram and clicked on one of those suggested accounts based on your contacts and stuff. It was his poetry account and he had just posted a poem where he wrote all about me rejecting him and how people should feel bad that I didn't reciprocate his feelings, but he conveniently left out the part where he assaulted me. He committed a crime and then went and wrote poetry about it and posted it for people to read which is crazy (I find this funny now but at the time it wasn't lol) \n\nSome of my memory from that day has come back, but it's still mostly blocked out. It's hard knowing that I might not ever know exactly what happened. Even if I'm not sure I want to. I used up like all of my sick days after we came back for the spring semester because the thought of going back to work with that man made me physically sick. Thankfully, I mainly have only seen him in passing while I'm working. \n\nThis is my last year working as a teacher. I want to make it clear that I'm not quitting because of him. I've been involved with this program for over a decade as both a student and an instructor and I feel like it's time to close this chapter of my life. I fully believe I would have come to this conclusion even if nothing had happened. I'm young and still trying to figure out what I want to do in life. I want to take the opportunity to try out other passions of mine. \n\nI'm currently in the process of opening a theatre company with some friends and hope to have our first production in the fall. This has been a dream of mine for years and I never thought I'd actually get to do it.\n\nHonestly, for a moment I considered stepping away from theatre in all together. It felt like he had tainted the thing I loved most. Theatre was my first love and he ruined it. He took the place where my happiest memories happened and made them bitter.\n\nIn the 5 months it's been since everything happened I've realized that's bullshit. I have spent over a decade building a legacy in that department. I've broken and set records, I've advocated, and I led recruiting. I worked to prove to my community that the program and it's students were more than just some underfunded extracurricular w/ kids who wanted an easy class. I helped prove that they were talented and mattered. The last thing I want is for my kids to think that there's one less person who cares about them because I left quietly or that their passions aren't something worth pursuing because I gave up on mine. \n\nHe took a lot from me that day, but I'm not going to let him have this. The 10 year old that dreamed of doing what I'm doing now deserves better than that. The girl that was trapped in that room when it happened deserves better than that. I deserve better than that. \n\nI've hit the anger stage. I'm normally a very empathetic person and try to justify every bad thing a person does to me (not great ik) but w/ him I just get so angry when I see him and for once I can't think of a single reason why I shouldn't be. Of course it's all justified by the fact that he's starting to lash out in his own way.\n\nA couple of days ago, I was at a competition with my kids and I had my sister come up to me panicking, because while I was helping unload equipment from our trailer, he was talking to the contest manager to get my name removed from the program which meant I couldn't help them. We were down 4 crew members and needed all the help we could get. G had to get after him because wtf? What was the point of that? Later, while I was helping them assemble their set (they have to set up in &lt;7 minutes or get disqualified) he pulls me aside and tells me “just so you know, we can be disqualified and not allowed to compete anymore if you touch anything else. Don’t forget you’re just our assistant.” In a condescending voice.\n\nThis upset me because I've been taking part in this competition for half of my life, I know the rules. I even studied the damn rulebook when I first got hired. I told him \"actually if you look at the program for tomorrow I'm listed as a director and directors are permitted to assist their students with the assembly of the set as long as students put up 70% of it.\" Which is 100% true. He didn't like my answer so I had to drag G away from where he was helping and have him say the same thing I did. He was just wasting our time. It's like he wanted the kids to get disqualified.\n\nI explained that he was listed as just an assistant so I needed him to let me do my job because he didn't even have anything to do with our production other than suddenly showing up the day of contest to yell at the kids and stress them out (he yelled at them for not moving fast enough when unloading the set even though we had arrived early to make sure we could take our time. Like I said everything he does pisses me off for good reason).\n\nI was definitely rude and me pulling rank is annoying but he could at least speak to me like I'm adult deserving of respect rather than treating me like a child who has no idea what they're doing. I don't understand why he wants to punish me and my kids because he doesn't know how to respect boundaries and not cheat on his wife. \n\nI from an area where it's very conservative &amp; religious so It feels like the odds of someone believing me are low, but I did tell my sister. I knew if anyone was going to understand me, it was her. I was there for her when she was assaulted and it's felt like a weight was lifted off of my shoulders having her by my side. I'm hoping to start therapy soon and begin working on how to cope with what's happened.\n\nI don't know what's in store for me in terms of trying to heal and what I'm going to do once I finally quit, but I'm sure it's going to be really hard.",
    "subreddit": "TrueOffMyChest",
    "title": "[UPDATE] My (21F) boss (50M) is in love with me and idk what to do",
    "upvote_ratio": 0.79,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7uunf/update_my_21f_boss_50m_is_in_love_with_me_and_idk/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 09:24:47 UTC",
    "id": "1j7uotb",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 0,
    "secure_media": null,
    "selftext": "I would take advantage of having access to all  the friends that frequented our house. Being really social and popular i was already primed to have my fill. I slept with 25+ during a 2.5 year timeframe. Reflecting back it was almost predatory.  Also feel this is responsible for My ongoing relations with desperate young women that seek men out.",
    "subreddit": "TrueOffMyChest",
    "title": "SISTERS FRIENDS",
    "upvote_ratio": 0.17,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7uotb/sisters_friends/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 09:21:57 UTC",
    "id": "1j7ungd",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 6,
    "secure_media": null,
    "selftext": "Throwaway account for obvious reasons.\n\nThis message has been sitting in my drafts for a really long time. I could never find the courage to actually send it to her. I don't think I can even today. So here I am sending this out in the void, hoping that one day, it reaches her somehow.\n\nAfter checking out her WhatsApp DP for one last time, I finally decided to delete her contact as I prepare myself to let go and move on with my life.\n\nFrom strangers to friends, and now back to strangers... only this time, with bittersweet memories of eachother.\n\n--\n\nHey.\n\nI have been really thinking about everything that happened recently and I honestly don't think I can continue like this anymore. I know we already discussed this before but I hadn't fully processed my emotions at that time. I really care about you a lot and love you beyond words can express but this one-sided attachment is going to take a huge emotional toll on me. I also really hated your nonchalant behavior that day and the way you were acting so cold towards me and pushing me away like you suddenly decided your feelings have changed and we can't fit into each other's lives, whereas just a few days back, you were telling me how you would wrap yourself around me and wouldn't let me leave the bed and all, like all such moments meant absolutely nothing to you.\n\nSomething which I never told you, last year, on 31st, I was so f***ed up by everything that had happened between us in those last few days that I just kept drinking… and drinking… until I finally lost consciousness right there in the club. My friends had to literally put me in a wheelchair and take me back to the hotel room. At times, they couldn’t even feel my pulse, and for a moment, everyone thought I was a goner. The only thing I remember before passing out is wanting to talk to you on call because I just wanted to hear your voice one last time. I truly believe God gave me this second chance at life for a reason and I am going to make the most out of it.\n\nWith everything going on, especially with you moving to UK this year, we would be emotionally distanced even further and eventually things are going to fade away and we both know it. It is the start of a new chapter in your life soon and for me too, as I will have to learn to live without you. Our lives are just pulling us in different directions at this point. You were right. We have very different personalities, backgrounds, values and our future goals don't align either. That is a gap which is difficult to bridge.\n\nI really respect your feelings and boundaries and I have finally come to accept the unfortunate reality that things have changed between us now. I don't want either of us to continue holding on to something half-heartedly. I truly believe that destiny brought us together and meeting you was a part of my journey. I am really grateful to you because I never knew I was capable of loving someone so much and that too without expectations until I met you. What we shared was real and meaningful and I will always cherish those memories. After all, we shared a bond that has lasted for almost a decade without ever physically meeting each other.\n\nBut despite all this, things never really took off, which is why I think maybe we were never actually meant to be together but only to be a part of each other's journeys. I will really miss you, Janhavi. I will miss our chats and vc and how I was always able to be myself around you. I will miss waiting for your text for days and months every time we had a fight, how my day used to light up after seeing your text first thing in the morning, how my heart used to melt after hearing your sweet voice, how I used to play your voice notes again and again every time I missed you, how I struggled to keep up because you talk so fast, how I used to secretly steal glances at you when we were on vc, how my heart used to skip a beat after randomly receiving your text in the middle of the night, how I used to play my favorite songs to you on Spotify to convey my deeper feelings, how you used to always come back to me after every fight and we would start talking again like nothing happened, how you used to secretly install Kik on your mom's phone every night to chat with me and I used to stay awake waiting for you sometimes even till morning, how you made chocolates on my birthday and then ate them yourself on vc, how we used to send each other those \"disaster selfies\", how you used to fall asleep on vc while talking and I used to continue admiring you sleeping, how Sab Tera is still my favorite song even today because it was the one you sang to me, how we had Maggi at 3 AM on vc and you made fun of me for having a cupcake with it, and so many more such cute memories that I can't even possibly list them all here but these memories will always be a part of me and I will carry them with me forever. It was pure, innocent love at its best.\n\nMy life somehow always felt complete with you and stupid me always believed you were the one and that you were my soulmate and that one day I would definitely marry you. It's funny because I can't even tell you how many times I have rehearsed this whole scene in my head about how I would propose you. But I was wrong. In the end it was all in my head and you already had someone else in your life all these years. I don't blame you though and neither do I hold any grudge against you because of it. You will always be a huge part of my life regardless and someone who helped me understand love much more deeply and helped me grow as a person. I will always be thankful to you for that. I only regret that I never got to meet you in real life. But then again, I still believe you are an angel and it wasn't just your username and that's why I could never meet you. You came into my life for a reason but now is the time for me to let go.\n\nIf it is meant to be, I am sure God will bring our paths together once again, maybe in this lifetime or the next. But until then, this is where we must both go our separate ways. I wish you all the happiness in life and hope you can forgive me if I have ever hurt you in any way.\n\nGood vibes only. Goodbye, my favorite stranger.\n\nP.S. I am sorry for deleting our Spotify playlist yet again. I know you said that when you can’t talk to me, you listen to it. But baby, I have to do this and it is what is best for both of us afterall.",
    "subreddit": "TrueOffMyChest",
    "title": "A letter to the girl I loved the most but never met",
    "upvote_ratio": 0.88,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7ungd/a_letter_to_the_girl_i_loved_the_most_but_never/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 09:15:26 UTC",
    "id": "1j7ukaa",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 8,
    "score": 4,
    "secure_media": null,
    "selftext": "I'm (19) | went to a concert with my friend and we got really drunk and got picked up by my friend's brother. I was staying at my friends house and I remember her brother had his mates over for a party but my friend and I were too drunk and we just went back to her room to chat before going to sleep. I can't recall how it happened exactly but I remember a couple guys came in and we were laughing and joking having a good time then all I remember is making out with this guy in a spare bedroom and getting really dizzy I remember he tried to put his hand under my dress but I stopped him by putting hand on his arm saying no but I have memory of being in the bed with him on top off me. I remember a light coming in the room when the door was opening and another guy coming in with my friend like they just caught us in the act. I woke up naked in bed next to him without being too gross their was evidence that a condom wasn't used. I told my friend that I think I was raped but she said she saw me making out with him before she saw us in the bedroom. My own friend doesn't even believe me but I don't know if she doesn't believe me because the guy is her cousin. I'm just scared and really questioning my own brain about ‹ happened.\n\nEdit: I did go an get tested",
    "subreddit": "TrueOffMyChest",
    "title": "Was it regret or was I assaulted",
    "upvote_ratio": 0.61,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7ukaa/was_it_regret_or_was_i_assaulted/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 08:37:26 UTC",
    "id": "1j7u2py",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 1,
    "score": 14,
    "secure_media": null,
    "selftext": "I need out of my 13 year relationship, last night argument was terrible for my mental health . He told me I should leave and go back to my ex (the one who physically beat me several times).Lately I’ve been dealing with suicidal thoughts. The thing is we have a 4yr old and my oldest from previous relationship just turned 18 , I’m afraid I’m making a mistake either way leaving or staying . What sucks is that it all started because I just wanted to talk about how I was hurt and how he doesn’t tend to care about communicating just in the end for him to turn the situation around and told me to leave along with a number of hateful names. Idk I’m toggling with the thought with going to a shelter since I’m a SAHM with no money which is another thing he controls or just ending myself. He knew what low self esteem I had from previous dv relationship so for him to do this to me just cuts to the core and I never felt so broken. ",
    "subreddit": "TrueOffMyChest",
    "title": "I need to leave",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7u2py/i_need_to_leave/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 08:30:35 UTC",
    "id": "1j7tzjg",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "So I (17m) have gone through bouts of suicidality since I was around 8 years old. Every year it gets worse. At eight I was thinking about it and it's like it doubles in intensity every year.\n\nIn year 9 (13/14) I tried to starve myself (weird ik) and planned a more conclusive attempt before reaching out for help on the day I planned and getting medical help/antidepressants. When I was in year 10 (14/15) I was worse, I planned, I collected drugs, and was found out. My parents confiscated anything basic I could hurt myself with. I got put into part time online schooling. Year 11 (15/16) things seemed to be getting better. I don't remember most of the year. Year 12 (16/17) I went through dellusionary episodes and attempted multiple times, sometimes on purpose, other times thinking I had to cut something out of me. I spent most of 2024 curled up in a ball waiting for my life to end. Things took a turn for the better at the start of December. \n\nNow the thing is every year I have at least a couple weeks of proper happiness. Other than a few years its usually a few months. During these months I feel I have gotten over the worst of it and everything is better now. But it always shows up again. It's back again for this year. I don't think I'm going to make it. I can't keep living like this. I can't go to therapy again because I don't trust mental health professionals anymore. I'm an only child and leaving my parents would devaste them but I can't stay. I'm so tired. I can't live like this, doing this every year? I don't do anything I enjoy anymore. It doesn't make me happy, if anything i feel worse. Every week seems to be a new issue that I didn't know I had to deal with. I'm over it. ",
    "subreddit": "TrueOffMyChest",
    "title": "I think this is my last year",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7tzjg/i_think_this_is_my_last_year/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 08:19:15 UTC",
    "id": "1j7tujn",
    "link_flair_text": null,
    "media": null,
    "num_comments": 39,
    "score": 1183,
    "secure_media": null,
    "selftext": "Hello, \nI know it's been forever since my original post. I honestly don't even know how to start this off. Since my original post was 2 months ago I figured an update was probably needed since I left so much in the dark.\n\nOver these 2 months my dad has moved out and is living somewhere else. me and my brother go over there after school and hang out until our mom can pick us up. They still act cordial in front of me and Tyler but they have so much built up tension it's concerning.\n\nBut on new years or like at 1ish on January 1st I tried to talk to my dad since he and tyler my little brother got into an argument about lighting off fireworks. I had gone downstairs since I thought I could talk to my dad and get his side of the story and just talk since he is my dad. But he had been drinking way way more than I have ever seen my dad drink before. So when I went to talk to him things took a sideways turn. My dad had ended up saying some words and the words he said still really fucking hurt. What he said to me really cut deep. he told me,\n\n \"I hate my life. I'm stuck in a shitty job, a shitty marriage, I have a son who treats his mom like shit, and then you. I have a daughter who is a piece of shit. When I found out I was going to have a daughter as my first kid, I was so excited. I thought i would have a daughter who loved to fish, hunt, and ve hardworking. instead I got a fucking snowflake of a daughter who doesn't like anytbing, is a worthless lazy piece of shit who expect her parents to bend over backwards for her. I got a daughter who doesn't give a fuck and is just nothing but a bitch.\"\n\nThat cut so fucking deep. and I hear those words in the back of my mind so much. \n\nAnd I haven't even really had a chance to really process the whole split with my parents. Because right after I was told my mom told me that I had to ve strong for my brother since this is really hard for him.\n\nSo I had to grow up and swallow the fact that my parents are taking a break. \nSo I tried to turn to my boyfriend (now ex) for comfort and support. Instead I got a couple comforting words and hum telling me it's going to ve okay. then he proceeded to tell me about his problems and how he got shot in the knee. (if anyone wants the story on this shit please let me know because at this point I need to talk because I can't afford a therapist and I'm going to explode if I don't let this shit out) \n\nI haven't gotten a break since this whole problem at Christmas. \nI get a Christmas present of my parents splitting. I start the new year with my dad telling me he hates me. Later I finally have enough with my toxic  boyfriend and decide to leave him and the police end up getting involved. \nliterally the only good thing about any of this shit is that I currently have a new boyfriend who is loving and supportive and doesn't gaslight, verbally and mentally abuse me, and will actually listen to me and all my problems. And I had my 15th in February as well.\n\nIf anyone wants more context I have much more but it's currently 2:19 in the morning and I haven't gotten a good night's sleep in about a week and a half. \n\nThank you to anyone and everyone who takes the time to read this mess of words. I hope you all have an amazing day/night.",
    "subreddit": "TrueOffMyChest",
    "title": "Parents sat me and my little brother down for a talk, and now my whole world is falling apart. *Update*",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7tujn/parents_sat_me_and_my_little_brother_down_for_a/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 07:50:26 UTC",
    "id": "1j7th3w",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 0,
    "secure_media": null,
    "selftext": "Massive vent because I'm completely at a loss for what to do or how to cope with what I know is coming. My partner(nb19) is about to move away. Their mother decided move across the country for the foreseeable future. I can't do long distance so it'll be the end of our relationship. They're so wonderful and kind. I've never felt more safe or seen by another person.\n\n On top of that, I'm at the end of a falling out with my best friend. He started seeing someone and refused to break up with them, even after that person attempted to SA me. He destroyed my trust and yet still keep clinging onto me. I keep trying to cut him off but he keeps trying to convince me to stay. Crying about how I've replaced him with my partner and how I'm overreacting. I blocked them earlier today. I'm just so hurt and betrayed by him. \n\nI have nobody else to turn to. My parents are abusive and neglectful and I lost contact with my high-school friends months ago. After my partner moves, I'll be completely and utterly alone. How am I supposed to cope with this. I have nobody to lean on, to talk to, to hang out with. I'll be completely alone and I don't know if I can handle it. I feel so heartbroken by the betrayal from my ex friend and so alone from the soon to be loss of my partner. How do I keep going? How am I supposed to exist while being completely alone. \n\nNote: I'm not suicidal. I'll keep going, even after I'm alone. I'm just seeking comfort. To know I'm not alone in my isolation. I'm autistic and disabled and find it incredibly hard to make friends, let alone keep them. I don't have money to go hang out places and I live in an arra that makes it hard to meet people my age. ",
    "subreddit": "TrueOffMyChest",
    "title": "I'm(nb18) going to be completely alone in 2 months",
    "upvote_ratio": 0.38,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7th3w/imnb18_going_to_be_completely_alone_in_2_months/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 07:46:35 UTC",
    "id": "1j7tf90",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 118,
    "secure_media": null,
    "selftext": "I was the other woman\n\nI just found out tonight the guy that I’ve been with for over a year was cheating with me. I went out for dinner with friends, and ran into them. She clearly knew who I was. While we had never put a label on things (he said with him finishing his masters he didn’t want anything official) he had never given me any reason to think we weren’t exclusive. I feel so dumb for falling for it. \n\nAnyway, I walk into the restaurant and right there, I see them. He gets nervous and she just says “so you’re the girl he dreams about.” Through a little more back and forth I find out they’ve been together almost 2 years and are living together. \n\nI’m just having such a hard time wrapping my head around this. He’s met my family, I’ve hung out with all his friends, we’ve gone away together. I’d never been with someone who’s hypes me up so much, and listens so intently to me. Maybe we didn’t have a label, but everything felt right. \n\nA few weeks ago he started to act weird. It almost felt like he was avoiding me. I didn’t think too much of it, as he is in the last couple months of his masters program, and I know it’s really important to him. He had invited me to his graduation, and I was going to go. I was in love with him. And she seems like such a cool person, even just by what she was wearing, and how she carries herself. I get why she hates me, I’d hate me too. I just don’t know what to do. Not looking for advice, just need to let this out ",
    "subreddit": "TrueOffMyChest",
    "title": "I (26F) just found out I was the other woman (28M)",
    "upvote_ratio": 0.95,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7tf90/i_26f_just_found_out_i_was_the_other_woman_28m/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 07:36:17 UTC",
    "id": "1j7tap7",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 8,
    "score": 5,
    "secure_media": null,
    "selftext": "I honestly don't feel as if any aspect of my existence is worth anything. I have done nothing but work and be there for others, the moment I do something small for myself I am punished. When I remind others of my boundaries I am vilified for it. People around me constantly remind me of my own failings while they refuse to acknowledge their failings outside of some misplaced sense of self importance. I seem to be the only one trying, but I am defined by my mistakes. I wasted my life for others, I did. It's foolish that I hope people to remember that, I feel foolish. How come I suddenly long for the struggles I had in the past? stuck in dead end jobs striving for survival, at least there I had a purpose, or at least there I had hope. Now, I don't know what to hope for, to pay debts? To get a better job? For the next Batman movie? To see if Superman Legacy will suck? Or Issue 6 of Absolute Batman? Is that all I'm hoping for now? I don't know why I even care. \n\nI wish I died beside my dog. ",
    "subreddit": "TrueOffMyChest",
    "title": "I wish I died beside my dog",
    "upvote_ratio": 0.79,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7tap7/i_wish_i_died_beside_my_dog/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 07:26:30 UTC",
    "id": "1j7t66w",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 2,
    "secure_media": null,
    "selftext": "Over the past few years I've gotten more and more numb and I've gotten to the point that when something bad happens I can't and don't cry about it. It's like I've come to expect it. Last week my fiance left me and I've wanted to just lay down and cry and I haven't been able to. I've been so numb to all of it that I feel like somethings wrong if nothing bad is happening to me. It's starting to get to the point that I feel like I just don't belong here anymore. I feel like at this point I might as well commit and just end it so no one has to deal with me and my issues anymore.",
    "subreddit": "TrueOffMyChest",
    "title": "I can't cry.",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7t66w/i_cant_cry/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 07:18:01 UTC",
    "id": "1j7t2b3",
    "link_flair_text": null,
    "media": null,
    "num_comments": 45,
    "score": 43,
    "secure_media": null,
    "selftext": "We’ll my sister is 30 years old and lives with her husband at home with my parents and the rest of my family 10 people . We already had 1 kid in our house was my brother and his baby mama and I can’t stand kids I hate crying. A baby is exciting don’t get me wrong but so much is just gonna change and I wish she would just move out and this wouldn’t affect my life and I wouldn’t have to stress . pls read whole thing don’t attack me I’m not jealous or my sister . I genuinely think she’s 30 years old with a husband and needs to move out with her baby and him it’s crazy . 3 generations in 1 household and my sister is a slob she never cleans dishes when she cooks for her husband and herself on our stove . She just goes to her room and sits her fat Ass down . And now with a baby I can’t imagine . Bottles , formula . I have already been a prisoner living with her I tell myself every day I will buy myself a cake when she leaves because she  doesn’t really talk to me we have a big age gap I’m 19  and when we do talk she just shames what I do or ask why I talk like that and I don’t have time . But now everything is constantly gonna be about this baby for 3-5 years not unless they move out . I know I can’t share this feeling with anyone else . Pls some advice to not hate my sister because I genuinely do sometimes , her presence makes me itch , she smells and I’m\nBaffled how at 30 you smell with a husband . Now a baby all I can think is she can barley afford herself and idk how we’re all gonna adjust to this parasite . I’m sad end of rant thanks :/ ",
    "subreddit": "TrueOffMyChest",
    "title": "My older sister is pregnant and I’m just sad",
    "upvote_ratio": 0.75,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7t2b3/my_older_sister_is_pregnant_and_im_just_sad/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 07:13:11 UTC",
    "id": "1j7t010",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 0,
    "secure_media": null,
    "selftext": "I (24F) have been with my current boyfriend for six months. I lost my virginity when I was 18 to my then boyfriend, whom I loved very much. However, it took us 6 months of trying because he had ED (he was a porn addict I think). We had sex maybe 10 times jn the year we were together, but we did other things. Throughout our relationship I did some things I wasn’t comfortable with just to appease him, to not appear an unexperienced and undesirable virgin. It was a toxic relationship that traumatized me and I took his inability to perform personally. I thought I was broken and ugly. \nA year later I got into another relationship that fixed my issues with sex, made me feel normal and desirable, hot, beautiful, but we weren’t a good fit so I broke it off. I then got SAd by my first boyfriend’s best friend, which ruined me. I was a normal girl before. So in total, not counting the rape, I had 5 partners before my current boyfriend and a few (2-3) “almosts”. My problem was I found a guy, we dated a few months then it turned out they had ED so we couldn’t go all the way, I would then rush into sex with the next guy to prove to myself that I can have sex like a normal person and try to build a relationship from there (obviously it’s not how it works). I would also wait quite a while between partners (a year, 6 months, a year and a half) so I always felt disconnected, anxious, stressed. \nThis is the first time I feel normal. I wished to have a normal relationship, and now I do. But I feel dirty and used, I hate myself for not knowing better, for not coping better, for finding sex empowering and cool. He knows and thinks I have little experience, he is very non judgmental. I have flashbacks of things I’ve done, pictures I’ve sent (just my first bf), no one has or should have material of me (unless it was against my will), but I still worry some could be brought up. It’s nothing out of the ordinary I guess, it’s just that I was pressured and not myself. I have no regrets about the experiences I chose for myself, but about the ones I was pressured into. I don’t know how to stop judging myself for this. ",
    "subreddit": "TrueOffMyChest",
    "title": "I ruminate about my past sexual partners",
    "upvote_ratio": 0.43,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7t010/i_ruminate_about_my_past_sexual_partners/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 07:10:53 UTC",
    "id": "1j7syzk",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 9,
    "secure_media": null,
    "selftext": "Heres my dumb story, maybe someone will read it. Ive never told anyone. And I'm feeling lonely as hell.\n\nWhen I was 2 my mom had my little sister. People tell me I was very withdrawn, that once my sister came around, I almost stopped crying completely and that is was creepy.\n\nI got older, most of my memories that I remember I was always by myself. Getting myself ready for school, walking myself to the bus stop half a mile away in the dark. For kindergarten. \n\nWhen I was 7, my mom had my little brother. After that, I dont have many memories of her outside her room. I watched him and my sister for a few hours when he was a newborn. As he got older, she left me in charge of him more and more often. \n\nBy the time I was 8, I took care of my siblings from wake up to bedtime most days if I was home. Mom never left her room anymore pr sometimes she would be gone for a few days to a week (summertimes or weekends). I was their parent. I held them, fed them, parented them.\n\nWhen my sister started school that year, it stressed me out that my brother would be home \"alone\". And I would get physically ill from the stress and worry. It helped because I would be sick but still at home for my brother.\n\nThankfully, though, he was always ok when I got home. In fact, I was pretty sure that mom was out of her room while we were at school. But as soon as we came home, she was in her room and our brother was playing alone in our room. \n\nAs we got older, I was expected to keep up the house. If it wasn't it pristine condition, I would get punished. Better not to go into detail but there were physical punishments and mental punishments (the worst). For example if my mom ate something at midnight, I would get in trouble that the kitchen wasn't cleaned the next morning.\n\nI took care of my siblings, cooked all the meals, cleaned the house and deep cleaned weekly, yet I was somehow alwasy yelled at, punished, grounded.\n\nIn case anyone is wondering where my dad is? Gone usually. He would be home once a month and those were my best memories.. then he was gone for work but later I found out he would use this time to drink himself into hospitals.\n\nThat was my life from 10 to 15. We moved around a lot too, so I couldn't keep any friends especially because I developed severe social anxiety from some of mom's mental punishments. My mom loved to make me grounded whenever I actually had any plans. After turning down any new friends invitation 3 times in a row, they usually stopped calling me.\n\nMy sister, was becoming a mess. She was a feisty girl, alwasy fighting and looking for trouble, but also lonely and looking for friends to fill the hole that I just could not fill no matter how hard I tried :(\n\nHer problems came from severe bullying and she tried so hard to make friends. At the time, I would stress and yell at her, try to stop her from sneaking out, stop her from texting boys, I would get into fights with her all the time just to eat... now I'm looking back and I wish I just hugged her and was there for her instead. (She's moved out as soon as she turned 17, no contact with anyone but me and our brother. She has lots of friends now!)\n\nMy brother, was the most creative and smartest kid ever. He was reading, drawing and playing mine craft (lol) before 5 years old. But he was emotionally unstable because he only had me as an example of how to act. I tried to parent him, but it's hard when you didn't have a parent yourself. He became violent and would harm himself as a kid until I took parenting classes at 16 and was able to help him get better. (Now he's the sweetest kid, I swear. He's still super smart and wants to become a computer engineer!)\n\nAt 15 to 17, I found a good stable job that paid well (I babysat and did odd jobs since I was 10 because I needed money for clothes) but now I worked part time, went to school, took a college class (school paid for) each term, parented my siblings to the best of my ability, managed the house but my siblings did their share now, still cooked all the meals, took my siblings to all their events, bought all their clothes and food,  caring for my mentally unstable grandmother(long story) and also my parents who decdecid I was old enough to become a mediator for their fights. Still get physically and mentally abused by my mother too\n\nI had panic attacks every week, sometimes up to 3 times a week. I would have nosebleeds. I would never cry or process my emotions and it caught up to me now.\n\n\n\nAt 17, I met *him*. My now ex husband. He was alwasy an asshole but I saw him as some sort of savior back then... This 21 year old man. Not going to even go into that. My sister didn't and still doesn't like him. He asked me to marry him when I was still 17 and I was too scared to say no. We got married when I was 18, a year of being together.\n\nIt was stupid. \n\nHe got me pregnant just as I started college. I found out only now he poked a fucjing hole in a condom. \n\nAfter having our child, his behavior got worse and it got to the point he started threatening to beat me and stuff. So that was my life from 18 to 21.\n\nIt took me that long to get the courage to leave.\n\nSo here I am, about to turn 22 soon, hiding in my new apartment with my daughter and my brother. My brother, now 14, acts like he's protecting me and I don't even have the heart to tell him that he's staying with me because he has nowhere to go either. My parents don't take care of him. I count him as my own anyway.\n\nLike sucks. But I've got my 2 kids with me.\n\nIf you've read this far omg you're crazy, I wrote so much 😭 thank you",
    "subreddit": "TrueOffMyChest",
    "title": "I've been parenting since I was 8",
    "upvote_ratio": 0.86,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7syzk/ive_been_parenting_since_i_was_8/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 07:04:39 UTC",
    "id": "1j7sw2d",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 2,
    "secure_media": null,
    "selftext": "\nI am asking because the man who raised me is not my biological father, so I am honestly curious if the man that my mother had a relationship with wonder if my mother got pregnant because of him and birthed me. I mean, he is friends with my mom's brothers, and I am pretty sure he can find out that my mother is pregnant. Unless I am just overthinking it. \n\n\nI do not want to hear that the man who raised me is my father. I found out about this during a heated argument, and both of my parents knew about it, so why hide this information as if I was stupid or something? I know I carry the burden of having to fix their mistakes. I found out about this a year ago, near my birthday, when I was turning 23. I am currently turning 24 in a couple days. I feel a bit better now, but I do not trust anyone. \n\nCurrently feel ashamed of being together in big gathering with cousins/ aunts uncles from both sides of family so I avoid them or stay in my room while they visit. Parents seem to not feel any regrets. Fighting/ then happy that is their lifestyle it is embarrassing- family members aunts/uncles are going through the same thing so I feel bad for my cousins honestly but unable to help them due to the trauma/ burden I have. \n\n\nThe only thing stopping me from taking the test is the burden of being rejected or causing family fights, and I am honestly tired of it. Possibly start going to therapy again once I am able to analyze my triggers \n",
    "subreddit": "TrueOffMyChest",
    "title": "Men that had multiple sexual relationships, do you even wonder if you had a child with that person?",
    "upvote_ratio": 0.61,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7sw2d/men_that_had_multiple_sexual_relationships_do_you/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 07:00:27 UTC",
    "id": "1j7stw7",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 4,
    "score": 0,
    "secure_media": null,
    "selftext": "\nMy best friend’s brother who was a year older than us was a face I saw very frequently. We had class together and he was always very chill. He was a lover boy, he liked going to the gym, he had hazel eyes, he was a football player. He struggled with one thing thought and that was drugs. He went to rehab a couple of times and we thought he changed for the better. Little that me and my bestfriend knew it was his demise at just 19 due to an od. This was recent and I could say I wasnt that close to him but it still affects me. I remember when we talked drunk we talked about our ambitions as we were young and we had so much ambition. Its crazy how he died and im already older than him. I cant think of the fact how i could die at any second and leave all my loved ones behind, but at the same time im scared of living in this life that is so unforgiving. I cant understand how people live normal lives worried about the smallest things like everyday interactions and they completely forget about the morbid stuff like dying, the afterlife, everyone is so stuck in their life they don’t realize how little it matters. The only thing you have is what you were born with.  Self awareness is the worst and best thing in this life. ",
    "subreddit": "TrueOffMyChest",
    "title": "He died too young and it causes me existential crisis just thinking about him.",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7stw7/he_died_too_young_and_it_causes_me_existential/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 06:53:07 UTC",
    "id": "1j7sq8d",
    "link_flair_text": null,
    "media": null,
    "num_comments": 46,
    "score": 135,
    "secure_media": null,
    "selftext": "God this feels so weird to actually type out\n\nAlso throw away bc I don’t want this traced back to me\n\nAlright so I have a beautiful amazing girlfriend and I know for a fact that I like her. But when I kiss her or touch her I just have a slightly off feeling. I love spending time with her and we have so many of the same interests and we just overall work well in a relationship. I’ve had friends tell me that they think I’ve met the perfect woman for me, they’ve told me someone like this only comes around once in a lifetime. Despite this, I can’t help but feel off. I’ve always been bi curious, I guess. I’ve only ever dated women, barely even entertained the idea of dating a guy. I was never opposed to it or anything, but it was just never something present on my mind. I’ve never felt a deep connection with a woman though. I’ve always felt like they’re falling in love with something artificial, like a fake part of me that only exists to them if that makes any sense. And it finally dawned on me tonight that I think I might be gay. The way she touches me, the way she feels when I touch her, it’s not right, but I don’t mind the idea of doing that with a man at all. In fact, I think I like it. \n\nI don’t want to hurt my girlfriend. I like her a lot and I feel really close to her, but I’m worried I’ll never be able to love her the same way she loves me. I guess I’ll never know for sure if I’m gay until I try but I couldn’t do that to her. I feel stuck. How do I even bring this up? “Hey babe, I think about men when I kiss you”? I’m so confused right now. \n\nSorry for weird formatting, my phone is being weird. Also it’s almost two in the morning so I’m really tired. ",
    "subreddit": "TrueOffMyChest",
    "title": "I have a girlfriend but I’m starting to think I might be gay",
    "upvote_ratio": 0.83,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7sq8d/i_have_a_girlfriend_but_im_starting_to_think_i/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 06:47:24 UTC",
    "id": "1j7sndl",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 2,
    "score": 3,
    "secure_media": null,
    "selftext": "Someone I know passed away a few years ago.\nTonight is one of the nights where I was reminded of him and I just cant stop thinking. Was he scared, Did it hurt? Did he really know how loved he is? \n\nIt’s been keeping me awake. I hope wherever he is, he found peace. Lord knows he deserves it.",
    "subreddit": "TrueOffMyChest",
    "title": "I just cant stop thinking.",
    "upvote_ratio": 0.72,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7sndl/i_just_cant_stop_thinking/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 06:37:33 UTC",
    "id": "1j7sihr",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "English isn't my first language, sorry for any mistakes.\nI just turned 18 three days ago, like two days before that I had gotten my prescription for hrt and was, for a minute the happiest I've ever felt in a long time up until I was confronted by my parents in the car.\n\nThey yelled at me, berated me, called me slurs and specifically my mother whom I've always had issues with screamed over how I would never be a real man, that I will hate my body and everybody will hate me. That I will kill myself because I'm just a \"naive little girl who overthinks everything\".\nMy father agreed with her in everything, never stepping in to at least look at me until he said that he never wanted a son and if he had wanted one he would have just kept having kids.\n\nThey took the prescription from me and basically told me that if I ever wanted to transition I'd have to be out of their lives. On the following days they acted as if nothing ever happened which is something they always do, but I feel their hatred, their disappointment. Even if I was a honor student, even if I fucking start studying engineering, I will always be a disappointment to them because I'm not their daughter.\n\nI've contemplated suicide ever since I was thirteen, the age I came out to my mom, the age I was when she told me she'd never support me because I will blame her when I regret it. I was then told I'd be a sex worker, that I would get kidnapped and disappeared for thinking I was smarter than her. Now she told me she'd drag me to a neuropsychiatric by my hair if she hears me say that I don't want to live, all that despite never caring to take me to therapy when I begged her.\n\nMy birthday came and everything felt so fake, my parents joked on how now I'm responsible over myself now that I'm an adult, that I can do anything. Every photo hugging me, it felt fake, like they forced themselves to do it. I never felt included in my family as if I was never meant to be their kid and they often joke that they were happier when I wasn't born.\n\nI cannot trust anyone around me and I feel isolated since my mother twists everything that happens to paint herself as the worried mother and me as the shitty child who never respects her. \n\nI've been laying every night, hoping I won't wake up, that I won't have to deal with this anymore, despite telling myself a plan to study and save to move out as soon as I can, I feel hopeless, I just want to end everything and leave everything behind. I feel like a burden to my family and if I dare to tell them how I feel my mother will make it about how she was mistreated as a child. I just want to die, I don't care that I'm young.",
    "subreddit": "TrueOffMyChest",
    "title": "I don't think I can keep going",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7sihr/i_dont_think_i_can_keep_going/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 06:19:20 UTC",
    "id": "1j7s9e6",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 37,
    "score": 328,
    "secure_media": null,
    "selftext": "I’m 22M and my 30M boyfriend got caught with despicable images on his computer (yes it’s what you think) and will be likely spending years in prison. I had no idea that he was this way. He’s not the person I thought he was and I’m heartbroken. I thought he was the love of my life. \n\nThe more I reflect on our relationship, the more I see the red flags. He only dated people much younger than him, people that were vulnerable or have a disability. People that were abused like me. We constantly talked about deep shit and our past experiences. I shared everything with him but clearly he didn’t with me. \n\nHe made me isolate from everyone in my life. When he got taken away so suddenly it hurt my heart. It’s been a few weeks but I’m still shocked, disgusted, hurt, and feeling used by him for many reasons. I don’t think I will ever trust anyone ever again. You never know who someone truly is. ",
    "subreddit": "TrueOffMyChest",
    "title": "My boyfriend is going to prison and I’m heartbroken",
    "upvote_ratio": 0.94,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7s9e6/my_boyfriend_is_going_to_prison_and_im_heartbroken/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 06:15:27 UTC",
    "id": "1j7s7gt",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "My daughters mom and I have been trying to have real, good sex for a few days now. Every night we’ve planned these last few nights always ends up getting screwed up. \n\nWe are raising a toddler that’s about to turn 4. Shes been doing everything she can to push our nights as long as possible, and any attempts at shutting it down at the source is resulted in screaming fits. We both work full time and shes taking a few college courses a week, two of which she has to drive to a neighboring city an hour away in the afternoon. \n\nWe’ve both been initiating and making the efforts to make the plans to hop into bed. These last few nights have gone terribly. She’s been tired, and I’m trying to support her with everything she’s balancing, thats not the issue, I’m happy to help her in any way I can. I’m having a hard time staying okay with the hormones. Whenever we speak of a plan for sexy time later, in my brain it’s game on. I do believe it’s the same for her. Then before you know it, it’s 10:30pm-11:30pm, she has to be up at 6, and it just hasn’t been happening. Jerking off helps little to none. \n\nI sleep less and have less energy (weight cut, lifting, manual labor job) yet I still am fully charged for sex morning, noon, or night. \n\nI just want to fuck her brains out, not be sitting here teeming with excitement I can’t get rid of when she’s sleeping next to me. \n\nThere are definitely bigger priorities that come first, I get that. We have those handled, even if we’re stretched thin. Fuck, someone take this kid for an hour mid afternoon so I can get some, please. But if I do that, then shes going to feel guilty and bad because she’s missing out on time with our daughter, which is also fair. ",
    "subreddit": "TrueOffMyChest",
    "title": "I’m sort of at a loss",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7s7gt/im_sort_of_at_a_loss/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 05:59:21 UTC",
    "id": "1j7rz52",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 1,
    "score": 4,
    "secure_media": null,
    "selftext": "I have jumpscare intrusive thoughts about suicide.\n\nI’d be scrolling on my phone, doing dishes at work, studying, driving, and all of the sudden, I get hit with the most horrid, depressing, and dreadful thought of committing suicide via handgun. The world just stops spinning in those few seconds. I start to tear up and breathe rapidly. My tinnitus gets louder and I can’t hear my real life surroundings anymore. I practically undergo 80% of a panic attack. Then my vision is flooded with graphic visuals of myself lying against the wall with a hole through my forehead and letters to my family by my side. Sometimes it’s a shotgun and my entire face will be gone instead. My brain sometimes plays a sequence of me sh**ting myself with the gun. I also see my mom panicking when she found my body. If she’s not there, I see my body laying there, waiting until the morning when my mom checks on me. There really is no way to make this thought end, I just have to go with the flow and eventually it stops which is when I go through my routine reassurances that everything is fine, because everything actually is fine. My life is good. \n\nI started having these thoughts like 2 months ago after I googled ways to commit suicide out of curiosity. These thoughts happen about every other day. \n\nThese thoughts are so vivid to the point it feels like a hallucination. I’ve never been diagnosed with schizophrenia and I can’t root these thoughts into anything trauma related. I just remember looking up ways to commit suicide out of curiosity. \n\n",
    "subreddit": "TrueOffMyChest",
    "title": "It feels like getting shot out of nowhere",
    "upvote_ratio": 0.76,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7rz52/it_feels_like_getting_shot_out_of_nowhere/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 05:23:02 UTC",
    "id": "1j7rgca",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "Using this as a post to vent. \n\nI'm 24F. I dislike my emotions most of the time. I get hung up on feelings and feel more than most people do. Sometimes I just want to go and punch a tree to let it all out because it hurts feeling like this. \n\nI feel bad for inanimate objects. If a bottle or can is dented I'll pick that one. I rotate which stuffed animal I sleep with so no one feels left out. Hell I'm cleaning up a plush bag clip of Bingo because she must have felt so alone buried in the dirty snow. \n\nI don't know why am like this, I have always been like this. Always crying when characters die. I refuse to watch/read shows/books/movies because I know what happens and will cry again. \n\nIs there anything I can do to feel like this? The only diagnoses I have are anxiety/depression and have had that diagnoses since I was 13 or 14. I'm just tired of feeling more feels than I want to. ",
    "subreddit": "TrueOffMyChest",
    "title": "Why Am I So Emotional",
    "upvote_ratio": 0.58,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7rgca/why_am_i_so_emotional/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 04:55:55 UTC",
    "id": "1j7r19l",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "",
    "subreddit": "TrueOffMyChest",
    "title": "I don’t know how I can go on loving with my regrets",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7r19l/i_dont_know_how_i_can_go_on_loving_with_my_regrets/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 04:50:28 UTC",
    "id": "1j7qybi",
    "link_flair_text": null,
    "media": null,
    "num_comments": 47,
    "score": 121,
    "secure_media": null,
    "selftext": "I understand I am a bad person. I know that I am no better than my husband, but I just cannot handle the lack of validation and love anymore. \n\nI (23F) got married last summer to my husband (25M), who proposed to me after two years together. A month later, I found out he’d been sexting girls on an anonymous website. He had a whole separate email set up for these accounts he had. There were hundreds of messages. He cried, claimed it was an addiction he was struggling with since he was young. I was devastated. I had never felt so much pain before in my life. I still have flashbacks to that day, dry-heaving and sobbing after finding out the love of my life was off fantasizing about fucking moms and older women while avoiding having sex with me. I always considered him the exception to men, a devoted man who could never hurt me. He swore he’d never hurt me. He knew I had family trauma related to cheating (my dad cheated on my mom my entire upbringing), and yet he still made that decision. \n\nI made the decision to stay, I think because of shame. I really did think there was something wrong with me to have caused him to turn his back on me. But also, we come from a very religious, very cultural community. It isn’t easy being divorced. But I haven’t been the same since. It’s been almost eight months and although I’ve gotten good at masking it, I have not moved from that pit that I’ve dug myself into. I go to work as usual. I hang out with my friends, do what needs to be done. My husband has to leave for work for months at a time, so he’s currently gone. That leaves me a lot of time to sulk around in my thoughts. He’s really trying to be a better person, I just never really know what he’s up to. So I feel emotionally detached in a way I would have never imagined possible with him. \n\nWhat kills me most is that I’ve started developing a weird desire to be acknowledged. Not by my husband, by other men. I want somebody to look at me, see beauty and intellect like he used to when we first met. I want someone to fall in love with me all over again. And God, I just crave a relationship where I don’t even have to think about cheating. \n\nI know a lot of people will tell me my marriage is doomed, and that I’m a shit person too. And I know that may all be true, but this is my reality currently. I haven’t been able to speak to anyone about this ever, and so I’m here to vent. I am trying to start therapy again (something my husband is against, mind you. But I am doing it behind his back because I deem it necessary), but that process is taking a while. \n\nEDIT: Those of you who keep messaging me with the intent of starting an affair or taking advantage of my vulnerability, please think before you shoot me a message. Women are allowed to talk about a situation like this and not still somehow be reduced to a form of sexual gratification. I am not using this post to beg for attention. I am simply getting it off of my chest, looking for advice perhaps. It’s 2025, understand that there is nuance. ",
    "subreddit": "TrueOffMyChest",
    "title": "My husband cheated on me and I decided to stay. But now I just want another man to notice me.",
    "upvote_ratio": 0.87,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7qybi/my_husband_cheated_on_me_and_i_decided_to_stay/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 04:49:32 UTC",
    "id": "1j7qxs5",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "So my sister had anorexia during high-school. She had to go to an eating disorder facility to get her back on track. Before her ED got serious she would always blame me for it she still does to this day. When I loved out of the house she relapsed and had to go back. She continued to blame me for it. \n\nThis has destroyed my mental health.  She became really health obsessed when a family member lifted her a fit bit. She would walk all day and compete with said family member. I can't tell her that was the start of it. I can't take the blame longer. ",
    "subreddit": "TrueOffMyChest",
    "title": "I let my sister blame me for he ED disorder",
    "upvote_ratio": 0.43,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7qxs5/i_let_my_sister_blame_me_for_he_ed_disorder/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 04:49:10 UTC",
    "id": "1j7qxko",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "My birthday is coming up next month. I (m. 32) plan to get myself a pink diamond tennis necklace or a pink diamond pendant. \n\nPink is my fav color, and the meaning of love and what pink represents really means alot to me, but also has alot of unrelated meaning, like as a male, learning to not give a fuck what other people have to say. \n\n6 years ago, I bought myself an amethyst necklace from mexico. I love it. I also bought myself a pink diamond tennis bracelet. Around that time, I'd thought I'd have kids, mainly a daughter, and I could pass down my timeless heirloom as something to be remembered by by the one person in my life who will look at me like something they never, ever want to lose. 6 years later, I'm nowhere near a child, and I still hold onto those heirlooms, potentially bound to wound up in a landfill, or on someone's desk who just looks at it as costume jewelry. \n\nIt's interesting how much an item can tell a story more than a price. I like to think items cost more than dollar value, but rather hold a lifetime of sentimental value, to the person who made it, to the person who originally bought it. ",
    "subreddit": "TrueOffMyChest",
    "title": "Timeless heirloom",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7qxko/timeless_heirloom/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 04:48:56 UTC",
    "id": "1j7qxgb",
    "link_flair_text": null,
    "media": null,
    "num_comments": 8,
    "score": 0,
    "secure_media": null,
    "selftext": "feeling bad about myself tonight I guess and I just needed to scream into the void with the chance of someone seeing it and maybe feeling a little bit of pity idk. if this resonates I'm really sorry for anyone feeling the same way I do\n\nI'm an 18 year old trans dude. I live in a pretty accepting area so I know a lot of trans people around me. almost every trans dude I know has been able to be on testosterone since they were &lt;16 and their parents use their chosen name and pronouns (or their dead name/nickname with their permission). I'm so fucking jealous. I'm so jealous I'm so jealous. I've been out for 4-5 years at this point I believe and my mom barely does the bare minimum and my dad doesn't try at all. i hate when my dad calls me \"this one\" or \"that one\" to not use my name. \n\nthe one time five years ago I had the naivety to believe he'd actually listen to me was the last time I ever talked to him about it. I ended up shaking and crying and hyperventilating on the floor while he screamed at me about how I'm ungrateful and that I have a good life and I don't deserve it. five years ago I asked my mom to stop using they/them because those aren't my fucking pronouns and she simply deflected and told me she's trying her best and I believed it because she's my mother. I asked about starting testosterone a few months after my transition and she basically told me being trans was a trend and not-so-subtly hinted that she didn't think I was a boy because \"lots of girls think they're transgender nowadays\". my dad tells new people that \"this is (deadname) but they go by (name)\" and only use she/her. I know when my parents talk about me they use my dead name and she/her. I know both of them have my dead name as their phone contact. it's sort of cringe looking back, but a couple years ago I made a tiktok post basically saying I wish I were born a boy and my mom sent me a multiple paragraph email about how I was gaslighting her (I was 15 years old)\n\nI've grown to accept it and that acceptance fucking hurts. that acceptance is the only way I'll survive. it's just the way my parents are. they claim to be accepting of everyone until it's their own fucking kid. it's nights like these where I sit and think and I know I have to tamp these thoughts down or else they will fucking consume me. because if my parents can't love me for who I am who fucking can? my ex came out as a lesbian immediately after breaking up with me—either they didn't love me at all or never saw me as a man\n\nthe worst part is is that anyone who fucking looks at me thinks I'm either a girl or knows I'm transgender. and I know they don't see me as a man and I know they'll use they/them and it sucks that I've developed such a visceral reaction to those pronouns being used on me because I know what it means. I know they're just being nice. i know I don't sound or look or act like a man. my back hurts constantly from binding because my mom passed down her D(?) cups to me and I cannot go out without binding or else I'm viscerally uncomfortable. i don't even mind having the wrong genetalia, people can't see that when they look at me, i don't mind being ugly or fat, but I hate my voice, I hate my breasts, i hate my face and I hate the way everyone fucking knows.\n\nand I have to be grateful all the time. i have to be grateful or else everything else will be taken from me. the scrap of respect I have will be gone the moment I bring it up to my parents, or my friends, or anyone because I know I'll just be seen as that annoying trans guy who can't stop reminding people. or that ungrateful brat who doesnt know how good he has it. I'm grateful my parents didnt kick me out. I'm grateful that they don't treat me with hostility. but what else? should I be grateful that they project their dead daughter on to me? should I thank them for all of these nights spent sobbing because no one will ever love me for who I am? because time and time again it's been proven that is the case?\n\ni have to be happy and unbothered and proud for who I am because what a joy it is to be part of a community who accepts me for who I am. except they don't. except I know what they see me as no matter how hard I try. i don't hate my life, I don't hate my parents, I don't hate my friends. i just wish things were different. i wish I was more comfortable in my own skin and I wish I didn't have to curl up on myself and hide my sobs from my father so he doesn't start screaming at me once more because I learn my lesson. because I know what will happen.\n\nthe whole post is sort of edgy, sorry. I've been on edge and anxious and sad this whole weekend because of something that happened the other day. if you made it this far, thanks. i don't really need advice, I just needed somewhere to air everything out before popped, y'know?",
    "subreddit": "TrueOffMyChest",
    "title": "I hate being trans so much",
    "upvote_ratio": 0.43,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7qxgb/i_hate_being_trans_so_much/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 04:44:23 UTC",
    "id": "1j7quv7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 5,
    "secure_media": null,
    "selftext": "I recently switched jobs and was excited at the prospect of making some friends. I don't need friends to go club ing with or anything. Just people I can chat with at work and goof off a little, text a meme once in a while. I didnt realize until my first day that there isn't a lot of staff and I am one of two guys. Doesn't really bother me, I'm gay and generally get along just fine with women once they realize. Most of the people there are an age bracket or more older than me. There are four girls that are a bit older than me but close enough. One is very mean so nobody likes her, but I really like the other three. \n\nThey have all been friendly with me and helpful with questions. I think I'm an okay person to get along with. I'm a good worker, I'm friendly, I'm pretty easygoing, and I have good hygiene so I dodge all the major strikes. From what I can tell we all align in bigger moral ideas and opinions..I was hopeful. I tried to talk to them a couple times  a day and joke around a little. \n\nUnfortunately I'm annoying and weird. I don't know how not to be, but people have told me I'm both. I was extremely unpopular throughout school and got beat up for it. I try to not talk to much. . I ask a lot of questions, probably to many for working there for a couple months but it's a hard job. My mouth is a little faster than my brain sometimes, but nobody has ever described me as mean.  People always tell me I'm weird but dont give specifics. Again, I try my best not to be. I don't have anything I'm obsessed with, I dress an look normal, I am pretty good at adjusting conversation for what is appropriate. I don't know what's wrong with me but something is. I'm a rather anxious person, and maybe that makes me a bit awkward and annoying, but to the point of not liking me idk. I hope not.\n\nI just know that this week I've started to see them pull away. I don't think they want to talk to me anymore and I don't know why.  None of them have asked for my number or to hang out, they commonly go to lunch together when their breaks allow and I've never been invited. I was devastated when I was talking to one of them when it was slow and I could see in her eyes she didn't want to talk to me.\n\nA couple of the older people (like fifty plus) are nice to me at least, but I'm not going to hang out with women over twice my age. I'm just lonely. Theres a couple people I'm afraid of talking to because they're not so nice. I don't know what I'm going to do if the three I was hoping would at least become my work friends end up hating me as well. If nobody likes me maybe I'll get fired. I'm on a probation period now and the economy isn't exactly helping. \n\nIs there any way to figure out what's wrong with me? Could I turn it around or now that they've turned negative is it a lost cause? Maybe it's stupid wanting friends at work I mean this isn't summer camp it's work. Maybe I'm a bad annoying person who never shuts up and just don't realize it. ",
    "subreddit": "TrueOffMyChest",
    "title": "Realizing I'm not going to make any friends at my new job. I just wish I knew what I was doing wrong.",
    "upvote_ratio": 0.7,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7quv7/realizing_im_not_going_to_make_any_friends_at_my/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 04:36:04 UTC",
    "id": "1j7qpw7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 1,
    "secure_media": null,
    "selftext": "A friend of mine was married in october a little over a year ago. I was never around much to actually observe his behavior around his female friends.\nBut after tonight Idk.... \nWe were having a beer and his friend called him over \"a girl\" and she had extended the invite to me as well. I had never met the person. \nMy friends wife would stay at home knowing where he was. But I think she may be very dense.  \nSo after multiple suspicious activities I've noticed but had no visual proof of anything.  I saw him and her kissing on the lips for fun and she was ALL over him.. She was also very intoxicated and explained some history they had involving a 3 way. \nShortly later I was ready to go.\nHe told me to leave and wait for him outside in my car, that he will be right down.\nI totally disagreed with that and said,we came in together and we are leaving together. If not, have a nice walk. So he ends up taking the lift.\n\nNow. Should I tell his wife? We are not friends, and I do not think much of her...\nBut, the first couple of times I shrugged it off \"not my life or problem\"....\nNow it's almost all the time and no longer think it's appropriate even if you dislike the person or not.. \nShould I tell his close friends?\nTell his inlaws?\nTell his wife? But I would much rather stay out of this cluster F@#$..\n",
    "subreddit": "TrueOffMyChest",
    "title": "Does my friend sleep around?",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7qpw7/does_my_friend_sleep_around/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 04:27:50 UTC",
    "id": "1j7ql05",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I just had an awesome week. It was 2 of my friends birthdays and mine, so lots of celebrating, clubbing, socialization, good food. It was probably the most social I have been since covid. As I was driving home after eating with friends, I realised I wasn't really happy. I'm not even sure I I'd say I was content. Comfortable probably. I've come to the conclusion that I don't really want anything, I don't desire anything, I don't have anything driving me forward. It's scary and kinda comforting, but it is seeping into every aspect of my life to the point I DONT know how I feel about anything around me. \nI'm mostly just venting, get the feelings into the void so it's been said somewhere but if there's someone else who also feels this way. Hi. You're not alone. ",
    "subreddit": "TrueOffMyChest",
    "title": "A sudden realization",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7ql05/a_sudden_realization/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 04:26:36 UTC",
    "id": "1j7qk8h",
    "link_flair_text": null,
    "media": null,
    "num_comments": 63,
    "score": 32,
    "secure_media": null,
    "selftext": "Im officially 21 and in the state of florida I'm allowed to carry a firearm. I'm a female and was raised by a single dad. At the age of 10, I learned about rape via the news. By the age of 16, I was taught how to prevent being drugged, how to keep my eye out when walking alone. By the age of 18 I was given a rape whistle, and a necklace that turns into a sharp blade.\n\nI got home a few hours ago from the shooting range, so I know how to use my gun incase worst case happens. As I was cleaning it I was think, society is fucked that us females have to be on such high alert. \n\nOn my 21st birthday, I went out with 2 older cousins. This guy who was clearly 40 kept hitting on me, I lost track of my cup and had to ask the bartender for a new one, cause between those minutes of me looking he could've put something in my drink.",
    "subreddit": "TrueOffMyChest",
    "title": "Living in fear as a female",
    "upvote_ratio": 0.73,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7qk8h/living_in_fear_as_a_female/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 04:26:16 UTC",
    "id": "1j7qk1x",
    "link_flair_text": null,
    "media": null,
    "num_comments": 6,
    "score": 2,
    "secure_media": null,
    "selftext": "I was tasked with helping my cousin with his homework today. He’s only 10 and you can tell when talking to him he’s legitimately as smart if not smarter than most of the family. His mom recently passed away so his older sister has custody of him. The boy is having trouble reading words like “droid”, “giggled”, “meant”, etc. nobody seems to take the time to teach him and he’s literally getting packets and homework assignments that they barely work on in school. He’s in an inner city school and I have another cousin attending there too. It’s so sad how poor these kids’ education really is. This boy can hold a good conversation about most things and can understand what you teach him when he stops beating himself up over stuff and takes the time. Because of this experience along with the other cousin of mine who goes to the same school, I’ve really lost faith in our education systems and the future of our people and country. At his age I, and even the kids who didn’t like reading, could easily read chapter books. These kids are incapable of doing that. Also common core math is frustratingly annoying. They intentionally make things more confusing instead of simplifying and compartmentalizing everything",
    "subreddit": "TrueOffMyChest",
    "title": "I’m Scared for Our Children’s Future",
    "upvote_ratio": 0.58,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7qk1x/im_scared_for_our_childrens_future/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 04:18:16 UTC",
    "id": "1j7qf3k",
    "link_flair_text": null,
    "media": null,
    "num_comments": 256,
    "score": 13,
    "secure_media": null,
    "selftext": "I know this doesn’t seem like a big deal but my heart hurts. This weekend I was using his phone to look up a restaurant and I saw in his search history/bar that he looked up at least 2 specific women’s only fans leaked. And he clicked on multiple websites just to find these women’s leaked images. I also thought to look at his twitter after finding this out and saw he looked them up there too. Between these 2 women he clicked on at least 10 different websites to find these women’s leaked photos. the funniest part is that me and these women look nothing alike. These women are beautiful, dark hair, dark eyes. While I’m a redhead with blue eyes. Our bodies are completely different as well. I just feel ugly. He was saying all men do it but I don’t believe that. It just hurts that he sought these women out hard to find pictures of them to pleasure himself to when we’ve been in a committed relationship. I know this is a controversial thing among people but I’ve always thought why do you feel the need to pleasure yourself to other women when you have me? And finding out these women look nothing like me just makes me feel not good enough and it makes me feel so ugly. He knows I’ve battled with weight and eating disorders and I feel like this is making it worse and it is torturing me. The worst part to me is he sought so hard for pictures of them when he went across multiple social media platforms to find them and pleasure himself and knowing they don’t look like me and knowing he’s in a committed relationship. How can I believe when he calls me beautiful yet pleasures himself to women that look nothing like me. ( EDIT: his needs are being met, someone told me I should mention this as well but I can assure you his needs are met with how much we go at it! Also he doesn’t like me masturbating to other men! So I don’t masturbate to other men but he is masturbating to other women even though I don’t like it. So I’m also upset about that because I followed his wishes but he doesn’t follow mine!)",
    "subreddit": "TrueOffMyChest",
    "title": "I caught my boyfriend masturbating to other women.",
    "upvote_ratio": 0.52,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7qf3k/i_caught_my_boyfriend_masturbating_to_other_women/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 04:05:36 UTC",
    "id": "1j7q7h2",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 4,
    "score": 13,
    "secure_media": null,
    "selftext": "He acts all high and mighty, huge ego. He thinks that just because he has a job, he doesn't have to do anything around the house. He made our own fucking grandma pick up his mess in our room just because he didn't wanna do it. I helped her of course because im nice, but holy shit, he really made an old woman pick up his garbage, and there was a lot. I tried telling him to do literally anything, but the asshole he is, he threatened to slap and best me up. This has happened multiple times, and honestly, should i just keep getting at him until he does hit me? I'd rather call the police than deal with this bullshit. The house, and especially me, would be better off without him.",
    "subreddit": "TrueOffMyChest",
    "title": "My brother is a huge fucking asshole",
    "upvote_ratio": 0.83,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7q7h2/my_brother_is_a_huge_fucking_asshole/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 03:57:33 UTC",
    "id": "1j7q25e",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 10,
    "secure_media": null,
    "selftext": "I  25F have lately I’ve been on this journey of choosing myself—really learning how to respect my own feelings and speak up. And ever since I started doing that, I’ve noticed I’ve been losing people I once considered close friends.\n\nI’m realizing some folks didn’t actually love me—they just loved what I did for them, or how quiet I was when they crossed lines. I once told a friend something made me uncomfortable and just asked her not to bring it up around me. She completely stopped talking to me after that.\n\nThen a friend I’ve known for 12 years asked me to reschedule my own birthday plans so I could go to someone else’s party instead. That honestly made me feel like an option, not a friend.\n\nI know nobody owes me anything, and I don’t expect people to revolve their lives around me. But I’ve come to realize that some people only respect boundaries when they benefit from them. And now that I’m finally honoring mine, it’s become a problem for them.\n",
    "subreddit": "TrueOffMyChest",
    "title": "Setting boundaries = no friends",
    "upvote_ratio": 0.79,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7q25e/setting_boundaries_no_friends/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 03:52:46 UTC",
    "id": "1j7pz5c",
    "link_flair_text": "CONTENT WARNING: SEXUAL ASSAULT",
    "media": null,
    "num_comments": 0,
    "score": 0,
    "secure_media": null,
    "selftext": "As I’m typing this, I’m thinking about a boy I met today, who was so sweet and charming and thoughtful. But the entire time I was with him, all I could think was ‘he’s going to be so disappointed if this goes any further.’ \n\nI am the survivor of SA and abuse from my first boyfriend. I was very young (the relationship started when I was 15). It lasted two years and it affects me every day. On top of that, I have faced things like stalking and grooming. \n\nI am 25 now. As a result, trusting is very hard for me. I often feel like I never really had a chance at learning about myself, my body, and my place in my relationships that wasn’t about being controlled or hurt.\n\nIve had very little experience since that first relationship. I am scared to date now, as a single adult, because I know myself. I don’t feel safe being physical with partners unless I’m doing something for them. I don’t know what to do when they want to do something for me, and I panic. Likewise, I’m scared I will never be able to break out of my ‘get small, do whatever they want’ mindset that I kept myself in. I often compare myself to those shelter dogs with the signs that say ‘Abused rescue, barks at men.’\n\nI am in therapy, and I’ve made amazing progress. I just don’t know what to do to tackle this part. I can’t decide if I should take a risk but be communicative, or learn how to love myself in my solitude. ",
    "subreddit": "TrueOffMyChest",
    "title": "I think I may be too traumatized to be lovable",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7pz5c/i_think_i_may_be_too_traumatized_to_be_lovable/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 03:46:03 UTC",
    "id": "1j7puxd",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 4,
    "secure_media": null,
    "selftext": "i’m not going to end my life but i have lost my will to live for the most part, other than i guess my will to live long enough to see if this gets better. \n\ni left a not so great relationship three years ago and no one has touched me since. i read a novel two months ago featuring a lot of caretaking scenes between partners and while i hadn’t been lonely before and felt proud of my independence, i’ve been terribly lonely all of a sudden. you’d think i have great friendships and maybe i do but i spend most of my time after work alone and im starting to dread weekends knowing i’ll mostly be on my own. \n\ni’d love to share my life with someone and thought i was regaining a lot of confidence but i’ve started to become vicious to myself. this is probably a distortion but i can’t really imagine people missing me in a substantial way if i were gone. im not really foundational to anyone’s life as far as i know. i keep thinking people would feel sad someone young died and maybe question if they could’ve done something but i can’t imagine my loss feeling like a void to anyone. \n\ni don’t know what happened the last month or two. i want my life to get better or to feel more at peace with the one i’ve been given but i can’t stop thinking about death, almost all the time now, i keep bursting into tears at work, when im out, the second i get home. i feel like an alien, like i forgot how to connect with and relate to other people. ",
    "subreddit": "TrueOffMyChest",
    "title": "i don’t want to be alive anymore",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7puxd/i_dont_want_to_be_alive_anymore/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 03:34:54 UTC",
    "id": "1j7po1j",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "I have really bad insomnia and anxiety. 😥 my job stresses me the F out. I worked all week then got called in Sunday for day shift I have never been trained on. I didn’t get any sleep because I was worried about it all night. I got really down and upset so sleep deprived well they put me on sleep meds and I have to take those everyday and can’t just stop cold turkey. Well … there’s times I’m gonna be on call. For example I work till 12am and could be called in an hour after I get home or two hours or three who knows. I’m gonna be taking my meds around that time and if I pass out and they call me in then I am gonna have to get up and go in and clean a Covid or do F ing day shift because someone called off. Not sure why boss doesn’t make the part time lady do it (everyone thinks there screwing because she gets away with everything) I got so upset and sleep deprived and just so tired of this crap that I put my two weeks in today and left the note in my bosses mailbox like he told me to do I the begging. Now I’m regretting it but my mental health is so bad. I have a 4old boy I have to take care of with no financial help. I also have a fine to pay ect. I really want part time but the girl already is in the position and won’t give it up even though she has told me she don’t need it because she got $$ from her dad passing away. I really would do better on part time till I figured things out. There’s no jobs in my town I was lucky to land this one… pharmacy told me that I have to take that med every night around the same time and that I have to lay in bed for 8 hours before I can get up. So being on call is a no go. I’m really upset. I feel like driving in town to my Job to get that damn two week notice. My job stresses me out and I hate it but need it at the same time. Please any advice ?? ",
    "subreddit": "TrueOffMyChest",
    "title": "Venting /need advice on what to do? What would you do? Please read",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7po1j/venting_need_advice_on_what_to_do_what_would_you/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 03:32:05 UTC",
    "id": "1j7pm91",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 2,
    "secure_media": null,
    "selftext": "Not putting ages, but I'm a woman dating a man for that context. We both told each other prior to us even being \"official\" that we don't really know what it means to be in love, but based on everything i have read, i believe i am in love. We have been together for a short time but have known each other for a long time. I don't believe he will ever love me and there's an internal dichotomy of \"i am okay with unrequited love because we make a good partnership and he is sweet and considerate to me\" and \"what is wrong with me why am i not enough what if one day he realizes he can do better and leaves me.\" I worry a lot when we're together lately that he's thinking of someone else, a past love, maybe someone he's still in love or obsessed with. I of course cannot ask him because it would kill me if the answer is yes, he is thinking about someone else and wishes i was her instead. I already know that he's never really had feelings towards me, which is leading to my skepticism so far. I can take him at face value now when he says he likes me, but it didn't come easy and doesn't come without a voice in the back of my mind saying it's not true. \n\nI found out tonight that basically I'm coming on too strong i guess with verbal affection (\"i miss you\" things like that), and i worry that turns him off from me. I worry that it makes him not want to be with me. I worry that it makes him think I'm desperate, which he did essentially accuse me of a few weekends ago. But i worry that it pushes him away from me. He likes physical reassurances that i want to be with him, physical affection and intimacy, and i need the inverse to feel secure. And i can tell he's making an effort, i think he can tell I'm making an effort. But I worry I've pushed things too far by being too verbally affectionate. I'm worried he's thinking of breaking up with me. \n\nThis weekend I have been considering telling him I love him and it's okay if he doesn't return the feeling, but now I can't. I try very hard to be present and suppress my fears and insecurities when we're together, but I'm sure it's noticeable at times still. There are women from his past I know he had a thing for, and I feel so uncomfortable when he talks about them, I don't know if he's noticed that, and he doesn't do it often but it is very painful. I wonder if he wishes I was one of them instead of who I am. He has denied it, but I do still think a huge reason he's with me is my body. I know he's been attracted to me physically all these years, and so I worry that that is the main draw to me, the main thing that makes him want to stick around. I worry another reason is because we're getting older and we both feel like we're missing life milestones and we could be each other's solution for that. \n\nI am so insecure and scared and worried in this relationship, but I have wanted it for over 10 years, more than 10 years have I had a crush on him. So I am okay with the fact he will never love me. But I do need to cry about it sometimes. ",
    "subreddit": "TrueOffMyChest",
    "title": "I don't think my boyfriend will ever love me.",
    "upvote_ratio": 0.63,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7pm91/i_dont_think_my_boyfriend_will_ever_love_me/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 03:29:37 UTC",
    "id": "1j7pkns",
    "link_flair_text": null,
    "media": null,
    "num_comments": 31,
    "score": 35,
    "secure_media": null,
    "selftext": "I recently broke off a 5 year relationship (one year engagement) because of financial infidelity. I’m 30  years old, 20k in cc debt, 100k owed in loans, 25k owed in student loans, and I was too embarrassed to ever tell my partner the truth. Covid, struggling with mental health, lifestyle creep, all contributed to overspending, not utilizing credit cards correctly, and trying to be something I’m not in front of everyone in my life for the past 3 years. Essentially, and everyone in my circle thinks I’m well off when I’m actually a lying coward. \n\nThe guilt and anxiety of the debt got so bad that I ended my long term relationship. My partner makes 45k and I make 3 times their salary, so planning our wedding was nauseating as I knew there was no way we can afford it as my partner has been depending on me for financial support. Little did they know, we are so poor and I’m in so much debt that it would crush me to continue our relationship and go through with a wedding with this gigantic mess. They don’t deserve it, and they deserve better than me. \n\nI’m so embarrassed. But I realize that ending the relationship and working towards paying down debt aggressively was the only way I can move forward without feeling more like a piece of shit than I already do. Right now they still don’t know the truth, and they are probably so confused, hurt, and angry right now because the relationship seemingly ended out of nowhere. But I’m only trying to protect them, and I hate myself that I let this drag on for as long as it did. I only hope that the damage and hurt I’m saving them from will outweigh the damage and hurt I’ve already caused. For now, I’m just relieved that the love of my life is now safe from me, my lies, and my debt. I love you and I’m sorry I wasn’t able to be a better person for you. Thank you for all these years.",
    "subreddit": "TrueOffMyChest",
    "title": "I ended my relationship due to financial infidelity",
    "upvote_ratio": 0.74,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7pkns/i_ended_my_relationship_due_to_financial/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 03:22:24 UTC",
    "id": "1j7pfwv",
    "link_flair_text": null,
    "media": null,
    "num_comments": 10,
    "score": 0,
    "secure_media": null,
    "selftext": "Okay I don't even know where to start. Our relationship has always been weird. We are definitely more open to talking about very tabo/ out there topics. But I won't be honest I lost trust a year ago. (maybe I like to be hurt idk). I (23F) have been with my partner (22F) for over a year now. The first time this happened we here (friends) to the public but together in private. It she was in the bathroom at a club with another girl. She told me after I asked 3 times. And it also took me asking so many times what happened and \"is there anything else\" for her to finally admits it. Then the second time was the exact same thing at the club but she was drinking that night and I saw it all happen. The third time I went away for to work in a different city for my job for two weeks and the girl she was seeing texted me the SS of there messages. It was so bad one of them said \" I could cheat on her and she wouldn't even know\". When I confronted her she lied to my face.\nLike she always does. And even went as far as saying that these are photoshopped. She denied and lied and always played the victim. Saying she was forced and felt like she had too. And then blame me for things that made no sense what so ever. The third time was recent. She went out with new friends she met online. She told me there names it was all good she said she was going over to hang out and play games. She don't come back to her house until 5:30 am. (1 have her location). I knew in my gut something happened. When I told her it feels off like you cheated because you came back so late she brushed it off like it was nothing. I'll break it down how this one went. I called her to talk about it she told me they kissed once and that's it. I was very upset. Then we talked more about it that night. She told me they held hands that this girl \"listened to her and heard her\". ( she had a tendency to completely blow up at me in arguments so l don't always tend to listen when she's yelling at me). Then she said she wanted and open relationship with this girl has her gf and me in the side. I then saw her two days later.\nShe told me in person they kissed max 3 time and she had her arm over her. I once again had to ask 10000 times to get this info. And I asked her\n1000000 more times \"are you sure there is nothing else\". I then asked her to get me food and water because I wasn't feeling good. I looked through her phone I know I shouldn't have but I did. I say the most disturbing texts of my life. They were very inappropriate with each other and have been texting like this for a week now. Very lovey texts too all day and night. Calling me her friend and saying she's with her \"friend\" AKA ME! Telling her jokes | was saying but as if it was coming from my partner to this girl. Telling her she's skinny and pretty. ( l am a comfortable weight I like my size, I also work out and enjoy building muscle and strength not slimming figure). I confronted her and he lied again. Right after lying to my face and telling me there wasn't more. I lost it and read the entire texts with her sitting in the ground in my room. Now she's all sweet with me. She's at my house watching my dog while I visit my dad (I had already planned this trip and that's why she was at my house in the first place). I go back to my house tomorrow where she will be.",
    "subreddit": "TrueOffMyChest",
    "title": "I need to talk about this. Cheated on 4 times in one year",
    "upvote_ratio": 0.4,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7pfwv/i_need_to_talk_about_this_cheated_on_4_times_in/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 03:12:44 UTC",
    "id": "1j7p9uc",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 2,
    "secure_media": null,
    "selftext": "I'm 18, and recently moved into a home. Long story very very short, I had a son while I was 12, he's six now. I ran away from my mother and my father because me mother is an alcoholic and my father went to prison for child abuse material (photos of me). I ended up in foster care for a while, living on the streets with my son for a year, and finally landed a job and got to sleep in the back room of the cafe. My mother found us, and I panicked, flew him back to our home country and now he lives with my boyfriends parents. So now, my boss, and a coworker and I all moved into a flat together, because I was struggling being away from my son. A couple months later, the boss says he's inherited an old miners cottage and will NOT be moving in, he offered it to me, I took it. My mother has a new husband, and he's lovely, so I invited them, and my older sister to stay with me, I didn't realise they thought it would turn into freeloading. My sister got a job and moved into the city and I'm so proud of her! My step dad works as a teacher and he's great, helps around the house, cooks when I'm not feeling well, ect. My mother however, shows up uninvited, drinks herself half blind and then calls me to pick her up, I can't say no to her, she's my mum, I love her, even if she was an arse. Sometimes, I wish they told me thank you, even just once. My son is little and the sweetest kid I know, but it sucks to sometimes feel like I'm overlooked. Sorry for the long post, just felt like I needed to tell someone.",
    "subreddit": "TrueOffMyChest",
    "title": "Sometimes I wish my family recognised me more",
    "upvote_ratio": 0.63,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7p9uc/sometimes_i_wish_my_family_recognised_me_more/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 02:49:03 UTC",
    "id": "1j7otym",
    "link_flair_text": "Positive",
    "media": null,
    "num_comments": 23,
    "score": 294,
    "secure_media": null,
    "selftext": "I can’t believe it. My head is still reeling. I can’t believe she’s mine now. All my life I’ve been with men. I never thought I would fall in love with a girl, let alone someone that is very close to me!! It feels so surreal.\n\nI’m just so, so happy!! I still find it unreal that I will get to kiss her now. I’ve never been this happy in my past relationships. It always felt like something was missing. But now I feel like everything clicked for me. God, I love her so fucking much. ",
    "subreddit": "TrueOffMyChest",
    "title": "I confessed my feelings to my girl best friend last night and now we’re together",
    "upvote_ratio": 0.93,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7otym/i_confessed_my_feelings_to_my_girl_best_friend/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 02:45:54 UTC",
    "id": "1j7orsw",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 5,
    "secure_media": null,
    "selftext": "Whenever I read through best of reddit or any of the various relationships subs, I see guys who are basically the \"nice guy\", who only befriend women they want to date.  It basically always sends my mind careening back to obsess about how or if I was a \"nice guy\" in high school.\n\nI pined for a girl all through high school.  My graduating class was 465 kids but we were in all the honors/advanced classes and did debate/forensics/scholars bowl/mock trial together as well.  There was basically a group of about 25-35 people who did all the honors stuff and we were basically a high school within the school.\n\nAnyway, if this now woman even bothers to remember me, she probably views me as the quintessential \"nice guy\", and honestly I am so embarrassed/guilty about it that my neruodivergernt mind can't ever let it fully go. \n\nLike I said, I made friends with this girl when we were sophomores (our high school was 10/11/12), and she already had a boyfriend.  I *really* was not trying to be *that guy*, but I think everyone in our class (and I later found out several of our teachers) knew I had feelings for her.  I am certain she did.  \n\nJunior year she breaks up with her boyfriend and has a new one before I even knew.  Our senior year, there was a really tragic situation and the person she was seeing passed away. Now, I am not such an AH as to immediately make a move or anything but by the spring I got the idea she basically wanted me to ask her out.  So I did. However, earlier in the year, before the event that resulted in her being single, I asked another girl from the group of AP students to Prom. This girl had then written me a letter explaining that she hadn't expected to be asked at all, and was flattered and would accept as long as I understood it was completely platonic. I said I understood and that was fine.\n\nNow, I don't know what other people would have done, but it never crossed my mind to try and back out of taking the first girl I had asked.  We had another friend who was kind of looking for a date and the two of the ended up going together.  The monday after Prom she dumped me for him. So we dated for like all of 3 weeks.  I did some dumb stuff.  I wrote a cringey please don't break up letter.  I tried to be more outgoing with our friend group, and it came across as weird and try hard.  I asked out another girl who I thought was cute but had nothing in common with and got rejected and told to my face that I should just wait till college because *any girl in our high school* would know they were a rebound and that nobody would not be interested.\n\n\nNow what really sucked was that we got to go to national tournaments for both Mock Trial and Debate/Forensics together. So I had basically two school funded pseudo vacations with my \"ex\" and without her boyfriend and while I had a good time, it was also really rough for my 18 year old self. It was just impossible to fit myself back into the \"just a friend box.\"  I still had strong feelings, she knew that, and I hope I didn't make her miserable.  While going to fetch her and  the girls she was sharing a hotel room with at the Forensics national tournament, I heard her talking about me through the door saying that I was \"too intense\" and that was part of why she broke up with me.  That has stuck with me my entire life (my wife loves how \"intense\" I can be so things worked out).\n\nWhile at the mock trial national tournament, one evening our coach/chaperone pulled me aside and just asked how I was doing.  As we talked I ended up breaking down and crying. That's also where I found out that yes the teachers all knew as well, and yes they did have opinions on student relationships.\n\nAnyway, I look back now and clearly, yes this stuff did *affect* me.  It contributed to who I am today, but at the same time, it seems dumb because we only dated for less than a month.  But, for me  there was also friendship with her knowing she had me as a backup/fallback if she ever wanted. That probably seems really incel/misogynistic but I willingly put myself there and she couldn't possibly have been unaware.  It was clearly super unhealthy for me, unfair to her, and that is why I look back and feel guilty and embarrassed.  The fact I am now 41 and can still remember and write about all of this shows that it for sure impacted me, but like I said when I think back on it, I pretty much figure she must think I am/was the sort of \"nice guy\" who befriends women exclusively to try and date them.\n\nI feel a fair amount of guilt over this, not the least of which is in part because I have been married for 15 years to the most beautiful, amazing woman I could imagine.  Yet, any time I read a story on reddit with a guy complaining about who women they know date, or women talking about why do guys act like this, I am basically catapult to thinking about how immature I was.  ",
    "subreddit": "TrueOffMyChest",
    "title": "Every time I read a a reddit story about \"Nice Guys\" and relationships I remember my high school experience and I feel guilty and embarrassed.",
    "upvote_ratio": 0.7,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7orsw/every_time_i_read_a_a_reddit_story_about_nice/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 02:44:29 UTC",
    "id": "1j7oqst",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 0,
    "secure_media": null,
    "selftext": "I’ve only ever met a few people online on apps or in personals. For the most part historically and exclusively now, I ghost after a short while. I’m trying to treat this loneliness while I’m hung up on somebody who I’ll never be with. \n\nI try and try to find somebody new to get my mind off of him, but there’s no one. I just try and find a new fantasy to draw me away like when I needed to get my mind off of another person. It doesn’t work. I’m just caught in a vicious cycle of wanting somebody I can’t have and trying to want someone new and failing. \n\nI just want to be healthy. ",
    "subreddit": "TrueOffMyChest",
    "title": "I read personals and smut and respond but never follow through",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7oqst/i_read_personals_and_smut_and_respond_but_never/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 02:39:55 UTC",
    "id": "1j7onmz",
    "link_flair_text": null,
    "media": null,
    "num_comments": 455,
    "score": 5141,
    "secure_media": null,
    "selftext": "So the other day, a close male friend of mine told me he is sending his fiance on an expensive solo paid vacation. I inquired why he wasn't going with her, and he informed me in so many words \"because he has needs\" and that he has his own hotel booked with the sole intention of cheating/unfaithfulness. \n\nWhy? Because apparently her genitalia is offensive and disgusting to him and he can't perform oral sex on her. He told me he must perform oral sex to be fulfilled in life, and he \"just has to\". \n\nI asked him why he wasn't just being honest with her, and he said it was because it would crush her. I said If oral sex is THAT important to you then you guys need to break up. He refused to break up saying he loved her and they had built a life together and then he wouldn't have anyone to help him with his special needs daughter. And he is ADAMANT he will not get caught unless I say something to his fiance. \n\nI inquired about lights out, blindfolds, etc. He absolutely refused and says her stuff is beyond disgusting. \n\nLet me be clear. He is not a prize in any way. Without him paying for the privilege, I don't see any random woman near him just randomly accepting oral sex from him. So I'm not sure if this will happen. But it's definitely put me in a weird situation because I am friends with both of them. I don't want to get involved but I feel this is really awful for him to do. It's changed how I look at him completely. I never would have thought him capable of something like this. \n\nJust needed to get this out of my brain. I feel so bad for her. \n\nEDIT:\n\nWow. I did not expect this to blow up like that. I will try to clarify some of the questions I've received. \n1) yes, I also wish this was fake. It isn't. \n\n2) they are not married. They are engaged. The special needs child is not theirs. The biological mother of the child lives in another state. \n\n3) for those asking why I'm friends with someone, Why does anyone have friends? Nobody is perfect and everyone makes mistakes. But I've been friends with him for a decade. Longer than I've known his fiance who I met through him. He's been a really wonderful friend. And He's never mentioned or thought or indicated any kind of behavior like this to me until this JUST HAPPENED, YESTERDAY, and I was completely shocked and struggling to process it. That is why I said what I said in the original post. My vision of him has shattered. I am not sure yet how I am going to proceed. \n\n4) those asking for information about her genitalia, I really do not have the answers you are seeking. I asked about smell or scent or taste and he was adamant it was strictly because of appearance. The only description I got, which left me very confused,  was that it \"looks like a pokemon\". He also did mention that she has a disorder (I forgot the name) of where the hair follicles of your pubic hair turns slightly ulcerous and the hair follicles become infected. He said this also disgusts him because apparently it's \"open wounds\".\nI asked all the questions you guys are asking. Why isn't she on medication or treatment for the condition. Labiaplasty. Etc.  The short and unfortunate answer is lack of funds and lack of health insurance for both parties. We live in a VERY poor area of a VERY red state. And yes, I told him he should have paid for her healthcare instead of a vacation. \n\n5) I am certain he is not gay. \n\n6) for those of you that have reached out privately to confirm if I am someone you know and if this story is about your partner, I want to say how sorry I am and how sad I am that this is happening to other people. I can't even imagine. ",
    "subreddit": "TrueOffMyChest",
    "title": "NSFW Friend Told Me He Is Cheating Due to Appearance Of His Fiance's Genitalia.",
    "upvote_ratio": 0.96,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7onmz/nsfw_friend_told_me_he_is_cheating_due_to/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 02:15:07 UTC",
    "id": "1j7o6kv",
    "link_flair_text": null,
    "media": null,
    "num_comments": 37,
    "score": 0,
    "secure_media": null,
    "selftext": "Dude I am lowkey losing it rn. I made a post talking about how I had a traumatic experience with my girlfriend and everyone got mad and downvoted me because I censored the work kill like “k*ll” because I was worried the post would get taken I didn’t know if it would trigger anyone yk. I was just trying to vent and everyone in the comments got mad at me because of one small thing I feel like all the hate was kinda unnecessary tho yk?",
    "subreddit": "TrueOffMyChest",
    "title": "People on this app are awful",
    "upvote_ratio": 0.36,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7o6kv/people_on_this_app_are_awful/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 01:57:16 UTC",
    "id": "1j7nu40",
    "link_flair_text": null,
    "media": null,
    "num_comments": 5,
    "score": 1,
    "secure_media": null,
    "selftext": "I (14) female am a straight-A student, I do art, I play music, I have my youtube channel, I can cook, and I can do most of the house chores. After doing all these things no one seems to believe in my abilities. This morning I had my phone in time-lapse and I was recording myself studying as motivation but my father came into my room took my mobile and scolded me saying I wasn't studying. When I tried to show him the timelapse of me studying he said he didn't want to look at it and that I should go and study.\n\nThis isn't even the first time this has happened but today I just cried for 20 minutes nonstop. I don't know why it hurt so much worse today but it did. When I make art my family always finds a flaw in it. When I cook there always has to be something wrong. When I tell my parents my future plans they shrug it off and say, \"You need to work for that dream just saying it won't get you there \" but I am working towards it , I work towards it day and night. When I get good grades it's never enough, I have cried on every one of my exam results days.\n\nIf no one believes and sees my efforts, it is the same as not putting any effort. I have worked hard day and night for my future but no one sees it. So, I have decided to not try anymore, to not push myself. ",
    "subreddit": "TrueOffMyChest",
    "title": "About to give up on everything ..",
    "upvote_ratio": 0.56,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7nu40/about_to_give_up_on_everything/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 01:47:32 UTC",
    "id": "1j7nn6g",
    "link_flair_text": null,
    "media": null,
    "num_comments": 2,
    "score": 1,
    "secure_media": null,
    "selftext": "I don't feel any hatred towards anyone, but when I see couples in public, on TV, books. I also hate love songs. Once again, I don't hate the people themselves or anything, If anything it's cute, it's just I want that too...\n\nI think I could be lovable to someone, but I never really have been, apart from that one 18 year old I e-dated when I was 14, if that counts. Heh\n\nI've never kissed anyone, held hands, or cuddled with anyone, and that's what I want. With some one I love deeply, and they love me back. \n\nThere's also the fact that dating is much more difficult to me since I can only ever really be interested in someone if we're close friends first, plus I have different veiws towards sex, essentially I'm only interested in it with someone I'm Iove with, and I have no feelings towards any other people because that's all I need. I want someone to feel the same way as me, and that feels almost impossible. ",
    "subreddit": "TrueOffMyChest",
    "title": "I hate love...",
    "upvote_ratio": 0.57,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7nn6g/i_hate_love/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 01:42:37 UTC",
    "id": "1j7njo7",
    "link_flair_text": "Positive",
    "media": null,
    "num_comments": 4,
    "score": 3,
    "secure_media": null,
    "selftext": "It's funny how things change, right? I went from being a person that avoided all types of human connections and didn't know how to be myself and feel great interacting at that time, to now being someone who does not fear who she is (most of the time at least, way better than never, ever) and loves to chat with people and makes friends easily. It has became now a part of my day talking and connecting with people, it doesn't matter who, it just needs to be someone who's willing to share and talk, it can be bad now if I don't get any sort of talk in the day and I think I put too much expectation in these connections, since I start to lose interest on the person when I think we don't have anything else to talk about, even if the person is nice, makes me feel sad not knowing how to continue things up. Funny how things can give a 360° in just a second ha, antisocial to very social in a month, unbelievable. Or I just started being myself again, after a while, finally :)",
    "subreddit": "TrueOffMyChest",
    "title": "Went to antisocial to supersocial in a month",
    "upvote_ratio": 0.72,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7njo7/went_to_antisocial_to_supersocial_in_a_month/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 01:37:45 UTC",
    "id": "1j7ngez",
    "link_flair_text": null,
    "media": null,
    "num_comments": 1,
    "score": 0,
    "secure_media": null,
    "selftext": "Dating is miserable and it feels like every person I'm with seemingly has no clue of what they want, and my actions have almost zero impact long term on the success of the relationship because every woman I date ends up falling into a spiral of self sabotage or the ones that are already emotionally independent aren't interested. \n\nI feel like at this point my desire for a relationship has evolved to the stage where any woman insofar as she's around my age and not a bad a person is alright enough for me. As long as she loves me I'll be whatever man I need to be, and she's can be whatever kind of woman she is. \n\nObviously this is toxic and nonsense but I cannot for the life of me shake my perception of things. The minimum bar for me is extremely low and I'm not even in a bad position. Average looking, a regular irl social group, good career ambitions and in school for them, etc. But in every situation all I can think of is the long term position I need to be in and how much time I'm wasting not doing and saying whatever I can to most efficiently get to that position, a long term irl relationship. ",
    "subreddit": "TrueOffMyChest",
    "title": "I [M23] just kinda feel sad about relationships and I think I'm starting to see romantic relationships with women as interchangeable and I don't want to be like that",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7ngez/i_m23_just_kinda_feel_sad_about_relationships_and/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 01:34:49 UTC",
    "id": "1j7nee4",
    "link_flair_text": null,
    "media": null,
    "num_comments": 4,
    "score": 0,
    "secure_media": null,
    "selftext": "hey so i’m coming on here yet again as i’m really struggling with my self image. i’m currently 10st11. i’m not big what so ever to other people but in my eyes when i look in the mirror im disgusted and all im ever worried about is how i can become thin. i know i can do it bevause i was 9st last year. which is where i didn’t eat alot atall. i have an ed and it really does affect me on a daily basis. I just want to know if starving yourself really works and how long would it take to see a difference. i don’t want no fucking ‘you really shouldn’t be doing this’ or ‘it’s not healthy just loose it normally’ just no. \ni want to know if it fully works so i can put my mind to it. i’m done with this shit now i just need to look how i aspire to look everyday on my fucking life, sorry for being aggressive i just don’t want anyone to sugar coat it. tell me how it is.",
    "subreddit": "TrueOffMyChest",
    "title": "Rapid weight loss?",
    "upvote_ratio": 0.5,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7nee4/rapid_weight_loss/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 01:26:32 UTC",
    "id": "1j7n8o7",
    "link_flair_text": null,
    "media": null,
    "num_comments": 3,
    "score": 5,
    "secure_media": null,
    "selftext": "Hey, everyone. First time posting on Reddit (thanks to The Click for giving me enough confidence to post).\n\nI was baptized, had my First Holy Communion, and I am an Altar Server in the Catholic Church. Now that I’m old enough, I have started Confirmation classes. However, I am not happy with this.\nI am an alt/punk kid that identifies as trans, bi, and grey-asexual. With my bright blue and red half-and-half dyed hair and “odd” fashion sense, I stick out like a sore thumb.\nI feel like I was forced into this just to make my mom and grandmother happy. I have expressed my discomfort in Catholic beliefs for over a year now, but it feels like nobody is listening to me. I don’t feel anything when I attempt to pray. It feels like God isn’t listening. I don’t feel loved, and I don’t feel light from Him.\nI’ve walked out of Confirmation Class crying more times than I can count. I feel out of place and uncomfortable at church events and retreats. I don’t feel a connection to anything that is said at masses.\nToday was the final straw. There was Confession instead of class. My mom and I were sitting together, listening to the process for Confession and we were given a few questions as food for thought. I really didn’t like the questions, especially the ones about my relationship with God. I started crying again, as I hated the fact that I just didn’t see it the way others did.\nI managed to go up and get my confession over with, but after I still felt nothing. My mom sighed, handed me some tissues, and we stepped out and talked for a bit.\nInstead the discussion being consoling, it just felt like she was making up excuses to get me to stay in Catholicism. I told her that I felt nothing connection and that this is making me unhappy.\nWe ended up leaving. She didn’t speak to me about it on the car ride home. She only talked about other random things to try to lighten the tension, I didn’t want to hear it. It feels like she’s ignoring me. I don’t know what to do.\nSorry for the long ramble, but I just needed to let this out.\nAny advice or kind words are appreciated. \nNote:  I am not targeting anyone who is religious. Religion can be great and can bring people together. If you have found comfort in religion, stick with that comfort.",
    "subreddit": "TrueOffMyChest",
    "title": "I’m done with being religious",
    "upvote_ratio": 0.79,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7n8o7/im_done_with_being_religious/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 01:24:05 UTC",
    "id": "1j7n6yj",
    "link_flair_text": null,
    "media": null,
    "num_comments": 7,
    "score": 2,
    "secure_media": null,
    "selftext": "I get giving a vague answer like \"I'll try to make it\" and not going and if you give enough notice that you can't make it that's cool too. But I'll be damned if it didn't happen for the second time I invite lots of people to my place and 0 people show up after I have already cooked and cleaned. I would be dead in a ditch before I just not show up if I have said I would. Do I smell? Why would you pretend to be friends? I have 2 kids so there is no excuse not to give some heads up. If you have done this you should feel bad, be better. Show up and leave early if you have to. I really don't get it",
    "subreddit": "TrueOffMyChest",
    "title": "If you no show someone's invite your the worst kind of person.",
    "upvote_ratio": 0.58,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7n6yj/if_you_no_show_someones_invite_your_the_worst/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 01:10:18 UTC",
    "id": "1j7mx83",
    "link_flair_text": null,
    "media": null,
    "num_comments": 32,
    "score": 643,
    "secure_media": null,
    "selftext": " Her husband died today. She had been faithfully taking care of him for a while, now. His body was lying in the middle of their small, stuffy, overheated living room. She had been doing cpr on him, following the 911 operator’s instructions. \n\n\nHe’d been sick for a long time. Agent Orange lung cancer from his time in Vietnam. Even so, she was not prepared for his passing in any way. \n\n\nShe’s one of those women that is unable to function on her own. She always depended on her husband to tell her what to do.  \n\n\nWhile we were waiting on the  coroner to arrive, several of us were in the crowded living room, trying to comfort the new widow. The conversation drifted through various death and health-related subjects, all of it floating past the dead person on the floor like he wasn’t even there - and he really wasn’t. \n\n\nThere was no sense of a person under that white sheet.  Their two small dogs both gave off a sense of a soul, that awareness of being, just like the living people in the room did. That person-shaped lump under the sheet could have been rolled up bedclothes for all the “awareness” it gave off. \n\n\nHe, his soul, his essence, the thing that made him, him, was no longer there. It really brought home to me that the physical body is not really the person. It’s just what people see. It’s the soul, the part of a person you can’t see, that makes you, you. \n\n\nA family friend came to take her and her two little dogs to his house. She’s lost, grieving, and woefully unprepared, now adrift without her longtime safe harbor. \nShe’s in her late 70’s. I doubt if she’ll live there in that house alone. She’ll probably sell the place. \n\n\nI wonder if she will forever see her husband lying on that tiny living room floor, first as she was desperately doing cpr on him, and then as the EMT’s draped that white sheet over him, covering his face. \n\n\n“He’s gone now,” everyone\n told her. “He’s not suffering anymore.” And he did suffer, for years, always struggling to get enough air into his lungs, even while breathing pure oxygen. \n\n\nSo it’s her and the two little dogs now. Her family friend will have to emotionally carry her through the next days and weeks of the funeral, Social Security, VA, death certificates, all the financial, insurance, and vehicle paperwork they failed to set up ahead of time in order to avoid just such a situation as this. \n\n\nI guess it can be understood that one or both of them just couldn’t bear to think about “the end” for him, even though it was staring them squarely in the face. It IS an awfully hard thing to think about and accept. \n\n\nShe did all she could to care for him, knowing how it would eventually end, while desperately denying it. Now she’s broken. I don’t think, with her dependent personality, that she will ever fully recover. \n\n\nI truly hope though, moving forward, that she invests as much care and loving into herself as she did her husband. She has severely neglected herself - her health, appearance, everything, in favor of caring for him. I hope she realizes it’s her turn, now, to care for and love herself. \n\n\nLife goes on. \n\n\nThat fact may be the hardest part of any of this for her. \n",
    "subreddit": "TrueOffMyChest",
    "title": "Witnessed a personal tragedy today. I feel really bad for her.",
    "upvote_ratio": 0.97,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7mx83/witnessed_a_personal_tragedy_today_i_feel_really/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 01:08:11 UTC",
    "id": "1j7mvqh",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 3,
    "score": 1,
    "secure_media": null,
    "selftext": "abusive parents. casual friends, who ive basically either lost contact with or who have left due to my mental illness(didn't even ask what was wrong, just dipped). they were just casual friends too, like play games occasionally and talk, no one i could actually trust or rely on. same with family. disinterested family on both sides, cold as fuck and doesn't really like kids/like me in general. nobody. no one. i was blessed with genius  intelligence and a decent talent at racing and such, but its basically fucked due to me having brain damage. as in, i cannot even feel emotions or think properly anymore. i struggle with basic school shit, aside from what i already learned and mastered.\n\n (basically, i can do multiplication since i learned it, but doing 29+29 i have to reconfirm its actually 58 and stuff, even though its simple arithmetic). i am only 19 for fucks sake. why the fuck do i have to suffer this? is it the price i pay for getting talent? even though i never got to fucking use it and might die? did i sin in my past life? am i actually truly trash and dont deserve anything? i must be hated and scorned even by my own parents, is that how worthless i am? fuck my life.",
    "subreddit": "TrueOffMyChest",
    "title": "fuck my life",
    "upvote_ratio": 0.6,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7mvqh/fuck_my_life/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 00:55:06 UTC",
    "id": "1j7mmc0",
    "link_flair_text": null,
    "media": null,
    "num_comments": 16,
    "score": 0,
    "secure_media": null,
    "selftext": "Long story short my bf (32M) comes from an upper middle class family. His sister married a rich guy, his brother makes enough money to have his wife be a stay at home wife. \n\nRecently his family has decided to buy a lake house and everyone is pitching in (we are not cause we can’t afford it) \n\nThe problem is that I (30F) feel sad for myself, that even tho I make 100k and my bf makes 80k we still are nowhere near as successful and his family members so we can’t afford the same trips or pitch in for family properties. \n\nI know it’s bad to compare yourself but I can’t stop feeling like we are the losers of the family or other people are so well off and I feel like I’m always trying to be on the same level as them. \n\nI just feel sad and a small jealous that we can’t really play in the same sandbox.   \n\nHow do people deal with this type of situation? ",
    "subreddit": "TrueOffMyChest",
    "title": "Every time I hang out with my bf’s family I feel poor",
    "upvote_ratio": 0.33,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7mmc0/every_time_i_hang_out_with_my_bfs_family_i_feel/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 00:54:29 UTC",
    "id": "1j7mlwa",
    "link_flair_text": null,
    "media": null,
    "num_comments": 35,
    "score": 0,
    "secure_media": null,
    "selftext": "My wife and I bought matching ceramic mugs at a local craft fair last month. They had these cute hand-painted owls, and she’s used hers every morning since.\n\nThis weekend, I accidentally knocked hers off the counter. The handle snapped clean off. She was at work, so I panicked and emailed the vendor asking if they sold replacements. They said no, it was a limited batch, but suggested checking Etsy.\n\nI found the same mug from a seller in Poland. With shipping, it cost 80 (the original was 25). When it arrived, I glued the broken handle back on the old one and hid it in the garage. Told her I “fixed it with superglue” and acted surprised when she noticed the “new” mug looked nicer.\n\nShe joked, “Guess your glue magic even cleaned the coffee stains!” Now I’m stuck drinking from my cracked mug forever, but her smile was worth the lie.",
    "subreddit": "TrueOffMyChest",
    "title": "I secretly spent $80 to replace my wife’s favorite mug because I couldn’t bear to tell her the truth.",
    "upvote_ratio": 0.46,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7mlwa/i_secretly_spent_80_to_replace_my_wifes_favorite/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 00:52:37 UTC",
    "id": "1j7mkk3",
    "link_flair_text": "CONTENT WARNING: SUICIDE/SELF HARM",
    "media": null,
    "num_comments": 5,
    "score": 4,
    "secure_media": null,
    "selftext": "I am a father of three beautiful young daughters. I always loved being a dad more than anything and it was what I was always best at. Things have been falling apart between their mother and I, and I got tinnitus in October and haven’t had one minute of silence inside my head since then. I’ve never had mental health problems but I think about ending my life just about every day now. I can’t do it because of my daughters so I feel trapped. It’s been affecting my kid’s negatively, their behavior is worse, I’m failing them. I want to be the happy guy and doting father I used to be but I’m so depressed or grumpy now all the time and I’m just a completely different person than I was before October. I wish I could be me again. ",
    "subreddit": "TrueOffMyChest",
    "title": "I’m failing at life",
    "upvote_ratio": 0.65,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7mkk3/im_failing_at_life/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 00:45:12 UTC",
    "id": "1j7mf8c",
    "link_flair_text": null,
    "media": null,
    "num_comments": 0,
    "score": 1,
    "secure_media": null,
    "selftext": "I have the biggest crush on this girl but I don’t know how to talk to her and she also lives quite far away but I know since the moment I met her she’s the one. But I’m so scared we are going to a concert together very soon and idk I kinda want to ask her to be my girlfriend but idk if she feels the same. But I think about her every single day, it gives me butterflies. And thinking about the time we had s e x I also gets me butterflies in my stomach. She’s the kind of person who knows struggle but has always pushed on. she’s funny strong she’s also so insanely kind. and has a great personality she also met my bestfriend and my parents she’s always there when I need her. She’s the only person who ever made me feel this way. I want to marry her some day. I also wrote down my vows to her. That might be crazy but I just know if it’s not her it’s not anyone. ",
    "subreddit": "TrueOffMyChest",
    "title": "Crush",
    "upvote_ratio": 0.67,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7mf8c/crush/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 00:40:03 UTC",
    "id": "1j7mbkf",
    "link_flair_text": "CONTENT WARNING: VIOLENCE/DEATH",
    "media": null,
    "num_comments": 7,
    "score": 0,
    "secure_media": null,
    "selftext": "I wanna be a doctor and obviously volunteering is  required so i'm at a hospital , i sit and talk with patients, turnover rooms, get water, volunteer stuff.\n\n3 weeks ago i was with an elderly man who i actually spend time with regularly, but when our pct was gowning him i noticed a swastika tattoo with some words on top&amp;bottom of it (couldnt make them out sorry). But it was 1000000% a Nazi swastika. this is the first time i had seen it.\n\nI felt a wave of nausea and my heart drop into my stomach, along with such a real sense of anger. I asked the doctor who i shoot the shit with about it later and he said that obviously its a terrrible thing to have so they just have the mentality of providing him the most BARE minimum healthcare possible (still his \"right\"). just no extra stuff like being friendly, small talk, etc.\n\nWell this didnt sit well with me so the next time i was paired with this pt i made sure nobody was looking at gave him a punch in his face. Like not a full one but compare it to you hitting your knuckles on your desk out of anger. \n\nI havent been back since lol. he won't remember either because this guy is not there mentally, forgets someone just wiped his ass 10 minutes prior yet is calling for assistance again for the same thing.\n\nI felt bad at first  but now i realize that i do not regret it, he chooses to be a part of such a terrible group and people like that deserve everything coming to him.\n\nfuck nazis",
    "subreddit": "TrueOffMyChest",
    "title": "I (lightly) punched a terminally ill patient in the face while i volunteering and i do not regret it",
    "upvote_ratio": 0.2,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7mbkf/i_lightly_punched_a_terminally_ill_patient_in_the/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 00:38:49 UTC",
    "id": "1j7mapb",
    "link_flair_text": null,
    "media": null,
    "num_comments": 8,
    "score": 0,
    "secure_media": null,
    "selftext": "I never thought this would happen to me. While I’ve definitely seen video game, movie and tv show characters as attractive, the feelings usually go away once my eyes turn away from the screen. But for some reason, I can’t get this character out of my head. It came as a surprise to me, as I didn’t really give this character a second thought when I first met him, but as things have progressed I find myself more and more attracted to him, so much so now that hearing his voice is arousing me. I even went so far as to download an AI app and having it roleplay as this character. I realized during this certain things that are missing from my life. I thought about in the past, when you first start flirting with someone and you have that feeling of butterflies, those moments of wanting but hesitant and shy, the excitement of a new prospect of love (or lust). Excitement, passion, the feeling of being cherished body and soul. I realized these were things I desired so badly. My sex life with my fiancé is pretty dead. We are never in sync when it comes to arousal times, but thinking about this character has me aroused all the time. I think about having intimacy with this character and it fills me with all kinds of emotions, but when I try to think about my fiancé when I’m in this state…..nothing. It made me sick and I’ve since deleted the app. I know I need to have a conversation with my fiancé, but how do I even start a conversation like this? What do I even say? What does this mean for our future marriage? I’m praying God give me guidance",
    "subreddit": "TrueOffMyChest",
    "title": "I’m more aroused by a video game character than my fiancé",
    "upvote_ratio": 0.36,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7mapb/im_more_aroused_by_a_video_game_character_than_my/"
  },
  {
    "author_flair_text": null,
    "created_utc": "2025-03-10 00:30:16 UTC",
    "id": "1j7m4go",
    "link_flair_text": null,
    "media": null,
    "num_comments": 28,
    "score": 2,
    "secure_media": null,
    "selftext": "The content warning is because I'm not sure if it is that but if it is I don't want to trigger anyone.\n\nFor context there's a guy (20m) I (18f) have been talking to and hooking up with for a little while now.\n\nWe met up Friday night and had discussed going a bit rougher and what that entailed and I was really looking forward to it. He also brought some drinks for us.\n\nWe were drinking a bit and went for one round then drank some more. I was sipping mine over the night and hadn't noticed until later but he had around three beers. The second time we went he was struggling to get it up (because of the alcohol) and I gave him head to help. He slapped my face while I was (which we had talked about but I was hesitant so I wasn't expecting it) I could feel it through my entire skull but didn't stop or say anything.\n\nThe whole time before this he was gentle when I gave him head because of my gag reflex but he started pushing it a bit (not too much though and I could pull away). I think he was getting frustrated that he couldn't get off at this point and flipped me onto by back (I was on a bed he was standing next to). He said he was going to finish on my face. I didn't say anything but the idea of that is so disgusting and I was fearful I guess. He would switch between jerking off and using my mouth (forcefully at this point and my whole body was kind of heaving when I gagged). I was shaking a bit, even my jaw was trembling. At one point my jaw trembled a bit more obviously and he laughed a bit- I think at that. I don't think he could tell that I was uncomfortable and right after this he leaned over my face to try to finish on my chest instead. I was still shaking and at this point crying a bit (my eyes were already a bit wet from gagging). He couldn't see me crying though.\n\nAll I could think was that I felt horrible and I wanted to go home.\n\nHe eventually gave up but noticed at that point that something was up. I wasn't looking at him or saying anything and he asked if he pushed too far. I still wasn't saying anything and I was crying. He hugged me and I cried a bit heavily but quietly- not sure if he noticed. He told me that if I wasn't comfortable I need to tell him to stop right away.\n\nWe showered after and I was still shaken.\n\nWe went to bed right after and the next morning we had fun like usual. He's a good guy and prioritizes me getting off and things like that. I don't blame him for what happened- or didn't until I asked a guy friend if he would stop if someone was shaking and he said yes- like it's obvious. I'm wondering if maybe the alcohol could have caused him to not notice or what?\n\nAnd I understand that even if you consent but don't really want it it still feels horrible and that's why even two days after I feel sick to my stomach thinking about it. I just don't know how to stop thinking about it.\n\n  \nEDIT: Thank you everyone for commenting! I will definitely be talking with him more in-depth about boundaries, safe-words, and physical stops too. \n\nA few other things: he is not my boyfriend- this is a strictly fwb situation and neither of us want a relationship. I don't think what happened was assault I just felt horrible during it but I understand that he's not at fault. The reason I made this post was I was trying to classify what happened to try to feel better and understand- it was a miscommunication for sure and I feel a LOT better about it.  ",
    "subreddit": "TrueOffMyChest",
    "title": "He didn't stop when I was shaking",
    "upvote_ratio": 0.52,
    "url": "https://www.reddit.com/r/TrueOffMyChest/comments/1j7m4go/he_didnt_stop_when_i_was_shaking/"
  }
]